{
  "metadata": {
    "title": "Rural Recipes | Channel Trailer",
    "channel_name": "Rural Recipes",
    "publish_date": "2023-04-12",
    "view_count": 1566,
    "like_count": 86,
    "duration": "02:35",
    "original_audio_language": "Bengali",
    "video_id": "vhQLhYzwJtE",
    "url": "https://www.youtube.com/watch?v=vhQLhYzwJtE",
    "description": "Welcome to Rural Recipes\nRural local recipes are integral part of Intangible Cultural Heritage and needs to be preserved and promoted.  We at banglanatak dot com have been working for the past 22+ years to safeguard and promote local cultural heritages in rural spaces across India. We are now launching a new initiative of documenting rural recipes and bringing them closer to the food lovers of the world. We request all to subscribe to our new channel Rural Recipes and stay tuned there to know, learn and try out local delicacies.",
    "ingredients_detected": [
      "Fish (Maach)",
      "Rice (Bhat)",
      "Drumstick (Shojne Dnata)",
      "Chicken",
      "Capsicum/Bell Pepper",
      "Small Fish (Puti/Mola Maach)",
      "Eggplant (Begun)",
      "Spices (Masala)",
      "Mustard Oil",
      "Turmeric (Haldi)"
    ]
  },
  "transcription_bengali": [
    "[00:00:00] [সংগীত]",
    "[00:00:05] নমস্কার, আমি দেবলিনা। আমি একজন লোকগানের শিল্পী ও সমাজকর্মী।",
    "[00:00:13] আমাদের রাজ্য ও দেশের লোকশিল্প, শিল্পী ও তার গ্রামের খবর পৃথিবীর কাছে পৌঁছে দেওয়াই হলো আমার কাজ।",
    "[00:00:25] বাংলানাটক ডটকমে গত ১০ বছর ধরে সমাজবিজ্ঞান নিয়ে কাজ করছি। আমাদের সংস্থার ২৩ বছর হতে চলেছে।",
    "[00:00:32] আঞ্চলিক সম্পদকে কীভাবে নতুন উদ্যোগে পরিণত করা যায় তার ওপরে এখন আমরা কাজ করছি।",
    "[00:00:44] আর এই কাজের সূত্রে বাংলার নানান গ্রামে থাকতে হয় বেশ অনেকটা সময়। খেতে ভালোবাসি, রান্নাও করতে ভালোবাসি। তাই যখন যেখানে থাকি তখন সেখানকার আঞ্চলিক খাবার খুঁজে বেড়াই। আর শিখেও নিই যথাসাধ্যমতো।",
    "[00:01:00] ভালো আছো?  গরম পড়ছে ভীষণ। গরম পড়ছে ভীষণ।",
    "[00:01:09] আজকে মাছ ভাজা দিয়ে ব্রেকফাস্ট?  হ্যাঁ, একদম। গরম ভাত দিয়ে মাছ ভাজা। আহ, ভেবেই আমার একদম জিভে জল আসছে।",
    "[00:01:21] সজনে ডাঁটাটা খেয়ে দেখি। উম!",
    "[00:01:34] তেল ছাড়া রান্না হবে চিকেন কাদম্বরী। আর চিকেন কাদম্বরী দেখতে কদম ফুলের মতো হবে।",
    "[00:01:42] পেঁপেতে গাছে লাউপাতা, সেগুলো কেটে রান্না। সেই স্বাদের কোনো ভাগ হবে না, সেই স্বাদের কোনো তুলনাও নেই।",
    "[00:01:49] আমাদের লোকশিল্পের মতোই আঞ্চলিক খাবার, উপকরণ ও রান্নার পদ্ধতিও কিন্তু ইনট্যানজিবল কালচারাল হেরিটেজ।",
    "[00:01:56] গ্রামের খুব সাধারণ ঘরোয়া মহিলাদের এই বিশেষ দক্ষতাই এই হেরিটেজ বা ঐতিহ্যকে লালন-পালন করে তুলেছে যুগ যুগ ধরে। আর এই বিশেষ দক্ষতাই হলো সেই অঞ্চলের সম্পদ।",
    "[00:02:11] আমি পৌঁছে যাব সেই সব ঘরোয়া বৌদি, কাকিমা, দিদিমা ও বান্ধবীদের কাছে। আর আপনাদের শোনাব তাদের গল্প। দেখাব আঞ্চলিক রান্না ও তার পদ্ধতি।",
    "[00:02:24] তাই দেরি না করে সাবস্ক্রাইব করুন আমাদের নতুন চ্যানেল Rural Recipes।"
  ],
  "transcription_english": [
    "[00:00:00] [Music]",
    "[00:00:05] Hello, I’m Debolina. I am a folk singer and a social worker.",
    "[00:00:13] My work is to share with the world the folk arts of our state and country, the artists, and stories from their villages.",
    "[00:00:25] At banglanatak dot com, I have been working on social development for the past 10 years. Our organization is nearing 23 years.",
    "[00:00:32] We are now working on how regional resources can be transformed into new initiatives.",
    "[00:00:44] Because of this work, I often spend long periods living in different villages of Bengal. I love eating and I also love cooking—so wherever I stay, I search for local foods and learn them as much as I can.",
    "[00:01:00] How are you? It’s extremely hot. Extremely hot.",
    "[00:01:09] Fried fish for breakfast today? Yes, absolutely. Fried fish with hot rice—just thinking about it makes my mouth water.",
    "[00:01:21] Let me taste the drumstick stem. Mmm!",
    "[00:01:34] We’ll cook Chicken Kadambari without oil, and it will look like a kadam flower.",
    "[00:01:42] Tender gourd leaves from the papaya tree—cook them and there’s no match for that taste, nothing compares to it.",
    "[00:01:49] Just like our folk arts, regional food, ingredients, and cooking methods are also intangible cultural heritage.",
    "[00:01:56] The special skills of ordinary homemakers in villages have nurtured and carried this heritage forward for generations. And that skill is the wealth of the region.",
    "[00:02:11] I will reach out to those homemakers—boudis, aunts, grandmothers, and friends—and share their stories with you, showing you regional recipes and how they are made.",
    "[00:02:24] So without delay, subscribe to our new channel, Rural Recipes."
  ]
}