{
  "metadata": {
    "title": "Shukto । শুক্তো। Bengali recipe",
    "channel_name": "Rural Recipes",
    "publish_date": "2023-05-04",
    "view_count": 941,
    "like_count": 35,
    "duration": "06:44",
    "original_audio_language": "Bengali",
    "video_id": "kv3KEorxcck",
    "url": "https://www.youtube.com/watch?v=kv3KEorxcck",
    "description": "Welcome to Rural Recipes\n\nShukto by Archana Mondal I রুরাল রেসিপির তৃতীয় পর্ব । পূর্ব বর্ধমানের বননবগ্রামের বাসিন্দা শ্রীমতি অর্চনা মণ্ডল এর হাতের রান্না :  শুক্তো।",
    "ingredients_detected": [
      "বেগুন",
      "আলু",
      "কাঁচা কলা",
      "উচ্ছে",
      "গাজর",
      "সজনে ডাটা",
      "আলা আলু",
      "তেল",
      "দুধ",
      "রাঁধুনি",
      "জিরে",
      "পোস্ত",
      "সাদা সর্ষে",
      "কালো সর্ষে",
      "পাঁচ ফোড়ন",
      "বড়ি",
      "লবণ",
      "চিনি",
      "হলুদ",
      "তেজ পাতা",
      "শুকনো লঙ্কা",
      "ঘি",
      "আদা"
    ]
  },
  "transcription_bengali": [
    "[00:00:00] আমরা এসেছি অর্চনাদির বাড়িতে।",
    "[00:00:05] অর্চনাদি, তুমি আজকে কী রান্না করবে?",
    "[00:00:10] রান্না যে শুক্তো রান্না করব।",
    "[00:00:15] শুক্তো? এই আটাটা কে করেছে? তুমি করেছ?",
    "[00:00:20] শুক্তো রান্না করতে করতে আমি শিখিয়ে দেব একটা। দাঁড়াও।",
    "[00:00:29] অর্চনাদি আজকে আমাদের শুক্তো রান্না করে শেখাবে।",
    "[00:00:35] শুক্তো গরমকালে দারুণ একটা খাবার—পেট ঠান্ডা করে, শরীর ঠান্ডা করে।",
    "[00:00:45] শুক্তো রান্না করাটা খুব সহজ নয়, কারণ শুক্তোতে অনেক পরিমাণের ব্যাপার আছে।",
    "[00:00:55] কোন সবজি কী দিতে হয়, কী দিতে হয় না—এসব কিছু আজকে অর্চনাদির কাছ থেকে শিখব।",
    "[00:01:10] শুক্তো রান্না করতে নিয়েছি: বেগুন, কাঁচা কলা, আলু, উচ্ছে, গাজর, আলা আলু, আদা।",
    "[00:01:28] শিমুলের ফুল গরমকালের এই রোদে আচার করে—সারা বছর আচার থাকে।",
    "[00:01:40] তেল, দুধ, রাঁধুনি, পাঁচ ফোড়ন, জিরে, বড়ি, দুই চামচ পোস্ত, এক চামচ কালো সর্ষে, এক চামচ সাদা সর্ষে, তেজ পাতা, লঙ্কা, হলুদ, ঘি, লবণ, চিনি।",
    "[00:02:10] প্রথমে বড়িগুলো ভেজে নেব। এখন আমি বেগুনগুলো ভেজে নেব।",
    "[00:04:30] অল্প পরিমাণে চিনি। শেষে ঘি আর আদা মিশিয়ে দিলাম। এবার দিলাম বাটা মশলা।",
    "[00:05:30] রান্না হয়ে গেছে—গ্যাস বন্ধ করলাম। এখন টেস্ট করব।",
    "[00:05:45] শুক্তো কিন্তু বেশ একটু তেতোই হবে, আর নুন-মিষ্টি পরিমাণ মতো হবে।",
    "[00:05:55] আমার কাছে এটা একদম পারফেক্ট—দারুণ হয়েছে। একটা টাটকা খেয়ে দেখি।",
    "[00:06:10] আমার এই রান্না ভালো লেগে থাকলে আপনারা বাড়িতে বানিয়ে দেখবেন। লাইক করবেন, শেয়ার করবেন। কেমন লাগলো কমেন্টে জানাবেন।",
    "[00:06:30] আজকের এপিসোড এখানে শেষ করছি। নেক্সট এপিসোডে যাব অন্য এক দিদির কাছে—অন্য কোনো রান্না শিখতে।"
  ],
  "transcription_english": [
    "[00:00:00] We’ve come to Archana-di’s house.",
    "[00:00:05] Archana-di, what will you cook today?",
    "[00:00:10] I will cook Shukto.",
    "[00:00:15] Shukto? Who made this batter/paste? Did you make it?",
    "[00:00:20] While cooking Shukto, I’ll teach you a tip—wait.",
    "[00:00:29] Archana-di will teach us how to cook Shukto today.",
    "[00:00:35] Shukto is a wonderful dish for summer—it cools the stomach and cools the body.",
    "[00:00:45] Cooking Shukto isn’t very easy, because it involves getting many quantities just right.",
    "[00:00:55] Which vegetables should be added and which shouldn’t—today we’ll learn all of that from Archana-di.",
    "[00:01:10] For Shukto we’ve taken: eggplant, raw banana, potato, bitter gourd, carrot, ola/aloo (elephant foot yam), and ginger.",
    "[00:01:28] In this summer sun, shimul flowers are pickled—so you can have the pickle all year round.",
    "[00:01:40] Oil, milk, radhuni (wild celery seed), panch phoron, cumin, bori (lentil dumplings), two spoons of poppy seeds, one spoon black mustard, one spoon white mustard, bay leaf, dried chili, turmeric, ghee, salt, and sugar.",
    "[00:02:10] First we’ll fry the bori. Now I’ll fry the eggplants.",
    "[00:04:30] A small amount of sugar. At the end I mixed in ghee and ginger. Now I’ve added the ground spice paste.",
    "[00:05:30] The cooking is done—I’ve turned off the stove. Now we’ll taste it.",
    "[00:05:45] Shukto should be slightly bitter, and the salt and sweetness should be balanced in the right proportion.",
    "[00:05:55] For me, this is perfect—it has turned out wonderful. Let me taste it fresh.",
    "[00:06:10] If you liked this dish, try making it at home. Please like and share, and tell us in the comments how it turned out.",
    "[00:06:30] We’re ending today’s episode here. In the next episode we’ll go to another didi to learn another recipe."
  ]
}