{
  "metadata": {
    "title": "Ambadi Kolmbi | A Monsoon Treat | Traditional Rural Recipe of Palghar, Maharashtra | #recipe",
    "channel_name": "Rural Recipes",
    "publish_date": "2025-02-24",
    "view_count": 124,
    "like_count": 2,
    "duration": "06:59",
    "original_audio_language": "Hindi / Warli / Marathi",
    "video_id": "P4ED5bPlsT8",
    "url": "https://www.youtube.com/watch?v=P4ED5bPlsT8",
    "description": "In this episode of Rural Recipes, we visit the Ganjad region in Palghar, Maharashtra, to meet the family of legendary Warli artist Jivya Soma Mashe. The family continues the legacy of Warli art and shares a traditional monsoon specialty: Ambadi Kolmbi. This unique dish combines sour Roselle leaves (Ambadi), okra (Bhindi), and dried tiny shrimp (Kolmbi) into a nutritious, oil-free stew.",
    "ingredients_detected": [
      "Ambadi (Roselle/Sorrel Leaves)",
      "Kolmbi (Tiny Dried Shrimp/Prawns)",
      "Bhindi (Okra/Ladyfinger)",
      "Lasun (Garlic - crushed)",
      "Hari Mirch (Green Chilies)",
      "Haldi (Turmeric Powder)",
      "Mith (Salt)",
      "Pani (Water)"
    ]
  },
  "transcription_hindi": [
    "[00:00:11.000] रूरल रेसिपी यूट्यूब चैनल में आप सबका स्वागत है। हम अभी मुंबई-अहमदाबाद एक्सप्रेस हाईवे पर चारोटी के पास रुके हुए हैं।",
    "[00:00:27.000] इस इलाके का एक अलग ही आकर्षण है। यहाँ से हम गंजड की ओर जा रहे हैं, जो यहाँ से लगभग 30-40 मिनट की दूरी पर है।",
    "[00:00:46.000] हम गंजड में एक प्रसिद्ध वारली चित्रकार परिवार से मिल रहे हैं, जिनका नाता स्वर्गीय जीव्या सोमा माशे से है।",
    "[00:00:55.000] किशोर और विजय दो भाई हैं जो पूर्णकालिक किसान और कलाकार हैं। उनका पूरा परिवार वारली पेंटिंग के काम में लगा हुआ है।",
    "[00:01:24.000] वे हमें अपनी कला में आधुनिक विषय दिखाते हैं, हालांकि पारंपरिक पेंटिंग आमतौर पर वारली जीवन और कृषि चक्र को दर्शाती हैं।",
    "[00:01:47.000] आज उन्होंने हमारे लिए एक विशेष मानसून डिश 'अंबाडी कोलम्बी' बनाने की योजना बनाई है।",
    "[00:02:03.000] अंबाडी बारिश के मौसम में होने वाली एक पत्तेदार सब्जी है।",
    "[00:02:10.000] कोलम्बी का मतलब है छोटी नदी की झींगा मछली। हम अंबाडी के पत्तों, कोलम्बी और भिंडी को मिलाकर यह व्यंजन बनाते हैं।",
    "[00:02:27.000] आदिवासी समुदाय इन झींगों को सुखाकर रखते हैं ताकि वे पूरे साल इनका आनंद ले सकें।",
    "[00:02:49.000] हम उनके चाचा के घर खाना बना रहे हैं। इसके मुख्य घटक अंबाडी के पत्ते, भिंडी और सूखी मछली (झींगा) हैं।",
    "[00:03:04.000] यह एक स्वास्थ्यवर्धक और बिना तेल वाली रेसिपी है। अंबाडी के पत्ते का स्वाद नींबू जैसा खट्टा होता है।",
    "[00:03:15.000] किशोर की चाची और उनकी बड़ी बहन सुनीता आज यह खाना बनाएंगी।",
    "[00:03:41.000] वे भिंडी काटकर शुरुआत करती हैं। अंबाडी और भिंडी को अच्छी तरह धोकर तैयार कर लिया गया है।",
    "[00:04:02.000] एक बर्तन में पानी उबाला जाता है। वे उबलते पानी में सीधे पत्ते और कटी हुई भिंडी डाल देती हैं।",
    "[00:04:12.000] इसके बाद इसमें कोलम्बी (सूखी झींगा) डाली जाती है। यह डिश एक उबले हुए स्टू या सूप की तरह होती है।",
    "[00:04:32.000] स्वाद के लिए कुचला हुआ लहसुन और हरी मिर्च डाली जाती है, फिर रंग के लिए थोड़ी हल्दी डाली जाती है।",
    "[00:04:51.000] इसमें बस इतने ही मसालों का उपयोग होता है। झींगा और भिंडी अंबाडी के पत्तों के खट्टेपन को संतुलित करते हैं।",
    "[00:05:27.000] लकड़ी की आग पर इसे पकने में लगभग 20 मिनट लगते हैं जब तक कि सब कुछ नरम न हो जाए।",
    "[00:05:43.000] अंबाडी कोलम्बी तैयार है! इसे आमतौर पर उबले हुए चावल के साथ परोसा जाता है।",
    "[00:06:01.000] इसकी कंसिस्टेंसी सूप जैसी है। यह मुझे 'लाफा शाक-एर पेलका' की याद दिलाता है जो हमने उत्तर बंगाल में चखा था।",
    "[00:06:16.000] यह दाल और सब्जी दोनों का काम करता है। हमारे गाइड तुकाराम जी कहते हैं कि यह यहाँ का एक लोकप्रिय भोजन है।",
    "[00:06:30.000] गाँव बहुत सुंदर है, और हम भोजन के बाद और अधिक घूमने के लिए उत्सुक हैं।",
    "[00:06:41.000] हम जल्द ही पालघर के दूसरे गाँव की ओर बढ़ेंगे। कृपया अपनी प्रतिक्रिया साझा करें। धन्यवाद!"
  ],
  "transcription_english": [
    "[00:00:11.000] Welcome to the Rural Recipes YouTube channel. We are currently staying near Charoti on the Mumbai-Ahmedabad Express Highway.",
    "[00:00:27.000] This area has a unique charm. From here, we are heading to Ganjad, which is about 30-40 minutes away.",
    "[00:00:46.000] In Ganjad, we are visiting a famous Warli artist family related to the late Jivya Soma Mashe.",
    "[00:00:55.000] Kishore and Vijay are two brothers who are full-time farmers and artists. Their entire family is engaged in Warli painting.",
    "[00:01:24.000] They show us modern themes in their art, though traditional paintings usually depict Warli life and agricultural cycles.",
    "[00:01:47.000] Today, they have planned a special monsoon dish for us called 'Ambadi Kolmbi'.",
    "[00:02:03.000] Ambadi is a leafy vegetable common in the rainy season.",
    "[00:02:10.000] Kolmbi refers to tiny river shrimp. We combine Ambadi leaves, Kolmbi, and okra (bhindi) to make this dish.",
    "[00:02:27.000] The tribal community dries these shrimp so they can enjoy them throughout the year.",
    "[00:02:49.000] We are cooking at their uncle's house. The primary ingredients are Ambadi leaves, okra, and dried shrimp.",
    "[00:03:04.000] This is a healthy, oil-free preparation. The Ambadi leaf has a distinct sour taste, similar to lemon.",
    "[00:03:15.000] Kishore's aunt and his elder sister Sunita will be cooking the meal today.",
    "[00:03:41.000] They start by slicing the okra. The Ambadi greens and okra have been thoroughly washed and prepared.",
    "[00:04:02.000] A pot of water is brought to a boil. They add the greens and sliced okra directly into the boiling water.",
    "[00:04:12.000] Next, the Kolmbi (dried shrimp) is added. This dish is more like a boiled stew or soup.",
    "[00:04:32.000] Crushed garlic and green chilies are added for flavor, followed by a bit of turmeric for color.",
    "[00:04:51.000] These are the only spices used. The shrimp and okra balance the sourness of the Ambadi leaves.",
    "[00:05:27.000] It takes about 20 minutes to cook on the wood fire until everything is soft and well-integrated.",
    "[00:05:43.000] The Ambadi Kolmbi is ready! It is typically served with steamed rice.",
    "[00:06:01.000] The dish has a soupy consistency. It reminds me of the 'Lafa Shak-er Pelka' we tried in North Bengal.",
    "[00:06:16.000] It works as both a dal and a vegetable side dish. Our guide Tukaram ji says this is a common comfort food here.",
    "[00:06:30.000] The village is beautiful, and we look forward to exploring more after our meal.",
    "[00:06:41.000] We will be moving to another village in Palghar soon. Please share your feedback. Thank you!"
  ]
}