{
  "metadata": {
    "title": "আঙুর পিঠে | Angur Pithe | Rural Recipes",
    "channel_name": "Rural Recipes",
    "publish_date": "2024-02-09",
    "view_count": 271,
    "like_count": 18,
    "duration": "07:49",
    "original_audio_language": "Bengali",
    "video_id": "J7Z1aFvQ7Ug",
    "url": "https://www.youtube.com/watch?v=J7Z1aFvQ7Ug",
    "description": "বাংলার বিভিন্ন রেসিপির খোঁজে আমরা ঘুরে বেড়াচ্ছি পশ্চিমবঙ্গের বিভিন্ন জেলায়। এই এপিসোডে আমরা নদীয়ায় মৃদুলা ভট্টাচার্যর বাড়িতে এসেছি একটি ঐতিহ্যবাহী ঢাকাই রেসিপি 'আঙুর পিঠে' শিখতে।",
    "ingredients_detected": [
      "সুজি (Semolina)",
      "কোড়ানো নারকেল (Grated Coconut)",
      "চিনি (Sugar)",
      "দুধ (Milk)",
      "পাটালি গুড় (Date Palm Jaggery)",
      "এলাচ (Cardamom)",
      "জল (Water)",
      "ময়দা (Flour)"
    ]
  },
  "transcription_bengali": [
    "[00:00:11.000] বাংলার বিভিন্ন রেসিপির খোঁজে আমরা ঘুরে বেড়াচ্ছি পশ্চিমবঙ্গের বিভিন্ন জেলায় বিভিন্ন অঞ্চলে।",
    "[00:00:16.500] সরষে ক্ষেত বললেই সবার আগে পাঞ্জাবের কথা মনে পড়ে।",
    "[00:00:20.200] তবে এই মুহূর্তে আমি নদীয়ায় এসে দেখতে পাচ্ছি চারিদিক সরষে ক্ষেতে ভরে গেছে।",
    "[00:00:24.800] সরষের চাষ চারিদিকে হচ্ছে।",
    "[00:00:29.100] নদীয়া মানেই মহাপ্রভু চৈতন্য, নদীয়া মানেই বাউল, নদীয়া মানে তাঁত।",
    "[00:00:35.400] নদীয়া মানে ফুল আর নদীয়া মানেই চাষবাস।",
    "[00:00:43.000] এই মুহূর্তে পশ্চিমবঙ্গের প্রথম শাড়ির একটি জেলা চাষবাসে যেটা রয়েছে সেটা হচ্ছে নদীয়া।",
    "[00:00:58.000] আমরা আবার চলে এসছি মৃদুলা ভট্টাচার্যর বাড়িতে এবং সঙ্গে রয়েছে মুকুল কাকিমা।",
    "[00:01:05.100] তাহলে আজকে তুমি কোন পিঠে পুলি করছো?",
    "[00:01:08.300] আজকে আমি আঙ্গুর পিঠে করবো।",
    "[00:01:10.500] কি পিঠে? আঙ্গুর পিঠে। আঙ্গুরের মত দেখতে বলে আঙ্গুর পিঠে।",
    "[00:01:16.000] এটা একটা ঢাকাই রেসিপি তাইতো? হ্যাঁ এটা আমার মার কাছ থেকে শিখেছি।",
    "[00:01:23.400] লাগবে হচ্ছে সুজি। আচ্ছা। নারকেল কোড়ো করে রেখেছি। চিনি।",
    "[00:01:31.200] একটু এলাচ কয়েকটা। পাটালি গুড়। দুধ।",
    "[00:01:50.000] আচ্ছা সুজি চিনি আর নারকেল কোড়া একসাথে দেবো।",
    "[00:02:00.600] এবার সুজিটা একটু বেশি দিতে হবে।",
    "[00:02:10.400] বেশি হলে শক্ত হবে আর কম হলে খুলে যাবে।",
    "[00:02:48.300] এটাকে ভালো করে নেড়েচুড়ে ড্রাই করতে হবে। একটা আঠা আটা ব্যাপার নাড়ুর মতো হবে।",
    "[00:03:08.000] বাহ। মানে বড় জোর চার পাঁচ মিনিট লাগলো এটা করতে।",
    "[00:03:21.200] এবার দুধটা আমরা জাল দিই। ততক্ষণ সুজির কড়াইয়ের মধ্যে।",
    "[00:03:32.400] দুধটা এখন আমরা ফুটতে দিয়েছি। দুধে চিনি দিয়েছি স্বাদমত।",
    "[00:03:42.000] নাও এটা করো। একটু ময়দা লাগিয়ে নাও হাতে, লেগে যাবে তো এটা করতে গেলে।",
    "[00:04:14.500] ব্যাস আমাদের সমস্ত আঙ্গুর তৈরি। দুধটা ঘন হয়েছে। এবার আঙ্গুর দেবো।",
    "[00:04:36.000] আহ একটা একটা করে আঙ্গুরগুলো দিয়ে দেওয়া হলো। লেগে যাবে না? না না না।",
    "[00:04:44.200] পাটালি গুড়টা আমি পরে দিচ্ছি কেন পাটালি গুড়ের গন্ধ বেশি ফুটলে নষ্ট হয়ে যায়।",
    "[00:05:07.100] চুষিটা হচ্ছে ময়দা দিয়ে বা চালের গুঁড়ো দিয়ে হয়। এটা আমার তৈরি হয়ে গেল।",
    "[00:06:39.600] এই তৈরি হয়ে গেল আমাদের আঙ্গুর পিঠে। এটা আমি এখন চেখে দেখব।",
    "[00:07:08.200] হুম। একদম ঠিক বলেছ যে কালকে এটা আরো ভালো লাগবে।",
    "[00:07:12.500] কেননা রসটা কিন্তু পুরোপুরি এখনো ভিতরে ঢোকেনি।",
    "[00:07:33.800] খুব সহজ বানাতে। শেয়ার করবেন আপনাদের ফিডব্যাক আপনাদের কমেন্টস।",
    "[00:07:42.100] আবার অন্য কোন রেসিপি নিয়ে আপনাদের সামনে হাজির হবো অন্য কোন এপিসোডে।"
  ],
  "transcription_english": [
    "[00:00:11.000] In search of various recipes of Bengal, we are traveling across different districts and regions of West Bengal.",
    "[00:00:16.500] Talking about mustard fields, Punjab is the first place that comes to mind.",
    "[00:00:20.200] But right now in Nadia, I can see the surroundings are filled with mustard fields.",
    "[00:00:24.800] Mustard cultivation is happening everywhere.",
    "[00:00:29.100] Nadia means Mahaprabhu Chaitanya, Nadia means Baul, Nadia means weaving.",
    "[00:00:35.400] Nadia means flowers and Nadia means agriculture.",
    "[00:00:43.000] At this moment, Nadia is one of the top districts in West Bengal for farming.",
    "[00:00:58.000] We have come again to Mridula Bhattacharya's house and with us is Mukul Kaki.",
    "[00:01:05.100] So, which pithe puli are you making today?",
    "[00:01:08.300] Today I will make Angur Pithe.",
    "[00:01:10.500] What pithe? Angur Pithe. It's called Angur Pithe because it looks like grapes.",
    "[00:01:16.000] This is a Dhakai recipe, right? Yes, I learned this from my mother.",
    "[00:01:23.400] You will need semolina. Okay. I have kept grated coconut ready. Sugar.",
    "[00:01:31.200] A few cardamoms. Date palm jaggery. Milk.",
    "[00:01:50.000] Alright, I will add semolina, sugar, and grated coconut together.",
    "[00:02:00.600] Now, the semolina should be added in a slightly larger quantity.",
    "[00:02:10.400] If it's too much it'll be hard, and if it's too little it'll break apart.",
    "[00:02:48.300] This needs to be stirred well to make it dry. It will have a sticky texture like a naru.",
    "[00:03:08.000] Wow. It took about four to five minutes to do this.",
    "[00:03:21.200] Now let's boil the milk in the meantime, inside the semolina pan.",
    "[00:03:32.400] We have now set the milk to boil. I have added sugar to the milk to taste.",
    "[00:04:14.500] That's it, all our 'grapes' are ready. The milk has thickened. Now I will add the grapes.",
    "[00:04:36.000] Ah, the grapes are being added one by one. Won't they stick? No, no, no.",
    "[00:04:44.200] I am adding the jaggery later because the aroma of the jaggery gets ruined if it boils too much.",
    "[00:05:07.100] Chushi is made with flour or rice powder. This is now ready.",
    "[00:06:39.600] Our Angur Pithe is now ready. I will taste it now.",
    "[00:07:08.200] Hmm. You're right that it will taste even better tomorrow.",
    "[00:07:12.500] Because the syrup hasn't fully soaked into the center yet.",
    "[00:07:33.800] Very easy to make. Please share your feedback and comments.",
    "[00:07:42.100] We will appear before you again with another recipe in another episode."
  ]
}