{
  "metadata": {
    "title": "বনুয়া কচুর ডাল | Banuya Kachu’r Dal | Wild Taro Root Gravy",
    "channel_name": "Rural Recipes",
    "publish_date": "2024-03-22",
    "view_count": 345,
    "like_count": 22,
    "duration": "05:46",
    "original_audio_language": "Bengali",
    "video_id": "bgKU72oUS5M",
    "url": "https://www.youtube.com/watch?v=bgKU72oUS5M",
    "description": "In this episode, we visit Dinhata in Cooch Behar to prepare a traditional dish – Banuya Kachu’r Dal (Wild Taro Root Gravy) with fish heads. This wild variety of taro is different from the cultivated ones and is a seasonal winter specialty.",
    "ingredients_detected": [
      "Banuya Kachu (Wild Taro Roots)",
      "Fish Heads (Rui or Katla, deep-fried)",
      "Mustard Oil",
      "Panch Phoron (Five-spice mix)",
      "Cumin Powder (Jeera Guro)",
      "Turmeric Powder (Holud)",
      "Green Chili Paste (Kancha Lonka Bata)",
      "Salt (Lobon)",
      "Coriander Leaves (Dhonepata)",
      "Warm Water"
    ]
  },
  "transcription_bengali": [
    "[00:00:11.200] আমরা এখন রয়েছি দিনাটায়, কুচবিহার জেলার দিনাটা কৃষি এবং এগ্রিকালচারের জন্য ভীষণ ভাবে পরিচিত।",
    "[00:00:20.500] গ্রামের আশপাশ থেকে তুলে নিয়ে এলাম এই বুনো কচু আর এটা দিয়েই তৈরি হবে ট্রেডিশনাল রেসিপি বনুয়া কচুর ডাল।",
    "[00:00:30.400] কুচবিহারি পোলাওয়ের এপিসোড করতে গিয়ে আমরা এই অঞ্চলের এই ট্রেডিশনাল রেসিপিটির খোঁজ পেয়েছিলাম।",
    "[00:00:46.300] এই ছোট ছোট কচু বা বইগুলোকে তুলে ভালো করে পরিষ্কার করে নিতে হবে।",
    "[00:00:52.150] এটি এক ধরনের গাঁটিক কচু কিন্তু এটি বনে জঙ্গলে হয়, চাষ করা হয় না।",
    "[00:01:05.600] কচুটা সেদ্ধ করার পরে আমরা চটকে বা ছেনে নিয়েছি যাতে একটা থকথকে ডালের মতো ঘনত্ব আসে।",
    "[00:01:18.250] কচুর মিশ্রণে কিছুটা জলও মেশানো হয়েছে। এখানে প্রায় এক কিলো মতো কচু আছে।",
    "[00:01:24.400] এই ডালে মাছের মাথা যাবে। আমরা রুই বা কাতল মাছের মাথা আগে থেকেই ভেজে রেডি করে রেখেছি।",
    "[00:01:34.100] শোল মাছের মাথা দিয়েও এই রেসিপি খুব ভালো হয়।",
    "[00:01:39.500] উপকরণ হিসেবে লাগছে জিরের গুঁড়ো, হলুদ, লঙ্কা বাটা, লবণ, তেল আর পাঁচ ফোরন।",
    "[00:01:50.300] নামানোর আগে ধনিয়া পাতা একটু বেশি করে দিতে হয় সুন্দর গন্ধের জন্য।",
    "[00:02:06.200] কড়াইতে প্রায় ৫০ গ্রাম মতো তেল দিয়ে আমি পাঁচ ফোরন ফোরন দিয়ে দিচ্ছি।",
    "[00:02:15.500] এবার কড়াইতে আগে থেকে তৈরি করে রাখা কচুর ডালটা ঢেলে দেবো।",
    "[00:02:32.450] একে একে হলুদ আর পরিমাণমতো লবণ দিয়ে দিচ্ছি।",
    "[00:02:40.300] এবার কাঁচা লঙ্কা বাটা দিয়ে দিচ্ছি। এই কচুর ডাল একটু ঝাল ঝাল হলে বেশি ভালো লাগে।",
    "[00:02:53.150] জিরার গুঁড়া দিয়ে দেওয়া হলো। এই ডালটিতে মাছ আর ধনেপাতার ব্যবহারই আসল।",
    "[00:03:04.600] এবার ভেজে রাখা মাছের মাথাগুলো ডালের মধ্যে দিয়ে দিচ্ছি।",
    "[00:03:21.400] রান্না তাড়াতাড়ি হওয়ার জন্য এবং স্বাদ ভালো রাখতে আমি আগে থেকে ফুটিয়ে রাখা গরম পানি ঢেলে দিলাম।",
    "[00:03:50.250] এটি প্রায় ১০ থেকে ১৫ মিনিট ফুটতে সময় লাগবে। এটি মূলত শীতকালীন একটি খাবার।",
    "[00:04:04.500] অনেকে ভয় পান বুনো কচু গলায় ধরবে কি না, কিন্তু এই কচু একদমই গলায় লাগে না। একটু ঠান্ডা করে খাওয়া ভালো।",
    "[00:04:12.350] মাছের মাথাগুলো খুন্তি দিয়ে একটু ভেঙে দিচ্ছি যাতে ডালের সাথে ভালো করে মিশে যায়।",
    "[00:04:26.150] এবার কুচানো ধনেপাতা দিয়ে দেবো। বেশি ধনেপাতা দিলে স্বাদ অনেক বেড়ে যায়।",
    "[00:04:43.400] লবণটা একবার চেকে দেখা হলো, আর সামান্য একটু লবণ লাগবে।",
    "[00:05:05.100] তৈরি হয়ে গেল আমাদের বুনো কচুর ডাল মাছের মাথা দিয়ে। শীতকালে গরম ভাতের সঙ্গে এটা দারুণ জমবে।",
    "[00:05:24.300] এপিসোডটি ভালো লাগলে আমাদের ফিডব্যাক দেবেন এবং চ্যানেলটি সাবস্ক্রাইব করবেন। ধন্যবাদ।"
  ],
  "transcription_english": [
    "[00:00:11.200] We are currently in Dinhata, Cooch Behar, a place well-known for its rich agriculture.",
    "[00:00:20.500] We gathered these wild taro roots from the village outskirts to prepare the traditional Banuya Kachu'r Dal.",
    "[00:00:30.400] While filming the Coochbehari Polao episode, we discovered this unique traditional recipe.",
    "[00:00:46.300] These small taro roots need to be picked and cleaned thoroughly.",
    "[00:00:52.150] It is a variety of Gathi Kachu, but unlike the cultivated ones, it grows wild in the woods.",
    "[00:01:05.600] The taro has been boiled and mashed to create a thick, dal-like consistency.",
    "[00:01:18.250] Some water has been added to the mash. We are using about one kilogram of taro here.",
    "[00:01:24.400] We'll add fish heads. Fried Rui or Katla fish heads have been kept ready.",
    "[00:01:34.100] Using Shol fish heads also makes this recipe taste excellent.",
    "[00:01:39.500] Ingredients include cumin powder, turmeric, chili paste, salt, oil, and panch phoron.",
    "[00:01:50.300] A generous amount of coriander leaves is added before finishing for a fresh aroma.",
    "[00:02:06.200] Adding about 50g of oil to the pan and tempering it with panch phoron.",
    "[00:02:15.500] Now, pouring the prepared taro mash into the pan.",
    "[00:02:32.450] Adding turmeric and salt to taste.",
    "[00:02:40.300] Adding green chili paste. This taro gravy tastes better when it's a bit spicy.",
    "[00:02:53.150] Cumin powder is added. The main flavors here come from the fish and coriander.",
    "[00:03:04.600] Now, adding the fried fish heads into the gravy.",
    "[00:03:21.400] Pouring in pre-boiled warm water to ensure better taste and faster cooking.",
    "[00:03:50.250] It needs to simmer for about 10 to 15 minutes. This is primarily a winter dish.",
    "[00:04:04.500] People often worry if wild taro causes throat irritation, but this variety doesn't. It's best eaten slightly cooled.",
    "[00:04:12.350] Breaking the fish heads slightly with the spatula so they blend well with the gravy.",
    "[00:04:26.150] Adding chopped coriander leaves now. More coriander enhances the overall flavor.",
    "[00:04:43.400] Checking the salt level; it needs just a little bit more.",
    "[00:05:05.100] Our wild taro gravy with fish heads is ready. It pairs perfectly with hot rice in winter.",
    "[00:05:24.300] If you liked this episode, please provide feedback and subscribe to our channel. Thank you."
  ]
}