{
  "metadata": {
    "title": "BOKRE CHI BHAJI | A Traditional Tribal Wedding Cuisine | Rural Recipes of Nashik, Maharastra",
    "channel_name": "Rural Recipes",
    "publish_date": "2025-09-06",
    "view_count": 722,
    "like_count": 17,
    "duration": "09:31",
    "original_audio_language": "Hindi / Marathi",
    "video_id": "BUIV5Id88qw",
    "url": "https://www.youtube.com/watch?v=BUIV5Id88qw",
    "description": "In this episode of Rural Recipes, we explore the tribal heartland of Nashik, Maharashtra, near the hand-built Hathgarh Fort. We visit Vardha village to meet Anil Raut, a local teacher, whose family demonstrates the preparation of 'Bokre Chi Bhaji'. This traditional mutton dish is a wedding staple, specifically prepared on the 'Haldi' day for the entire village. The recipe features a unique black masala made from fire-roasted onions and coconut, slow-cooked over a wood fire.",
    "ingredients_detected": [
      "Bokra (Male Goat/Mutton)",
      "Sabut Pyaz (Whole Onions - for roasting)",
      "Sookha Nariyal (Dried Coconut - for roasting)",
      "Adrak-Lashun Paste (Ginger-Garlic Paste)",
      "Soybean Oil",
      "Lal Tikhat (Red Chili Powder)",
      "Ghar ka Masala (Homemade Tribal Masala)",
      "Haldi (Turmeric Powder)",
      "Kadi Patta (Curry Leaves)",
      "Namak (Salt)",
      "Hara Dhaniya (Fresh Coriander Leaves)",
      "Pani (Water)"
    ]
  },
  "transcription_hindi": [
    "[00:00:15.000] नमस्ते, आदाब। रूरल रेसिपी में आपका स्वागत है। हम नासिक के आदिवासी क्षेत्रों की खोज कर रहे हैं।",
    "[00:00:22.000] दूर आप एक सपाट चोटी वाली पहाड़ी देख सकते हैं जिसे हाथगढ़ कहा जाता है। हम इसके करीब जाकर इसकी दिलचस्प कहानी बताएंगे।",
    "[00:00:40.000] मेरे पीछे यह पहाड़ी हाथगढ़ किला है। स्थानीय लोगों का मानना है कि जब शिवाजी महाराज सूरत से लौटे थे, तो उनके सैनिकों ने इसे हाथों से बनाया था—इसीलिए इसका नाम हाथगढ़ पड़ा।",
    "[00:00:59.000] आज, हम एक पारंपरिक ग्रामीण रेसिपी का दस्तावेजीकरण करने के लिए वर्धा नामक एक छोटे, सुंदर गाँव की ओर जा रहे हैं।",
    "[00:01:18.000] हम वर्धा गाँव पहुँच गए हैं। खाना पकाने से पहले, मैं आपको दिखाता हूँ कि यह गाँव कितना सुंदर है।",
    "[00:01:36.000] नमस्ते! मैं यहाँ एक स्थानीय शिक्षक अनिल राउत के साथ हूँ। अनिल जी, रूरल रेसिपी में आपका स्वागत है।",
    "[00:01:51.000] आज आप हमारे लिए क्या बना रहे हैं? आज मैं 'बोकरे ची भाजी' बना रहा हूँ। यह हमारी आदिवासी शादी की परंपरा है।",
    "[00:01:58.000] यह हल्दी समारोह के दिन पूरे गाँव और सभी रिश्तेदारों को खिलाने के लिए बनाया जाता है।",
    "[00:02:06.000] 'बोकरा' का विशेष अर्थ है नर बकरी (खस्सी)। इस उत्सव की रेसिपी के लिए केवल नर बकरी का उपयोग किया जाता है।",
    "[00:02:13.000] अनिल जी ताज़ा मटन लाए हैं, और हम इस शानदार दावत के लिए उत्साहित हैं।",
    "[00:02:25.000] सब कुछ तैयार है। आइए रसोइया से मिलते हैं। अनिल जी की पत्नी, हेमलता अनिल राउत, यह व्यंजन तैयार करेंगी।",
    "[00:02:40.000] बहन जी, मसालों के बारे में बताइए। हमारे पास नारियल, प्याज, अदरक-लहसुन का पेस्ट और सोयाबीन का तेल है।",
    "[00:02:51.000] तीखेपन के लिए हमारे पास लाल मिर्च पाउडर है। इसके अलावा घर का बना मसाला, हल्दी, करी पत्ता और नमक भी है।",
    "[00:03:04.000] हम प्याज और नारियल का उपयोग कच्चा नहीं करते हैं। हम पहले उन्हें सीधे आग में भूनते हैं।",
    "[00:03:38.000] साबुत प्याज को पहले आग में भूना जाता है। फिर उन्हें पीसकर एक काले रंग का पेस्ट बनाया जाता है।",
    "[00:03:44.000] भुने हुए नारियल को भी पीसा जाता है। ये दो भुनी हुई चीजें मसाले को अपना विशिष्ट काला रंग देती हैं।",
    "[00:04:04.000] हम बर्तन में तेल डालकर शुरुआत करते हैं, फिर नमक और हल्दी डालते हैं। अब हम मटन डालते हैं।",
    "[00:04:24.000] यह अब लगभग आधे घंटे तक उबलेगा ताकि यह सुनिश्चित हो सके कि मांस आंशिक रूप से पक गया है।",
    "[00:04:36.000] जब यह उबल रहा होता है, अनिल बताते हैं कि उनके माता-पिता कलाकार हैं जो ठाकुर और गौरी गीतों जैसे पारंपरिक लोक गीत गाते हैं।",
    "[00:05:10.000] मटन लगभग 30 से 35 मिनट से उबल रहा है। आइए इसे चेक करते हैं।",
    "[00:05:20.000] यह तैयार है। हम आंशिक रूप से पके हुए मांस को अब बाहर निकाल लेंगे।",
    "[00:05:29.000] अब, बर्तन में ताज़ा तेल जाता है। हम अदरक-लहसुन के पेस्ट के साथ तड़के की शुरुआत करते हैं।",
    "[00:05:46.000] कुछ मिनट भूनने के बाद, हम भुना हुआ प्याज का पेस्ट डालते हैं।",
    "[00:05:58.000] भुने हुए प्याज के पेस्ट को अदरक-लहसुन के साथ भुना जाता है। फिर हम भुना हुआ नारियल पेस्ट डालते हैं।",
    "[00:06:19.000] अब सूखे मसाले: लाल मिर्च पाउडर, हल्दी और घर का बना आदिवासी मसाला।",
    "[00:06:39.000] आंशिक रूप से पका हुआ मटन वापस इस समृद्ध मसाले के आधार में जाता है। हम स्वादानुसार नमक डालते हैं।",
    "[00:07:01.000] हम उबालने के चरण के बचे हुए गर्म पानी (मटन स्टॉक) को वापस बर्तन में डालते हैं।",
    "[00:07:07.000] हम इसे पकने के लिए ढक देते हैं। अब हम करी पत्ता डालते हैं।",
    "[00:07:15.000] पकने के दौरान भाप का प्रभाव पैदा करने के लिए हम ढक्कन पर थोड़ा पानी भी डालते हैं।",
    "[00:07:36.000] इसे बस थोड़ा और समय चाहिए। हम ताज़ा धनिया पत्ती डालते हैं।",
    "[00:07:57.000] ढक्कन के नीचे भाप में पकाने के बाद, हम ग्रेवी को गाढ़ा करने के लिए इसे बिना ढके 10 मिनट तक तेज़ आंच पर पकाते हैं।",
    "[00:08:03.000] आइए अंतिम रूप देखते हैं।",
    "[00:08:26.000] यह साथ में परोसी जाने वाली 'अळू वड़ी' है। यह काले अरबी के पत्तों से बनी है।",
    "[00:08:42.000] मेरे पास नागली (रागी) की रोटी और चावल के साथ बोकरे ची भाजी परोसी गई है। मुझे इसे चखने दें।",
    "[00:08:53.000] भले ही वे शुरुआत में मांस को मसालों में नहीं भूनते हैं, लेकिन इसका स्वाद अविश्वसनीय और बहुत ही जबरदस्त है।",
    "[00:09:02.000] अनिल जी, हमारे साथ शादी की यह परंपरा साझा करने के लिए आपके पूरे परिवार को धन्यवाद।",
    "[00:09:15.000] हमारे गाइड रतन जी को भी धन्यवाद। अगले एपिसोड में मिलते हैं!"
  ],
  "transcription_english": [
    "[00:00:15.000] Hello, Namaste, Aadab. Welcome to Rural Recipes. We are exploring the tribal areas of Nashik.",
    "[00:00:22.000] In the distance, you can see a flat-topped hill called Hathgarh. We'll head closer to tell you its interesting story.",
    "[00:00:40.000] This 'Table Mountain' behind me is Hathgarh Fort. Locals believe when Shivaji Maharaj returned from Surat, his men built this manually by hand—hence the name Hathgarh.",
    "[00:00:59.000] Today, we are heading to a small, beautiful village called Vardha to document a traditional rural recipe.",
    "[00:01:18.000] We've reached Vardha village. Before we cook, let me show you how beautiful this village is.",
    "[00:01:36.000] Namaste! I am here with Anil Raut, a local teacher. Anil ji, welcome to Rural Recipes.",
    "[00:01:51.000] What are you making for us today? Today I am making 'Bokre Chi Bhaji'. It is our tribal wedding tradition.",
    "[00:01:58.000] It is made on the day of the Haldi ceremony to feed the entire village and all relatives.",
    "[00:02:06.000] 'Bokra' specifically means male goat. Only the male goat is used for this festive recipe.",
    "[00:02:13.000] Anil ji has brought fresh mutton, and we are excited for this great feast.",
    "[00:02:25.000] Everything is ready. Let's meet the cook. Anil ji's wife, Hemlata Anil Raut, will be preparing the dish.",
    "[00:02:40.000] Sister, tell us about the spices. We have coconut, onion, ginger-garlic paste, and soybean oil.",
    "[00:02:51.000] For heat, we have red chili powder. There is also a homemade masala, turmeric, curry leaves, and salt.",
    "[00:03:04.000] We don't use the onions and coconut raw. We first roast them directly in the fire.",
    "[00:03:38.000] The whole onions are roasted in the fire first. Then they are ground into a dark paste.",
    "[00:03:44.000] The roasted coconut is also ground. These two roasted items give the masala its characteristic blackish color.",
    "[00:04:04.000] We start by adding oil to the pot, then salt and turmeric. Now we add the mutton.",
    "[00:04:24.000] It will now boil for about half an hour to ensure the meat is partially cooked.",
    "[00:04:36.000] While it boils, Anil mentions his parents are artists who perform traditional folk songs like Thakur and Gauri songs.",
    "[00:05:10.000] The mutton has been boiling for about 30 to 35 minutes. Let's check it.",
    "[00:05:20.000] It's ready. We will remove the partially cooked meat now.",
    "[00:05:29.000] Now, fresh oil goes into the pot. We start the tempering with ginger-garlic paste.",
    "[00:05:46.000] After sautéing for a few minutes, we add the roasted onion paste.",
    "[00:05:58.000] The roasted onion paste is sautéed with the ginger-garlic. Then we add the roasted coconut paste.",
    "[00:06:19.000] Now for the dry spices: red chili powder, turmeric, and the homemade tribal masala.",
    "[00:06:39.000] The partially cooked mutton goes back into this rich spice base. We add salt to taste.",
    "[00:07:01.000] We add the reserved hot water (mutton stock) from the boiling stage back into the pot.",
    "[00:07:07.000] We cover it to simmer. We add the curry leaves now.",
    "[00:07:15.000] We also pour a bit of water onto the lid while it simmers to create a steaming effect.",
    "[00:07:36.000] It needs just a little more time. We add fresh coriander leaves.",
    "[00:07:57.000] After steaming it under the lid, we cook it on high flame for another 10 minutes uncovered to thicken the gravy.",
    "[00:08:03.000] Let's check the final consistency.",
    "[00:08:26.000] This is 'Alu Wadi' served on the side. It's made from black colocasia leaves.",
    "[00:08:42.000] I have the Bokre Chi Bhaji served with Nagali (finger millet) roti and rice. Let me taste it.",
    "[00:08:53.000] Even though they don't sauté the meat in spices at the start, the flavor is incredible and very robust.",
    "[00:09:02.000] Anil ji, thank you to your whole family for sharing this wedding tradition with us.",
    "[00:09:15.000] Thank you to our guide Ratan ji as well. We'll see you in the next episode!"
  ]
}