{
  "metadata": {
    "title": "Bombil Cha Rasha | A Coastal Culinary Delight | Traditional Rural Recipe of Palghar, Maharashtra |",
    "channel_name": "Rural Recipes",
    "publish_date": "2025-02-24",
    "view_count": 211,
    "like_count": 7,
    "duration": "07:39",
    "original_audio_language": "Hindi / Marathi",
    "video_id": "EF7fJWC0kak",
    "url": "https://www.youtube.com/watch?v=EF7fJWC0kak",
    "description": "In this episode of Rural Recipes, we explore the Talasari region of Palghar, Maharashtra. We visit the home of our local guide, Tukaram, where his wife Sujata demonstrates how to prepare 'Bombil Cha Rasha'—a spicy and tangy curry made from dried Bombay Duck (Bombil).",
    "ingredients_detected": [
      "Sukh Bombil (Dried Bombay Duck)",
      "Bata/Batata (Potatoes)",
      "Kanda (Onions)",
      "Tamatar (Tomatoes)",
      "Papadi (Flat beans)",
      "Imli Pani (Tamarind water)",
      "Lasun (Garlic)",
      "Adrak (Ginger)",
      "Hari Mirch (Green chilies)",
      "Dhaniya Patta (Coriander leaves)",
      "Mirch Powder (Red chili powder)",
      "Haldi (Turmeric powder)",
      "Garam Masala",
      "Tel (Oil)",
      "Namak (Salt)"
    ]
  },
  "transcription_hindi": [
    "[00:00:11.000] नमस्ते, रूरल रेसिपी के इस महाराष्ट्र अध्याय में हम महाराष्ट्र के पालघर जिले की खोज कर रहे हैं।",
    "[00:00:20.000] मुझे इस परिदृश्य और छोटा नागपुर पठार या पुरुलिया के बीच एक समानता महसूस हुई—वहाँ के भूभाग और पौधों के मामले में।",
    "[00:00:34.000] हम अभी तलासरी में हैं। यहाँ का एक महत्वपूर्ण स्थान गंभीरगढ़ किला है।",
    "[00:00:42.000] स्थानीय लोगों का मानना है कि शिवाजी महाराज यहाँ कई बार रुके थे और उन्होंने ही इस स्थान का नामकरण किया था।",
    "[00:00:54.000] हमारे गाइड तुकाराम के साथ कई दिनों तक पालघर के गाँवों का भ्रमण करने के बाद, अब हम उनके घर आए हैं।",
    "[00:01:08.000] तुकाराम जी, आप पूरी तरह तैयार लग रहे हैं! अब तक तो आप सीख गए होंगे कि हम इन एपिसोड्स की शूटिंग कैसे करते हैं।",
    "[00:01:23.000] आज खाना कौन बना रहा है और क्या बन रहा है? मेरी पत्नी आज 'सूखे बोंबिल का रस्सा' बनाएगी।",
    "[00:01:31.000] बॉम्बे डक (बोंबिल) महाराष्ट्र की पहचान है। यहाँ आकर बोंबिल की रेसिपी न बनाना तो नामुमकिन है।",
    "[00:01:43.000] तुकाराम बताते हैं: हम दहानू से ताज़ा बोंबिल लाते हैं, उन्हें धूप में सुखाते हैं और ज़रूरत पड़ने पर उसका रस्सा बनाते हैं।",
    "[00:01:53.000] आइए सुजाता से मिलते हैं। नमस्ते! आपके पास क्या है? यह ताज़ा खजूर का रस (खजुरी रस) है।",
    "[00:02:08.000] आपने सब कुछ बहुत अच्छे से सजाया है। रस्से के लिए ज़रूरी सामग्री के बारे में बताएं।",
    "[00:02:15.000] हमारे पास साफ़ किया हुआ सूखा बोंबिल, आलू (बटाटा), प्याज (कांदा) और टमाटर हैं।",
    "[00:02:30.000] यहाँ कद्दूकस किया हुआ अदरक, लहसुन और हरी मिर्च है। हमारे पास 'पापड़ी' भी है, जो स्थानीय किस्म की सेम है।",
    "[00:02:49.000] सूखा बोंबिल बंगाल में भी बहुत लोकप्रिय है, जहाँ इसे 'लोटे शुटकी' कहा जाता है।",
    "[00:03:00.000] मसालों में हमारे पास तेल, नमक, गरम मसाला, मिर्च पाउडर, हल्दी और खटास के लिए इमली का पानी है।",
    "[00:03:20.000] चलिए खाना बनाने के लिए बाहर के चूल्हे पर चलते हैं। लकड़ी की आग तैयार है।",
    "[00:03:39.000] सुजाता तेल गरम करके कटे हुए प्याज और टमाटर डालकर शुरुआत करती हैं।",
    "[00:03:52.000] इसके बाद, वह कद्दूकस किया हुआ लहसुन, अदरक और हरी मिर्च डालती हैं। सूखी मछली में लहसुन का भरपूर इस्तेमाल होता है।",
    "[00:04:01.000] वह नमक, मिर्च पाउडर, हल्दी और गरम मसाला डालती हैं।",
    "[00:04:22.000] अब, सूखे बोंबिल को मसाले के आधार में डालकर अच्छी तरह भूना जाता है।",
    "[00:04:37.000] कटे हुए आलू और पापड़ी को अब इसमें डाला जाता है। ये मछली के साथ मिलकर पकेंगे।",
    "[00:04:59.000] यह डिश तैयार होने में ज़्यादा समय नहीं लेती, सब कुछ कड़ाही में डालने के बाद बस 10-15 मिनट लगते हैं।",
    "[00:05:15.000] यह बहुत मसालेदार दिख रहा है। अब, वह इसमें खट्टा स्वाद देने के लिए इमली का पानी डालती हैं।",
    "[00:05:32.000] तुकाराम की बेटी, समृद्धि, हमारे साथ जुड़ती है। रस्सा लगभग तैयार है।",
    "[00:05:50.000] हम ताज़ा धनिया पत्ती के साथ इसे सजाते हैं। बोंबिल का रस्सा तैयार है!",
    "[00:06:02.000] जब तक खाना परोसा जाता है, तुकाराम और उनके भाई शांताराम हमें एक पारंपरिक नृत्य दिखाते हैं।",
    "[00:06:17.000] इसे 'घर' या 'टिपरी' नृत्य कहा जाता है, जो दीपावली के दौरान गाँवों में किया जाता है।",
    "[00:06:30.000] वे इस क्षेत्र के अन्य पारंपरिक नृत्यों जैसे कामड़ी, गौरी और तारपा नृत्य का भी उल्लेख करते हैं।",
    "[00:07:01.000] खाना परोसा जा चुका है। इसमें मसालों की तीक्ष्णता और इमली की खटास का सही संतुलन है।",
    "[00:07:10.000] पालघर एक तटीय और आदिवासी दोनों जिला है, इसलिए यहाँ ताज़ी और सूखी मछली साल भर उपलब्ध रहती है।",
    "[00:07:26.000] आपको आज का एपिसोड कैसा लगा? कृपया कमेंट में अपनी प्रतिक्रिया और सुझाव साझा करें।",
    "[00:07:33.000] रूरल रेसिपी देखते रहिए। धन्यवाद!"
  ],
  "transcription_english": [
    "[00:00:11.000] Hello, Namaste, and welcome back. In this Maharashtra chapter of Rural Recipes, we are exploring the Palghar district.",
    "[00:00:20.000] I noticed a striking similarity between this landscape and the Chota Nagpur plateau or Purulia—in terms of terrain and plants.",
    "[00:00:34.000] We are currently in Talasari. A key destination here is the Gambhirgad Fort.",
    "[00:00:42.000] Local tradition says Shivaji Maharaj stayed here many times and even named this place.",
    "[00:00:54.000] After exploring Palghar villages for several days with our guide Tukaram, we've finally come to his home.",
    "[00:01:08.000] Tukaram ji, you look all set! By now, you must have learned how we film these episodes.",
    "[00:01:23.000] Who is cooking today and what's on the menu? My wife will cook 'Sukh Bombil Cha Rasha' (Dried Bombay Duck Curry).",
    "[00:01:31.000] Bombay Duck is iconic to Maharashtra. It's impossible to visit here and not feature a Bombil recipe.",
    "[00:01:43.000] Tukaram explains: We bring fresh Bombil from Dahanu, dry it in the sun, and cook it when we need a hearty meal.",
    "[00:01:53.000] Let's meet Sujata. Namaste! What do you have there? This is fresh date palm sap (Khajuri ras).",
    "[00:02:08.000] You've organized everything beautifully. Tell us the ingredients needed for the curry.",
    "[00:02:15.000] We have cleaned and cut dried Bombil, potatoes (bata), onions (kanda), and tomatoes.",
    "[00:02:30.000] There are grated ginger, garlic, and green chilies. We also have 'Papadi', which is a local variety of flat beans.",
    "[00:02:49.000] Dried Bombil is also very popular in Bengal, where it's called 'Lote Shutki'.",
    "[00:03:00.000] For spices, we have oil, salt, garam masala, chili powder, turmeric, and tamarind water for the tang.",
    "[00:03:20.000] Let's go to the outdoor kitchen to start cooking. The wood fire is ready.",
    "[00:03:39.000] Sujata starts by heating oil and adding chopped onions and tomatoes.",
    "[00:03:52.000] Next, she adds the grated garlic, ginger, and green chilies. Garlic is used generously in dry fish preparations.",
    "[00:04:01.000] She adds salt, chili powder, turmeric, and garam masala.",
    "[00:04:22.000] Now, the dried Bombil is added to the spice base and sautéed well.",
    "[00:04:37.000] The cubed potatoes and Papadi beans are added next. These will cook together with the fish.",
    "[00:04:59.000] This dish is quick to prepare, taking only about 10-15 minutes once everything is in the pan.",
    "[00:05:15.000] It's looking very rich and spicy. Now, she pours in the tamarind water to give it a tangy flavor.",
    "[00:05:32.000] Tukaram's daughter, Samriddhi, joins us. The curry is almost done.",
    "[00:05:50.000] We finish with a garnish of fresh coriander leaves. The Bombil Cha Rasha is ready!",
    "[00:06:02.000] While the food sets, Tukaram and his brother Shantaram show us a traditional dance.",
    "[00:06:17.000] This is called the 'Ghar' or 'Tipri' dance, traditionally performed in the village during Diwali.",
    "[00:06:30.000] They also mention other traditional dances like the Kaamdi, Gauri, and Tarpa dances of the region.",
    "[00:07:01.000] The food is served. It has the perfect balance of heat from the masala and tang from the tamarind.",
    "[00:07:10.000] Palghar is both a coastal and tribal district, so fresh and dried fish are available year-round and deeply enjoyed.",
    "[00:07:26.000] How did you like today's episode? Please share your feedback and suggestions in the comments.",
    "[00:07:33.000] Keep watching Rural Recipes. Thank you!"
  ]
}