{
  "metadata": {
    "title": "কোচবিহারি পোলাও | Coochbehari Polao",
    "channel_name": "Rural Recipes",
    "publish_date": "2024-03-01",
    "view_count": 699,
    "like_count": 40,
    "duration": "07:36",
    "original_audio_language": "Bengali",
    "video_id": "tx0hY4uqnGg",
    "url": "https://www.youtube.com/watch?v=tx0hY4uqnGg",
    "description": "In this episode of Rural Recipes, we visit Cooch Behar to explore a historical and local delicacy – Coochbehari Polao. Prepared by Laila Sultana (Lovely), this polao is unique due to its specific preparation technique and traditional roots.",
    "ingredients_detected": [
      "Govindabhog Rice (Gobindobhog Chal)",
      "Ghee",
      "Cashews (Kaju)",
      "Raisins (Kishmish)",
      "Panch Phoron (Bengali Five-Spice)",
      "Cardamom (Chhoto Elach)",
      "Ginger Paste (Ada Bata)",
      "Fried Onions (Beresta)",
      "Sugar (Chini)",
      "Red Chili Powder (Shukno Lonkar Guro)",
      "Salt (Lobon)",
      "Water",
      "Cherries and Green Chilies (for garnishing)"
    ]
  },
  "transcription_bengali": [
    "[00:00:10.200] রুরাল রেসিপি ইউটিউব চ্যানেল নিয়ে আমরা এখন কুচবিহার জেলায়।",
    "[00:00:17.500] এই জায়গাটা কে বলে গোসানিমারির গড় কেউ বলে গোসানিমারির ঢিপি। এটা একসময় কান্তা ডাইনাস্টির রাজধানী ছিল।",
    "[00:00:34.100] এই রাজকীয় জায়গা থেকে আমরা যাব একটু দূরে এবং সেখান থেকে তুলে ধরবো কুচবিহার জেলার একটি ইন্টারেস্টিং রেসিপি।",
    "[00:00:43.600] পোলাও বা পোলান; ইতিহাসবিদরা বলে যে পোলাও আমাদের দেশে তথা এই বাংলায় এসছে মুসলিম শাসকদের হাত ধরে।",
    "[00:01:00.300] এটি একটি প্রচন্ড পপুলার ডিশ এটা রয়েছে নানান ভ্যারাইটি এবং এটা পরিচিত নানান নামে - পোলাও, পোলাও, পিলাও।",
    "[00:01:10.500] আজ বিয়েবাড়িতে অনুষ্ঠানে পিস পোলাও সেরকমই একটি ইউনিক রেসিপি আজ আপনাদের সঙ্গে শেয়ার করব।",
    "[00:01:19.200] আসসালামু আলাইকুম। ওয়ালাইকুম আসসালাম। আজ আমরা এসছি লায়লা সুলতানার বাড়িতে।",
    "[00:01:25.400] তুমি কি বানাচ্ছ? আমি এই অঞ্চলের কোচবিহারি পোলাও বানাচ্ছি।",
    "[00:01:32.100] কোচবিহরি পোলাও, যেটা আমাদের সচরাচর এখানে পোলাও খাওয়া হয়।",
    "[00:01:40.300] আমরা প্রথমে নিচ্ছি কাজু, তারপরে নিচ্ছি কিসমিস, তারপরে ঘি আছে এখানে।",
    "[00:01:50.100] শুকনো লঙ্কার গুঁড়ো, তারপরে একটু চিনি দেবো। ছোট এলাচ, এখানে পাঁচ ফোরন আছে।",
    "[00:02:05.200] আদা বাটা দিবো আর এটা বেরেস্তা (ভাজা পেঁয়াজ) করে রেখেছি।",
    "[00:02:12.300] চাল নিয়েছি আমি গোবিন্দভোগ চাল। একসময় কালো মুনিয়া চালও ভীষণ পপুলার ছিল।",
    "[00:02:43.100] আমি প্রথমে পানি ফুটিয়ে নিচ্ছি। মেপে মেপে দিচ্ছি।",
    "[00:02:48.500] আমি এখানে চার কাপ চাল নিয়েছি তো এই চার কাপ চালে আট কাপ পানি দেবো।",
    "[00:03:01.200] পাঁচ ফোরন দেবো আর ছোট এলাচ দেবো পানির মধ্যে। ওটাকে থেতলে নিয়েছি।",
    "[00:03:09.400] এটা ১০ থেকে ১৫ মিনিট ফোটাবো একটা কালার আসবে একটা সেন্টও আসবে।",
    "[00:03:21.300] ফুটে গেছে নিশ্চয়ই? হ্যাঁ ফুটে গেছে। বাহ একটা সুন্দর কালার এসছে কিন্তু।",
    "[00:03:32.400] এবার এই চালটাকে ভিজিয়ে ধুয়ে পানি ঝরিয়ে নেব।",
    "[00:03:41.100] এখন আমি চালটাকে ভুনিয়ে নেব। কড়াইতে ঘি দিচ্ছি। এবার চালটা দিয়ে নিচ্ছি।",
    "[00:04:14.200] স্বাদমত লবণ দিচ্ছি। এটাকে কনস্ট্যান্টলি তোমাকে নাড়তে হবে না হলে পুড়ে যাবে।",
    "[00:04:26.500] একটু শুকনো লঙ্কা গুঁড়া দিচ্ছি এটাতে কালার আসবে। একটু চিনি দিয়ে দিচ্ছি কালারের জন্য।",
    "[00:04:41.100] কখন বুঝবে যে চালটা হয়ে গেছে? একটু গায়ে মাখা মাখা হবে, আঠা আটা হবে।",
    "[00:04:48.300] চালটা ভুনানো হয়ে গেছে, এবার আমি আগে ফুটিয়ে রাখা পানিটা এখানে ঢেলে দিচ্ছি।",
    "[00:05:08.200] এবার আমি পানিটা ঢেলে দিচ্ছি। পুরো জলটাই চলে যাচ্ছে।",
    "[00:05:17.400] ঢেকে দিচ্ছি মোটামুটি ১০ মিনিট। এখন আঁচটা তুমি একটু বেশি করে দিয়েছো।",
    "[00:05:50.100] পানিটা অনেকটাই শুকিয়ে গেছে; প্রথমে কাজু আর কিসমিস দিয়ে দিলাম।",
    "[00:06:02.300] এবার আদা বাটা দিয়ে দিচ্ছি আর পুরো বেরেস্তাটা দিয়ে দিচ্ছি। ভাজা পেঁয়াজটা যাচ্ছে।",
    "[00:06:25.100] পোলাও হয়ে গেছে, বাকিটা ভাপে (dum) হয়ে যাবে।",
    "[00:06:32.500] সাজানোর জন্য উপরে চেরি আর কাঁচা লঙ্কা দিয়ে দিচ্ছি।",
    "[00:06:40.200] টেকনিকটা একটু আলাদা; চালটাকে আলাদা করে ভেজে জলটাকে আলাদা করে ফুটিয়ে নিয়ে বানানো।",
    "[00:06:55.300] এইতো আমার হাতে হাজির কুচবিহারী পোলাও, সঙ্গে একটু চিকেন কষাও দেখতে পাচ্ছি।",
    "[00:07:22.100] আপনারা সাবস্ক্রাইব করবেন এবং কমেন্ট করবেন। গ্রাম বাংলার অন্য কোন ট্রেডিশনাল রেসিপি নিয়ে আবার ফিরে আসবো।"
  ],
  "transcription_english": [
    "[00:00:10.200] We are in Cooch Behar district with the Rural Recipes YouTube channel.",
    "[00:00:17.500] This place is called Gosanimari's Garh or Mound. It was once the capital of the Kanta dynasty.",
    "[00:00:34.100] From this royal location, we will travel nearby to showcase an interesting recipe from Cooch Behar.",
    "[00:00:43.600] Polao or Polan; historians say Polao came to this country and Bengal through Muslim rulers.",
    "[00:01:00.300] It is a very popular dish with many varieties and known by different names - Polao, Pulao, Pilaf.",
    "[00:01:10.500] Today I will share a unique wedding-style Pea Polao recipe with you.",
    "[00:01:19.200] As-salamu alaykum. Wa alaykum as-salam. Today we are at Laila Sultana's house.",
    "[00:01:25.400] What are you making? I am making the regional Coochbehari Polao.",
    "[00:01:32.100] Coochbehari Polao, which is the variety typically eaten here.",
    "[00:01:40.300] First, we are taking cashews, then raisins, and we have ghee here.",
    "[00:01:50.100] Red chili powder, then a bit of sugar. Small cardamom and panch phoron.",
    "[00:02:05.200] Adding ginger paste and previously prepared beresta (fried onions).",
    "[00:02:12.300] I have used Govindabhog rice. Once, 'Kalo Munia' rice was very popular too.",
    "[00:02:43.100] First, I am boiling the water. I am measuring it out.",
    "[00:02:48.500] I have taken four cups of rice, so I will add eight cups of water.",
    "[00:03:01.200] Adding panch phoron and small cardamom into the water. I have crushed them.",
    "[00:03:09.400] I'll boil this for 10 to 15 minutes; a color and aroma will develop.",
    "[00:03:21.300] Is it boiling? Yes, it is. Wow, it has developed a beautiful color.",
    "[00:03:32.400] Now I will wash the rice and drain the water.",
    "[00:03:41.100] Now I will sauté (bhuno) the rice. Adding ghee to the pan. Then adding the rice.",
    "[00:04:14.200] Adding salt to taste. You have to stir this constantly, otherwise, it will burn.",
    "[00:04:26.500] Adding a bit of red chili powder for color. Adding sugar for color as well.",
    "[00:04:41.100] When do you know the rice is ready? It becomes a bit sticky and coats the pan.",
    "[00:04:48.300] The rice is sautéed; now I am pouring the previously boiled flavored water into it.",
    "[00:05:08.200] Now I am pouring the water. All the water is being added.",
    "[00:05:17.400] Covering it for about 10 minutes. You've kept the heat high for now.",
    "[00:05:50.100] The water has dried up significantly; first, I added the cashews and raisins.",
    "[00:06:02.300] Now I am adding ginger paste and the entire beresta (fried onions).",
    "[00:06:25.100] The Polao is done; the rest will finish on steam (dum).",
    "[00:06:32.500] Adding cherries and green chilies on top for decoration.",
    "[00:06:40.200] The technique is a bit different; frying the rice and boiling the water separately.",
    "[00:06:55.300] Here is the Coochbehari Polao ready in my hand, served with some chicken kosha.",
    "[00:07:22.100] Please subscribe and comment. We will return with another traditional recipe from rural Bengal."
  ]
}