{
  "metadata": {
    "title": "ইলিশ মাথা দিয়ে দোস্তল কচু | Dostol Kochu cooked with Hilsha Fish head | Rural Recipes",
    "channel_name": "Rural Recipes",
    "publish_date": "2024-04-12",
    "view_count": 360,
    "like_count": 10,
    "duration": "07:48",
    "original_audio_language": "Bengali",
    "video_id": "0A03xZQ0XU4",
    "url": "https://www.youtube.com/watch?v=0A03xZQ0XU4",
    "description": "In this episode of Rural Recipes, we visit the historic village of Neelkuthi in Nadia district, West Bengal. We explore the traditional preparation of 'Dostol Kochu' (a specific variety of taro/colocasia stalks). This versatile vegetable is used to create two distinct recipes: one non-vegetarian version featuring Hilsa fish heads and a vegetarian version with grated coconut.",
    "ingredients_detected": [
      "Dostol Kochu (Colocasia/Taro stalks)",
      "Ilish Macher Matha (Hilsa Fish Head)",
      "Narkel Kora (Grated Coconut)",
      "Sorsher Tel (Mustard Oil)",
      "Ada Bata (Ginger Paste)",
      "Jeera Bata (Cumin Paste)",
      "Kancha Lonka Bata (Green Chili Paste)",
      "Holud Guro (Turmeric Powder)",
      "Lobon (Salt)",
      "Chini (Sugar)",
      "Tejpata (Bay Leaves)",
      "Panch Phoron (Five-Spice Blend)"
    ]
  },
  "transcription_bengali": [
    "[00:00:10.000] গ্রাম বাংলা ভ্রমণের সময় আমরা কেবল স্বাদই খুঁজে পাই না, বরং ইতিহাসের গল্পও খুঁজে পাই।",
    "[00:00:21.000] বর্তমানে আমরা নদীয়া জেলায় আছি, যেখানে ইতিহাসের ছাপ প্রতিটি কোণায় ছড়িয়ে আছে।",
    "[00:00:31.000] আঠারো শতকের শেষের দিকে ব্রিটিশরা এখানে নীল চাষ করতে বাধ্য করত। আমরা যে গ্রামে আছি তার নাম 'নীলকুঠি'।",
    "[00:00:58.000] আজ আমরা 'দোস্তল কচু' নামক একটি ঐতিহ্যবাহী খাবার তৈরি করব। হয়তো আপনারা এই নাম আগে শোনেননি।",
    "[00:01:08.000] দেখুন, এই হলো দোস্তল কচু। এটি দেখতে মান-কচুর মতো কিন্তু পাতা গাঢ় সবুজ এবং ডাঁটা সাদাটে।",
    "[00:01:41.000] আমরা করিমপুর ব্লকের নাটনা গ্রামে তুলসীদির বাড়িতে আছি। তুলসীদি, রুরাল রেসিপিতে আপনাকে স্বাগত।",
    "[00:01:52.000] আজ আমরা ইলিশ মাছের মাথা দিয়ে দোস্তল কচুর ডাঁটা রান্না করব।",
    "[00:02:17.000] আজ আমরা দুটো ভার্সনই তৈরি করব। মশলা হিসেবে আছে সরিষার তেল, আদা, জিরা এবং কাঁচা লঙ্কা বাটা।",
    "[00:02:56.000] এই অঞ্চলে ইলিশ খুব জনপ্রিয় কারণ পদ্মা নদী খুব কাছেই। প্রথমে আমরা ডাঁটাগুলো সেদ্ধ করে নেব।",
    "[00:03:08.000] প্রেশার কুকারে প্রায় ৩টি সিটি দিয়ে ডাঁটাগুলো সেদ্ধ করে নিচ্ছি।",
    "[00:03:28.000] আমরা জল ঝরিয়ে ফেলে দেব। এবার কড়াই বসিয়ে দেব।",
    "[00:04:05.000] বাঙালি রান্নায় সরিষার তেল মাস্ট। ইলিশের মাথা হালকা করে ভেজে নিতে হবে।",
    "[00:04:20.000] এবার ডাঁটাগুলো রান্না করব। পাঁচ ফোড়ন, তেজপাতা, আদা এবং জিরা বাটা দিচ্ছি।",
    "[00:04:45.000] কাঁচা লঙ্কা বাটা এবং সেদ্ধ করা ডাঁটাগুলো দিয়ে দেব। তারপর হলুদ এবং লবণ।",
    "[00:05:18.000] এটি শুকনো এবং টানটান না হওয়া পর্যন্ত নাড়তে হবে। রান্নার সময় বাড়তি জলের প্রয়োজন নেই।",
    "[00:05:38.000] নিরামিষ পদের জন্য অর্ধেক সরিয়ে রাখব। বাকি অর্ধেকের সাথে ভাজা ইলিশের মাথা মিশিয়ে দেব।",
    "[00:06:05.000] আমিষ পদটি তৈরি। এবার নিরামিষ পদের জন্য সামান্য চিনি এবং নারকেল কোরা যোগ করব।",
    "[00:07:03.000] এক এপিসোডে দুটি রেসিপি: ইলিশ মাথা দিয়ে দোস্তল কচু এবং নারকেল দিয়ে দোস্তল কচু।",
    "[00:07:33.000] আমাদের ফিডব্যাক জানাবেন। পরবর্তী গ্রামে দেখা হবে। ধন্যবাদ!"
  ],
  "transcription_english": [
    "[00:00:10.000] While traveling through rural Bengal, we find not just tastes but stories of history.",
    "[00:00:21.000] Currently, we are in Nadia district, where history is scattered in every corner.",
    "[00:00:31.000] In the late 18th century, the British forced indigo cultivation here. The village we are in is called 'Neelkuthi'.",
    "[00:00:58.000] Today, we will prepare a traditional dish called 'Dostol Kochu'. You might not have heard this name before.",
    "[00:01:08.000] Look, this is Dostol Kochu. It looks like 'Man-kochu' but the leaves are darker green and stalks are whitish.",
    "[00:01:41.000] We are at Tulsidi's house in Natna, Karimpur block. Tulsi, welcome to Rural Recipes.",
    "[00:01:52.000] Today we will cook Dostol Kochu stalks with Hilsa fish head.",
    "[00:02:17.000] We will make both versions today. For spices, we have mustard oil, ginger, cumin, and green chili pastes.",
    "[00:02:56.000] Hilsa is popular here because the Padma River is very close. First, we boil the stalks.",
    "[00:03:08.000] We pressure cook the stalks for about 3 whistles.",
    "[00:03:28.000] We drain the water and discard it. Now we set up the kadai.",
    "[00:04:05.000] Bengali cooking requires mustard oil. The Hilsa head should be lightly fried.",
    "[00:04:20.000] Now I'll cook the stalks. I add five-spice blend, bay leaves, ginger, and cumin paste.",
    "[00:04:45.000] Adding green chili paste and the boiled stalks. Then turmeric and salt.",
    "[00:05:18.000] We stir it until it becomes dry and tight. No extra water is needed during cooking.",
    "[00:05:38.000] I'll set aside half for the vegetarian version. Now I add the fried fish head to the rest.",
    "[00:06:05.000] The non-vegetarian version is ready. Now for the vegetarian one, we add a little sugar and coconut.",
    "[00:07:03.000] Two recipes in one episode: Dostol Kochu with Hilsa head and Dostol Kochu with coconut.",
    "[00:07:33.000] Let us know your feedback. See you in the next village. Thank you!"
  ]
}