{
  "metadata": {
    "title": "আমচুর দিয়ে মাছের টক | Fish Curry with Dried Mango | Rural Recipes",
    "channel_name": "Rural Recipes",
    "publish_date": "2024-06-21",
    "view_count": 442,
    "like_count": 15,
    "duration": "09:08",
    "original_audio_language": "Bengali",
    "video_id": "O9xMePCaEYo",
    "url": "https://www.youtube.com/watch?v=O9xMePCaEYo",
    "description": "In this episode of Rural Recipes, we visit Sarta village in West Midnapore, known for its traditional Madur (mat-weaving) industry. We meet National Award-winning artisans Nishikanta Das and Gouribala Das, who demonstrate how to prepare a regional favorite: Fish Curry with Amchur (sun-dried mango).",
    "ingredients_detected": [
      "Katla Mach (Katla Fish pieces)",
      "Amchur (Sun-dried mango slices)",
      "Kumro (Pumpkin)",
      "Dherosh (Okra/Ladyfinger)",
      "Sorsher Tel (Mustard Oil)",
      "Panch Phoron (Bengali five-spice)",
      "Shukno Lonka (Dried Red Chili)",
      "Sorshe-Posto Bata (Mustard and Poppy seed paste)",
      "Holud Guro (Turmeric Powder)",
      "Lobon (Salt)",
      "Chini (Sugar)",
      "Jol (Water)"
    ]
  },
  "transcription_bengali": [
    "[00:00:38.000] নমস্কার রুরাল রেসিপি ইউটিউব চ্যানেলে আপনাদের সকলকে স্বাগত।",
    "[00:00:46.000] আমরা এই মুহূর্তে রয়েছি পশ্চিম মেদিনীপুরের সবং ব্লকের সারতা গ্রামে। এই গ্রামটির একটি আলাদা পরিচিতি রয়েছে।",
    "[00:00:54.000] এই গ্রাম এবং তথা এই অঞ্চলের অন্যান্য গ্রামের বহু মানুষ মাদুরকাঠির হস্তশিল্পের সঙ্গে যুক্ত।",
    "[00:01:05.000] এই সুন্দর গ্রামটি আমার ঘুরে দেখার সুযোগ হলো এবং দেখলাম এই অঞ্চলের বহু মানুষ তাদের বাড়িতে এই শিল্পের সঙ্গে জড়িয়ে রয়েছে।",
    "[00:01:16.000] কাল বিকেল বেলা আমরা এখানকার সাপ্তাহিক বাজারেও গিয়েছিলাম, সেখানেও মাদুর শিল্পের আদানপ্রদান হচ্ছে।",
    "[00:01:34.000] আমার সঙ্গে রয়েছে নিশিকান্ত দাস এবং তার স্ত্রী গৌরীবালা দাস। আজ আমরা এই গুণী মানুষের বাড়ি থেকে রেসিপিটি দেখাবো।",
    "[00:01:51.000] এই মাদুর শিল্পটা আমাদের ট্রেডিশনাল। আমি শিখেছি আমার মায়ের কাছ থেকে, মা শিখেছেন তার শাশুড়ির কাছ থেকে।",
    "[00:02:06.000] আমরা মসলন মাদুর করি। এছাড়া ব্যাগ, ডাইনিং টেবিল ম্যাট, যোগা ম্যাট থেকে শুরু করে অনেক কিছু তৈরি করা যায়।",
    "[00:02:22.000] গৌরীবালা দেবী ১৯৯২ সালে ন্যাশনাল মেরিট এবং পরবর্তীতে ন্যাশনাল অ্যাওয়ার্ড পেয়েছেন।",
    "[00:02:44.000] আজ ওনার হাতের জাদু রান্নার ক্ষেত্রে দেখতে চাই। মেদিনীপুরে মাছের টকটাই খুব বেশি চলে।",
    "[00:03:00.000] আমচুর দিয়ে মাছের টক সবজি দিয়েও করা যায়। মেদিনীপুরে সারা বছরই এই মাছের টক খাওয়া হয়।",
    "[00:03:06.000] কাকিমনি একটু দেখিয়ে দাও তো কি কি লাগবে এই মাছের টক বানানোর জন্য।",
    "[00:03:13.000] কাতলা মাছের পিস, সবজি হিসেবে ঢেঁড়স ও কুমড়ো, পাঁচ ফোরন এবং শুকনো লঙ্কা।",
    "[00:03:21.000] এছাড়া হলুদ, লবণ, একটু চিনি, সরষের তেল আর সরষে-পোস্ত বাটা।",
    "[00:03:31.000] প্রধান উপকরণ আমচুর। আমচুর ঠিক কিভাবে তৈরি করা হয় সেটা একটু বলে দাও।",
    "[00:03:44.000] আম গাছ থেকে পেড়ে নুন দিয়ে মাখিয়ে রাখা হয়। তারপর সেই নোনা জল সমেত আম রোদে শুকিয়ে আমচুর তৈরি করা হয়।",
    "[00:04:00.000] জলটা যতক্ষণ না শুকোচ্ছে ততক্ষণ রোদে দেওয়া হয়। এরপর আমচুরটা তৈরি হয়ে যায়।",
    "[00:04:14.000] এটা থেকে আমচুর গুঁড়োও তৈরি হয়। টক হিসেবে অনেকে তেঁতুল, লেবু বা কামরাঙ্গাও ব্যবহার করেন।",
    "[00:04:38.000] আমরা রান্নাঘরে চলে এসছি। এখানে স্মোকলেস বা ধোঁয়াবিহীন চুল্লিতে রান্না হবে।",
    "[00:04:51.000] উননে কড়া বসাচ্ছি এবং মাছ ভাজার জন্য সরষের তেল দিয়ে দিচ্ছি।",
    "[00:05:03.000] মাছগুলো নুন-হলুদ মাখিয়ে কড়াইতে ছাড়ছি। মাছটা একটু কড়া করে ভাজতে হবে।",
    "[00:05:27.000] মাছ ভাজা কমপ্লিট। এবার ওই তেলেই কুমড়ো আর ঢেঁড়স সবজিগুলো একটু ভেজে নেবো।",
    "[00:05:46.000] সবজি হালকা ভেজে নিয়ে কড়াইতে শুকনো লঙ্কা আর পাঁচ ফোড়ন দিয়ে ফোরন দিচ্ছি।",
    "[00:06:02.000] এবার সরষে ও পোস্ত বাটা দিয়ে দিচ্ছি। এতে সরষে-পোস্ত বাটা একটু বেশি পরিমাণে লাগে।",
    "[00:06:20.000] মশলার মধ্যে হলুদ আর স্বাদমতো নুন যোগ করছি।",
    "[00:06:33.000] এবার আগে থেকে ভিজিয়ে রাখা আমচুরগুলো জলের সাথে কড়াইতে দিয়ে দেবো।",
    "[00:06:51.000] সবজি সেদ্ধ হওয়ার জন্য পরিমাণমতো জল দিতে হবে।",
    "[00:07:08.000] আমচুরের কড়া টকটা ব্যালেন্স করার জন্য সামান্য চিনি দিয়ে দিচ্ছি।",
    "[00:07:28.000] দু-তিন মিনিটের জন্য ঢাকা দিয়ে দেবো। আমচুরগুলো খুন্তি দিয়ে একটু থেঁতলে দিলে টকটা ভালো বেরোবে।",
    "[00:07:43.000] এবার ভেজে রাখা মাছগুলো ঝোলের মধ্যে দিয়ে দিচ্ছি। এটি একটু ঝোল ঝোল হবে।",
    "[00:08:09.000] মাছের টক তৈরি হয়ে গেছে এবার নামিয়ে নেবো। মেদিনীপুরের এই বিখ্যাত আইটেম স্বাদ বদলাতে দারুণ।",
    "[00:08:26.000] নিশিকান্ত বাবু ও কাকিমনিকে অসংখ্য ধন্যবাদ আমাদের এই রেসিপিটি দেখানোর জন্য।",
    "[00:08:47.000] দর্শকদের বলবো আমাদের চ্যানেলটি সাবস্ক্রাইব করার জন্য। আপনাদের ফিডব্যাক আমাদের উৎসাহ দেবে।",
    "[00:08:54.000] দেখা হবে অন্য কোন রেসিপির সঙ্গে অন্য কারো বাড়িতে। ধন্যবাদ।"
  ],
  "transcription_english": [
    "[00:00:38.000] Namaskar, welcome to the Rural Recipes YouTube channel.",
    "[00:00:46.000] We are currently in Sarta village in Sabang, West Midnapore. This village has a unique identity.",
    "[00:00:54.000] Many people in this village and region are involved in the traditional handicraft of 'Madur' (mat-weaving).",
    "[00:01:05.000] I had the chance to tour this beautiful village and saw how families are intertwined with this craft.",
    "[00:01:16.000] Yesterday evening, we visited the weekly local market where mat trade and materials are exchanged.",
    "[00:01:34.000] With me are Nishikanta Das and his wife, Gouribala Das. Today we are documenting this episode from their home.",
    "[00:01:51.000] This mat industry is our tradition. I learned it from my mother, and she from her mother-in-law.",
    "[00:02:06.000] We make 'Maslan' mats. Various items like bags, dining mats, and yoga mats can also be made.",
    "[00:02:22.000] Gouribala received a National Merit award in 1992 and later a National Award for her craftsmanship.",
    "[00:02:44.000] Today we want to see her culinary magic. In Midnapore, 'Macher Tok' (sour fish curry) is very popular.",
    "[00:03:00.000] Sour curry with Amchur can be made with vegetables. This dish is eaten year-round in Midnapore.",
    "[00:03:06.000] Auntie, please show us the ingredients needed for this sour fish curry.",
    "[00:03:13.000] Katla fish pieces, vegetables like okra and pumpkin, panch phoron, and dried red chilies.",
    "[00:03:21.000] Also turmeric, salt, a bit of sugar, mustard oil, and mustard-poppy seed paste.",
    "[00:03:31.000] The main ingredient is Amchur. Please explain how this Amchur is made.",
    "[00:03:44.000] Raw mangoes are plucked and salted. Then they are sun-dried along with that salty water.",
    "[00:04:00.000] They are kept in the sun until the water dries up completely. Then the Amchur is ready.",
    "[00:04:14.000] Amchur powder is also made from this. Others use tamarind, lemon, or starfruit as souring agents.",
    "[00:04:38.000] We are in the kitchen now. We will use a smokeless traditional stove for cooking.",
    "[00:04:51.000] Placing the pan and adding mustard oil for frying the fish.",
    "[00:05:03.000] Adding salt-turmeric marinated fish pieces. They need to be fried until crispy.",
    "[00:05:27.000] Fish frying is complete. Now, I'll lightly sauté the vegetables (okra and pumpkin) in the same oil.",
    "[00:05:46.000] After sautéing vegetables, I'm tempering the oil with dried red chilies and panch phoron.",
    "[00:06:02.000] Now, adding the mustard and poppy seed paste. This requires a generous amount of paste.",
    "[00:06:20.000] Adding turmeric and salt to taste to the spice mix.",
    "[00:06:33.000] Now adding the pre-soaked Amchur pieces along with the soaking water into the pan.",
    "[00:06:51.000] Adding enough water so the vegetables can boil and soften properly.",
    "[00:07:08.000] Adding a little sugar to balance the sharp tanginess of the Amchur.",
    "[00:07:28.000] Cover it for 2-3 minutes. Mashing the Amchur slices slightly with the spatula helps release more tang.",
    "[00:07:43.000] Now adding the fried fish pieces into the gravy. It should be a bit runny.",
    "[00:08:09.000] The Fish Tok is ready; now I'll take it off. This famous item is great for changing the palate.",
    "[00:08:26.000] Many thanks to Nishikanta Babu and Auntie for showing us this recipe.",
    "[00:08:47.000] Please subscribe to our channel. Your feedback will encourage us.",
    "[00:08:54.000] We'll see you with another recipe at someone else's home. Thank you."
  ]
}