{
  "metadata": {
    "title": "মাছের খিচুড়ি | Fish Khichudi | Rural Recipes",
    "channel_name": "Rural Recipes",
    "publish_date": "2024-08-23",
    "view_count": 403,
    "like_count": 11,
    "duration": "09:42",
    "original_audio_language": "Bengali",
    "video_id": "3T3MX5oOEr4",
    "url": "https://www.youtube.com/watch?v=3T3MX5oOEr4",
    "description": "In this episode of Rural Recipes, we travel to Rajbalhat in the Hooghly district, a village famous for its traditional handloom weaving and historical temples. We meet Nupur Di, who demonstrates a unique and traditional regional recipe: Fish Khichudi. This hearty, one-pot meal is a local favorite, especially during the monsoon season when fresh fish is abundant.",
    "ingredients_detected": [
      "Rui Mach (Carp) - boiled and deboned",
      "Chal (Rice - mixture of parboiled and sun-dried)",
      "Bhaja Moong Dal (Roasted Yellow Lentils)",
      "Musur Dal (Red Lentils)",
      "Sorsher Tel (Mustard Oil)",
      "Pyaj (Onions - sliced, around 700g)",
      "Rosun (Garlic - grated, around 100g)",
      "Alu & Gajor (Potatoes and Carrots - cubed and fried)",
      "Panch Phoron (Bengali five-spice)",
      "Gota Jeera (Whole Cumin seeds)",
      "Tejpata (Bay Leaves)",
      "Shukno Lonka (Dried Red Chilies)",
      "Holud, Lonka, Jeera, Dhone Guro (Spice powders)",
      "Garam Masala Guro (Homemade)",
      "Dhonepata (Fresh Coriander Leaves)",
      "Chini & Lobon (Sugar and Salt)",
      "Gorom Jol (Hot Water)"
    ]
  },
  "transcription_bengali": [
    "[00:00:12.000] রুরাল রেসিপি ইউটিউব চ্যানেলে আপনাদের সকলকে স্বাগত। আমরা চলে এসছি হুগলী জেলার রাজবলহাট গ্রামে।",
    "[00:00:23.000] হুগলী জেলা ইতিহাস আর ঐতিহ্যে ভরা, আর রাজবলহাট মূলত তাঁতিদের গ্রাম হিসেবে পরিচিত।",
    "[00:00:32.000] এখানে তাঁতের কাজের পাশাপাশি রাজবল্লভী মাতার মন্দিরের মতো অনেক সুন্দর মন্দির রয়েছে।",
    "[00:00:46.000] এই মন্দিরে প্রতিদিন ৬০০ থেকে ৮০০ জনের জন্য ভোগ তৈরি হয়, যাতে ভাত, ডাল আর মাছ দেওয়া একটি সবজিও থাকে।",
    "[00:01:19.000] খিচুড়ির অনেক রকমফের থাকলেও আজ আমরা এই অঞ্চলের একটি ট্রেডিশনাল রেসিপি দেখাবো—মাছের খিচুড়ি।",
    "[00:01:27.000] আমরা নুপুরদির বাড়িতে এসেছি। নুপুরদি এবং তার বড় মেয়ে সুদীপ্তা আজ আমাদের সাথে আছেন।",
    "[00:01:50.000] নুপুরদি জানাচ্ছেন: এখানকার তাঁতিরা অল্প সময়ে এবং কম খরচে উৎসব পালনের জন্য এই খিচুড়ি বানান।",
    "[00:01:57.000] বিশেষ করে বর্ষার দিনে যখন পুকুরে বা মাঠে মাছ ওঠে, তখন চটজলদি আনন্দের জন্য এই মাছের খিচুড়ি করা হয়।",
    "[00:02:18.000] আজ রুই মাছ দিয়ে এই খিচুড়ি তৈরি হবে। নুপুরদি সব উপকরণ সাজিয়ে রেখেছেন।",
    "[00:02:25.000] উপকরণের মধ্যে আছে ধোয়া চাল, ভাজা মুগ ডাল এবং মসুর ডাল।",
    "[00:02:34.000] আরও লাগছে ৭০০ গ্রাম পেঁয়াজ কুচি, ১০০ গ্রাম রসুন কোরা, সরষের তেল, শুকনো লঙ্কা, জিরে আর পাঁচ ফোড়ন।",
    "[00:03:00.000] প্রধান উপকরণ রুই মাছ, যা নুন-হলুদ দিয়ে সেদ্ধ করে আগে থেকেই কাঁটা বেছে রাখা হয়েছে।",
    "[00:03:21.000] প্রথমে কড়াইতে পেঁয়াজ ভাজা শুরু করবো। ৮-১০ জনের রান্নার জন্য অনেকটা পেঁয়াজ লাগছে।",
    "[00:03:32.000] পেঁয়াজ একটু স্বচ্ছ হয়ে এলে কোরা রসুন দিয়ে দেবো এবং লালচে হওয়া পর্যন্ত ভাজবো।",
    "[00:04:00.000] এক চামচ চিনি আর নুন দিয়ে দেবো যাতে পেঁয়াজ তাড়াতাড়ি নরম হয় এবং সুন্দর রঙ আসে।",
    "[00:04:16.000] এবার হাড়িতে অল্প তেল দিয়ে তেজপাতা, পাঁচ ফোড়ন, জিরে আর শুকনো লঙ্কা দিয়ে ফোড়ন দেবো।",
    "[00:04:51.000] ধোয়া চাল দিয়ে সামান্য নেড়ে জল দিয়ে দেবো সেদ্ধ হওয়ার জন্য।",
    "[00:05:26.000] ২০ মিনিট পর চাল আধ-সেদ্ধ হলে মুগ ডাল, মসুর ডাল আর ভাজা সবজিগুলো দিয়ে দেবো।",
    "[00:06:13.000] মাছের খিচুড়িতে সবজি ঐচ্ছিক। এবার ডাল আর চাল পুরোপুরি সেদ্ধ হওয়া পর্যন্ত অপেক্ষা করবো।",
    "[00:06:23.000] খিচুড়ি ফুটে উঠলে এবার কাঁটা বেছে রাখা মাছগুলো মিশিয়ে দেবো।",
    "[00:06:38.000] ছোট মাছ হলে অনেকে আস্ত দেয়, কিন্তু রুই-কাতলার মতো বড় মাছের ক্ষেত্রে কাঁটা বেছে নেওয়াই ভালো।",
    "[00:07:08.000] এবার সব গুঁড়ো মশলা—হলুদ, লঙ্কা গুঁড়ো, ধনে আর জিরে গুঁড়ো দিয়ে দেবো।",
    "[00:07:45.000] সব শেষে বাড়িতে বানানো গরম মশলা আর আগে থেকে ভেজে রাখা পেঁয়াজ-রসুনের মিশ্রণটি দিয়ে দেবো।",
    "[00:08:14.000] ঘনত্বের সামঞ্জস্য রাখতে ফুটিয়ে রাখা গরম জল যোগ করবো। রান্নার এই পর্যায়ে ঠান্ডা জল দেবেন না।",
    "[00:08:34.000] নুপুরদি নামানোর আগে আমায় চেখে দেখতে বললেন। নুন আর ঝাল একদম নিখুঁত হয়েছে।",
    "[00:08:55.000] এর স্বাদ একদম আলাদা—মাছের একটা চমৎকার ফ্লেভার পাওয়া যাচ্ছে। এটি সাধারণ খিচুড়ির চেয়ে অনেক বেশি সুস্বাদু।",
    "[00:09:06.000] নুপুরদির মেয়ে ধনেপাতা কুচি ছড়িয়ে দিলো। এবার এটি বিভিন্ন ভাজাভুজির সাথে পরিবেশনের জন্য তৈরি।",
    "[00:09:23.000] নুপুরদিকে অনেক ধন্যবাদ এই রেসিপিটি দেখানোর জন্য। আপনারা অবশ্যই ফিডব্যাক দেবেন। ধন্যবাদ!"
  ],
  "transcription_english": [
    "[00:00:12.000] Welcome to the Rural Recipes YouTube channel. We have arrived in Rajbalhat village, Hooghly district.",
    "[00:00:23.000] Hooghly is rich in history, and Rajbalhat is primarily known as a weavers' village.",
    "[00:00:32.000] Along with handloom work, there are beautiful temples here like the Rajballavi Mata Temple.",
    "[00:00:46.000] Every day, Bhog is prepared for 600-800 people at this temple, which includes rice, dal, and a fish-mixed vegetable.",
    "[00:01:19.000] Though there are many types of Khichudi, today we show a regional tradition: Fish Khichudi.",
    "[00:01:27.000] We are at Nupur Di's house. Nupur Di and her elder daughter Sudipta are with us today.",
    "[00:01:50.000] Nupur Di explains: Local weavers make this for quick and cost-effective celebrations.",
    "[00:01:57.000] Especially during monsoon, when fish is caught from ponds, they make this to add joy to life.",
    "[00:02:18.000] Today we are making it with Rui fish. Nupur Di has arranged all the ingredients.",
    "[00:02:25.000] Ingredients include washed rice, roasted moong dal, and musur dal.",
    "[00:02:34.000] Also needed: 700g sliced onions, 100g grated garlic, mustard oil, dry chilies, cumin, and panch phoron.",
    "[00:03:00.000] The main ingredient is Rui fish, which has been boiled with salt and turmeric and deboned beforehand.",
    "[00:03:21.000] First, I'll start frying the onions. A lot of onions are needed for 8-10 people.",
    "[00:03:32.000] Once onions are translucent, add grated garlic and fry until they turn golden brown.",
    "[00:04:00.000] Adding a spoon of sugar and salt helps the onions soften quickly and get a nice color.",
    "[00:04:16.000] Now, temper a little oil in the main pot with bay leaves, panch phoron, cumin, and dry chilies.",
    "[00:04:51.000] Add washed rice, sauté briefly, and then add water to let it boil.",
    "[00:05:26.000] After 20 minutes, when rice is half-cooked, add the moong dal, musur dal, and fried vegetables.",
    "[00:06:13.000] Vegetables are optional in fish khichudi. Now wait until the rice and dal are fully cooked.",
    "[00:06:23.000] Once the khichudi boils vigorously, mix in the deboned fish.",
    "[00:06:38.000] For small fish, people leave them whole, but for big fish like Rui or Katla, deboning is better.",
    "[00:07:08.000] Now add all spice powders: turmeric, chili powder, coriander, and cumin powder.",
    "[00:07:45.000] Finally, add homemade garam masala and the previously fried onion-garlic mixture.",
    "[00:08:14.000] Add pre-boiled hot water to adjust consistency. Do not add cold water at this stage.",
    "[00:08:34.000] Nupur Di asked me to taste before serving. The salt and spices are absolutely perfect.",
    "[00:08:55.000] The taste is very distinct—you get a wonderful flavor of the fish. It's much tastier than plain khichudi.",
    "[00:09:06.000] Nupur Di's daughter added fresh coriander leaves. It is now ready to be served with various fritters.",
    "[00:09:23.000] Many thanks to Nupur Di for demonstrating this recipe. Please share your feedback. Thank you!"
  ]
}