{
  "metadata": {
    "title": "Gauthi Komra with Suran | A Tribal Heirloom Dish | Traditional Rural Recipe of Palghar, Maharashtra|",
    "channel_name": "Rural Recipes",
    "publish_date": "2025-02-24",
    "view_count": 139,
    "like_count": 5,
    "duration": "07:23",
    "original_audio_language": "Hindi / Marathi / Warli",
    "video_id": "Ck0lPAXvBdY",
    "url": "https://www.youtube.com/watch?v=Ck0lPAXvBdY",
    "description": "In this episode of Rural Recipes, we continue our journey through Maharashtra's Palghar district. Located near the scenic Kurje Dam in the Talasari block, we visit Rekha ji's home. Along with her daughter-in-law Maina, she prepares a traditional tribal delicacy: 'Gauthi Komra' (Desi/Country Chicken) cooked with 'Suran' (Elephant Foot Yam).",
    "ingredients_detected": [
      "Gauthi Komra (Country Chicken)",
      "Suran (Elephant Foot Yam)",
      "Soybean Oil",
      "Kanda (Onions)",
      "Tamatar (Tomatoes)",
      "Adrak (Ginger)",
      "Lasun (Garlic)",
      "Hirvi Mirchi Chutney (Green chili paste)",
      "Dhaniya Powder (Coriander powder)",
      "Chicken Masala Powder",
      "Haldi (Turmeric powder)",
      "Tikhat (Red chili powder)",
      "Mith (Salt)",
      "Fresh Coriander Leaves",
      "Gorom Jol (Hot Water)"
    ]
  },
  "transcription_hindi": [
    "[00:00:11.000] हम महाराष्ट्र की पारंपरिक रेसिपीज़ की तलाश में यहाँ पालघर आए हैं।",
    "[00:00:18.000] अपनी मंजिल की ओर जाते समय हमें यह खूबसूरत 'कुर्जे डैम' दिखा।",
    "[00:00:26.000] हम पालघर के तलासरी ब्लॉक में हैं और हमारी आज की मंजिल इस बांध से कुछ ही दूरी पर है।",
    "[00:00:39.000] हम यहाँ रेखा जी के घर पर हैं। रेखा जी, आपके साथ कौन है? यह मेरी बहू मैना है।",
    "[00:00:55.000] आज के एपिसोड में यह सास-बहू की जोड़ी हमारे लिए खाना बनाएगी।",
    "[00:01:05.000] हम 'गावती कोमरा' (देसी मुर्गा) और 'सुरन' बना रहे हैं। गावती कोमरा का मतलब है देसी चिकन।",
    "[00:01:11.000] सुरन क्या है? यह एक जड़ है जो जमीन के अंदर उगती है। मराठी में इसे सुरन और अंग्रेजी में 'एलिफेंट फुट यम' कहते हैं।",
    "[00:01:39.000] रेखा जी मसाले दिखाती हैं: लहसुन, प्याज, अदरक, हरी मिर्च की चटनी, चिकन मसाला, धनिया पाउडर, हल्दी, नमक और धनिया पत्ती।",
    "[00:02:03.000] हम आज सोयाबीन तेल का उपयोग कर रहे हैं। हमारे पास लगभग 1 किलो देसी चिकन और 1 किलो सुरन है।",
    "[00:02:19.000] चलिए खाना बनाना शुरू करते हैं। बर्तन में तेल गरम हो रहा है।",
    "[00:02:43.000] सबसे पहले, वह गरम तेल में कद्दूकस किया हुआ लहसुन और अदरक डालती हैं और उन्हें भूनती हैं।",
    "[00:03:01.000] वह बाद में सजावट के लिए पलाश के पत्तों के उपयोग का उल्लेख करती हैं। अब, बहुत सारे कटे हुए टमाटर बर्तन में जाते हैं।",
    "[00:03:15.000] हम टमाटरों को नरम होने देने के लिए इसे थोड़ी देर के लिए ढक देते हैं।",
    "[00:03:25.000] वह नमक—या जैसा कि स्थानीय भाषा में वे इसे 'मीठ' कहते हैं—और हरी मिर्च का पेस्ट डालती हैं।",
    "[00:03:38.000] अब सूखे मसाले एक-एक करके डाले जाते हैं: धनिया पाउडर, चिकन मसाला और हल्दी पाउडर।",
    "[00:04:03.000] गावती कोमरा (चिकन) को मसाले के आधार में डाला जाता है। इसे आलू के साथ भी बनाया जा सकता है, लेकिन सुरन यहाँ की पारंपरिक पसंद है।",
    "[00:04:18.000] इसे शुरू में तेज़ आँच पर पकाया जाता है ताकि यह अपने ही जूस में पक जाए।",
    "[00:04:35.000] लगभग 7-8 मिनट भूनने के बाद, वह कटे हुए सुरन को बर्तन में डालती हैं।",
    "[00:04:53.000] इसे तेज़ी से पकने में मदद के लिए गरम पानी डाला जाता है। वह ढक्कन पर पानी रखने की पारंपरिक तकनीक का उपयोग करती हैं ताकि दोनों तरफ से भाप बने।",
    "[00:05:06.000] जब यह पकता है, वह वारली पेंटिंग के बारे में बात करती हैं। उनकी बहू और अन्य रिश्तेदार भी इस दीवार-पेंटिंग कला का अभ्यास करते हैं।",
    "[00:05:31.000] वह पारंपरिक गोबर के बैकग्राउंड से बनी पेंटिंग्स दिखाती हैं। एक पेंटिंग नामकरण समारोह को दर्शाती है—लड़कों (4 दिन) और लड़कियों (3 दिन) के लिए रस्में थोड़ी अलग होती हैं।",
    "[00:06:12.000] वह इस स्तर पर करी को गहरा रंग देने के लिए थोड़ा लाल मिर्च पाउडर डालती हैं।",
    "[00:06:25.000] देसी चिकन को नरम करने के लिए कुल पकाने का समय लगभग 40 मिनट है।",
    "[00:06:37.000] यह तैयार है! यह बहुत शानदार दिख रहा है। आज यहाँ गाँव के पिकनिक जैसा अहसास हो रहा है।",
    "[00:06:48.000] खाना परोसा गया है। मैं अब गावती कोमरा चख रहा हूँ। यह बहुत ही स्वादिष्ट और फ्लेवरफुल है।",
    "[00:07:07.000] रेखा जी, इस शानदार भोजन के लिए धन्यवाद। कृपया कमेंट्स में अपनी प्रतिक्रिया और सुझाव साझा करें।"
  ],
  "transcription_english": [
    "[00:00:11.000] We are exploring Maharashtra and looking for traditional recipes of this area.",
    "[00:00:18.000] While traveling to our destination, we found this beautiful and big dam called Kurje Dam.",
    "[00:00:26.000] We are in the Talasari block of Palghar, and our destination is just a short distance from this dam.",
    "[00:00:39.000] We are here at Rekha ji's home. Rekha ji, who is with you today? This is Maina, my daughter-in-law.",
    "[00:00:55.000] In today's episode, this mother-in-law and daughter-in-law duo will cook for us.",
    "[00:01:05.000] We are making 'Gauthi Komra' (Country Chicken) with 'Suran'. Gauthi Komra means desi/local chicken.",
    "[00:01:11.000] What is Suran? It is a root that grows underground. In Marathi, it's called Suran; in English, it's Elephant Foot Yam.",
    "[00:01:39.000] Rekha ji shows the spices: garlic, onions, ginger, green chili chutney, chicken masala, coriander powder, turmeric, salt, and coriander leaves.",
    "[00:02:03.000] We are using soybean oil today. We have about 1kg of country chicken and 1kg of Suran.",
    "[00:02:19.000] Let's start the cooking. The oil is heating up in the pot.",
    "[00:02:43.000] First, she adds grated garlic and ginger to the hot oil and sautés them.",
    "[00:03:01.000] She mentions using Palash leaves for decoration later. Now, a large amount of chopped tomatoes goes into the pot.",
    "[00:03:15.000] We cover it for a bit to let the tomatoes soften.",
    "[00:03:25.000] She adds salt—or 'Mith' as they call it locally—and the green chili paste.",
    "[00:03:38.000] Now the dry spices are added one by one: coriander powder, chicken masala, and turmeric powder.",
    "[00:04:03.000] The Gauthi Komra (chicken) is added to the masala base. You can also make this with potatoes, but Suran is the traditional choice here.",
    "[00:04:18.000] It is cooked on high flame initially so it cooks in its own juices.",
    "[00:04:35.000] After about 7-8 minutes of sautéing, she adds the cubed Suran (yam) to the pot.",
    "[00:04:53.000] Hot water is added to help it cook faster. She uses a traditional technique of placing a lid with water on top to create steam from both sides.",
    "[00:05:06.000] While it simmers, she talks about Warli painting. Her daughter-in-law and other relatives like Kusum ji also practice this wall-painting art.",
    "[00:05:31.000] She shows paintings made with traditional cow-dung backgrounds. One depicts a naming ceremony—rituals differ slightly for boys (4 days) and girls (3 days).",
    "[00:06:12.000] She adds a bit of red chili powder at this stage to give the curry a rich color.",
    "[00:06:25.000] The total cooking time for this country chicken is about 40 minutes to ensure it's tender.",
    "[00:06:37.000] It’s done! It looks wonderful. It feels like a proper village picnic today.",
    "[00:06:48.000] The food is served. I'm tasting the Gauthi Komra now. It's excellent—very flavorful.",
    "[00:07:07.000] Thank you, Rekha ji, for this wonderful meal. Please share your feedback and suggestions in the comments."
  ]
}