{
  "metadata": {
    "title": "গয়না বড়ি | Goyna Bori | Ornament shaped sundried lentil cracker",
    "channel_name": "Rural Recipes",
    "publish_date": "2024-03-08",
    "view_count": 1263,
    "like_count": 45,
    "duration": "08:54",
    "original_audio_language": "Bengali",
    "video_id": "22_xcQIxhTk",
    "url": "https://www.youtube.com/watch?v=22_xcQIxhTk",
    "description": "In this episode, we visit Sabang (Madur Gram) in Midnapore to witness the creation of Goyna Bori—a unique artistic food tradition where lentil paste is transformed into intricate jewelry-like designs.",
    "ingredients_detected": [
      "Biulir Dal (Urad Dal/Black Gram)",
      "Posto (Poppy Seeds)",
      "Sada Til (White Sesame Seeds)",
      "Shukno Lonka (Dry Red Chili)",
      "Kancha Lonka (Green Chili)",
      "Jeera (Cumin)",
      "Ada (Ginger)",
      "Tejpata (Bay Leaf)",
      "Lobon (Salt)",
      "Tel (Oil)"
    ]
  },
  "transcription_bengali": [
    "[00:00:22.500] আমরা এক নতুন রেসিপির সন্ধানে বেরিয়ে পড়েছি মেদিনীপুরের উদ্দেশ্যে।",
    "[00:00:34.200] আজ আমরা সবং-এ এসছি, যাকে মাদুর গ্রাম নামেও চেনা যায়।",
    "[00:00:54.400] এখানে খাদ্য আর শিল্পের এক অদ্ভুত মেলবন্ধন দেখতে পাওয়া যায়, যাকে আমরা বলি গয়না বড়ি।",
    "[00:01:06.100] খাবারের সাথে আর্ট বা শিল্পের এমন মেলবন্ধন খুব কমই দেখা যায়।",
    "[00:01:25.800] রুরাল রেসিপি ইউটিউব চ্যানেলে আপনাদের স্বাগত।",
    "[00:01:58.300] আমরা আজ গয়না বড়ি বা গহনা বড়ির রেসিপি এবং তার ইতিহাস দেখবো।",
    "[00:02:40.100] বড়ি দেওয়ার জন্য ডালটাকে খুব মিহি করে বেটে নেওয়া হয়েছে।",
    "[00:02:58.400] বড়ি তৈরির ইতিহাস মেদিনীপুরে অনেক পুরোনো এবং এটি মেদিনীপুরের এক অমূল্য সাংস্কৃতিক ঐতিহ্য।",
    "[00:03:34.200] এটি মূলত একটি পারিবারিক শিল্পের মতো, যা মায়েদের হাত ধরে প্রজন্মান্তরে চলে আসছে।",
    "[00:03:58.100] আজ আমাদের সাথে এই বড়ি তৈরির কৌশল দেখানোর জন্য লক্ষ্মী দি আছেন।",
    "[00:04:31.200] নমস্কার লক্ষ্মী দি, আপনাকে আমাদের চ্যানেলে স্বাগত।",
    "[00:04:49.500] চলুন আমরা এই শৈল্পিক গয়না বড়ি বানানো শুরু করি।",
    "[00:04:58.300] বড়ি বানাতে সাধারণত চার-পাঁচ জন মিলে একসাথে কাজ করলে খুব সুবিধা হয়।",
    "[00:06:28.100] এই বড়ি বানাতে প্রধানত বিউলির ডাল ব্যবহার করা হয়।",
    "[00:06:58.200] এছাড়া বড়ির সৌন্দর্য ও স্বাদের জন্য পোস্ত ও সাদা তিল ব্যবহার করা হয়।",
    "[00:07:22.100] ডালটাকে আমরা আগে থেকেই ২৪ ঘণ্টা ভিজিয়ে রেখেছিলাম।",
    "[00:07:27.400] এরপর ডালটাকে ভালো করে ধুয়ে জল ঝরিয়ে মেশিনে বা শীল-নোড়ায় পিষে নেওয়া হয়েছে।",
    "[00:07:40.500] ডাল যত ভালো ফাটানো হবে, বড়ি তত হালকা হবে এবং মুচমুচে হবে।",
    "[00:07:52.300] ডাল ফেটানো হয়ে গেলে একটি কাপড়ের নজেল দিয়ে নিখুঁত আলপনার মতো ডিজাইন করা হয়।",
    "[00:07:58.400] থালার ওপর পোস্ত বা তিল ছড়িয়ে দিয়ে তার ওপর গয়নার মতো ডিজাইনগুলো করা হচ্ছে।",
    "[00:08:07.200] পোস্ত আর তিল দেওয়ার ফলে বড়িগুলো শুকানোর পর থালা থেকে খুব সহজে উঠে আসে।",
    "[00:08:15.300] এই বড়িগুলোকে কড়া রোদে অন্তত তিন দিন ভালো করে শুকোতে হয়।",
    "[00:08:25.400] মসলা বড়িতে আদা, জিরে, তেজপাতা ও শুকনো লঙ্কা ব্যবহার করা হয় স্বাদের ভিন্নতার জন্য।",
    "[00:08:31.600] বড়িগুলো ডুবো তেলে ভেজে গরম ভাতের সাথে বা বিকেলের জলখাবারে দারুণ স্ন্যাকস হিসেবে কাজ করে।",
    "[00:08:48.500] গ্রাম বাংলার এই ঐতিহ্যবাহী শিল্প দেখতে আমাদের রুরাল রেসিপি চ্যানেলটি সাবস্ক্রাইব করুন।"
  ],
  "transcription_english": [
    "[00:00:22.500] We have set out on a journey to Midnapore in search of a new recipe.",
    "[00:00:34.200] Today we have come to Sabang, which is also known as 'Madur Gram' (Mat Village).",
    "[00:00:54.400] Here, one can witness a unique blend of food and art, which we call 'Goyna Bori'.",
    "[00:01:06.100] Such a combination of food and art is rarely seen elsewhere.",
    "[00:01:25.800] Welcome to the Rural Recipes YouTube channel.",
    "[00:01:58.300] Today we are going to see the recipe and history of Goyna Bori (Ornament Cracker).",
    "[00:02:40.100] The lentils have been ground into a very fine paste for making the crackers.",
    "[00:02:58.400] The history of making these crackers in Midnapore is very old and a priceless cultural heritage.",
    "[00:03:34.200] It is essentially a domestic art form passed down through generations of mothers.",
    "[00:03:58.100] Today, Lakshmi Di is with us to demonstrate the technique of making these crackers.",
    "[00:04:31.200] Greetings Lakshmi Di, welcome to our channel.",
    "[00:04:49.500] Let's begin making these artistic Goyna Boris.",
    "[00:04:58.300] It is usually more convenient if four or five people work together to make these.",
    "[00:06:28.100] Biulir Dal (Black Gram) is the primary ingredient used to make these crackers.",
    "[00:06:58.200] Additionally, poppy seeds and white sesame seeds are used for the beauty and taste of the cracker.",
    "[00:07:22.100] We had soaked the lentils for 24 hours beforehand.",
    "[00:07:27.400] Then the lentils were washed, drained, and ground in a machine or with a grinding stone.",
    "[00:07:40.500] The better the paste is whisked, the lighter and crispier the cracker will become.",
    "[00:07:52.300] Once the paste is whisked, intricate Alpona-like designs are piped through a cloth nozzle.",
    "[00:07:58.400] Jewelry-like designs are being made over poppy seeds or sesame seeds spread on a plate.",
    "[00:08:07.200] The poppy and sesame seeds help the crackers release easily from the plate after drying.",
    "[00:08:15.300] These crackers need to be dried thoroughly in strong sunlight for at least three days.",
    "[00:08:25.400] Spices like ginger, cumin, bay leaf, and dry chili are used in 'Masala Bori' for flavor variation.",
    "[00:08:31.600] These crackers are deep-fried and served with hot rice or as a great afternoon snack.",
    "[00:08:48.500] Please subscribe to our Rural Recipes channel to explore more of Bengal's traditional heritage."
  ]
}