{
  "metadata": {
    "title": "গুঁড়া মাছের চচ্চড়ি | Gura Machher Chocchori",
    "channel_name": "Rural Recipes",
    "publish_date": "2024-02-16",
    "view_count": 426,
    "like_count": 27,
    "duration": "08:35",
    "original_audio_language": "Bengali",
    "video_id": "vORED3HEE2Y",
    "url": "https://www.youtube.com/watch?v=vORED3HEE2Y",
    "description": "In this episode, we explore a traditional recipe from the border area of Dinhata, Cooch Behar. This 'Gura Machher Chocchori' (Small Fish Medley) is a staple in Bengali Muslim wedding menus in this region.",
    "ingredients_detected": [
      "Small Fish (Mourala, Darka, Puti, Boruli, Tangra)",
      "Eggplant (Begun)",
      "Potato (Alu)",
      "Beans",
      "Peas (Motorhuti)",
      "Spring Onions (Pyaj Koli)",
      "Green Chilies",
      "Coriander Leaves",
      "Mustard Oil",
      "Coriander Powder",
      "Cumin Powder",
      "Kashmiri Red Chili Powder",
      "Turmeric Powder",
      "Black Pepper Powder",
      "Salt",
      "Panch Phoron",
      "Kalonji"
    ]
  },
  "transcription_bengali": [
    "[00:00:10.000] আবার আমরা চলে এসছি আমাদের ইউটিউব চ্যানেল রুরাল রেসিপি নিয়ে।",
    "[00:00:15.000] এর আগেরবার উত্তরে এসেছিলাম বর্ষায়, এখন শীত।",
    "[00:00:21.000] উত্তরের শীত বরাবরই তীব্র, পারদ থাকে অনেকটা নিচে।",
    "[00:00:27.000] সারাদিন কুয়াশা আর কনকনে হাওয়া এর মধ্যেই আমরা বেরিয়ে পড়েছি রুরাল রেসিপির খোঁজে।",
    "[00:00:34.000] আমরা যাচ্ছি ভারত বাংলাদেশ সীমান্তে একদম বর্ডার এরিয়াতে।",
    "[00:00:43.000] দিনাহাটা থেকে আরো একটি প্রত্যন্ত গ্রামে আসার সময় যে রাস্তাটা দিয়ে এলাম তার নাম রংপুর রোড।",
    "[00:01:25.000] আমরা চলে এসছি কুসসাহাটে বাঙালি মুসলিম বিয়েবাড়িতে যে একটা ট্রেডিশনাল রেসিপি এখনো বয়ে বেড়াচ্ছে।",
    "[00:01:45.000] মামি তোমার নামটা বলে দাও একটু সবাইকে। আমার নাম হাসনা হেনা।",
    "[00:01:52.000] এটা তো মুসলিম বিয়ে বাড়ির একটা ট্রেডিশনাল আইটেম বানানো হবে, সেটা কি আইটেম? গুঁড়া মাছের চর্চরি।",
    "[00:02:11.000] এই যে ছোট মাছ লাগবে - মৌড়ালা মাছ আছে, ডারকা আছে, পুটি আছে আর কিছুটা বরুলি আছে।",
    "[00:02:18.000] অন্য কোন মাছ দিয়ে এটা করা হয়? হ্যাঁ ট্যাংরা পুটি শীতকালে নানান ধরনের ছোট মাছ পাওয়া যায়।",
    "[00:02:31.000] মাছের সঙ্গে আর কি কি লাগবে? বেগুন লাগবে, আলু কেটে রেখেছি, বিনস কেটে রেখেছি।",
    "[00:02:35.000] মটরশুটি কিছুটা খুলে রেখেছি, ধনেপাতা রেখেছি, কাঁচা লঙ্কা তারপর পেঁয়াজ কলি।",
    "[00:02:41.000] আমি সরিষার তেলে রান্না করবো আজকে আর সবজিগুলো লম্বা লম্বা করে কেটে রেখেছি।",
    "[00:02:50.000] মসলা কি কি আছে? ধনে গুঁড়া, জিরা গুঁড়া, কাশ্মীরি লঙ্কার গুঁড়া, হলুদ গুঁড়া আর গোল মরিচ গুঁড়া।",
    "[00:03:08.000] প্রথমে কি করবে? ওই মাছটা ভেজে নেব। সরষের তেলটা দিলাম।",
    "[00:03:23.000] তেলটা গরম হয়ে গেছে এখন আমি এই যে মাছটা দেবো।",
    "[00:03:32.000] এটা আমি নুন হলুদ মেখে রেখেছি।",
    "[00:03:37.000] এটা চরচরা ভাজা হবে না, একটু নরম ভাজা হবে।",
    "[00:04:06.000] পরের স্টেপ কি? এই যে আমি বিনসটা এখন একটু ভাজবো। সব সবজিগুলো অল্প অল্প করে ভেজে নেব।",
    "[00:04:13.000] অল্প লবণ দিলাম একটু হলুদ গুঁড়ো। বিনসটা নামাবো।",
    "[00:04:25.000] এখন দেবো আমি এই যে আলুটা। একটু হলুদ গুঁড়ো আর একটু লবণ। আলুটা নামাবো।",
    "[00:04:40.000] এখন দেবো বেগুনটা। বেগুনটা হয়ে এসেছে আমি এখন এটাকে নামিয়ে নেব।",
    "[00:04:52.000] এখন পেঁয়াজ কলিটা দেবো। একটু লবণ দিব একটু হলুদ। এখন পেঁয়াজ কলিটা নামাবো।",
    "[00:05:03.000] এখন দেবো আমি মটরশুটিটা। এখন ঢাকাটা খুলবো, মটরশুটটা হয়ে গেছে।",
    "[00:05:15.000] কাঁচা লঙ্কা ফোরন সঙ্গে কি যাচ্ছে? একটু পাঁচ ফোরন আর কালোজিরা।",
    "[00:05:30.000] এখন এগুলো সব দিয়ে দিব। এখন আমি মাছটা দিয়ে দেবো।",
    "[00:05:43.000] এখন তুমি এক এক করে সব মসলাগুলো দেবে। জিরে গুঁড়ো, ধনে গুঁড়ো, কাশ্মীরি লঙ্কার গুঁড়ো।",
    "[00:05:53.000] একটু হলুদ গুঁড়ো আর একটু গোল মরিচ গুঁড়ো।",
    "[00:06:07.000] এখন একটু আমি ঢাকা দিয়ে আঁচটা একটু কমিয়ে দেবো।",
    "[00:06:12.000] মানে এটাতে কোন জল যাবে না? না কোন জল না।",
    "[00:06:17.000] খুলে একটু নেড়েচেড়ে একটু ধনেপাতা কুচি আমি দিয়ে দেবো।",
    "[00:06:23.000] সুন্দর ঝরঝরে হয়েছে দেখছি মনে হচ্ছে চর্চরিটা। বিয়ে বাড়িতে বেশি বেগুন দেয়।",
    "[00:06:55.000] এখন আমি নামাবো। গ্যাসটা অফ করে দিলাম।",
    "[00:07:32.000] বিয়ে বাড়িতে স্পেশালি বাঙালিদের ক্ষেত্রে এই অঞ্চলে গুঁড়ো মাছ চর্চরি ইজ মাস্ট।",
    "[00:07:47.000] চর্চরি কেমন বানালে? গরম ভাতের সঙ্গে হুম এটা ফার বেটার। দারুণ হয়েছে মামি।",
    "[00:08:26.000] চ্যানেলটি সাবস্ক্রাইব করতে ভুলবেন না ধন্যবাদ। দেখা হবে অন্য কোন রেসিপির সঙ্গে।"
  ],
  "transcription_english": [
    "[00:00:10.000] We are back again with our YouTube channel, Rural Recipes.",
    "[00:00:15.000] Last time we visited the north during monsoon; now it's winter.",
    "[00:00:21.000] Winter in the north is always severe; the mercury stays quite low.",
    "[00:00:27.000] Amidst fog and cold winds all day, we've set out in search of rural recipes.",
    "[00:00:34.000] We are heading towards the India-Bangladesh border area.",
    "[00:00:43.000] Traveling from Dinhata to a remote village, the road we took is called Rangpur Road.",
    "[00:01:25.000] We've arrived at Kussahat to showcase a traditional recipe still common in Bengali Muslim weddings.",
    "[00:01:45.000] Mami, please tell everyone your name. My name is Hasna Hena.",
    "[00:01:52.000] A traditional item for Muslim weddings will be made; what is it? Small fish medley (Chocchori).",
    "[00:02:11.000] We need small fish - there's Mourala, Darka, Puti, and some Boruli fish.",
    "[00:02:18.000] Can any other fish be used? Yes, Tangra, Puti - various small fish are available in winter.",
    "[00:02:31.000] What else is needed with the fish? Eggplant, sliced potatoes, and beans.",
    "[00:02:35.000] Some shelled peas, coriander leaves, green chilies, and spring onions.",
    "[00:02:41.000] I'll cook in mustard oil today, and I've sliced the vegetables into long strips.",
    "[00:02:50.000] What spices are there? Coriander, cumin, Kashmiri red chili, turmeric, and black pepper powder.",
    "[00:03:08.000] What's first? I'll fry the fish. Added the mustard oil.",
    "[00:03:23.000] The oil is hot now; I'll add the fish.",
    "[00:03:32.000] I've marinated these with salt and turmeric.",
    "[00:03:37.000] They shouldn't be fried until crunchy, just a soft fry.",
    "[00:04:06.000] Next step? I'll fry the beans now. I'll fry all the vegetables one by one.",
    "[00:04:13.000] Added a little salt and turmeric powder. Taking the beans out.",
    "[00:04:25.000] Now I'll add the potatoes. A bit of turmeric and salt. Taking the potatoes out.",
    "[00:04:40.000] Now adding eggplant. The eggplant is done; I'll take it out now.",
    "[00:04:52.000] Now adding the spring onions. A little salt and turmeric. Taking the onions out.",
    "[00:05:03.000] Now I'll add the peas. Opening the lid; the peas are done.",
    "[00:05:15.000] Green chili for tempering, what else? A bit of Panch Phoron and Kalonji.",
    "[00:05:30.000] Now I'll add everything back in. Now I'll add the fish.",
    "[00:05:43.000] Now will you add all the spices? Cumin, coriander, and Kashmiri red chili powder.",
    "[00:05:53.000] A bit of turmeric and black pepper powder.",
    "[00:06:07.000] Now I'll cover it and lower the flame for a bit.",
    "[00:06:12.000] Does it need any water? No, no water at all.",
    "[00:06:17.000] After opening, stir and add some chopped coriander leaves.",
    "[00:06:23.000] The Chocchori looks beautifully dry. In weddings, they usually add more eggplant.",
    "[00:06:55.000] I'll take it off now. Switched off the gas.",
    "[00:07:32.000] In Muslim weddings in this region, small fish Chocchori is a must.",
    "[00:07:47.000] How did the Chocchori turn out? With hot rice... this is far better. It's great, Mami.",
    "[00:08:26.000] Don't forget to subscribe to the channel, thank you. See you with another recipe."
  ]
}