{
  "metadata": {
    "title": "কাঁঠালের ঝাল | Hot and Spicy Jackfruit Curry | Rural Recipes",
    "channel_name": "Rural Recipes",
    "publish_date": "2024-04-12",
    "view_count": 549,
    "like_count": 22,
    "duration": "08:04",
    "original_audio_language": "Bengali",
    "video_id": "mH-ObkxIdVw",
    "url": "https://www.youtube.com/watch?v=mH-ObkxIdVw",
    "description": "In this episode of Rural Recipes, we visit the India-Bangladesh border region in Nadia district, West Bengal. We explore a unique local staple: 'Kathaler Jhal' (Spicy Jackfruit Curry). Unlike the typical tender jackfruit (Echor) dishes found in cities, this recipe uses mature jackfruit grown locally. It is a traditional field-worker's meal, often served with handmade rotis to laborers. The recipe features a special twist involving raw milk, rice flour, and urad dal for texture and flavor.",
    "ingredients_detected": [
      "Paka Kathal (Mature Jackfruit)",
      "Sorsher Tel (Mustard Oil)",
      "Panch Phoron (Five-spice blend)",
      "Tejpata (Bay leaves)",
      "Shukno Lonka (Dry red chilies)",
      "Kancha Lonka Bata (Green chili paste)",
      "Jeera Bata (Cumin paste)",
      "Ada Bata (Ginger paste)",
      "Holud Guro (Turmeric powder)",
      "Lobon (Salt)",
      "Kolai-er Dal (Urad dal)",
      "Kancha Dudh (Raw milk)",
      "Chaler Guro (Rice flour)",
      "Gorom Jol (Hot water)"
    ]
  },
  "transcription_bengali": [
    "[00:00:12.000] রুরাল রেসিপি ইউটিউব চ্যানেলে আপনাদের স্বাগত।",
    "[00:00:22.000] ভারত-বাংলাদেশ বর্ডারে নদীয়ায় অনেক গল্প আছে, যেখানে কারো উঠোন ভারতে আর কিচেন বাংলাদেশে।",
    "[00:00:31.000] আমার পিছনে পদ্মা নদীর একটি অংশ। ১৯৯৬ থেকে ২০০১ সালের ভাঙ্গনের ফলে অনেকে এখান থেকে সরে যেতে বাধ্য হয়।",
    "[00:01:03.000] মাথাভাঙ্গা, চুর্নি, জলঙ্গী নদী এখানে মিশে গেছে। আমরা একটি গ্রামে যাচ্ছি একটি ইন্টারেস্টিং রেসিপির জন্য।",
    "[00:01:18.000] আমরা কাছারি পাড়ায় চঞ্চলদার কাছে এসেছি। রুরাল রেসিপিতে আপনাকে স্বাগতম।",
    "[00:01:37.000] শহরের মানুষ সাধারণত এঁচোড় খায়, কিন্তু এখানে পাকা কাঁঠালের ঝাল বানানো হবে।",
    "[00:02:16.000] কৃষি কাজে যারা কাজ করে তাদের আমরা ১০টা-১১টার সময় খাবার দিই।",
    "[00:02:22.000] ৪টে রুটি আর এই কাঁঠালের ঝাল দেওয়া হয়। এই কাঁঠাল আমাদের কিনতে হয় না, গাছেরই কাঁঠাল।",
    "[00:02:39.000] আমার বাড়িতে রান্না হবে এবং বৌদি (স্ত্রী) রান্না করবেন।",
    "[00:02:50.000] দীপিকা বৌদি, এই কাঁঠালের ঝাল বানাতে কি কি মশলা লাগবে?",
    "[00:02:57.000] পাঁচ ফোড়ন, তেজপাতা, শুকনো লঙ্কা, কাঁচা লঙ্কা বাটা, জিরে বাটা আর আদা বাটা লাগবে।",
    "[00:03:07.000] সাথে চালের গুঁড়ো, হলুদ আর লবণ। ভালো স্বাদের জন্য কাঁচা দুধ আর কলাইয়ের ডাল যোগ করব।",
    "[00:03:30.000] কাঁঠাল ধুয়ে কেটে রেডি করা আছে। আমরা প্রেশার কুকার ছাড়াই কড়াইতে রান্না করব।",
    "[00:03:45.000] প্রথমে সরষের তেল দিলাম।",
    "[00:03:57.000] শুকনো লঙ্কা, তেজপাতা আর পাঁচ ফোড়ন ফোড়ন দিচ্ছি।",
    "[00:04:14.000] এবার কাঁঠাল দিয়ে লবণ আর হলুদ দিয়ে দিচ্ছি।",
    "[00:04:27.000] ভালো করে নেড়েচেড়ে ঢাকা দিয়ে সেদ্ধ হতে দেব।",
    "[00:04:47.000] এবার কাঁচা লঙ্কা, জিরে আর আদা বাটা দিয়ে দিচ্ছি। গ্রামীণ রান্নায় বাটা মশলার চল বেশি।",
    "[00:05:16.000] মশলা দিয়ে ১০ মিনিট কষাতে হবে এবং কাঁঠালগুলো কিছুটা স্ম্যাশ করে দিচ্ছি।",
    "[00:05:33.000] গরম জল দিয়ে আবার ঢেকে দিচ্ছি। পুরো রান্না হতে ৩০-৩৫ মিনিট সময় লাগলো।",
    "[00:05:55.000] কড়াই ধুয়ে আবার তেল দিয়ে দ্বিতীয়বার ফোড়ন দেব।",
    "[00:06:18.000] শুকনো লঙ্কা, তেজপাতা আর কলাইয়ের ডাল দিচ্ছি। এটা বেশ ইন্টারেস্টিং।",
    "[00:06:28.000] এবার কাঁঠালটা দিয়ে দেব। ডালটা খাওয়ার সময় মুখে পড়লে বেশ ভালো লাগবে।",
    "[00:06:47.000] কাঁচা দুধ দিয়ে দিচ্ছি।",
    "[00:06:54.000] সব শেষে চালের গুঁড়ো দিচ্ছি গ্রেভিটা আঠালো করার জন্য।",
    "[00:07:20.000] দীপিকা বৌদি আঞ্চলিক রেসিপিটি বানালেন। আমি এবার রুটি দিয়ে খেয়ে দেখব এটাই এখানকার ঐতিহ্য।",
    "[00:07:49.000] আমাদের চ্যানেলটি সাবস্ক্রাইব করবেন এবং উৎসাহ দেবেন। ধন্যবাদ!"
  ],
  "transcription_english": [
    "[00:00:12.000] Welcome to Rural Recipes YouTube channel.",
    "[00:00:22.000] There are many stories here at the India-Bangladesh border in Nadia, where a courtyard might be in India and the kitchen in Bangladesh.",
    "[00:00:31.000] Behind me is a branch of the Padma River. Due to heavy erosion between 1996 and 2001, many local residents had to relocate.",
    "[00:01:03.000] Several rivers like Mathabhanga, Churni, and Jalangi meet here. We are going to a nearby village for an interesting recipe.",
    "[00:01:18.000] We've reached Kachari Para to meet Chanchal-da. Welcome to Rural Recipes.",
    "[00:01:37.000] Usually, city folk eat 'Echor' (tender green jackfruit). Is this different? Yes, we use mature jackfruit from our village trees.",
    "[00:02:16.000] We have workers in the fields. At 10:00 or 11:00 AM, we provide them a meal.",
    "[00:02:22.000] The meal consists of 4 rotis and this Kathaler Jhal. We don't have to buy the jackfruit.",
    "[00:02:39.000] The cooking will happen at my home, and my wife will prepare it.",
    "[00:02:50.000] Deepika, namaste! Tell us what spices are needed for this Kathaler Jhal.",
    "[00:02:57.000] We need five-spice blend (panch phoron), bay leaves, dry red chilies, green chili paste, cumin paste, and ginger paste.",
    "[00:03:07.000] Also rice flour, turmeric, and salt. For better taste, we add raw milk and Urad dal.",
    "[00:03:30.000] Here is the jackfruit, cut and cleaned. No pressure cooker; we will cook it traditionally in the kadai.",
    "[00:03:45.000] First, I add mustard oil.",
    "[00:03:57.000] Adding dry red chilies, bay leaves and five-spice blend for tempering.",
    "[00:04:14.000] Now adding the jackfruit along with salt and turmeric.",
    "[00:04:27.000] Stir it well and then cover it to let it soften.",
    "[00:04:47.000] Now I'll add the green chili, cumin, and ginger pastes. Ground pastes are very common in rural cooking.",
    "[00:05:16.000] Sautéing it for about 10 minutes, and occasionally smashing the pieces a bit.",
    "[00:05:33.000] Adding some hot water and covering it again. It took about 30 to 35 minutes to fully cook.",
    "[00:05:55.000] Now for the second tempering. Added oil to the cleaned pan.",
    "[00:06:18.000] Sautéing dry red chilies, bay leaves and then adding Urad dal (Kolai-er dal). This is interesting.",
    "[00:06:28.000] Now putting the jackfruit back in. The dal adds a nice crunch when you eat it.",
    "[00:06:47.000] Adding raw milk.",
    "[00:06:54.000] Now adding rice flour to give it a thick, sticky consistency.",
    "[00:07:20.000] Deepika-boudi has prepared this regional recipe. I'll try it now with roti, which is the local tradition.",
    "[00:07:49.000] Please subscribe to Rural Recipes, like, and comment to support us. Thank you!"
  ]
}