{
  "metadata": {
    "title": "KEKRA KA AMTI | Sour Crab Curry with Local Spices | Traditional Rural Recipes of Nashik, Maharastra",
    "channel_name": "Rural Recipes",
    "publish_date": "2025-09-06",
    "view_count": 262,
    "like_count": 10,
    "duration": "07:55",
    "original_audio_language": "Hindi / Marathi",
    "video_id": "xeTToAchHPY",
    "url": "https://www.youtube.com/watch?v=xeTToAchHPY",
    "description": "In this episode of Rural Recipes, we visit Pimpalsond in the Surgana Taluka of Nashik, Maharashtra. We explore local natural attractions like waterfalls and the 'Tata Pani' hot springs before heading to Hemant's house. Hemant and his wife Vanita demonstrate a unique tribal delicacy: 'Kekra Ka Amti' (Crab Soup/Curry). This traditional recipe uses locally caught river crabs, fermented 'Ambadi' (Roselle) leaves for sourness, and homemade Mahua oil.",
    "ingredients_detected": [
      "River Crabs (Kekda)",
      "Mahua Oil (Mohwa ka tel)",
      "Ambadi (Roselle/Sorrel Leaves)",
      "Pyaz (Onions)",
      "Adrak-Lashun Paste (Ginger-Garlic Paste)",
      "Hari Mirch (Green Chilies)",
      "Kadi Patta (Curry Leaves)",
      "Lal Mirch Powder (Red Chili Powder)",
      "Homemade Tribal Masala",
      "Haldi (Turmeric Powder)",
      "Namak (Salt)",
      "Garam Pani (Hot Water)"
    ]
  },
  "transcription_hindi": [
    "[00:00:12.000] सुरगाना और इसके आसपास के इलाकों में कई प्राकृतिक आकर्षण हैं। आज हम पिंपलसोंड में हैं।",
    "[00:00:18.000] यहाँ दो मुख्य स्थान हैं: एक सुंदर झरना और 'ताता पानी', जो एक प्राकृतिक गर्म पानी का सोता (हॉट स्प्रिंग) है।",
    "[00:00:32.000] यहाँ से लगभग 2 किलोमीटर दूर हेमंत का घर है, जहाँ हम एक स्थानीय व्यंजन—केकड़ा बनाने की विधि देखेंगे।",
    "[00:00:49.000] मिलिए हेमंत और उनके पिता मनीराम जी से। वे हमें 'कटवा' दिखा रहे हैं, जो एक पारंपरिक आदिवासी जाल है।",
    "[00:01:02.000] वे रात में नदी में ये जाल छोड़ देते हैं ताकि केकड़े और छोटी मछलियाँ पकड़ी जा सकें, फिर सुबह उन्हें इकट्ठा करते हैं।",
    "[00:01:19.000] आज हम 'केकड़ा का आमटी' (केकड़ा सूप) बना रहे हैं। हेमंत की पत्नी, वनिता, हमारे लिए खाना बनाएंगी।",
    "[00:01:38.000] वनिता सामग्री दिखाती हैं: हरी मिर्च, घर का बना आदिवासी मसाला, अदरक-लहसुन का पेस्ट और अंबाड़ी के पत्ते।",
    "[00:02:00.000] हम महुआ के तेल का उपयोग कर रहे हैं, जो धूप में सुखाए गए महुआ के फूलों से बनाया जाता है। हमारे पास करी पत्ता, लाल मिर्च पाउडर और नमक भी है।",
    "[00:02:17.000] वनिता ने केकड़े के शरीर को तैयार कर लिया है। पंजों (claws) को, जो कैल्शियम का प्राकृतिक स्रोत हैं, कुचलकर गर्म पानी में भिगोया जाता है।",
    "[00:02:37.000] इस मिश्रण को कई बार धोया जाता है ताकि सारा स्वाद सूप का आधार बन सके।",
    "[00:02:55.000] कड़ाही गरम है। खाना पकाने के लिए घर के बने महुआ तेल का उपयोग करना मेरे लिए एक नया अनुभव है।",
    "[00:03:11.000] तेल गरम होने पर, वह कड़ाही में ताज़ा करी पत्ता और कटा हुआ प्याज़ डालती हैं।",
    "[00:03:26.000] वह प्याज़ को अच्छी तरह भूनती हैं और हरी मिर्च व अदरक-लहसुन का पेस्ट डालती हैं।",
    "[00:03:56.000] इसके बाद, वह लाल मिर्च पाउडर, घर का बना आदिवासी मसाला और हल्दी पाउडर मिलाती हैं।",
    "[00:04:26.000] वह उस विशिष्ट खट्टे स्वाद के लिए अंबाड़ी के पत्ते मिलाती हैं, फिर मसाले में केकड़े के हिस्से डालती हैं।",
    "[00:04:41.000] वह केकड़ों को मसालों में कुछ मिनट तक भूनती हैं और फिर बर्तन को ढक देती हैं।",
    "[00:05:00.000] 2 मिनट बाद, मसालों ने तेल छोड़ दिया है। अब वह पहले से तैयार किया गया केकड़े के पंजों का रस (स्टॉक) डालती हैं।",
    "[00:05:24.000] वह इसे उबलने देती हैं और अंत में स्वादानुसार नमक डालती हैं। इसे पूरी तरह पकने में 5 से 7 मिनट और लगेंगे।",
    "[00:06:03.000] हेमंत बताते हैं कि वे जंगल में भी केकड़े को पत्तों में लपेटकर और आग के नीचे रखकर पकाते हैं।",
    "[00:06:30.000] यहाँ दिवाली तक केकड़े मिलते हैं, जिसके बाद वे मिट्टी में गहरे दब जाते हैं।",
    "[00:06:53.000] केकड़ा का आमटी तैयार है! अब इस पारंपरिक आदिवासी सूप का आनंद लेने का समय है।",
    "[00:07:03.000] यह डिश दिलचस्प है क्योंकि सूप (आमटी) और मांस को कभी-कभी अलग-अलग परोसा जाता है।",
    "[00:07:18.000] मैं अब सूप चख रहा हूँ। यह लाजवाब है! यह सूप अक्सर बीमार लोगों को ताकत और स्वाद वापस लाने के लिए दिया जाता है।",
    "[00:07:42.000] इस शानदार तैयारी के लिए हेमंत और वनिता को बहुत-बहुत धन्यवाद। अगले एपिसोड में मिलते हैं!"
  ],
  "transcription_english": [
    "[00:00:12.000] Surgana and its surrounding areas have many natural attractions. Today we are in Pimpalsond.",
    "[00:00:18.000] There are two major spots here: a beautiful waterfall and 'Tata Pani', which is a natural hot spring.",
    "[00:00:32.000] About 2 kilometers from here is Hemant's house, where we will see a local delicacy—a crab preparation.",
    "[00:00:49.000] Meet Hemant and his father, Maniram ji. They are showing us 'Katwa', a traditional tribal trap.",
    "[00:01:02.000] They leave these traps in the river at night to catch crabs and small fish, then collect them in the morning.",
    "[00:01:19.000] Today we are making 'Kekra Ka Amti' (Crab Soup). Hemant's wife, Vanita, will be cooking for us.",
    "[00:01:38.000] Vanita shows the ingredients: green chilies, homemade tribal masala, ginger-garlic paste, and Ambadi leaves.",
    "[00:02:00.000] We're using Mahua oil, made from sun-dried Mahua flowers. We also have curry leaves, red chili powder, and salt.",
    "[00:02:17.000] Vanita has prepared the crab bodies. The claws, a natural source of calcium, are smashed and soaked in hot water.",
    "[00:02:37.000] This mixture is washed multiple times to extract all the flavorful juices, which will form the base of our soup.",
    "[00:02:55.000] The pan is hot. Using homemade Mahua oil for cooking is a new experience for me.",
    "[00:03:11.000] Once the oil is boiling, she adds fresh curry leaves and chopped onions to the pan.",
    "[00:03:26.000] She sautés the onions well and adds the green chilies and ginger-garlic paste.",
    "[00:03:56.000] Next, she adds the red chili powder, homemade tribal masala, and turmeric powder.",
    "[00:04:26.000] She adds the Ambadi leaves for that characteristic sour taste, then adds the crab bodies to the masala.",
    "[00:04:41.000] She sautés the crabs in the spices for a few minutes and then covers the pan.",
    "[00:05:00.000] After 2 minutes, the spices have released oil. Now she pours in the crab claw extract (stock) we prepared earlier.",
    "[00:05:24.000] She lets it simmer and finally adds salt to taste. It will take another 5 to 7 minutes to cook completely.",
    "[00:06:03.000] Hemant mentions that they also cook crabs in the forest by wrapping them in leaves and placing them under a fire.",
    "[00:06:30.000] Crabs are available here until Diwali, after which they burrow deep into the mud for the season.",
    "[00:06:53.000] The Kekra Ka Amti is ready! It’s time to enjoy this traditional tribal soup.",
    "[00:07:03.000] The dish is interesting because the soup (amti) and the meat are sometimes served separately.",
    "[00:07:18.000] I'm trying the soup now. It's excellent! This soup is often given to people who are ill to restore their energy and taste.",
    "[00:07:42.000] Many thanks to Hemant and Vanita for this wonderful preparation. See you in the next episode!"
  ]
}