{
  "metadata": {
    "title": "KHAKRE KI PATOWARE | A Fusion Of Steamed Leaves & Right Spices | Monsoon's Snacking Delight",
    "channel_name": "Rural Recipes",
    "publish_date": "2025-09-06",
    "view_count": 664,
    "like_count": 12,
    "duration": "08:11",
    "original_audio_language": "Hindi / Marathi",
    "video_id": "4FbTVmg4hhg",
    "url": "https://www.youtube.com/watch?v=4FbTVmg4hhg",
    "description": "In this episode of Rural Recipes, we visit Kuntvihir village in Nashik, Maharashtra. Subhash ji and Rekha ji demonstrate the preparation of 'Khakre Ki Patoware'—a seasonal monsoon delicacy made with forest leaves, rice flour, and local spices, steamed for two hours and then stir-fried.",
    "ingredients_detected": [
      "Khakre Leaves (Jungle ke patte)",
      "Swad Leaves (Swad ke patte)",
      "Chawal ka atta (Rice Flour)",
      "Adrak-Lashun Paste (Ginger-Garlic Paste)",
      "Jeera Paste (Cumin Paste)",
      "Ghar ka Masala (Homemade Tribal Masala)",
      "Lal Chatni (Red Chili Chutney)",
      "Haldi (Turmeric Powder)",
      "Hara Dhaniya (Fresh Coriander)",
      "Singdana Tel (Peanut Oil)",
      "Rai (Mustard Seeds)",
      "Jeera (Whole Cumin)",
      "Lashun (Garlic)",
      "Namak (Salt)",
      "Pani (Water)"
    ]
  },
  "transcription_hindi": [
    "[00:00:11.000] रूरल रेसिपी के एक बिल्कुल नए एपिसोड में आपका स्वागत है।",
    "[00:00:14.000] तो सुभाष जी, यहाँ से आपका घर कितनी दूर है और कितना समय लगेगा?",
    "[00:00:20.000] यहाँ से 40 किमी है। आपके गाँव का नाम क्या है? मेरे गाँव का नाम कुंठविहीर है।",
    "[00:00:27.000] हम महाराष्ट्र में हैं और नासिक जिले के आदिवासी क्षेत्रों की खोज कर रहे हैं।",
    "[00:00:38.000] इस खूबसूरत आदिवासी क्षेत्र में, हम पारंपरिक व्यंजनों का दस्तावेजीकरण करने के लिए गाँव-गाँव जा रहे हैं।",
    "[00:00:44.000] सुभाष जी हमारे ड्राइवर और स्थानीय गाइड भी हैं। क्या ये वही पत्ते हैं जो यहाँ मिलते हैं? हाँ, यहीं पास में हैं।",
    "[00:00:57.000] यह वही पत्ता है जिससे आज की रेसिपी बनाई जाएगी।",
    "[00:01:14.000] अंदर आइए सर। सुभाष जी, हम आपके घर पहुँच गए हैं। मेरी पत्नी का नाम रेखा सुभाष थोरात है।",
    "[00:01:22.000] रेखा जी, हमारे चैनल पर आपका स्वागत है। सुभाष जी ने मुझे बताया कि क्या बन रहा है, लेकिन मैं इसे आपसे सुनना चाहता हूँ।",
    "[00:01:30.000] खाखरे के पतौड़े। क्या आप इसे बनाएंगी? हाँ।",
    "[00:01:38.000] इसे बनाने के लिए किन चीजों की जरूरत है? वे वहाँ रखी हैं, चलिए आपको दिखाते हैं। सब व्यवस्था तैयार है।",
    "[00:01:43.000] आइए बहन जी से समझते हैं। यह पत्ता है, हम इसे बारीक टुकड़ों में काटते हैं।",
    "[00:02:03.000] यह पत्ता अलग दिखता है। यह क्या है? हम इसे मिलाते हैं; इससे स्वाद आता है।",
    "[00:02:11.000] यहाँ अदरक-लहसुन है, यह आदिवासी क्षेत्रों में इस्तेमाल होने वाला घर का बना मसाला है।",
    "[00:02:22.000] लाल चटनी, चावल का आटा, हल्दी, जीरा पेस्ट, धनिया और नमक।",
    "[00:02:37.000] मूंगफली का तेल, जीरा, राई और लहसुन।",
    "[00:02:51.000] चावल का आटा, जीरा पेस्ट, अदरक-लहसुन का पेस्ट।",
    "[00:02:58.000] घर का बना मसाला, लाल चटनी, हल्दी पाउडर, नमक और ताज़ा धनिया।",
    "[00:03:21.000] पानी के साथ मिलाना। प्रक्रिया दिलचस्प और सरल है: चावल का आटा और मसालों को पत्तों के साथ मिलाकर आटा (डो) तैयार करें।",
    "[00:03:34.000] हम थोड़ा मूंगफली का तेल डालते हैं और उन्हें मोटी टिक्कियों (पतौड़े) का आकार देते हैं।",
    "[00:03:56.000] इन्हें मोटा आकार दिया जाता है ताकि ये अच्छी तरह से भाप में पक सकें।",
    "[00:04:04.000] एक बार जब सब तैयार हो जाते हैं, तो हम 'धात्रा' तैयार करते हैं—लकड़ियों से बना एक स्टीमिंग सिस्टम।",
    "[00:04:36.000] जब सुभाष ने मुझे पतौड़े के बारे में बताया, तो मैंने बंगाल की 'पातुड़ी' से इसकी समानता के बारे में सोचा। यह भाप में पकाने की एक तकनीक है।",
    "[00:04:48.000] उन्होंने स्टीमिंग सेटअप बनाने के लिए लकड़ियों और पलाश के पत्तों का एक आधार बनाया।",
    "[00:05:07.000] हवा के कारण आग को स्थिर रखना मुश्किल हो रहा है। थोड़ा इंतज़ार करते हैं।",
    "[00:05:11.000] यह धीरे-धीरे पक रहा है; रंग बदलना शुरू हो गया है।",
    "[00:05:25.000] तेज़ हवा के कारण, हम इसे अंदर बड़े चूल्हे पर ले जा रहे हैं।",
    "[00:05:33.000] इसे पकते हुए 40 मिनट हो चुके हैं।",
    "[00:05:39.000] पकने में कितना समय लगेगा? दो घंटे। क्या आंच ऐसी ही रहेगी? हाँ, दो घंटे तक धीमी आंच।",
    "[00:05:55.000] जब यह घर पर बनाया जाता है, तो आपको 2 घंटे की योजना बनानी पड़ती है। यह केवल जून के महीने में होता है।",
    "[00:06:12.000] दो घंटे पूरे हो गए। चलिए इसे बाहर निकालते हैं। यह पूरी तरह से भाप में पक गया है।",
    "[00:06:22.000] अब, रेखा जी इन्हें छोटे टुकड़ों में काटेंगी। क्या कोई और प्रक्रिया है?",
    "[00:06:40.000] हम इन्हें कड़ाही में तेल में तलेंगे। आप इन्हें ऐसे ही खा सकते हैं, लेकिन तलने से ये और बेहतर हो जाते हैं।",
    "[00:06:51.000] पारंपरिक रूप से हम इसे बिना तेल के खाते थे, लेकिन अब हम इसे तलते हैं। आप इसे ऐसे ही खा सकते हैं।",
    "[00:07:07.000] धन्यवाद। यहाँ चावल की रोटी और तुअर दाल है।",
    "[00:07:17.000] और आज की रेसिपी: खाखरे के पतौड़े। चलिए इसे चखते हैं।",
    "[00:07:29.000] यह एक अनूठा आदिवासी व्यंजन है। पुराने समय में, लोग प्रकृति में जो कुछ भी उपलब्ध होता था, उससे भोजन बनाते थे।",
    "[00:07:48.000] सुभाष जी, रेखा जी, मेहनत के लिए बहुत-बहुत धन्यवाद। यह एक आदिवासी गाँव की अनोखी रेसिपी थी।",
    "[00:08:00.000] हम दूसरे गाँव जाएंगे और अधिक पारंपरिक और अनूठी रेसिपी पेश करेंगे। देखते रहें।"
  ],
  "transcription_english": [
    "[00:00:11.000] Welcome to a brand new episode of Rural Recipe.",
    "[00:00:14.000] So Subhash ji, how far is your home and how long will it take from here?",
    "[00:00:20.000] It's 40 km from here. What is your village name? My village is Kuntvihir.",
    "[00:00:27.000] We are in Maharashtra and exploring the tribal areas of Nashik district.",
    "[00:00:38.000] In this beautiful tribal area, we are going village to village to document traditional recipes.",
    "[00:00:44.000] Subhash ji is our driver and also a local guide. Are these the leaves found here? Yes, right here.",
    "[00:00:57.000] This is the leaf from which today's recipe will be made.",
    "[00:01:14.000] Come in, sir. Subhash ji, we've reached your home. My wife's name is Rekha Subhash Thorat.",
    "[00:01:22.000] Rekha ji, welcome to our channel. Subhash ji told me what's being made, but I want to hear it from you.",
    "[00:01:30.000] Khakre Ki Patoware. Will you be making it? Yes.",
    "[00:01:38.000] What things are needed to make it? They are kept there, let's show you. Everything is arranged.",
    "[00:01:43.000] Let's understand from Sister. This is the leaf, we cut it into fine small pieces.",
    "[00:02:03.000] This leaf looks different. What is it? We mix it in; it gives flavor.",
    "[00:02:11.000] There's ginger-garlic, this is the homemade masala used in the tribal areas.",
    "[00:02:22.000] Red chutney, rice flour, turmeric, cumin paste, coriander, and salt.",
    "[00:02:37.000] Peanut oil, cumin, mustard seeds, and garlic.",
    "[00:02:51.000] Rice flour, cumin paste, ginger-garlic paste.",
    "[00:02:58.000] Homemade masala, red chutney, turmeric powder, salt, and fresh coriander.",
    "[00:03:21.000] Mixing with water. The process is interesting and simple: mix rice flour and spices with the leaves to make a dough.",
    "[00:03:34.000] We add a little peanut oil and shape them into thick patties (Patwad).",
    "[00:03:56.000] These are shaped thick so they steam well.",
    "[00:04:04.000] Once all are ready, we prepare the 'Dhatra'—a steaming system made with sticks.",
    "[00:04:36.000] When Subhash told me about Patoware, I thought of the similarity to 'Paturi' in Bengal. It's a steaming technique.",
    "[00:04:48.000] They made a base with sticks and Palash leaves to create the steaming setup.",
    "[00:05:07.000] The wind is making it hard to keep the fire steady. Let's wait a bit.",
    "[00:05:11.000] It's cooking slowly; the color has started to change.",
    "[00:05:25.000] Due to the heavy wind, we are moving it inside to the larger stove.",
    "[00:05:33.000] It has already been cooking for 40 minutes.",
    "[00:05:39.000] How much time to cook? Two hours. Will the heat stay like this? Yes, a slow fire for two hours.",
    "[00:05:55.000] When this is made at home, you have to plan for 2 hours. It only happens in the month of June.",
    "[00:06:12.000] Two hours are up. Let's take it out. It has steamed perfectly.",
    "[00:06:22.000] Now, Rekha ji will cut them into small pieces. Is there another process?",
    "[00:06:40.000] We will fry them in oil in a kadai. You can eat them as is, but frying makes them better.",
    "[00:06:51.000] Traditionally we ate it without oil, but now we fry it. You can eat it by itself.",
    "[00:07:07.000] Thank you. Here is rice roti (chawal ki roti) and Tuur dal.",
    "[00:07:17.000] And today's recipe: Khakre Ki Patoware. Let's try it.",
    "[00:07:29.000] This is a unique tribal delicacy. In the past, people made food from whatever was available in nature.",
    "[00:07:48.000] Subhash ji, Rekha ji, thank you so much for the hard work. This was a unique recipe from a tribal village.",
    "[00:08:00.000] We will go to another village and present more traditional and unique recipes. Keep watching."
  ]
}