{
  "metadata": {
    "title": "Kolmbi Bhaat | A Flavorful Prawn Dish | Traditional Rural Recipe of Palghar, Maharashtra | #recipe",
    "channel_name": "Rural Recipes",
    "publish_date": "2025-02-24",
    "view_count": 189,
    "like_count": 8,
    "duration": "09:14",
    "original_audio_language": "Hindi / Marathi",
    "video_id": "pWtYfTM5s5Y",
    "url": "https://www.youtube.com/watch?v=pWtYfTM5s5Y",
    "description": "In this episode of Rural Recipes, we visit the historic coastal town of Bordi in the Palghar district, Maharashtra. Known for its Parsi heritage and serene beaches, Bordi is a fishing hub where fresh seafood is a staple. We meet Archana ji, a local bamboo craft artist, who demonstrates how to prepare 'Kolmbi Bhaat' (Prawn Rice)—a simple, flavorful, and traditional one-pot meal loved by the coastal communities.",
    "ingredients_detected": [
      "Fresh Prawns (Kolmbi)",
      "Rice (Chawal)",
      "Soybean Oil (Soybean Tel)",
      "Curry Leaves (Kadi Patta)",
      "Ginger, Garlic, and Green Chili Paste (Adrak, Lasun, Hari Mirch Paste)",
      "Whole Spices (Khada Masala: Cloves, Cinnamon, Black Peppercorns)",
      "Turmeric Powder (Haldi)",
      "Red Chili Powder (Lal Mirch)",
      "Garam Masala Powder",
      "Bay Leaves (Tej Patta)",
      "Fresh Coriander Leaves (Hara Dhaniya)",
      "Ghee (optional)",
      "Boiling Water (Ubalta Pani)",
      "Salt (Namak)"
    ]
  },
  "transcription_hindi": [
    "[00:00:18.000] नमस्ते, रूरल रेसिपी यूट्यूब चैनल में आपका स्वागत है। हम बोर्डी में हैं, जो एक बहुत ही दिलचस्प और ऐतिहासिक बीच टाउन है।",
    "[00:00:27.000] यह एक शांत जगह है जहाँ पारसी समुदाय मूल रूप से उतरा था। आप यहाँ आज भी कई पारसी विरासत की इमारतें और संपत्तियाँ देख सकते हैं।",
    "[00:00:48.000] हम एक खूबसूरत हेरिटेज प्रॉपर्टी में ठहरे हुए हैं और आज के एपिसोड की शूटिंग के लिए घोलवड़ जाएंगे।",
    "[00:01:06.000] हम बोर्डी में अर्चना जी के घर पहुँच गए हैं। अर्चना जी, रूरल रेसिपी में आपका स्वागत है।",
    "[00:01:12.000] आज आप हमारे लिए क्या बना रही हैं? मैं 'झींगा की खिचड़ी' या 'कोलम्बी भात' (झींगा चावल) बना रही हूँ।",
    "[00:01:19.000] यह बहुत स्वादिष्ट है और बनाने में बहुत आसान है। चूंकि यह एक मछली पकड़ने वाला गाँव है, यहाँ झींगे आसानी से मिल जाते हैं।",
    "[00:01:40.000] अर्चना जी एक कुशल बांस शिल्प कलाकार भी हैं। वह कल शाम को बाज़ार से ये ताज़ा झींगे लाई थीं।",
    "[00:01:54.000] आइए अब इस पारंपरिक कोलम्बी भात को पकाते हैं।",
    "[00:02:08.000] अर्चना जी, हमें सामग्री दिखाइए। हमारे पास ताज़ा झींगे (कोलम्बी) और साफ किए हुए धुले चावल हैं।",
    "[00:02:23.000] हमारे पास अदरक, लहसुन और हरी मिर्च का पेस्ट है। हमारे अपने बगीचे से ताज़ा कड़ी पत्ता और धनिया भी है।",
    "[00:02:35.000] मसालों के लिए हमारे पास खड़े मसाले (लौंग, दालचीनी, काली मिर्च), हल्दी, लाल मिर्च पाउडर, नमक, गरम मसाला और तेजपत्ता है।",
    "[00:02:52.000] घी वैकल्पिक है, लेकिन हमारे पास कुछ घर का बना घी है। हम खाना पकाने के लिए सोयाबीन तेल का उपयोग कर रहे हैं।",
    "[00:03:10.000] आप इसके लिए किसी भी किस्म के चावल का उपयोग कर सकते हैं। आज हम बाहर पारंपरिक लकड़ी के चूल्हे पर खाना बना रहे हैं।",
    "[00:03:29.000] वह चूल्हे पर बर्तन रखकर और तेल डालकर शुरुआत करती हैं। इसके बाद, वह ताज़ा कड़ी पत्ता डालती हैं।",
    "[00:03:42.000] भूनने के लिए इसके बाद अदरक-लहसुन-मिर्च का पेस्ट डाला जाता है।",
    "[00:03:57.000] वह तड़के में खड़े मसाले और फिर तेजपत्ता डालती हैं।",
    "[00:04:11.000] अब, ताज़ा झींगे बर्तन में डाले जाते हैं। वह आंच को थोड़ा कम कर देती हैं ताकि मसाले जलें नहीं।",
    "[00:04:31.000] जैसे-जैसे झींगे पकते हैं, उनका रंग बदल जाता है। यह प्रक्रिया बिना किसी जटिल कदम के बहुत सरल है।",
    "[00:04:51.000] अब पिसे हुए मसाले डाले जाते हैं: हल्दी, लाल मिर्च पाउडर (तीखेपन और रंग के लिए), नमक और गरम मसाला।",
    "[00:05:17.000] चावल को धोया गया है लेकिन देर तक भिगोया नहीं गया है। वह मसालों और झींगे के मिश्रण में चावल मिलाती हैं।",
    "[00:05:39.000] खुशबू अभी से बहुत बढ़िया है! आप चाहें तो प्याज या टमाटर भी डाल सकते हैं, लेकिन यह उनके बिना भी बहुत अच्छा लगता है।",
    "[00:05:51.000] हमारे गाँव में, हम कभी-कभी इसे 'बिरयानी' कहते हैं। अब पानी डालने का समय है।",
    "[00:06:10.000] वह चावल के लिए उबलते पानी का उपयोग करती हैं। गर्म पानी का उपयोग करने से चावल पूरी तरह से पकने में मदद मिलती है।",
    "[00:06:28.000] इसे पकने में लगभग 15 से 20 मिनट लगेंगे। वह लकड़ी की आग पर इसे पकने के लिए बर्तन को ढक देती हैं।",
    "[00:06:57.000] केसर के बिना भी रंग बहुत सुंदर है। वह लगभग तैयार होने पर कुछ ताज़ा धनिया पत्ती मिलाती हैं।",
    "[00:07:20.000] वह आज हल्के वर्जन के लिए घी नहीं डालने का फैसला करती हैं। वह इसे सिर्फ दो और मिनट के लिए कम आंच पर 'दम' होने देती हैं।",
    "[00:07:52.000] खाना तैयार है! धन्यवाद, अर्चना जी। कोलम्बी भात बहुत लुभावना लग रहा है।",
    "[00:08:01.000] मैं चखने से पहले इस पर थोड़ा नींबू निचोड़ रहा हूँ।",
    "[00:08:26.000] कोलम्बी भात यहाँ एक नियमित भोजन है। हालांकि हम झींगा बिरयानी या पुलाव को एक विशेष डिश मान सकते हैं, लेकिन इस क्षेत्र में यह एक स्वादिष्ट रोज़मर्रा का भोजन है।",
    "[00:08:48.000] आपको आज का एपिसोड कैसा लगा? कृपया हमें कमेंट में बताएं।",
    "[00:08:55.000] यदि आपने इसका आनंद लिया, तो कृपया सब्सक्राइब करें। हम महाराष्ट्र के एक और गाँव में एक नई रेसिपी के साथ मिलेंगे। धन्यवाद!"
  ],
  "transcription_english": [
    "[00:00:18.000] Hello, welcome to the Rural Recipes YouTube channel. We are in Bordi, a very interesting and historic beach town.",
    "[00:00:27.000] It's a sleepy, serene place where the Parsi community originally landed. You can still see many Parsi heritage buildings and properties here.",
    "[00:00:48.000] We are staying at a beautiful heritage property and will be heading to Gholvad to film today's episode.",
    "[00:01:06.000] We have arrived at the home of Archana ji in Bordi. Archana ji, welcome to Rural Recipes.",
    "[00:01:12.000] What are you preparing for us today? I am making 'Jhinga ki Khichudi' or 'Kolmbi Bhaat' (Prawn Rice).",
    "[00:01:19.000] It's very tasty and incredibly easy to prepare. Since this is a fishing village, prawns are easily available.",
    "[00:01:40.000] Archana ji is also a skilled bamboo craft artist. She got these fresh prawns from the market yesterday evening.",
    "[00:01:54.000] Let's go and cook this traditional Kolmbi Bhaat now.",
    "[00:02:08.000] Archana ji, show us the ingredients. We have fresh prawns (kolmbi) and cleaned, washed rice.",
    "[00:02:23.000] We have a paste of ginger, garlic, and green chili. We also have fresh curry leaves and coriander from our own garden.",
    "[00:02:35.000] For spices, we have whole spices (cloves, cinnamon, black peppercorns), turmeric, red chili powder, salt, garam masala, and bay leaves.",
    "[00:02:52.000] Ghee is optional, but we have some homemade ghee. We are using soybean oil for cooking.",
    "[00:03:10.000] You can use any variety of rice for this. Today, we are cooking on a traditional wood-fire 'Chulha' outdoors.",
    "[00:03:29.000] She starts by placing the pot on the fire and adding oil. Next, she adds the fresh curry leaves.",
    "[00:03:42.000] The ginger-garlic-chili paste goes in next to sauté.",
    "[00:03:57.000] She adds the whole spices and then the bay leaves to the tempering.",
    "[00:04:11.000] Now, the fresh prawns are added to the pot. She reduces the flame slightly so the spices don't burn.",
    "[00:04:31.000] As the prawns cook, they change color. The process is very simple without any complicated steps.",
    "[00:04:51.000] Now the ground spices go in: turmeric, red chili powder (for heat and color), salt, and garam masala.",
    "[00:05:17.000] The rice has been washed but not soaked for long. She adds the rice to the spice and prawn mixture.",
    "[00:05:39.000] The aroma is already wonderful! You can add onions or tomatoes if you like, but it's great even without them.",
    "[00:05:51.000] In our village, we sometimes call this 'Biryani'. Now it's time to add water.",
    "[00:06:10.000] She uses boiling water for the rice. Using hot water helps in cooking the rice perfectly.",
    "[00:06:28.000] It will take about 15 to 20 minutes to cook. She covers the pot to let it simmer on the wood fire.",
    "[00:06:57.000] The color is beautiful even without saffron. She adds some fresh coriander leaves as it's almost done.",
    "[00:07:20.000] She decides to skip the ghee today for a lighter version. She lets it 'dum' or steam on low heat for just two more minutes.",
    "[00:07:52.000] The food is ready! Thank you, Archana ji. The Kolmbi Bhaat looks very tempting.",
    "[00:08:01.000] I'm squeezing a bit of lemon over it before tasting.",
    "[00:08:26.000] Kolmbi Bhaat is a regular item here. While we might consider prawn biryani or pulao a special dish, this is a delicious everyday meal in this region.",
    "[00:08:48.000] How did you like today's episode? Please let us know in the comments.",
    "[00:08:55.000] If you enjoyed it, please subscribe. We will see you in another village of Maharashtra with a new recipe. Thank you!"
  ]
}