{
  "metadata": {
    "title": "Kuday Rice Ladoo | A Festive Sweet | Traditional Rural Recipe of Palghar, Maharashtra | #recipe",
    "channel_name": "Rural Recipes",
    "publish_date": "2025-02-24",
    "view_count": 144,
    "like_count": 8,
    "duration": "08:37",
    "original_audio_language": "Hindi / Warli / Marathi",
    "video_id": "zjQwTvrqCDY",
    "url": "https://www.youtube.com/watch?v=zjQwTvrqCDY",
    "description": "In this episode of Rural Recipes, we travel deep into the interiors of the Palghar district in Maharashtra to meet Reena ji, a renowned Warli artist who has showcased her work in France. Alongside her friend Suman, she demonstrates the preparation of 'Kuday' (Rice Ladoo), a traditional sweet delicacy made in every Warli household specifically for the festival of Holi.",
    "ingredients_detected": [
      "Rice Flour (Chawal ka Atta)",
      "Grated Coconut (Kisahua Nariyal)",
      "Jaggery (Ganne ka Gud)",
      "Cardamom Paste/Powder (Elaichi Powder)",
      "Oil (Tel - for coating)",
      "Salt (Namak)",
      "Water (Pani)"
    ]
  },
  "transcription_hindi": [
    "[00:00:13.000] नमस्ते और रूरल रेसिपी यूट्यूब चैनल में आपका स्वागत है।",
    "[00:00:18.000] हम सुबह से 40 किलोमीटर का सफर तय कर चुके हैं। मुझे बताया गया है कि हम महाराष्ट्र के काफी अंदरूनी इलाकों में जा रहे हैं।",
    "[00:00:26.000] यह बहुत खास होने वाला है। रूरल रेसिपी के आज के एपिसोड में मेरे साथ जुड़ें।",
    "[00:00:42.000] तुकाराम जी, यह मेरी कल्पना से भी अधिक अंदरूनी इलाका है, लेकिन गाँव बहुत सुंदर और हरा-भरा है।",
    "[00:00:54.000] रीना जी को नमस्ते! आपका गाँव और आसपास का वातावरण बहुत बढ़िया है। चलिए आपके घर चलते हैं।",
    "[00:01:05.000] रीना जी, रूरल रेसिपी में आपका स्वागत है। खाना बनाने से पहले, आइए आपकी कला के बारे में बात करते हैं।",
    "[00:01:21.000] क्या आप कल्पना कर सकते हैं? उन्होंने अपनी वारली कला की प्रदर्शनी के लिए चार बार फ्रांस—ल्योन और पेरिस—की यात्रा की है।",
    "[00:01:46.000] वह बताती हैं कि वह अपनी पेंटिंग के लिए पीली मिट्टी, लाल मिट्टी और गोबर जैसे पारंपरिक आधारों का उपयोग करती हैं।",
    "[00:01:57.000] वह आकाशगंगा में उड़ते सात घोड़ों की पेंटिंग दिखाती हैं, जो उनकी संस्कृति में प्रगति और धन का प्रतीक है।",
    "[00:02:14.000] अब, कुछ मीठा बनाते हैं। रीना जी के साथ उनकी सहेली सुमन भी जुड़ गई हैं।",
    "[00:02:22.000] वे 'लाडू' (कुडे) नामक एक विशेष मिठाई बना रही हैं, जो होली के दौरान हर वारली घर में बनाई जाती है।",
    "[00:02:42.000] इन लड्डुओं के लिए हमें चावल का आटा, घिसा हुआ नारियल, गुड़, इलायची का पेस्ट और थोड़ा नमक चाहिए।",
    "[00:03:01.000] हमें लड्डुओं पर लगाने के लिए तेल भी चाहिए ताकि वे चिपके नहीं। यहाँ इस्तेमाल किया गया गुड़ हल्के रंग का गन्ने का गुड़ है।",
    "[00:03:21.000] हम आज सुमन के घर पर खाना बना रहे हैं। पानी पहले से ही उबल रहा है।",
    "[00:03:32.000] रीना जी आटे की मात्रा (लगभग 1 किलो) के अनुसार उबलते पानी में गुड़ डालती हैं।",
    "[00:03:50.000] इसके बाद, वह घिसा हुआ नारियल और लगभग एक चम्मच नमक डालती हैं।",
    "[00:04:03.000] इसके बाद इलायची पाउडर डाला जाता है। चूँकि पानी पहले से ही उबल रहा था, वह चावल का आटा डालने की प्रक्रिया शुरू करती हैं।",
    "[00:04:25.000] वह आटे को चूल्हे पर उबलते मिश्रण में मिलाती हैं ताकि यह अच्छी तरह से मिक्स हो जाए।",
    "[00:04:45.000] मिश्रण का काम सीधे लकड़ी के चूल्हे पर किया जाता है। फिर वह इसे दो मिनट के लिए ढक देती हैं।",
    "[00:05:03.000] अब मिश्रण को आंच से उतार लिया गया है। हाथों से लड्डू बनाने से पहले इसे थोड़ा ठंडा होने की जरूरत है।",
    "[00:05:15.000] इस बीच, अंतिम भाप देने की प्रक्रिया (steaming) के लिए पानी का एक और बर्तन उबलने के लिए रखा गया है।",
    "[00:05:25.000] वे लड्डू बनाने की तैयारी करती हैं। वे अपनी हथेलियों और लड्डुओं पर तेल लगाती हैं।",
    "[00:05:42.000] तेल चावल के लड्डुओं को एक-दूसरे से चिपकने से रोकता है। इन्हें पसंद के अनुसार बड़ा या छोटा बनाया जा सकता है।",
    "[00:06:12.000] एक बार जब सभी लड्डू तैयार हो जाते हैं, तो उन्हें उबलते पानी के ऊपर एक ट्रे/स्टीमर पर रखा जाता है।",
    "[00:06:32.000] चावल के आटे को पूरी तरह से पकाने के लिए इस स्टीमिंग प्रक्रिया में लगभग 30 मिनट लगते हैं।",
    "[00:06:59.000] 30 मिनट बाद, ये तैयार हैं! ये वारली समुदाय के पारंपरिक 'लाडू' हैं।",
    "[00:07:13.000] हम अब इन्हें चख रहे हैं। ये नारियल और इलायची के अद्भुत स्वाद के साथ हल्के मीठे हैं।",
    "[00:07:41.000] इनकी बनावट थोड़ी चबाने वाली (chewy) और बहुत ही पारंपरिक है। इनमें से सिर्फ दो या तीन ही काफी पेट भरने वाले होते हैं।",
    "[00:07:55.000] मैं इस उत्सव की परंपरा को हमारे साथ साझा करने के लिए रीना जी और सुमन जी को धन्यवाद देना चाहता हूं।",
    "[00:08:09.000] तुकाराम जी भी मराठी/वारली में अपनी खुशी व्यक्त करते हैं और इस होली स्पेशल ट्रीट के लिए मेजबानों को धन्यवाद देते हैं।",
    "[00:08:20.000] कृपया इस मीठे एपिसोड पर अपनी प्रतिक्रिया और सुझाव साझा करें। यदि आपको यह पसंद आया, तो कृपया वीडियो साझा करें। धन्यवाद!"
  ],
  "transcription_english": [
    "[00:00:13.000] Hello, Namaste, and welcome to the Rural Recipes YouTube channel.",
    "[00:00:18.000] We've already traveled 40 kilometers since morning. I'm told we are heading into the deep interiors of Maharashtra.",
    "[00:00:26.000] It's going to be very special. Join me in today's episode of Rural Recipes.",
    "[00:00:42.000] Tukaram ji, this is even more interior than I imagined, but the village is beautiful and lush green.",
    "[00:00:54.000] Namaste to Reena ji! Your village and surroundings are wonderful. Let's head to your home.",
    "[00:01:05.000] Reena ji, welcome to Rural Recipes. Before we cook, let's talk about your art for a moment.",
    "[00:01:21.000] Can you imagine? She has traveled all the way to France—Lyon and Paris—four times to exhibit her Warli art.",
    "[00:01:46.000] She explains that she uses traditional backgrounds like yellow clay, red soil, and cow dung for her paintings.",
    "[00:01:57.000] She shows a painting of seven horses flying in the galaxy, a symbol of progress and wealth in their culture.",
    "[00:02:14.000] Now, let's make something sweet. Reena ji is joined by her friend Suman.",
    "[00:02:22.000] They are making a special sweet called 'Laadu' (Kuday), which is made in every Warli home during Holi.",
    "[00:02:42.000] For these ladoos, we need rice flour, grated coconut, jaggery, cardamom paste, and a bit of salt.",
    "[00:03:01.000] We also need oil to coat the ladoos so they don't stick. The jaggery used here is light-colored sugarcane jaggery.",
    "[00:03:21.000] We are cooking at Suman's house today. The water is already boiling.",
    "[00:03:32.000] Reena ji adds the jaggery to the boiling water according to the amount of flour (about 1kg).",
    "[00:03:50.000] Next, she adds the grated coconut and about a teaspoon of salt.",
    "[00:04:03.000] The cardamom powder goes in next. Since the water was already boiling, she proceeds to add the rice flour.",
    "[00:04:25.000] She mixes the flour into the boiling mixture over the stove to ensure it's well-integrated.",
    "[00:04:45.000] The mixing is done directly over the wood-fire 'Chulha'. She then covers it for two minutes.",
    "[00:05:03.000] Now the mixture is taken off the heat. It needs to cool down slightly before they can shape the ladoos by hand.",
    "[00:05:15.000] Meanwhile, another pot of water is set to boil for the final steaming process.",
    "[00:05:25.000] They prepare to shape the ladoos. They apply oil to their palms and to the ladoos.",
    "[00:05:42.000] The oil prevents the rice ladoos from sticking to each other. They can be made large or small according to preference.",
    "[00:06:12.000] Once all the ladoo balls are ready, they are placed on a tray/steamer over the boiling water.",
    "[00:06:32.000] This steaming process takes about 30 minutes to cook the rice flour completely.",
    "[00:06:59.000] After 30 minutes, they are done! These are the traditional 'Laado' of the Warli community.",
    "[00:07:13.000] We are tasting them now. They are mildly sweet with a lovely flavor of coconut and cardamom.",
    "[00:07:41.000] The texture is slightly chewy and very rustic. Just two or three of these are very filling.",
    "[00:07:55.000] I want to thank Reena ji and Suman ji for sharing this festive tradition with us.",
    "[00:08:09.000] Tukaram ji also expresses his joy in Marathi/Warli, thanking the hosts for this Holi special treat.",
    "[00:08:20.000] Please share your feedback and suggestions on this sweet episode. If you liked it, please share the video. Thank you!"
  ]
}