{
  "metadata": {
    "title": "KURUL KI BHAJI | A Rare Tribal Delicacy | Rural Recipes of Nashik, Maharastra",
    "channel_name": "Rural Recipes",
    "publish_date": "2025-09-06",
    "view_count": 426,
    "like_count": 7,
    "duration": "07:40",
    "original_audio_language": "Hindi / Marathi",
    "video_id": "bX6bwGswQ3I",
    "url": "https://www.youtube.com/watch?v=bX6bwGswQ3I",
    "description": "In this episode of Rural Recipes, we travel to the remote Vangaon village in Surgana, Nashik. We visit the home of Gulab ji, a local mango farmer and tribal artist, where his wife Lakshmi ji prepares 'Kurul Ki Bhaji'. This rare tribal delicacy is made from the tender new leaves of the Kurul tree, found deep in the forest.",
    "ingredients_detected": [
      "Kurul Leaves (Kurul के कोमल पत्ते)",
      "Singdana Tel (Peanut Oil)",
      "Kanda (Onions - chopped)",
      "Hari Mirch and Lashun Chutney (Green Chili & Garlic Paste)",
      "Mith (Salt)",
      "Urad Dal",
      "Chawal (Rice)",
      "Nagali Roti (Finger Millet Roti)"
    ]
  },
  "transcription_hindi": [
    "[00:00:26.000] हम सुरगाना तहसील के काफी अंदरूनी इलाकों में पहुँच गए हैं। यह बहुत ही दूरस्थ स्थान है।",
    "[00:00:33.000] दूर दिखने वाला वह गाँव वनगाँव है। वहाँ से हम इस क्षेत्र के दो पारंपरिक व्यंजन पेश करेंगे।",
    "[00:00:40.000] तो बने रहें।",
    "[00:00:57.000] हम स्थान पर पहुँच गए हैं। आज हमारे मेज़बान गुलाब जी हैं।",
    "[00:01:02.000] हम उनसे उनके आम के बाग में मिल रहे हैं। गुलाब जी, नमस्ते! रूरल रेसिपी में आपका स्वागत है।",
    "[00:01:14.000] यहाँ आप आम की कौन सी किस्में उगाते हैं? हमारे पास राजापुरी, हापुस, केसर और लंगड़ा हैं।",
    "[00:01:24.000] आपके घर आने का कारण आपके समुदाय की एक पारंपरिक आदिवासी रेसिपी का दस्तावेजीकरण करना है।",
    "[00:01:30.000] आज आप क्या बना रहे हैं? हम 'कुरुळ की भाजी' बना रहे हैं।",
    "[00:01:36.000] कुरुळ क्या है? यह एक पेड़ है। हम इस सब्जी को बनाने के लिए इसके ताज़ा, कोमल पत्ते तोड़ते हैं।",
    "[00:01:49.000] हाँ, हम इसे कुरुळ कहते हैं।",
    "[00:02:11.000] नमस्ते! यह मेरी पत्नी लक्ष्मी जी हैं। आज वही खाना बनाएंगी।",
    "[00:02:20.000] लक्ष्मी जी, बहुत ही सुंदर नाम। लक्ष्मी, बताइए, क्या सब कुछ तैयार है?",
    "[00:02:32.000] आइए मसालों को समझते हैं। हम यहाँ पत्ते देख रहे हैं। आप केवल कोमल टहनियों का ही उपयोग करते हैं, है ना?",
    "[00:02:46.000] हाँ, केवल कोमल वाली। मसालों के लिए, हमारे पास हरी मिर्च और लहसुन की चटनी, कटा हुआ प्याज, नमक और मूंगफली का तेल है।",
    "[00:03:04.000] यह एक बहुत ही सरल रेसिपी है जिसमें बहुत कम मसालों की आवश्यकता होती है और यह बहुत जल्दी पक जाती है।",
    "[00:03:14.000] हम उन्हें एक बर्तन में डालेंगे और धोएँगे। हम कोमल हिस्सों को चुनते हैं और उन्हें अच्छी तरह धोते हैं।",
    "[00:03:46.000] अब तेल डाल रहे हैं। सब कुछ तैयार है।",
    "[00:03:56.000] तेल गरम होने दें। तेल गरम होने के बाद, इसमें प्याज डाल रहे हैं।",
    "[00:04:10.000] अब मिर्च और लहसुन की चटनी डाल रहे हैं।",
    "[00:04:25.000] थोड़ा नमक डाल रहे हैं।",
    "[00:04:32.000] प्याज भून गया है। अब इसमें पत्ते डाल रहे हैं।",
    "[00:05:00.000] गुलाब जी एक कलाकार भी हैं। हमें अपनी कला के बारे में बताएं। मैं हमारी आदिवासी संस्कृति का एक कलाकार हूँ।",
    "[00:05:14.000] मैं 'डोंगरी देव' नृत्य करता हूँ और गाता हूँ। मैं एक पारंपरिक नर्तक हूँ।",
    "[00:05:32.000] तो आप डोंगरी नृत्य करते हैं? हाँ, और पावरी भी।",
    "[00:05:42.000] क्या यह हो गया, लक्ष्मी जी? हाँ। आइए कुरुळ की सब्जी देखते हैं।",
    "[00:05:53.000] एक बहुत ही सरल रेसिपी—त्वरित और आसान। बस पत्ते तोड़ें, न्यूनतम मसाले डालें और पकाएँ। इसमें पानी नहीं डाला जाता; यह तेल में ही पकता है।",
    "[00:06:03.000] रतन जी, यह पेड़ जंगल में पाया जाता है, है ना? हाँ, इसलिए इसे 'रान भाजी' (जंगली सब्जी) भी कहा जा सकता है।",
    "[00:06:12.000] हम ज़्यादा मसालों का उपयोग नहीं करते क्योंकि हम मूल स्वाद और विटामिन व खनिजों को बरकरार रखना चाहते हैं।",
    "[00:06:25.000] यह बहुत जल्दी पकता है। धन्यवाद, लक्ष्मी जी।",
    "[00:06:32.000] चावल को उड़द दाल के साथ परोसा गया है। यह यहाँ का एक विशिष्ट मुख्य भोजन है—आप जहाँ भी जाएँ, आपको उड़द दाल, नागली रोटी और चावल मिलेंगे।",
    "[00:06:54.000] मुझे यह कुरुळ की भाजी चखने दें। नागली रोटी के साथ इसका स्वाद बहुत अच्छा है।",
    "[00:07:09.000] गुलाब जी के घर पर मेरा दिन शानदार रहा। हमने एक पारंपरिक रेसिपी आज़माई और उनका आम का खेत देखा।",
    "[00:07:20.000] आप दोनों को धन्यवाद! यदि आपको हमारी सामग्री पसंद आई हो, तो कृपया हमारे चैनल को लाइक, शेयर और सब्सक्राइब करें।",
    "[00:07:28.000] हम फिर मिलेंगे एक नई पारंपरिक रेसिपी के साथ। धन्यवाद!"
  ],
  "transcription_english": [
    "[00:00:26.000] We have arrived deep in the interiors of Surgana tehsil. It's a very remote place.",
    "[00:00:33.000] That village in the distance is Vangaon. From there, we will present two traditional recipes of this area.",
    "[00:00:40.000] So stay tuned.",
    "[00:00:57.000] We've reached the location. Our host today is Gulab ji.",
    "[00:01:02.000] We are meeting him at his mango orchard. Gulab ji, Namaste! Welcome to Rural Recipes.",
    "[00:01:14.000] What varieties of mango do you grow here? We have Rajapuri, Hapus, Kesar, and Langra.",
    "[00:01:24.000] The reason for coming to your home is to document a traditional tribal recipe of your community.",
    "[00:01:30.000] What are you making today? We are making 'Kurul Ki Bhaji'.",
    "[00:01:36.000] What is Kurul? It is a tree. We pluck the fresh, tender leaves from it to make this vegetable.",
    "[00:01:49.000] Yes, we call it Kurul.",
    "[00:02:11.000] Namaste! This is my wife, Lakshmi ji. She will be cooking today.",
    "[00:02:20.000] Lakshmi ji, a beautiful name. Lakshmi, tell us, is everything ready?",
    "[00:02:32.000] Let's understand the spices. We see the leaves here. You only use the tender shoots, right?",
    "[00:02:46.000] Yes, only the tender ones. For spices, we have a green chili and garlic chutney, chopped onions, salt, and peanut oil.",
    "[00:03:04.000] It's a very simple recipe that requires very few spices and cooks very quickly.",
    "[00:03:14.000] We'll put them in a dish and wash them. We pluck the tender parts and wash them thoroughly.",
    "[00:03:46.000] Now adding the oil. Everything is ready.",
    "[00:03:56.000] Let the oil heat up. Once the oil is hot, adding the onions.",
    "[00:04:10.000] Now adding the chili and garlic chutney.",
    "[00:04:25.000] Adding a bit of salt.",
    "[00:04:32.000] The onions are sautéed. Now adding the leaves.",
    "[00:05:00.000] Gulab ji is also an artist. Tell us about your art. I am an artist in our tribal culture.",
    "[00:05:14.000] I perform the 'Dongri Dev' dance and sing. I am a traditional dancer.",
    "[00:05:32.000] So you do the Dongri dance? Yes, and Pavri too.",
    "[00:05:42.000] Is it done, Lakshmi ji? Yes. Let's see the Kurul vegetable.",
    "[00:05:53.000] A very simple recipe—quick and easy. Just pluck the leaves, add minimal spices, and cook. No water is added; it cooks in the oil.",
    "[00:06:03.000] Ratan ji, this tree is found in the forest, right? Yes, so this can also be called 'Raan Bhaji' (wild vegetable).",
    "[00:06:12.000] We don't use much spice because we want to keep the original flavor and the vitamins and minerals intact.",
    "[00:06:25.000] It cooks very fast. Thank you, Lakshmi ji.",
    "[00:06:32.000] Rice is served along with Urad dal. This is a typical staple here—wherever you go, you find Urad dal, Nagali roti, and rice.",
    "[00:06:54.000] Let me try this Kurul Ki Bhaji. It tastes great with the Nagali roti.",
    "[00:07:09.000] I had a fantastic day at Gulab ji's home. We tried a traditional recipe and saw his mango farm.",
    "[00:07:20.000] Thank you both! If you liked our content, please like, share, and subscribe to our channel.",
    "[00:07:28.000] We will meet again with a new traditional recipe. Thank you!"
  ]
}