{
  "metadata": {
    "title": "লাফা শাকের প্যালকা | Lafa Shak-er Pelka | Rural Recipes",
    "channel_name": "Rural Recipes",
    "publish_date": "2024-03-15",
    "view_count": 470,
    "like_count": 22,
    "duration": "07:48",
    "original_audio_language": "Bengali",
    "video_id": "4--b5NvnqeQ",
    "url": "https://www.youtube.com/watch?v=4--b5NvnqeQ",
    "description": "In this episode of Rural Recipes, we explore Chanakata village in Cooch Behar to document 'Pelka', a signature Rajbangshi dish made with Lafa Shak and natural alkali (Chhyaka).",
    "ingredients_detected": [
      "Lafa Shak (Mallow leaves)",
      "Soluk/Radhuni Shak (Dill leaves)",
      "Bethua Shak (Chenopodium)",
      "Rosun Pata (Garlic leaves)",
      "Rosun (Garlic cloves)",
      "Kancha Lonka (Green Chilies)",
      "Chhyaka/Khaar (Natural banana ash alkali)",
      "Lobon (Salt)",
      "Sorsher Tel (Mustard Oil)",
      "Jol (Water)"
    ]
  },
  "transcription_bengali": [
    "[00:00:13.000] রুরাল রেসিপি খোঁজে আমরা আবার বেরিয়ে পড়লাম। আজ আমরা বাজার থেকে তাজা লাফা শাক কিনবো।",
    "[00:00:24.000] আমাদের বাজারে এই শাকটা পাওয়া গেছে। এটা হচ্ছে লাফা শাক, এই শাকটা দিয়ে আমরা আজ নতুন এপিসোড তৈরি করবো।",
    "[00:00:38.000] আমরা এখন কোচবিহারের ছোট্ট গ্রাম চানাকাটাতে এসছি। এখান থেকে রাজবংশীদের ইউনিক খাবার তুলে ধরবো।",
    "[00:00:47.000] শীতকালে রাজবংশীদের একটা স্পেশাল খাবার হচ্ছে প্যালকা, যা লাফা শাক দিয়ে তৈরি হয়।",
    "[00:01:04.000] সুমিতাদি নমস্কার! তোমার বাড়ির লেবু গাছটা তো বাপরে বাপ অনেক বড়।",
    "[00:01:17.000] সুমিতাদি আজ লাফা শাকের প্যালকা করে দেখাবে। এটা আমাদের রাজবংশীদের খুব প্রিয় খাবার।",
    "[00:01:28.000] এই শাকটা খেলে স্লিপারি টেক্সচারের জন্য খুব মজা লাগে।",
    "[00:01:42.000] লাফা শাকের সাথে গন্ধের জন্য সলুক শাক বা রাধুনি শাক দিতেই লাগে।",
    "[00:02:01.000] সঙ্গে বথুয়া শাক আর টাটকা রসুন গাছের পাতাও ব্যবহার করা হয়।",
    "[00:02:10.000] প্যালকার জন্য শাকগুলো কাটতে হয় না, হাত দিয়ে ছিঁড়লেই হয়। সোডা দিলে এমনিই গলে যাবে।",
    "[00:02:28.000] সমস্ত শাক ধুয়ে পরিষ্কার করা হয়ে গেছে। এবার রান্না শুরু হবে।",
    "[00:02:50.000] এতে মসলা খুব কম লাগে - শুধু নুন, রসুন, কাঁচা লঙ্কা আর সামান্য তেল।",
    "[00:03:00.000] প্যালকার আসল জিনিস হলো ছ্যাকা বা ক্ষার। এটি আঠিয়া কলার শুকনো অংশ পুড়িয়ে তার ছাই থেকে তৈরি করা হয়।",
    "[00:03:18.000] রাজবংশীদের খাবার এই ক্ষার ছাড়া অসম্পূর্ণ। এটি স্বাস্থ্যের জন্য খুব উপকারী।",
    "[00:03:45.000] কড়াইতে নামমাত্র তেল দিয়ে রসুন থেঁতো করে ফোরন দেওয়া হলো।",
    "[00:04:05.000] এবার এতে ছ্যাকার জল আর মাপমতো কিছুটা সাধারণ জল মেশানো হলো।",
    "[00:04:30.000] জল ফুটে উঠলে চেরা কাঁচা লঙ্কা আর নুন দিয়ে দেওয়া হলো।",
    "[00:04:50.000] এবার ধুয়ে রাখা লাফা শাক ও বাকি সব শাকগুলো কড়াইতে দিয়ে দেওয়া হচ্ছে।",
    "[00:05:17.000] শাকগুলোকে ঢাকা দেওয়া হলো যাতে সেগুলো তাড়াতাড়ি ভালো করে গলে যায়।",
    "[00:05:44.000] মাঝে মাঝে নেড়ে দিতে হবে। ছ্যাকার জন্য প্যালকার রঙটা একটু গাঢ় বা লালচে হয়।",
    "[00:06:20.000] এটি এক ধরণের ঘন শাকের সুপ যা ভাতের সাথে খাওয়া হয়।",
    "[00:06:41.000] প্যালকা তৈরি হয়ে গেছে! এবার একটি পাত্রে নামিয়ে নেওয়া হলো।",
    "[00:06:52.000] গরম ভাত আর আলু ভাজার সাথে প্যালকা খাওয়ার আনন্দই আলাদা।",
    "[00:07:16.000] এর স্বাদ খুবই অন্যরকম। সুমিতাদি আপনাকে অনেক ধন্যবাদ।",
    "[00:07:28.000] আমাদের রুরাল রেসিপি চ্যানেলটি সাবস্ক্রাইব করুন। দেখা হবে অন্য কোন রেসিপি নিয়ে।"
  ],
  "transcription_english": [
    "[00:00:13.000] We have set out again in search of rural flavors. Today we will buy fresh Lafa Shak from the market.",
    "[00:00:24.000] We found this green in the market. This is Lafa Shak, and we will make our new episode with this.",
    "[00:00:38.000] We are in Chanakata, a small village in Cooch Behar. We will showcase a unique Rajbangshi dish from here.",
    "[00:00:47.000] In winter, 'Pelka' made with Lafa Shak is a special meal for the Rajbangshi community.",
    "[00:01:04.000] Greetings, Sumitadi! Your lemon tree is incredibly large.",
    "[00:01:17.000] Sumitadi will show us how to make Lafa Shak Pelka today. This is a favorite Rajbangshi dish.",
    "[00:01:28.000] This green has a slippery texture, which makes it very enjoyable to eat.",
    "[00:01:42.000] Soluk or Radhuni Shak must be added along with Lafa Shak for its aroma.",
    "[00:02:01.000] Additionally, Bethua and fresh garlic leaves are also used.",
    "[00:02:10.000] For Pelka, the greens are not chopped; they are torn by hand. Soda will melt them anyway.",
    "[00:02:28.000] All the greens have been washed and cleaned. Now the cooking will begin.",
    "[00:02:50.000] Very few spices are used: just salt, garlic, green chilies, and a little oil.",
    "[00:03:00.000] The most important thing is 'Chhyaka' or alkali. It is made from the ash of burnt banana plants.",
    "[00:03:18.000] Rajbangshi food is incomplete without this alkali. It is very good for health.",
    "[00:03:45.000] A nominal amount of oil is added to the pan, and crushed garlic is used for tempering.",
    "[00:04:05.000] Now the alkali water and some plain water are added to the pan.",
    "[00:04:30.000] Once the water boils, slit green chilies and salt are added.",
    "[00:04:50.000] Now the washed Lafa Shak and all other greens are slowly added to the pan.",
    "[00:05:17.000] The greens are covered so that they melt and cook thoroughly.",
    "[00:05:44.000] It needs to be stirred occasionally. Pelka turns a bit dark or reddish due to the alkali.",
    "[00:06:20.000] It is a type of thick green soup eaten with rice.",
    "[00:06:41.000] Pelka is ready! It has been taken out into a bowl.",
    "[00:06:52.000] Eating hot Pelka with rice and fried potatoes is a different kind of joy.",
    "[00:07:16.000] Its taste is very unique and refreshing. Thank you very much, Sumitadi.",
    "[00:07:28.000] Please subscribe to our Rural Recipes channel. See you with another recipe."
  ]
}