{
  "metadata": {
    "title": "LAURI KI BHAJI | Slow-cooked Wild Bird Curry | Rural Recipes of Nashik, Maharastra",
    "channel_name": "Rural Recipes",
    "publish_date": "2025-09-06",
    "view_count": 303,
    "like_count": 12,
    "duration": "09:01",
    "original_audio_language": "Hindi / Marathi",
    "video_id": "j4oTGltLaAM",
    "url": "https://www.youtube.com/watch?v=j4oTGltLaAM",
    "description": "In this episode of Rural Recipes, we travel to the Surgana Taluka of Nashik, Maharashtra, a fertile region famous for grapes and onions but home to unique tribal traditions in its ghat areas. We meet Laxman Bangal, a tribal dance leader, and his wife Yashoda, who demonstrates how to prepare 'Lauri Ki Bhaji'—a traditional spicy curry made from a local wild bird (Common Quail/Lauri).",
    "ingredients_detected": [
      "Lauri (Wild Bird/Quail) - Roasted and cleaned",
      "Singdana Tel (Peanut Oil)",
      "Rai (Mustard Seeds)",
      "Kadi Patta (Curry Leaves)",
      "Pyaz (Onions - chopped)",
      "Adrak-Lashun Paste (Ginger-Garlic Paste)",
      "Hari Mirch (Green Chilies)",
      "Lal Mirch Powder (Red Chili Powder)",
      "Haldi (Turmeric Powder)",
      "Homemade Tribal Masala (Chili, onion, coconut, coriander blend)",
      "Namak (Salt)",
      "Garam Pani (Hot Water)"
    ]
  },
  "transcription_hindi": [
    "[00:00:13.000] नमस्ते और रूरल रेसिपी यूट्यूब चैनल में आपका स्वागत है, जहाँ हम ग्रामीण भारत की पारंपरिक और अनूठी रेसिपीज़ का दस्तावेजीकरण करते हैं।",
    "[00:00:22.000] इनमें से कई रेसिपीज़ विलुप्त हो रही हैं, इसलिए हमारा लक्ष्य उन्हें आने वाली पीढ़ियों के लिए सहेज कर रखना है।",
    "[00:00:29.000] हम वापस महाराष्ट्र में हैं। पालघर के बाद, अब हम नासिक जिले में हैं।",
    "[00:00:36.000] नासिक एक बड़ा जिला है जिसमें 15 तहसीलें हैं। यह बहुत उपजाऊ है और पूरे देश के लिए अंगूर और प्याज के उत्पादन के लिए जाना जाता है।",
    "[00:00:53.000] हम वर्तमान में गुजरात की सीमा से लगे घाट क्षेत्र में हैं, जहाँ आदिवासी समुदायों का दबदबा है। विशेष रूप से, हम सुरगाना तालुका में हैं।",
    "[00:01:17.000] मिलिए रतन चौधरी से, जो एक भाषा शिक्षक और हमारे गाइड हैं, जो आदिवासी समाजों के विकास के लिए काम करते हैं।",
    "[00:01:33.000] हमारे साथ लक्ष्मण बंगाल भी हैं, जो एक पारंपरिक नृत्य कलाकार और एक आदिवासी नृत्य टीम के नेता हैं।",
    "[00:01:56.000] लक्ष्मण डिश के बारे में बताते हैं: यह उनकी बोली में 'गांजी' और हिंदी में 'लवरी' (क्वेल) कहे जाने वाले एक जंगली पक्षी से बनाई जाती है।",
    "[00:02:11.000] आज, उनकी पत्नी यशोदा हमारे लिए 'लवरी की भाजी' तैयार करेंगी। यह इस क्षेत्र की एक पारंपरिक रेसिपी है।",
    "[00:02:30.000] हम उनके घर पर हैं। यशोदा ने मसाले व्यवस्थित किए हैं: प्याज, अदरक-लहसुन का पेस्ट, हरी मिर्च, लाल मिर्च पाउडर, राई, हल्दी और नमक।",
    "[00:03:02.000] उनके पास मिर्च, प्याज, नारियल और धनिया पाउडर वाला एक विशेष घर का बना मसाला भी है।",
    "[00:03:16.000] तेल के लिए, वे मूंगफली के तेल (सिंगदाना तेल) का उपयोग करते हैं। वे ताज़ा करी पत्ते का भी उपयोग करते हैं।",
    "[00:03:36.000] लक्ष्मण पक्षी की तैयारी के बारे में बताते हैं: पंख हटाने के लिए इसे पहले आग पर भूना जाता है, फिर साफ़ करके धोया जाता है और टुकड़ों में काटा जाता है।",
    "[00:03:57.000] खाना पकाने का काम पारंपरिक लकड़ी की आग पर होता है। यशोदा मूंगफली का तेल गरम करके और राई डालकर शुरुआत करती हैं।",
    "[00:04:34.000] इसके बाद, वह ताज़ा करी पत्ता और कटी हुई हरी मिर्च डालती हैं। करी पत्ते की खुशबू शानदार है।",
    "[00:04:44.000] फिर कटा हुआ प्याज डाला जाता है, उसके बाद अदरक-लहसुन का पेस्ट। वे इसे कच्ची महक जाने तक भूनते हैं।",
    "[00:05:15.000] अब सूखे मसाले डाले जाते हैं: लाल मिर्च पाउडर और विशेष स्थानीय घर का बना मसाला। यह डिश आमतौर पर काफी तीखी होती है।",
    "[00:05:29.000] थोड़ी हल्दी डाली जाती है, और फिर तैयार पक्षी का मांस (लवरी) मसाला बेस में मिलाया जाता है।",
    "[00:05:53.000] वह पैन को ढक देती हैं और इसे पकने देती हैं। पकाने का समय कम है क्योंकि पक्षी छोटा है और पहले से ही भुना हुआ है।",
    "[00:06:08.000] दिलचस्प बात यह है कि जहाँ अधिकांश मीट करी में प्याज और अदरक-लहसुन का उपयोग होता है, यहाँ राई और करी पत्ते का उपयोग इस क्षेत्र के लिए काफी अनूठा है।",
    "[00:06:39.000] मिश्रण में नमक डाला जाता है। लक्ष्मण बताते हैं कि वे कभी-कभी इन पक्षियों को जंगल में पकड़ लेते हैं और उन्हें पालतू जानवर के रूप में घर पर भी रखते हैं।",
    "[00:07:24.000] वे गर्म पानी के लिए एक दिलचस्प तकनीक का उपयोग करते हैं: खाना पकाने के बर्तन के ऊपर पानी वाला एक ढक्कन रखा जाता है। गरम होने पर इस पानी को ग्रेवी में डाल दिया जाता है।",
    "[00:07:33.000] यह एक क्षेत्रीय व्यंजन है, ठीक वैसे ही जैसे पूर्वी भारत में कबूतर के मांस का आनंद लिया जाता है, जैसे असम या बंगाल में।",
    "[00:07:51.000] डिश लगभग तैयार है! यशोदा कहती हैं कि इसे पारंपरिक रूप से नाागली (फिंगर मिलेट) की रोटी, दाल और चावल के साथ परोसा जाता है।",
    "[00:08:15.000] मैं अब लवरी की भाजी चख रहा हूँ। इसका स्वाद कबूतर या बटेर के मांस के समान है। यह उत्कृष्ट है।",
    "[00:08:32.000] हमारे साथ यह पारंपरिक रेसिपी साझा करने के लिए लक्ष्मण जी और यशोदा जी का धन्यवाद।",
    "[00:08:47.000] आने वाले दिनों में, हम सुरगाना के और गाँवों का भ्रमण करेंगे और आपके लिए और भी अनूठी रेसिपीज़ लाएंगे। रूरल रेसिपी देखते रहें!"
  ],
  "transcription_english": [
    "[00:00:13.000] Hello and welcome to the Rural Recipes YouTube channel, where we document the traditional and unique recipes of rural India.",
    "[00:00:22.000] Many of these recipes are dying out or their processes are becoming obsolete, so we aim to preserve them for posterity.",
    "[00:00:29.000] We are back in Maharashtra. After covering Palghar, we are now in the Nashik district.",
    "[00:00:36.000] Nashik is a large district with 15 tehsils. It's fertile and known for producing grapes and onions for the whole country.",
    "[00:00:53.000] We are currently in the ghat area bordering Gujarat, dominated by tribal communities. Specifically, we are in the Surgana Taluka.",
    "[00:01:17.000] Meet Ratan Chaudhary, a language teacher and our guide, who works for the development of tribal societies.",
    "[00:01:33.000] We are also joined by Laxman Bangal, a traditional dance artist and leader of a tribal dance team.",
    "[00:01:56.000] Laxman explains the dish: It's made from a wild forest bird called 'Ganji' in their dialect and 'Lauri' (Quail) in Hindi.",
    "[00:02:11.000] Today, his wife Yashoda will prepare 'Lauri Ki Bhaji' for us. This is a traditional recipe of this region.",
    "[00:02:30.000] We are at their home. Yashoda has organized the spices: onions, ginger-garlic paste, green chilies, red chili powder, mustard seeds (rai), turmeric, and salt.",
    "[00:03:02.000] She also has a special homemade masala containing chilies, onions, coconut, and coriander powder.",
    "[00:03:16.000] For oil, they use peanut oil (singdana tel). They also use fresh curry leaves.",
    "[00:03:36.000] Laxman explains the bird preparation: It is first roasted over the fire to remove feathers, cleaned, washed, and then cut into pieces.",
    "[00:03:57.000] The cooking happens over a traditional wood fire. Yashoda starts by heating the peanut oil and adding mustard seeds.",
    "[00:04:34.000] Next, she adds fresh curry leaves and chopped green chilies. The aroma of the curry leaves is fantastic.",
    "[00:04:44.000] Then the chopped onions go in, followed by the ginger-garlic paste. They sauté until the raw smell is gone.",
    "[00:05:15.000] Now the dry spices are added: red chili powder and the special local homemade masala. This dish is usually quite spicy.",
    "[00:05:29.000] A bit of turmeric is added, and then the prepared bird meat (Lauri) is mixed into the masala base.",
    "[00:05:53.000] She covers the pan and lets it simmer. The cooking time is short because the bird is small and already pre-roasted.",
    "[00:06:08.000] Interestingly, while most meat curries use onions and ginger-garlic, the use of mustard seeds and curry leaves here is quite unique for this region.",
    "[00:06:39.000] Salt is added to the mixture. Laxman mentions that they sometimes catch these birds in the forest and even keep them at home as livestock.",
    "[00:07:24.000] They use an interesting technique for hot water: a lid with water is placed on top of the cooking pot. Once heated, this water is added to the gravy.",
    "[00:07:33.000] This is a regional delicacy, similar to how pigeon meat is enjoyed in Eastern India, like in Assam or Bengal.",
    "[00:07:51.000] The dish is almost done! Yashoda says it is traditionally served with Naagli (finger millet) rotis, dal, and rice.",
    "[00:08:15.000] I'm tasting the Lauri Ki Bhaji now. It has a flavor very similar to pigeon or quail meat. It's excellent.",
    "[00:08:32.000] Thank you, Laxman ji and Yashoda ji, for sharing this traditional recipe with us.",
    "[00:08:47.000] In the coming days, we will explore more villages in Surgana and bring you more unique recipes. Keep watching Rural Recipes!"
  ]
}