{
  "metadata": {
    "title": "MACHHLI KA PATORI | A Rare Tribal Trove - Amidst Dense Forest | A Recipe Without Utensils",
    "channel_name": "Rural Recipes",
    "publish_date": "2025-09-06",
    "view_count": 792,
    "like_count": 25,
    "duration": "08:13",
    "original_audio_language": "Hindi / Marathi",
    "video_id": "zqLuVpKqz-0",
    "url": "https://www.youtube.com/watch?v=zqLuVpKqz-0",
    "description": "Deep in the Surgana area of Nashik, Maharashtra, we explore a unique tribal tradition in the village of Vangaon. This episode documents 'Machhli Ka Patori' (or Patoli)—a survival recipe from the tribal community. This dish is remarkable because it is cooked entirely without utensils. Using Sag (Teak) and Palash leaves, the fish is seasoned and slow-cooked directly over an open fire.",
    "ingredients_detected": [
      "Fish (Machhli)",
      "Sag Leaves (Saga che paan - Teak)",
      "Palash Leaves",
      "Hari Mirch (Fresh Green Chilies)",
      "Lal Mirch Chutney (Red Chili Chutney)",
      "Kanda (Onions)",
      "Haldi (Turmeric)",
      "Lashun (Grated Garlic)",
      "Kothimbir (Fresh Coriander)",
      "Singdana tel (Peanut Oil)",
      "Pani (Water)"
    ]
  },
  "transcription_hindi": [
    "[00:00:14.000] हम महाराष्ट्र के नासिक जिले के सुरगाना क्षेत्र में बहुत अंदरूनी इलाके में हैं। यह एक बहुत ही दूरस्थ आदिवासी क्षेत्र है।",
    "[00:00:24.000] लेकिन यह गाँव, वनगाँव, बहुत सुंदर है। आज हम यहाँ से एक नई रेसिपी पेश करेंगे।",
    "[00:00:29.000] रेसिपी से बढ़कर, यह एक परंपरा है—एक आदिवासी परंपरा—जिसके बारे में हम इस एपिसोड में जानेंगे।",
    "[00:00:43.000] नमस्ते! हम विट्ठल जी के पास आए हैं। वह यहाँ अपने दो भाइयों के साथ हैं।",
    "[00:01:01.000] आज हम जो रेसिपी देखने जा रहे हैं वह बहुत पुरानी पारंपरिक रेसिपी है।",
    "[00:01:06.000] जब वे पहाड़ों या जंगलों में जाते हैं और कुछ पकड़ते हैं—चाहे वह शिकार हो या केकड़े—वे बर्तन साथ नहीं ले जाते।",
    "[00:01:17.000] वे पेड़ों से पत्तियाँ तोड़ते हैं और उन्हीं के अंदर खाना पकाते हैं। इसे 'पतोरी' कहा जाता है।",
    "[00:01:30.000] यह बिना बर्तनों वाली रेसिपी है। क्योंकि यह पत्तियों में बंद रहता है, इसलिए इसकी नमी बाहर नहीं निकलती, जिससे यह बहुत मीठा और स्वादिष्ट बनता है।",
    "[00:01:45.000] आज हम इसे मछली के साथ बनाएंगे। आइए देखते हैं हमारे क्षेत्र की यह पारंपरिक पतोरी कैसे बनाई जाती है।",
    "[00:01:53.000] आइए अब इसे बनाना शुरू करते हैं।",
    "[00:02:01.000] हम पतोरी बनाने के लिए तैयार हैं। तीनों भाई यहाँ मौजूद हैं। विट्ठल जी, बताइए आप कौन से मसाले इस्तेमाल कर रहे हैं।",
    "[00:02:07.000] सर, हमारे पास ताज़ा हरी मिर्च और लाल मिर्च की चटनी है जो हमने तैयार की है।",
    "[00:02:22.000] हम यहाँ प्याज को 'कांदा' कहते हैं। हमारे पास हल्दी, कुचला हुआ लहसुन और धनिया (कोथिंबीर) भी है। हमारे पास थोड़ा मूंगफली का तेल है।",
    "[00:02:33.000] आम तौर पर, तेल और इतने सारे मसालों का उपयोग नहीं किया जाता है, लेकिन चूंकि हम घर पर हैं, इसलिए हम कुछ अतिरिक्त स्वाद जोड़ रहे हैं।",
    "[00:02:44.000] ये साग (सागौन) के पत्ते हैं। हम इन्हें 'साग चे पान' कहते हैं।",
    "[00:03:06.000] क्योंकि सागौन के पत्ते थोड़े खुरदरे हो सकते हैं, इसलिए हम अंदर पलाश के पत्तों का भी उपयोग करते हैं। वे सुरक्षित और चिकने होते हैं।",
    "[00:03:18.000] ये मछली के टुकड़े हैं, धुले हुए और तैयार। अब हम मसाला मिलाएंगे।",
    "[00:03:32.000] सबसे पहले, हम मछली रखते हैं। फिर हम मसाले डालते हैं। सोनी बहुत सारी मिर्च डाल रही है; इससे स्वाद बेहतर होता है।",
    "[00:03:57.000] प्याज (कांदा), हल्दी, लहसुन-चटनी का मिश्रण और धनिया पत्ती डाल रहे हैं।",
    "[00:04:14.000] थोड़ा सा तेल डाला जाता है, और फिर हम सब कुछ हाथ से मिलाते हैं। अलग से नमक नहीं डाला जाता क्योंकि चटनी में पहले से ही नमक होता है।",
    "[00:04:29.000] हम दो तरह के पत्तों का इस्तेमाल करते हैं: सागौन और पलाश। पहले एक सागौन का पत्ता बिछाया जाता है, फिर एक पलाश का पत्ता।",
    "[00:04:33.000] मसालेदार मछली को अंदर रखा जाता है। ऊपर एक और पलाश का पत्ता रखा जाता है, और अंत में इसे सागौन के पत्तों में लपेट दिया जाता है।",
    "[00:04:44.000] सागौन का पत्ता मजबूती और आग से सुरक्षा प्रदान करता है, जबकि पलाश का पत्ता इसे साफ और चिकना रखता है।",
    "[00:04:49.000] इसे चारों तरफ से कसकर सील कर दिया जाता है। अब हम इसे पकाएंगे।",
    "[00:04:59.000] यह वास्तव में दिलचस्प है। एक भी बर्तन का उपयोग नहीं किया गया है; यह सब पत्तियों के बारे में है।",
    "[00:05:12.000] हम इसे सीधे दहकती आग पर रखते हैं।",
    "[00:05:22.000] आग अच्छी जल रही है। इसे पकने में करीब 20 मिनट लगेंगे। कुल मिलाकर इस प्रक्रिया में 35 से 40 मिनट लगते हैं।",
    "[00:05:34.000] विट्ठल जी और उनके भाई किसान हैं, लेकिन वे मधुमक्खी पालक भी हैं। वे मधुमक्खियाँ पालते हैं।",
    "[00:05:40.000] विट्ठल और राजाराम कलाकार भी हैं; वे पारंपरिक 'ठाकर' और 'पावरी' नृत्य करते हैं।",
    "[00:06:12.000] पतोरी तैयार है। हम इसे कुछ लकड़ियों की मदद से अंगारों से सावधानीपूर्वक हटाते हैं।",
    "[00:06:34.000] बाहरी पत्तियाँ पूरी तरह से जल गई हैं, लेकिन अंदर देखिए—यह जला नहीं बल्कि पूरी तरह से पका हुआ है। अद्भुत!",
    "[00:06:56.000] जब वे जंगल में होते हैं, तो वे एक कपड़े (गमछा) में लिपटी नागली या चावल की भाकरी लाते हैं और इसके साथ खाते हैं।",
    "[00:07:03.000] मुझे इसे आज़माने दें। बंगाली होने के नाते, मैं मछली के काँटों को संभाल सकता हूँ, इसलिए मेरे लिए कोई समस्या नहीं है।",
    "[00:07:20.000] इसका स्वाद बहुत ही शानदार और देहाती है। यह पूरी तरह से पक गया है, और सभी मसालों का स्वाद इसमें आ गया है।",
    "[00:07:26.000] वे रोटी के साथ इसका आनंद लेते हैं। वनगाँव में हमारा दिन बहुत शानदार रहा।",
    "[00:07:40.000] विट्ठल जी, आपको और आपके भाइयों को धन्यवाद। अपनी परंपरा साझा करने के लिए धन्यवाद कि आप बिना बर्तनों के जंगल में कैसे खाना पकाते हैं।",
    "[00:07:54.000] खाना स्वादिष्ट और बहुत ज़ायकेदार था। यह पहली बार था जब मैंने बिना किसी बर्तन के खाना बनते देखा है। धन्यवाद!"
  ],
  "transcription_english": [
    "[00:00:14.000] We are deep inside Maharashtra, in the Surgana area of Nashik. This is a tribal area, very remote.",
    "[00:00:24.000] But this village, Vangaon, is very beautiful. Today we will present a new recipe from here.",
    "[00:00:29.000] More than a recipe, it is a tradition—a tribal tradition—that we will learn about in this episode.",
    "[00:00:43.000] Namaste! We have come to Vitthal ji. He is here with his two brothers.",
    "[00:01:01.000] The recipe we are going to see today is a very old traditional one.",
    "[00:01:06.000] When they go to the mountains or forests and catch something—be it game or crabs—they don't carry utensils.",
    "[00:01:17.000] They pluck leaves from the trees and cook the food inside them. This is called 'Patori'.",
    "[00:01:30.000] This is a recipe without utensils. Because it is sealed in leaves, the moisture doesn't escape, making it very sweet and flavorful.",
    "[00:01:45.000] Today we will make it with fish. Let's see how this traditional Patori of our region is made.",
    "[00:01:53.000] Let's start preparing it now.",
    "[00:02:01.000] We are ready to make the Patori. All three brothers are present. Vitthal ji, tell us which spices you are using.",
    "[00:02:07.000] Sir, we have fresh green chilies and a red chili chutney we prepared.",
    "[00:02:22.000] We call onions 'Kanda' here. We also have turmeric, crushed garlic, and coriander (kothimbir). We have a little peanut oil.",
    "[00:02:33.000] Normally, oil isn't used and neither are so many spices, but since we are at home, we are adding a few extra flavors.",
    "[00:02:44.000] These are Sag (Teak) leaves. We call them 'Saga che paan'.",
    "[00:03:06.000] Because Teak leaves can be a bit rough, we also use Palash leaves inside. They are safe and smooth.",
    "[00:03:18.000] These are the fish pieces, washed and ready. Now we will mix the masala.",
    "[00:03:32.000] First, we place the fish. Then we add the spices. Soni is adding many chilies; it makes it taste better.",
    "[00:03:57.000] Adding onions (kanda), turmeric, the garlic-chutney mix, and coriander leaves.",
    "[00:04:14.000] A little bit of oil is added, and then we mix everything by hand. No extra salt is added because the chutney already contains salt.",
    "[00:04:29.000] We use two types of leaves: Teak and Palash. First, a Teak leaf is laid out, then a Palash leaf.",
    "[00:04:33.000] The seasoned fish is placed inside. Another Palash leaf is placed on top, and finally, it's wrapped in Teak leaves.",
    "[00:04:44.000] The Teak leaf provides strength and protection from the fire, while the Palash leaf keeps it clean and smooth.",
    "[00:04:49.000] It's sealed tightly from all sides. Now we will cook it.",
    "[00:04:59.000] This is truly interesting. Not a single utensil is used; it's all about the leaves.",
    "[00:05:12.000] We place it directly on the hot fire.",
    "[00:05:22.000] The fire is burning well. It will take about 20 minutes to cook. In total, the process takes 35 to 40 minutes.",
    "[00:05:34.000] Vitthal ji and his brothers are farmers, but they are also beekeepers. They raise honeybees.",
    "[00:05:40.000] Vitthal and Rajaram are also artists; they perform traditional 'Thakar' and 'Pavri' dances.",
    "[00:06:12.000] The Patori is ready. We carefully move it away from the embers using a few sticks.",
    "[00:06:34.000] The outer leaves are completely charred, but look at the inside—it isn't burnt but perfectly cooked. Wonderful!",
    "[00:06:56.000] When they are in the forest, they bring Nagali or rice bhakris wrapped in a cloth (gamcha) and eat them with this.",
    "[00:07:03.000] Let me try this. Being Bengali, I can handle fish bones, so no problem for me.",
    "[00:07:20.000] It has a very flavorful, rustic taste. It's cooked perfectly, and all the spice flavors have come through.",
    "[00:07:26.000] They enjoy this with roti. We've had a wonderful day here in Vangaon.",
    "[00:07:40.000] Vitthal ji, thank you to you and your brothers. Thank you for sharing your tradition of how you cook in the forest without utensils.",
    "[00:07:54.000] The food was delicious and very flavorful. It was the first time I've seen food made without any utensils. Thank you!"
  ]
}