{
  "metadata": {
    "title": "Moura Bhaji | A Coastal Curry | Traditional Rural Recipe of Palghar, Maharashtra | #recipe",
    "channel_name": "Rural Recipes",
    "publish_date": "2025-02-24",
    "view_count": 228,
    "like_count": 4,
    "duration": "07:06",
    "original_audio_language": "Hindi / Marathi / Warli",
    "video_id": "r7Ssiy90MR4",
    "url": "https://www.youtube.com/watch?v=r7Ssiy90MR4",
    "description": "In this episode of Rural Recipes, we continue our exploration of the Palghar district in Maharashtra. We meet Ashok ji, a versatile Warli artist and traditional dancer. Alongside his wife and mother, Kalavati ji, they demonstrate the preparation of 'Moura Bhaji'—a tangy tribal fish curry made with Indian Mackerel (Bangda) and tamarind water.",
    "ingredients_detected": [
      "Bangda (Indian Mackerel)",
      "Soybean Oil (Soybean Tel)",
      "Kanda (Onions - chopped)",
      "Lasun (Garlic - grated)",
      "Tamatar (Tomatoes - chopped)",
      "Hirvi Mirchi Chutney (Green Chili Paste)",
      "Local Masala Powder",
      "Halad (Turmeric Powder)",
      "Chincheche Pani (Tamarind Water)",
      "Mith (Salt)",
      "Jol (Water)"
    ]
  },
  "transcription_hindi": [
    "[00:00:13.000] नमस्ते, रूरल रेसिपी में आपका स्वागत है। हम महाराष्ट्र के पालघर जिले के ग्रामीण इलाकों की खोज कर रहे हैं।",
    "[00:00:24.000] मैं अपने गाइड का इंतज़ार कर रहा हूँ। वह आ गए! गुड मॉर्निंग, तुकाराम जी।",
    "[00:00:31.000] तुकाराम बताते हैं कि एक छोटी सी समस्या है—मछली बाज़ार में नहीं मिली, इसलिए हमें खुद जाकर खरीदनी होगी।",
    "[00:01:14.000] तुकाराम ने मेरा परिचय अपने दोस्त अशोक जी से कराया।",
    "[00:01:25.000] अशोक जी दीवार पर बनी 'चौक' पेंटिंग के बारे में बताते हैं। आदिवासी परंपराओं में शादी के समय ऐसी रस्म वाली पेंटिंग बनाई जाती है।",
    "[00:01:44.000] यह पेंटिंग पूरी रस्म को दर्शाती है, जिसमें उनके देवता हीरो-हिमायु और नाचते हुए लोग होते हैं। यह शादी समारोह के लिए अनिवार्य है।",
    "[00:02:00.000] अशोक जी एक प्रसिद्ध कलाकार हैं, जो 'तारपा' नृत्य और वारली पेंटिंग के लिए विशेष रूप से जाने जाते हैं।",
    "[00:02:11.000] अशोक जी, आज हम क्या बना रहे हैं? इस डिश का नाम 'मऊरा भाजी' है।",
    "[00:02:18.000] हम 'बांगड़ा' (इंडियन मैकेरल) का उपयोग कर रहे हैं। हमारी बोली में हम इस तैयारी को मऊरा भाजी कहते हैं।",
    "[00:02:32.000] अशोक जी की पत्नी और उनकी माँ (आई), कलावती जी, आज हमारे लिए खाना बनाएंगी। रूरल रेसिपी में आपका स्वागत है।",
    "[00:02:59.000] वे सामग्री दिखाती हैं: हरी मिर्च का पेस्ट, हल्दी, स्थानीय मसाला, नमक और टमाटर।",
    "[00:03:06.000] एक मुख्य सामग्री इमली का पानी है, जो इसमें खास खट्टापन लाता है।",
    "[00:03:20.000] खाना बनाने की शुरुआत सोयाबीन तेल गरम करने से होती है। वे प्याज भूनते हैं और फिर कद्दूकस किया हुआ लहसुन डालते हैं।",
    "[00:03:49.000] कड़ाही में कटे हुए टमाटर डाले जाते हैं।",
    "[00:04:05.000] अब मसाले डाले जाते हैं: हरी मिर्च का पेस्ट (जिसे स्थानीय स्तर पर चटनी कहा जाता है), मसाला पाउडर, हल्दी और नमक।",
    "[00:04:29.000] मसाले भुन जाने के बाद, वे इमली का पानी डालते हैं। यह काफी खट्टा व्यंजन होगा।",
    "[00:04:46.000] अब मछली डाली जाती है। दिलचस्प बात यह है कि वे मछली को तलते नहीं हैं; वे कच्चा बांगड़ा सीधे उबलती खट्टी ग्रेवी में डाल देते हैं।",
    "[00:04:56.000] यह पारंपरिक आदिवासी शैली है। इसे पूरी तरह पकने में करीब 15 मिनट लगेंगे।",
    "[00:05:08.000] इस रेसिपी के लिए किसी भी समुद्री मछली (मऊरा) का उपयोग किया जा सकता है, लेकिन आज हम इंडियन मैकेरल का उपयोग कर रहे हैं।",
    "[00:05:20.000] जब तक करी पक रही है, अशोक जी अन्य पारंपरिक नृत्यों के बारे में बात करते हैं जो वे करते हैं, जैसे घोड़ा नाच और गौरी नाच।",
    "[00:05:31.000] वे बताते हैं कि गौरी नाच डांडिया के समान है और ढोल के साथ किया जाता है। उन्होंने छत्तीसगढ़ और झारखंड में भी प्रस्तुति दी है।",
    "[00:05:40.000] ग्रेवी कम हो गई है और अच्छी तरह गाढ़ी हो गई है। रंग बहुत ही स्वादिष्ट लग रहा है।",
    "[00:06:01.000] इसे आग से उतारने का समय आ गया है। मऊरा भाजी तैयार है!",
    "[00:06:23.000] मैं अब चावल के साथ मऊरा भाजी चख रहा हूँ। इसका स्वाद लाजवाब है।",
    "[00:06:31.000] इमली इसे बहुत ही अनोखा और ताज़ा स्वाद देती है। यह वाकई स्वादिष्ट है।",
    "[00:06:49.000] धन्यवाद, अशोक जी। हमने इतने बहुमुखी कलाकार के साथ एक शानदार दिन बिताया। कृपया कमेंट में अपनी प्रतिक्रिया साझा करें।"
  ],
  "transcription_english": [
    "[00:00:13.000] Hello, Namaste, and welcome to Rural Recipes. We are exploring the rural areas of Palghar district in Maharashtra.",
    "[00:00:24.000] I am waiting for my guide. Here he comes! Good morning, Tukaram ji.",
    "[00:00:31.000] Tukaram tells me there's a small problem—they couldn't find fish at the market, so we'll have to buy it ourselves.",
    "[00:01:14.000] Tukaram introduces me to his friend, Ashok ji.",
    "[00:01:25.000] Ashok ji explains a 'Chowk' painting on the wall. In tribal traditions, when there is a wedding, such a ritualistic painting is created.",
    "[00:01:44.000] The painting captures the entire ritual, featuring their deities like Hiro-Himayu and people dancing. It is essential for wedding ceremonies.",
    "[00:02:00.000] Ashok ji is a renowned artist, particularly famous for the 'Tarpa' dance and Warli painting.",
    "[00:02:11.000] Ashok ji, what are we making today? The dish is called 'Moura Bhaji'.",
    "[00:02:18.000] We are using 'Bangda' (Indian Mackerel). In our dialect, we call the preparation Moura Bhaji.",
    "[00:02:32.000] Ashok ji's wife and his mother (Aai), Kalavati ji, will be cooking for us today. Welcome to Rural Recipes.",
    "[00:02:59.000] They show the ingredients: green chili paste, turmeric, local masala, salt, and tomatoes.",
    "[00:03:06.000] A key ingredient is tamarind water (imli pani), which provides the characteristic tanginess.",
    "[00:03:20.000] The cooking starts with heating soybean oil. They sauté onions and then add grated garlic.",
    "[00:03:49.000] Chopped tomatoes are added to the pan.",
    "[00:04:05.000] Now the spices go in: green chili paste (called chutney locally), masala powder, turmeric, and salt.",
    "[00:04:29.000] Once the spices are sautéed, they pour in the tamarind water. This will be quite a tangy preparation.",
    "[00:04:46.000] Now the fish is added. Interestingly, they don't fry the fish; they put the raw Bangda directly into the boiling tangy gravy.",
    "[00:04:56.000] This is the traditional tribal style. It will take about 15 minutes to cook thoroughly.",
    "[00:05:08.000] Any sea fish (Moura) can be used for this recipe, but today we are using Indian Mackerel.",
    "[00:05:20.000] While the curry simmers, Ashok ji talks about other traditional dances he performs, like Ghora Nach and Gauri Nach.",
    "[00:05:31.000] He explains that Gauri Nach is similar to Dandiya and is performed with drums. He has even performed in Chhattisgarh and Jharkhand.",
    "[00:05:40.000] The gravy has reduced and thickened nicely. The color looks very appetizing.",
    "[00:06:01.000] It's time to take it off the fire. The Moura Bhaji is ready!",
    "[00:06:23.000] I'm trying the Moura Bhaji now with rice. It tastes fantastic.",
    "[00:06:31.000] The tamarind gives it a very unique and refreshing flavor. It's truly delicious.",
    "[00:06:49.000] Thank you, Ashok ji. We spent a fantastic day with such a versatile artist. Please share your feedback in the comments."
  ]
}