{
  "metadata": {
    "title": "Naagli Bhakar | A Superfood Flatbread | Traditional Rural Recipe of Palghar, Maharashtra | #recipe",
    "channel_name": "Rural Recipes",
    "publish_date": "2025-02-24",
    "view_count": 258,
    "like_count": 10,
    "duration": "08:55",
    "original_audio_language": "Warli / Marathi / Hindi",
    "video_id": "V_k52MwBQjk",
    "url": "https://www.youtube.com/watch?v=V_k52MwBQjk",
    "description": "In this episode of Rural Recipes, we visit Ganjad village in Palghar, Maharashtra, at the home of the legendary Warli artist, Padma Shri Jivya Soma Mashe. We explore the artistic heritage of the Warli tribe and learn how to make 'Naagli Bhakar' (Finger Millet Flatbread), a traditional tribal superfood.",
    "ingredients_detected": [
      "Naagli (Finger Millet/Ragi) flour",
      "Water",
      "Urad Dal (Black Gram)",
      "Green Chilies",
      "Garlic",
      "White Sesame Seeds",
      "Salt"
    ]
  },
  "transcription_hindi": [
    "[00:00:12.000] देश के दूसरे हिस्से, पश्चिमी तट महाराष्ट्र में आपका स्वागत है।",
    "[00:00:20.000] मैं मुंबई-अहमदाबाद एक्सप्रेस हाईवे पर खड़ा हूं, जो देश का सबसे बड़ा एक्सप्रेस हाईवे है।",
    "[00:00:29.000] हम पालघर जिले में हैं और पश्चिमी महाराष्ट्र के इस अद्भुत आदिवासी क्षेत्र को एक्सप्लोर करेंगे।",
    "[00:00:39.000] हमारा उद्देश्य इस क्षेत्र की कुछ पारंपरिक रेसिपी आप तक पहुँचाना है।",
    "[00:00:55.000] चूंकि मैं इस क्षेत्र के बारे में ज्यादा नहीं जानता, मैंने स्थानीय गाइड तुकाराम से मदद मांगी है।",
    "[00:01:07.000] हम दहानू स्टेशन के पास गंजड गांव जा रहे हैं, जो एक प्रसिद्ध वारली चित्रकार का घर है।",
    "[00:01:24.000] हम जीव्या सोमा माशे के घर पहुँच गए हैं। उनके सम्मान में यहाँ एक स्मारक प्रतिमा बनाई गई है।",
    "[00:01:33.000] उन्हें 2011 में पद्म श्री से सम्मानित किया गया था और वे वारली पेंटिंग के अग्रदूत थे।",
    "[00:01:42.000] मूल रूप से यह कला दीवारों पर गोबर और चावल के पेस्ट से की जाती थी, जीव्या जी इसे कैनवास पर ले आए।",
    "[00:02:19.000] महान कलाकार के बेटे सदाशिव जी को मेरा नमस्ते।",
    "[00:02:24.000] हम उनके छात्र शांताराम जी से भी मिल रहे हैं। वे हमें मूल पेंटिंग दिखा रहे हैं जो प्रकृति पर आधारित हैं।",
    "[00:03:05.000] सदाशिव जी, आज आप कौन सी पारंपरिक रेसिपी बना रहे हैं? हम 'नागली भाकर' बना रहे हैं।",
    "[00:03:16.000] महाराष्ट्र में हम इसे भाकर कहते हैं। यह फिंगर मिलेट (रागी) के आटे से बनी रोटी है।",
    "[00:03:27.000] यह हमारी पारंपरिक 'डांगी थाली' का हिस्सा है। इसे बहुत स्वास्थ्यवर्धक और हमारा मुख्य भोजन माना जाता है।",
    "[00:03:35.000] मेरी पत्नी आज इसे बनाने की विधि दिखाएंगी। नागली महाराष्ट्र और गुजरात में काफी लोकप्रिय है।",
    "[00:03:53.000] क्या आप आज भी घर पर आटा बनाते हैं? हाँ, हम कम मात्रा के लिए पारंपरिक पत्थर की चक्की (जाता) का उपयोग करते हैं।",
    "[00:04:10.000] दो या तीन बार पीसने के बाद यह बारीक नागली का आटा तैयार हो जाता है।",
    "[00:04:27.000] लकड़ी की आग पर मिट्टी का तवा रखा गया है। आटे को गूंथने के लिए पानी मिलाया जाता है।",
    "[00:04:41.000] आटे में सीमित मात्रा में पानी मिलाया जाता है, और एक बार तवा गरम हो जाने पर वह भाकर को आकार देना शुरू करती हैं।",
    "[00:05:01.000] पकाते समय वह ऊपरी सतह पर थोड़ा पानी लगाती हैं ताकि यह समान रूप से पक सके।",
    "[00:05:12.000] एक बार एक साइड पक जाने पर वह इसे पलट देती हैं। इसे दोनों तरफ से अच्छी तरह सेंका जाता है।",
    "[00:05:32.000] क्या आटे में नमक डाला जाता है? नहीं, नमक या कुछ और नहीं डाला जाता, सिर्फ नागली और पानी।",
    "[00:05:44.000] क्या आप इसे साल भर खाते हैं? हाँ, हम साल भर हर दिन नागली खाते हैं। यह हर सुबह ताज़ा बनाई जाती है।",
    "[00:06:04.000] उच्च पोषण मूल्य के कारण यह स्तनपान कराने वाली माताओं और मजदूरों के लिए बहुत फायदेमंद है।",
    "[00:06:26.000] अब हम साइड डिश तैयार कर रहे हैं। हरी मिर्च, लहसुन, नमक और सफेद तिल के साथ तीखी चटनी बनाई जाती है।",
    "[00:06:51.000] हमारी नागली भाकर तैयार है! इसे काली उड़द दाल और मिर्च-लहसुन की चटनी के साथ परोसा जाता है।",
    "[00:07:06.000] यह बहुत स्वादिष्ट है! नागली भाकर काफी भारी और कैलोरी से भरपूर होती है।",
    "[00:07:29.000] इस बड़ी रोटी का आधा हिस्सा ही एक व्यक्ति का पेट लंबे समय तक भरने के लिए काफी है।",
    "[00:07:37.000] दाल बहुत बढ़िया है। दिलचस्प बात यह है कि रोटी में नमक भी नहीं है, फिर भी यह लाजवाब है।",
    "[00:07:51.000] तुकाराम बताते हैं कि वे जो भाषा बोल रहे हैं वह 'वारली' है, मानक मराठी नहीं।",
    "[00:08:06.000] उपयोग की गई काली दाल वही है जो दाल तड़का के लिए उपयोग की जाती है। यह एक साधारण लेकिन शक्तिशाली भोजन है।",
    "[00:08:11.000] सदाशिव जी और उनकी पत्नी को इस शानदार दिन और परंपरा को साझा करने के लिए धन्यवाद।",
    "[00:08:25.000] हम पालघर को एक्सप्लोर करना जारी रखेंगे और आपके लिए और भी रेसिपी लेकर आएंगे।",
    "[00:08:40.000] रूरल रेसिपी देखने के लिए धन्यवाद!"
  ],
  "transcription_english": [
    "[00:00:12.000] Welcome to the other side of the country. We are on the western coast, in Maharashtra.",
    "[00:00:20.000] I am standing on the Mumbai-Ahmedabad Express Highway, the biggest express highway in the country.",
    "[00:00:29.000] We are in the Palghar district and we will be exploring this wonderful tribal region in Western Maharashtra.",
    "[00:00:39.000] We aim to bring you some of the traditional recipes from this area.",
    "[00:00:55.000] Since I don't know much about this region, I've requested a local guide named Tukaram to help us explore.",
    "[00:01:07.000] We are traveling to Ganjad village near Dahanu station, specifically to the house of a famous Warli painter.",
    "[00:01:24.000] We have arrived at the home of Jivya Soma Mashe. A memorial statue has been erected here in his honor.",
    "[00:01:33.000] He was awarded the Padma Shri in 2011 and was the pioneer of Warli painting, a traditional tribal art form.",
    "[00:01:42.000] Originally done on walls using cow dung and rice paste, Jivya Soma Mashe took it from the walls to the canvas.",
    "[00:02:19.000] Namaste to Sadashiv ji, the son of the great artist.",
    "[00:02:24.000] We are also meeting Shantaram ji, his student. They show us original paintings depicting themes like the origin of life and nature.",
    "[00:03:05.000] Sadashiv ji, tell us about the traditional recipe you are making today. We are making 'Naagli Bhakar'.",
    "[00:03:16.000] In Maharashtra, we call it Bhakar. It's a flatbread made from finger millet flour.",
    "[00:03:27.000] It is part of our traditional 'Dangi Thali'. It's considered very healthy and is our staple bread.",
    "[00:03:35.000] My wife will demonstrate the preparation today. Naagli is a kind of millet popular in Maharashtra and Gujarat.",
    "[00:03:53.000] Do you still make the flour at home? Yes, we use a traditional stone grinder (Jata) for small batches.",
    "[00:04:10.000] Two or three rounds of grinding result in this fine Naagli flour.",
    "[00:04:27.000] The traditional clay pan (tawa) is placed on the wood fire. Water is mixed with the flour to make a dough.",
    "[00:04:41.000] A measured amount of water is added to the flour, and once the tawa is hot, she begins shaping the bhakar.",
    "[00:05:01.000] She adds a little water to the top surface while cooking to ensure it cooks evenly.",
    "[00:05:12.000] Once one side is cooked, she flips it. It is cooked on both sides until it's done.",
    "[00:05:32.000] Is salt added to the dough? No, no salt or anything else is added, just millet and water.",
    "[00:05:44.000] Do you eat this year-round? Yes, we eat Naagli every day throughout the year. It's made fresh every morning.",
    "[00:06:04.000] It is particularly beneficial for nursing mothers and hard-working laborers due to its high nutritional value.",
    "[00:06:26.000] Now we are preparing the side dishes. A spicy chutney is made with green chilies, garlic, salt, and white sesame seeds.",
    "[00:06:51.000] Our Naagli flatbread is ready! It is served with black urad dal and the chili-garlic chutney.",
    "[00:07:06.000] This is very tasty! The Naagli Bhakar is quite heavy and calorie-dense.",
    "[00:07:29.000] Just half of this large bread is enough to fill a person for a long time.",
    "[00:07:37.000] The dal is excellent. One interesting thing is that the bread doesn't even contain salt, but it's delicious.",
    "[00:07:51.000] Tukaram explains that the language they are speaking is 'Warli', not standard Marathi.",
    "[00:08:06.000] The black dal used is the same variety used for Dal Tadka. It's a simple, rustic, yet powerful meal.",
    "[00:08:11.000] Thank you to Sadashiv ji and his wife for this wonderful day and for sharing your tradition.",
    "[00:08:25.000] We will continue to explore Palghar and bring you more traditional recipes and art from Western Maharashtra.",
    "[00:08:40.000] Thank you for watching Rural Recipes!"
  ]
}