{
  "metadata": {
    "title": "পাকন পিঠে ও চিতুই পিঠে | Pakon Pithe & Chitui Pithe",
    "channel_name": "Rural Recipes",
    "publish_date": "2024-02-23",
    "view_count": 298,
    "like_count": 32,
    "duration": "07:54",
    "original_audio_language": "Bengali",
    "video_id": "yscKhl5pIBc",
    "url": "https://www.youtube.com/watch?v=yscKhl5pIBc",
    "description": "In this episode of Rural Recipes, we visit Mathabhanga, Cooch Behar, to learn two unique traditional Bengali pithe recipes: Pakon Pithe and Chitui Pithe, both soaked in thick date palm jaggery milk.",
    "ingredients_detected": [
      "Flour (Maida)",
      "Semolina (Suji)",
      "Milk (Dudh)",
      "Date Palm Jaggery (Patali Gur)",
      "Sugar (Chini)",
      "Salt (Noon)",
      "Cardamom (Elach)",
      "Kheer (Condensed Milk for filling)",
      "Oil (for frying)",
      "Water"
    ]
  },
  "transcription_bengali": [
    "[00:00:10.000] নমস্কার রুরাল রেসিপি youtube চ্যানেলের মূল উদ্দেশ্য আমাদের দেশের ট্রেডিশনাল খাবারগুলোকে তুলে ধরা।",
    "[00:00:19.000] আমরা এখন রয়েছি কুচবিহার জেলার মাথাভাঙ্গা শহরে, দাঁড়িয়ে আছি সুতুঙ্গা নদীর ধারে।",
    "[00:00:29.000] সুতুঙ্গা এবং মানসাই এই দুটো নদী দিয়ে এই শহরটি চারদিক থেকে ঘেরা।",
    "[00:00:38.000] এখান থেকে দেখা যাচ্ছে মানসাই এর উপরে পঞ্চানন সেতু বা মানসাই ব্রিজ।",
    "[00:00:47.000] গ্রাম বাংলায় রয়েছে পিঠের হাজারো ভ্যারাইটি, দুটো ইউনিক পিঠের রেসিপি আপনাদের দেখাবো।",
    "[00:01:03.000] মুকুল কাকিমা তোমাকে আমাদের চ্যানেলে স্বাগত। অনেকদিন পরে এসছি।",
    "[00:01:10.000] তুমি তো দুটো রসের পিঠে বানাবে বলেছিল দুধে ভেজানো। হ্যাঁ ছাদে বানাবো।",
    "[00:01:25.000] আমি পাকন পিঠে বানাবো আর চিতই পিঠে বানাবো। দুইটাই দুধের মধ্যে ভিজাবো।",
    "[00:01:39.000] পাকন পিঠে বানাতে আমার লাগবে হচ্ছে ময়দা, পাটেলি গুড়, চিনি, নুন আর দুধের মধ্যে এলাচ।",
    "[00:01:54.000] এটা ক্ষীর আর এটা দুধ আছে; দুধ ক্ষীর করে পাটালি গুড় দিছি। এটা দিয়ে পুর করবো।",
    "[00:02:01.000] ময়দা দিয়ে চিনি দিয়ে একটা ডো বানাবো। পরিমাণমত চিনি নিলাম পরে নুন নিলাম।",
    "[00:02:15.000] এটা এখন একটু গরম জল দিয়ে মেখে নেব। ডো তৈরি হচ্ছে।",
    "[00:02:36.000] আমি এখন দুধটা গরম করবো। দুধের মধ্যে চিনি আর পাটালি দিয়ে দুধটাকে জাল করবো।",
    "[00:02:51.000] এখন পুলি বানাবো আর তার মধ্যেই পুরটা (ক্ষীর) দিয়ে দেবো।",
    "[00:03:05.000] একটা গ্লাস দিয়ে গোল গোল করে লুচির মতো কেটে নিচ্ছি।",
    "[00:03:25.000] দেড় লিটার দুধের মধ্যে আমি ২৫০ গ্রাম গুড় দিয়ে দিয়েছি। বেশ ঘন হবে কালারটাও চেঞ্জ হবে।",
    "[00:03:44.000] এলাচটা একটু থেত করে নেবো এলাচের দানাগুলো বের করে নেব।",
    "[00:03:55.000] এই রসটা তুমি একসঙ্গে বানিয়ে আলাদা আলাদা ভাগ করে নিলে। এলাচের গুঁড়ো দিয়ে দিচ্ছি।",
    "[00:04:05.000] রসটা বেশ সুন্দর দেখতে হয়েছে গাড়ো হয়েছে। এখন কড়াই বসালাম।",
    "[00:04:14.000] কড়াইতে তেল দেবো এখন কুলিগুলো ছেড়ে দিচ্ছি ভাজার জন্য।",
    "[00:04:35.000] এই যে এখন ভাজা হয়ে গেছে লাল লাল হয়ে গেছে। এখন এটা তুমি নামিয়ে নিচ্ছ।",
    "[00:04:43.000] নামিয়ে এখন এটা সঙ্গে সঙ্গে রসের মধ্যে দিয়ে দিচ্ছি। একটু ভিজে তারপরে করতে হবে।",
    "[00:05:01.000] পিঠে বাসি খেতেই বেশি ভালো লাগে। পাকন পিঠা আমাদের তৈরি হয়ে গেলো।",
    "[00:05:07.000] এবার আমরা চিতুই পিঠের দিকে যাচ্ছি। চিতই পিঠার জন্য আটা দিব, সুজি দিব।",
    "[00:05:15.000] সুজি বেশি লাগবে, ২০০ গ্রামের মতন সুজি আছে। ১০০ গ্রাম আটা নিব।",
    "[00:05:26.000] একটু নুন দিব স্বাদমত। এখন এটা জল দিয়ে ফেটে নেব।",
    "[00:05:37.000] ৩০ মিনিট ভিজিয়ে রাখতে হয় সুজিটাকে। এটা মাটির সরা, এটাতে ভাজতে হয়।",
    "[00:06:00.000] একটা বেগুনের বোঁটা দিয়ে তেলটা সরায় মেখে দিচ্ছি। না হলে পিঠে ওঠে না।",
    "[00:06:09.000] মিনিট পাঁচেক ঢেকে রাখতে হবে প্রত্যেকটা পিঠে হওয়ার জন্য।",
    "[00:06:39.000] এগুলো রেডি হয়ে গেল। এবার গুড় দুধের মিশ্রণে এগুলো ছেড়ে দেবো।",
    "[00:06:48.000] এটাকে আধা ঘন্টার মতো রসের মধ্যে রেখে দিতে হবে ভেজার জন্য।",
    "[00:06:54.000] আমি এখন একটু চেকে দেখব। আগে পাকন পিঠেটা খাচ্ছি।",
    "[00:07:08.000] একদম ঠিক বলেছ যে কালকে এটা আরো ভালো লাগবে কারণ রসটা ভেতরে ঢুকবে।",
    "[00:07:16.000] নেক্সট পিঠের জন্য রেডি সেটা হচ্ছে চিতই পিঠে। এটার টেস্টটা একটু আলাদা।",
    "[00:07:33.000] আপনাদের সঙ্গে আবার দেখা হবে অন্য কোন জায়গায় অন্য কোন রেসিপি নিয়ে। রুরাল রেসিপি দেখুন।"
  ],
  "transcription_english": [
    "[00:00:10.000] Welcome, the main objective of Rural Recipes is to showcase our country's traditional foods.",
    "[00:00:19.000] We are currently in Mathabhanga, Cooch Behar, standing by the Sutunga river.",
    "[00:00:29.000] This town is surrounded on four sides by the Sutunga and Mansai rivers.",
    "[00:00:38.000] From here, the Panchanan Setu or Mansai Bridge over the Mansai river is visible.",
    "[00:00:47.000] Bengal has thousands of Pithe varieties; we'll show you two unique recipes.",
    "[00:01:03.000] Mukul Kaki, welcome to our channel. I've visited after a long time.",
    "[00:01:10.000] You mentioned making two types of milk-soaked Pithe. We'll cook on the roof.",
    "[00:01:25.000] I'll make Pakon Pithe and Chitui Pithe. Both will be soaked in milk.",
    "[00:01:39.000] For Pakon Pithe, I need flour, date jaggery, sugar, salt, and cardamom in milk.",
    "[00:01:54.000] Here is kheer and milk; I've made condensed milk with jaggery for the filling.",
    "[00:02:01.000] I'll make a dough with flour and sugar. Adding sugar and a pinch of salt.",
    "[00:02:15.000] Now I'll knead it with warm water. The dough is getting ready.",
    "[00:02:36.000] Now I'll heat the milk. Adding sugar and jaggery to boil and thicken the milk.",
    "[00:02:51.000] I'll make the dumplings and place the kheer filling inside them.",
    "[00:03:05.000] I'm cutting them into circles using a glass, like small luchis.",
    "[00:03:25.000] I've added 250g of jaggery to 1.5 liters of milk. It will thicken and change color.",
    "[00:03:44.000] I'll crush the cardamom and extract the seeds for aroma.",
    "[00:03:55.000] You've made the syrup and divided it into two parts. Adding cardamom powder.",
    "[00:04:05.000] The syrup looks very nice and thick. Now I've placed the pan on the stove.",
    "[00:04:14.000] Adding oil to the pan and putting the dumplings in to deep fry.",
    "[00:04:35.000] They are now fried and have turned a nice reddish color. Taking them out.",
    "[00:04:43.000] After frying, I'm putting them immediately into the syrup to soak properly.",
    "[00:05:01.000] Pithe tastes best when eaten the next day. Pakon Pithe is now ready.",
    "[00:05:07.000] Now we're moving to Chitui Pithe. For this, I'll use flour and semolina.",
    "[00:05:15.000] More semolina is needed, about 200g. I'll take 100g of flour.",
    "[00:05:26.000] Adding salt to taste. Now I will whisk the batter with water.",
    "[00:05:37.000] The semolina needs to soak for 30 minutes. Baking them in a traditional clay mold.",
    "[00:06:00.000] Applying oil to the mold with an eggplant stem so the Pithe doesn't stick.",
    "[00:06:09.000] Each Pithe needs to be covered and cooked for about five minutes.",
    "[00:06:39.000] These are ready. Now I'll drop them into the milk and jaggery mixture.",
    "[00:06:48.000] These need to soak in the syrup for about half an hour.",
    "[00:06:54.000] I'll taste it now, starting with the Pakon Pithe.",
    "[00:07:08.000] You're right, it will taste even better tomorrow once the syrup soaks deep inside.",
    "[00:07:16.000] Ready for the next one, the Chitui Pithe. Its taste is quite unique.",
    "[00:07:33.000] See you again in another place with another recipe. Keep watching Rural Recipes."
  ]
}