{
  "metadata": {
    "title": "PALWA MACHHLI KI BHAJI | Catfish curry in Peanut Oil | Rural Recipes of Nashik, Maharastra",
    "channel_name": "Rural Recipes",
    "publish_date": "2025-09-06",
    "view_count": 124,
    "like_count": 4,
    "duration": "07:51",
    "original_audio_language": "Hindi / Marathi",
    "video_id": "ekIqMVra8Jg",
    "url": "https://www.youtube.com/watch?v=ekIqMVra8Jg",
    "description": "In this episode of Rural Recipes, we visit the Bada village in the tribal heartland of Nashik, Maharashtra, near the Gujarat border. We meet Ganpati ji and his family, who demonstrate the preparation of 'Palwa Machhli Ki Bhaji'. This traditional fish curry is made with Pangas catfish (Palwa), cooked in local peanut oil, and seasoned with a unique tribal masala blend containing coconut and coriander.",
    "ingredients_detected": [
      "Palwa Fish (Pangas Catfish)",
      "Singdana tel (Peanut Oil)",
      "Lashun (Garlic)",
      "Kanda (Onions)",
      "Adrak (Ginger)",
      "Tribal Masala (Coconut, Coriander, Cloves, Bay leaves mix)",
      "Mirchi Chatni (Green Chili Chutney)",
      "Haldi (Turmeric)",
      "Mota Namak (Rock Salt)",
      "Hara Dhaniya (Fresh Coriander Leaves)",
      "Garam Pani (Hot Water)"
    ]
  },
  "transcription_hindi": [
    "[00:00:14.000] रूरल रेसिपी यूट्यूब चैनल में आपका स्वागत है। हम महाराष्ट्र के सफर पर हैं और वर्तमान में हम",
    "[00:00:21.000] नासिक जिले के आदिवासी क्षेत्रों को कवर कर रहे हैं। जहाँ हम अभी खड़े हैं, वह तकनीकी रूप से महाराष्ट्र में है लेकिन गुजरात के बहुत करीब है।",
    "[00:00:30.000] पीछे दिखने वाला पहाड़ सापुतारा है, जो एक लोकप्रिय हिल स्टेशन है।",
    "[00:00:43.000] मैं अपने गाइड रतन जी का इंतज़ार कर रहा हूँ। रतन जी के आने के बाद,",
    "[00:00:48.000] हम यहाँ से श्रीभवन बाड़ा नामक गाँव जाएंगे और एक पारंपरिक रेसिपी का दस्तावेजीकरण करेंगे।",
    "[00:01:04.000] चलिए चलते हैं, लगभग 15-20 मिनट हो गए हैं। ठीक है।",
    "[00:01:23.000] तो गणपति जी, नमस्ते। स्वागत है।",
    "[00:01:33.000] आइए गणपति जी से पूछते हैं कि आज यहाँ क्या बन रहा है। तो गणपति जी, बताइए आप क्या बना रहे हैं।",
    "[00:01:37.000] मछली बना रहे हैं। पालवा मछली की भाजी तैयार कर रहे हैं।",
    "[00:01:42.000] इसे कौन बनाएगा? मेरी पत्नी। नमस्ते। जहाँ तक मुझे पता चला है, पालवा मछली मूल रूप से पंगास है, जो यहाँ लोकप्रिय है।",
    "[00:01:58.000] तो बहन जी, बताइए क्या-क्या चाहिए। लहसुन, प्याज, मसाले, अदरक।",
    "[00:02:03.000] यह वह मसाला है जिसे हम आदिवासी क्षेत्रों में उपयोग करते हैं—धनिया, फिर नारियल, सब एक साथ मिला हुआ।",
    "[00:02:11.000] और यहाँ ताज़ा धनिया पत्ती, हल्दी और मिर्च की चटनी है। वे इसे मिर्च की चटनी कहते हैं।",
    "[00:02:25.000] हम मूंगफली के तेल (सिंगदाना तेल) का उपयोग कर रहे हैं। और यह पालवा मछली है,",
    "[00:02:33.000] टुकड़ों में कटी हुई। इसे एक बार धोना होगा। हाँ। बड़ी मात्रा में बना रहे हैं क्योंकि मेहमान बहुत हैं।",
    "[00:03:07.000] आमतौर पर, आप इसे कड़ाही में बनाएंगे, लेकिन चूँकि यह बहुत ज़्यादा है, हम एक बड़े बर्तन का उपयोग कर रहे हैं।",
    "[00:03:36.000] तेल डाल रहे हैं। अब लहसुन डाल रहे हैं।",
    "[00:03:56.000] प्याज, अदरक। एक बार जब लहसुन का कच्चा स्वाद चला जाए, तो आदिवासी मसाला डाल रहे हैं।",
    "[00:04:02.000] इस स्थानीय आदिवासी मसाले में धनिया, नारियल, तेजपत्ता और लौंग है। अब मिर्च की चटनी डाल रहे हैं।",
    "[00:04:19.000] तीखी चटनी। अब थोड़ी हल्दी डाल रहे हैं।",
    "[00:04:32.000] अब पूरी मछली अंदर जाती है।",
    "[00:04:44.000] नमक डाल रहे हैं। मोटा खड़ा नमक इस्तेमाल किया जा रहा है।",
    "[00:05:02.000] दूसरी तरफ गर्म करने के लिए पानी रखा गया है। हम इसमें गर्म पानी डालेंगे।",
    "[00:05:09.000] पानी अब गर्म है। इसे अंदर डाल रहे हैं।",
    "[00:05:35.000] गणपति जी एक बहुत अच्छे संगीतकार भी हैं।",
    "[00:05:51.000] यह 'पावरी' नाम का वाद्य यंत्र है। यह काफी हद तक तारपा जैसा दिखता है। इसमें क्या अंतर है?",
    "[00:06:06.000] यह तारपा जैसा ही है लेकिन इसे बगल से बजाया जाता है।",
    "[00:06:19.000] यह अब तैयार है। धनिया पत्ती डाल रहे हैं। 6-7 मिनट हो गए हैं। आइए इसे बाहर निकाल कर देखते हैं।",
    "[00:06:37.000] रंग बहुत अच्छा आया है। यही प्रक्रिया और सामग्री अन्य मछलियों जैसे कतला के लिए भी इस्तेमाल की जा सकती है।",
    "[00:06:47.000] वे आमतौर पर चावल के साथ खाने के लिए थोड़ी ग्रेवी बनाते हैं। लोग इसे चावल के साथ पसंद करते हैं।",
    "[00:07:15.000] तो यह हमारा एपिसोड था, पालवा मछली की भाजी, बाड़ा गाँव से प्रस्तुत।",
    "[00:07:23.000] गणपति जी, इस अवसर के लिए बहुत-बहुत धन्यवाद। हमें कमेंट्स में बताएं कि आपको यह एपिसोड कैसा लगा।",
    "[00:07:35.000] अगर आपको हमारा कंटेंट पसंद आता है, तो कृपया सब्सक्राइब करें और शेयर करें। महाराष्ट्र के एक और गाँव में नई रेसिपी के साथ मिलते हैं। धन्यवाद!"
  ],
  "transcription_english": [
    "[00:00:14.000] Welcome to Rural Recipe YouTube channel. We are on a Maharashtra trail and currently we are covering the tribal areas of",
    "[00:00:21.000] Nashik district. Where we are standing right now is technically in Maharashtra but very close to Gujarat.",
    "[00:00:30.000] The mountain visible behind is Saputara, a popular hill station.",
    "[00:00:43.000] I am waiting for my guide, Ratan ji. After Ratan ji arrives,",
    "[00:00:48.000] we will go from here to a village called Bada, Shribhavan Bada, and document a traditional recipe.",
    "[00:01:04.000] Let's go, it's been about 15-20 minutes. Okay.",
    "[00:01:23.000] So Ganpati ji, Namaste. Welcome.",
    "[00:01:33.000] Let's ask Ganpati ji what is being prepared here today. So Ganpati ji, tell us what you are making.",
    "[00:01:37.000] Making fish. Preparing Palwa fish curry.",
    "[00:01:42.000] Who will make it? My wife. Namaste. From what I've learned, Palwa fish is basically Pangas, which is popular here.",
    "[00:01:58.000] So Sister, tell us what all is needed. Garlic, Onion, Spices, Ginger.",
    "[00:02:03.000] This is the spice we use in tribal areas—coriander, then coconut, all mixed together.",
    "[00:02:11.000] And here is fresh coriander leaves, turmeric, and chili chutney. They call it chili chutney.",
    "[00:02:25.000] We were using Peanut Oil (Singdana tel). And this is the Palwa fish,",
    "[00:02:33.000] cut into pieces. It needs to be washed once. Yes. Making a large quantity as there are many guests.",
    "[00:03:07.000] Usually, you would make it in a kadai, but because it's a lot, we are using a large pot.",
    "[00:03:36.000] Adding oil. Now adding garlic.",
    "[00:03:56.000] Onion, ginger. Once the raw flavor of garlic is gone, adding the tribal masala.",
    "[00:04:02.000] This local tribal masala has coriander, coconut, bay leaves, and cloves. Now adding the chili chutney.",
    "[00:04:19.000] Spicy chutney. Now adding some turmeric.",
    "[00:04:32.000] Now the whole fish goes in.",
    "[00:04:44.000] Adding salt. Coarse rock salt is being used.",
    "[00:05:02.000] There is water kept for heating on the other side. We will add hot water to this.",
    "[00:05:09.000] The water is hot now. Pouring it in.",
    "[00:05:35.000] Ganpati ji is also a very good musician.",
    "[00:05:51.000] This is the instrument called 'Pawari'. It looks quite like a Tarpa. What is the difference?",
    "[00:06:06.000] It's like a Tarpa but played from the side.",
    "[00:06:19.000] It's ready now. Adding coriander leaves. It's been 6-7 minutes. Let's take it out and see.",
    "[00:06:37.000] The color has come out well. This same process and ingredients can be used for other fish like Katla too.",
    "[00:06:47.000] They usually make some gravy to eat with rice. People enjoy it with rice.",
    "[00:07:15.000] So this was our episode, Palwa Machhli Ki Bhaji, presented from Bada village.",
    "[00:07:23.000] Ganpati ji, thank you very much for this opportunity. Tell us how you liked this episode in the comments.",
    "[00:07:35.000] If you like our content, please subscribe and share. See you in another village of Maharashtra with a new recipe. Thank you!"
  ]
}