{
  "metadata": {
    "title": "Pan Mouri | A Festive Delicacy | Traditional Rural Recipe of Palghar, Maharashtra | #recipe",
    "channel_name": "Rural Recipes",
    "publish_date": "2025-02-24",
    "view_count": 208,
    "like_count": 9,
    "duration": "08:29",
    "original_audio_language": "Hindi / Marathi / Warli",
    "video_id": "0ResoDfsfGo",
    "url": "https://www.youtube.com/watch?v=0ResoDfsfGo",
    "description": "In this episode of Rural Recipes, we visit Bapu Gaon in Palghar, Maharashtra, to meet renowned Warli artist Ramesh Singari. While exploring the thousands-of-years-old tribal art form of Warli painting, we document a unique regional festive delicacy: Pan Mouri. This simple yet symbolic steamed rice cake is prepared using Palash leaves and is traditionally made during festivals like Diwali.",
    "ingredients_detected": [
      "Rice Flour (Chawal ka Atta)",
      "Palash Leaves (Palash ke Patte)",
      "Water (Pani)",
      "Salt (Mith/Namak)"
    ]
  },
  "transcription_hindi": [
    "[00:00:12.000] तुकाराम जी, आज हम कहाँ जा रहे हैं? चूँकि आप महाराष्ट्र में हैं, हम पालघर के बापू गाँव जा रहे हैं।",
    "[00:00:18.000] हम रूरल रेसिपी के आज के एपिसोड के लिए एक प्रसिद्ध वारली कलाकार के घर जाएंगे।",
    "[00:00:35.000] हम बापू गाँव के एक प्रसिद्ध कलाकार रमेश सिंगारी के घर पहुँच गए हैं।",
    "[00:00:44.000] रमेश जी और आपकी पत्नी, रूरल रेसिपी में आपका स्वागत है। हम पहले वारली पेंटिंग के बारे में जानना चाहते हैं।",
    "[00:01:04.000] वारली पेंटिंग महाराष्ट्र की एक आदिवासी कला है जिसका इतिहास हज़ारों साल पुराना है।",
    "[00:01:10.000] रमेश जी 32 वर्षों से इसका अभ्यास कर रहे हैं और उन्होंने दो बार लंदन—2008 और 2016 में—अपनी कला की प्रदर्शनी की है।",
    "[00:01:22.000] वे बताते हैं कि पहले के समय में महिलाएँ खुशी या गम के समय ये पेंटिंग बनाती थीं; यह उनकी जीवनशैली का हिस्सा है।",
    "[00:01:44.000] वे एक अधूरी पेंटिंग दिखाते हैं जो पूर्वजों की कहानी बताती है। बुजुर्ग बच्चों को बताते हैं कि जब पूर्वज स्वर्ग में कंचे खेलते हैं, तो बिजली कड़कती है।",
    "[00:02:31.000] वे 'तारपा' भी दिखाते हैं, जो उनके प्रसिद्ध तारपा नृत्य के लिए उपयोग किया जाने वाला एक पारंपरिक वाद्य यंत्र है।",
    "[00:02:44.000] अब खाना पकाने की बारी। रमेश जी की पत्नी घर के बाहर पारंपरिक लकड़ी के चूल्हे पर तैयारी कर रही हैं।",
    "[00:03:06.000] आज हम 'पान मौरी' (या पान मोड़ी) बना रहे हैं। 'पान' का अर्थ है पत्ता और 'मोड़ी' का अर्थ है मोड़ना।",
    "[00:03:14.000] इसे पलाश के पत्ते के अंदर चावल के आटे की लोई रखकर और उसे मोड़कर बनाया जाता है।",
    "[00:03:25.000] यह विशेष रूप से दिवाली जैसे त्योहारों के दौरान बनाया जाता है। इसका अर्धचंद्राकार आकार उस समय दिखने वाले चंद्रमा के चरणों से प्रेरित है।",
    "[00:03:40.000] इसे बनाने के लिए, वे अपने खेतों में उगाए गए 'काली करजत' चावल का उपयोग करते हैं, जिसे पत्थर की चक्की (जाता) पर पीसा जाता है।",
    "[00:04:03.000] सामग्री बहुत सरल है: चावल का आटा, नमक और पानी। बस इतना ही।",
    "[00:04:15.000] ये वही पलाश के पत्ते हैं जिनका रमेश जी ज़िक्र कर रहे थे।",
    "[00:04:36.000] उनकी पत्नी एक बर्तन में चावल का आटा लेती हैं और स्वाद के लिए एक चुटकी नमक मिलाती हैं।",
    "[00:05:11.000] वह एक ऐसा आटा गूंथती हैं जो न तो बहुत पतला हो और न ही बहुत गाढ़ा। वह इसे पलाश के पत्ते पर फैलाती हैं।",
    "[00:05:24.000] आटे को फैलाने के बाद, वह पत्ते को मोड़ती हैं और उसे मजबूती से दबा देती हैं।",
    "[00:05:53.000] पानी का एक बर्तन पहले ही उबालने के लिए रखा गया है। वह भाप देने के लिए मुड़े हुए पत्तों को बर्तन में रखती हैं।",
    "[00:06:06.000] उन्होंने आज बहुत सारे बनाए हैं! इन्हें लगभग 25 से 30 मिनट तक भाप में पकाया जाएगा।",
    "[00:06:20.000] बर्तन को कसकर ढक दिया जाता है ताकि चावल के केक भाप में अच्छी तरह पक जाएं।",
    "[00:06:38.000] पान मौरी तैयार है! आप देख सकते हैं कि पत्तों का रंग बदल गया है, जो दर्शाता है कि वे पक गए हैं।",
    "[00:06:57.000] इसे उनके खेत में उगाई गई मूंग और पापड़ी (सेम) से बनी सब्जी (भाजी) के साथ परोसा जाता है।",
    "[00:07:19.000] यह व्यंजन बहुत ही अनोखा है और इसमें एक पारंपरिक स्वाद है। यह मिट्टी का सच्चा स्वाद है।",
    "[00:07:24.000] रमेश जी और आपकी पत्नी, आपकी मेहमाननवाज़ी और अपनी कला तथा भोजन हमारे साथ साझा करने के लिए बहुत-बहुत धन्यवाद।",
    "[00:07:47.000] कृपया कमेंट में अपनी प्रतिक्रिया साझा करें। हम तुकाराम जी के साथ पालघर की खोज जारी रखेंगे।",
    "[00:08:13.000] पर्यटकों के लिए, पास में सूर्या नदी पर भीम बांध है, जो घूमने के लिए एक बेहतरीन जगह है। धन्यवाद!"
  ],
  "transcription_english": [
    "[00:00:12.000] Tukaram ji, where are we heading today? Since you are in Maharashtra, we are going to Bapu Gaon in Palghar.",
    "[00:00:18.000] We will visit the home of a famous Warli artist to document today's episode of Rural Recipes.",
    "[00:00:35.000] We have arrived at the home of Ramesh Singari, a celebrated artist in Bapu Gaon.",
    "[00:00:44.000] Ramesh ji and your wife, welcome to Rural Recipes. We want to learn about Warli painting first.",
    "[00:01:04.000] Warli painting is a tribal art form of Maharashtra with a history spanning thousands of years.",
    "[00:01:10.000] Ramesh ji has been practicing for 32 years and has exhibited his work in London twice—in 2008 and 2016.",
    "[00:01:22.000] He explains that in the past, women made these paintings during times of joy or sorrow; it's vital to their lifestyle.",
    "[00:01:44.000] He shows a work-in-progress painting that tells a story about ancestors. Elders tell children that thunder and lightning occur when ancestors play marbles in the sky.",
    "[00:02:31.000] He also shows the 'Tarpa', a traditional tribal musical instrument used for their famous Tarpa dance.",
    "[00:02:44.000] Now, for the cooking. Ramesh ji's wife is setting up the traditional wood-fire 'Chulha' outside the house.",
    "[00:03:06.000] Today we are preparing 'Pan Mouri' (or Pan Modi). 'Pan' means leaf and 'Modi' means fold.",
    "[00:03:14.000] It is made by placing rice flour dough inside a Palash leaf and folding it.",
    "[00:03:25.000] This is specifically made during festivals like Diwali. Its crescent shape is inspired by the moon phases observed during that time.",
    "[00:03:40.000] To make this, they use 'Kali Karjat' rice grown in their own fields, which is ground into flour using a stone grinder (Jata).",
    "[00:04:03.000] The ingredients are very simple: rice flour, salt, and water. That's it.",
    "[00:04:15.000] These are the Palash leaves Ramesh ji was mentioning.",
    "[00:04:36.000] His wife takes the rice flour in a bowl and adds a pinch of salt for taste.",
    "[00:05:11.000] She adds water to make a dough that is neither too thin nor too thick. She spreads it on the Palash leaf.",
    "[00:05:24.000] After spreading the dough, she folds the leaf and presses it down firmly.",
    "[00:05:53.000] A pot of water has already been brought to a boil. She places the folded leaves into the pot for steaming.",
    "[00:06:06.000] She has made many of them today! They will be steamed for about 25 to 30 minutes.",
    "[00:06:20.000] The pot is covered tightly to ensure the rice cakes cook thoroughly in the steam.",
    "[00:06:38.000] The Pan Mouri is ready! You can see the color of the leaves has changed, indicating they are cooked.",
    "[00:06:57.000] This is served with a side dish (bhaji) made from moong and papadi (flat beans) grown on their farm.",
    "[00:07:19.000] The dish is very unique and has a rustic appeal. It's a true taste of the land.",
    "[00:07:24.000] Ramesh ji and your wife, thank you so much for your hospitality and for sharing your art and food with us.",
    "[00:07:47.000] Please share your feedback and suggestions in the comments. We will continue exploring Palghar with Tukaram ji.",
    "[00:08:13.000] For tourists, there is the Bhim Bandh on the Surya River nearby, which is a great place to explore. Thank you!"
  ]
}