{
  "metadata": {
    "title": "পটল লতির রসা | Pointed Gourd Stem Curry | Rural Recipes",
    "channel_name": "Rural Recipes",
    "publish_date": "2024-05-10",
    "view_count": 1124,
    "like_count": 43,
    "duration": "08:17",
    "original_audio_language": "Bengali",
    "video_id": "v7ymnQzB05g",
    "url": "https://www.youtube.com/watch?v=v7ymnQzB05g",
    "description": "In this episode, Rural Recipes visits Shikarpur village in Nadia, West Bengal, near the India-Bangladesh border. Local resident Mouma and her mother demonstrate a unique vegetarian delicacy: Potol Lotir Rosa. This dish uses tender stems of the pointed gourd plant, a regional specialty known for its slightly bitter, medicinal, and refreshing taste, typically served as a starter with steamed rice.",
    "ingredients_detected": [
      "Potol Loti (Tender Pointed Gourd Stems)",
      "Potol Pata (Pointed Gourd Leaves - for fritters)",
      "Alu (Potatoes)",
      "Begun (Eggplant)",
      "Kancha Pepe (Raw Papaya)",
      "Sorsher Tel (Mustard Oil)",
      "Panch Phoron (Bengali five-spice)",
      "Tejpata (Bay Leaf)",
      "Shukno Lonka (Dried Red Chili)",
      "Ada-Jeera-Kancha Lonka Bata (Ginger-Cumin-Green Chili Paste)",
      "Sorshe-Posto Bata (Mustard and Poppy Seed Paste)",
      "Matar Dal-er Bora (Yellow Split Pea Dumplings)",
      "Holud Guro (Turmeric Powder)",
      "Lobon (Salt)",
      "Chini (Sugar - a pinch)",
      "Gorom Jol (Warm Water)"
    ]
  },
  "transcription_bengali": [
    "[00:00:10.000] নিচু ক্লাসে ভূগোলের স্যার যখন দক্ষিণবঙ্গের নদীগুলোর নাম মুখস্ত করতে বলতো, তখন দামোদর, হুগলি ছাড়াও আর বেশ কিছু নাম আমাদের মুখস্ত করতে হতো।",
    "[00:00:22.000] সেখানে একটা নাম এসেছিল মাথাভাঙ্গা। আমি নিজে মাথাভাঙ্গার ছেলে আর এই মুহূর্তে আমি মাথাভাঙ্গা নদীর তীরে দাঁড়িয়ে রয়েছি।",
    "[00:00:31.000] নদীর উল্টো দিকটায় রয়েছে বাংলাদেশ। এখানে নদীটাই সীমানা। ভারত-বাংলাদেশ সীমান্ত থেকে আমরা চলে এসছি নদীয়া জেলার শিকারপুর গ্রামে।",
    "[00:01:05.000] এখানে নিরামিষ খাওয়ার একটা ভীষণ চল রয়েছে। মৌমা তোমাকে রুরাল রেসিপি চ্যানেলে স্বাগত। আজ তোমরা কি বানাচ্ছ?",
    "[00:01:27.000] আজ আমরা বানাবো পটল লতির রসা। পটলের খুব কচি লতিগুলো এখানে ব্যবহার করা হবে।",
    "[00:01:42.000] পটল আমরা নানান ভাবে খাই, কিন্তু এই অঞ্চলের মানুষরা পটলের লতিটাকে ব্যবহার করে একটা ইন্টারেস্টিং রেসিপি তৈরি করেছে।",
    "[00:01:50.000] প্রথমে লতিগুলোর আঁশ ছাড়িয়ে ছোট করে কেটে ধুয়ে রাখা হয়েছে। সাথে আলু, বেগুন আর কাঁচা পেঁপেও পাতলা করে কাটা আছে।",
    "[00:02:16.000] মশলা হিসেবে আছে আদা-জিরে-কাঁচা লঙ্কা বাটা আর সরষে-পোস্ত বাটা। সাথে সামান্য চিনি আর নুন-হলুদ লাগবে।",
    "[00:02:23.000] আমরা মটর ডালের বড়া করে রেখেছি। আপনারা চাইলে ছোলার ডাল বা বড়িও দিতে পারেন।",
    "[00:02:35.000] রান্না শুরু করি। আমরা কাঠের উনুনে রান্নাটা করবো। কড়াই গরম হলে সরষের তেল দিয়ে নিচ্ছি।",
    "[00:02:48.000] তেল গরম হলে শুকনো লঙ্কা, তেজপাতা আর পাঁচ ফোড়ন দিয়ে ফোরন দিতে হবে।",
    "[00:03:04.000] এবার ধুয়ে রাখা বেগুনগুলো দিয়ে হালকা করে ভেজে নেবো। এরপর আলু আর পেঁপেগুলো দিয়ে দিতে হবে।",
    "[00:03:36.000] ভাজার জন্য পরিমাণমতো নুন আর হলুদ দিয়ে দিচ্ছি।",
    "[00:03:58.000] সবজি হালকা ভাজা হলে এবার পটলের লতিগুলো দিয়ে দেবো। এগুলোকেও সবজির সাথে হালকা কষিয়ে নিতে হবে।",
    "[00:04:30.000] এবার আদা, জিরে আর কাঁচা লঙ্কা বাটা দিয়ে ভালো করে কষাবো যতক্ষণ না কাঁচা গন্ধটা যায়।",
    "[00:05:07.000] মশলা কষানো হলে জল দিয়ে দেবো। যেহেতু এটা রসা হবে তাই সবজি সেদ্ধ হওয়ার জন্য কিছুটা জল লাগবে।",
    "[00:05:38.000] সবজি সেদ্ধ হয়ে এলে আগে থেকে তৈরি করা মটর ডালের বড়াগুলো দিয়ে দেবো।",
    "[00:06:02.000] স্বাদের ব্যালেন্সের জন্য সামান্য চিনি আর সব শেষে সরষে-পোস্ত বাটা দিয়ে দেবো।",
    "[00:06:12.000] এক মিনিট ঢাকা দিয়ে রেখে দিলেই তৈরি। এর ফাঁকে মৌমা পটলের পাতার বড়াও করে দেখালো।",
    "[00:06:53.000] পটল লতির রসা তৈরি! এটি মূলত তেতো বা শুক্তো হিসেবে খাওয়ার শুরুতে পরিবেশন করা হয়।",
    "[00:07:36.000] স্বাদটা দারুণ! পটলের পাতার বড়াটাও খুব মুচমুচে হয়েছে।",
    "[00:07:48.000] মৌমা এবং তার মাকে অসংখ্য ধন্যবাদ। আমাদের চ্যানেলটি সাবস্ক্রাইব করবেন এবং ফিডব্যাক দেবেন। ধন্যবাদ!"
  ],
  "transcription_english": [
    "[00:00:10.000] In primary geography, when we memorized the rivers of South Bengal, we learned names like Damodar and Hooghly.",
    "[00:00:22.000] One such name was Mathabhanga. I am a son of Mathabhanga myself, and today I stand on its banks.",
    "[00:00:31.000] On the opposite side of this river is Bangladesh. Here, the river is the border. We've come to Shikarpur village in Nadia.",
    "[00:01:05.000] Vegetarianism is deeply rooted here. Welcome, Mouma, to the channel. What are you preparing today?",
    "[00:01:27.000] Today we will make 'Potol Lotir Rosa'. We will use the very tender stems of the pointed gourd plant.",
    "[00:01:42.000] We usually eat the fruit, but people here use the stems for an interesting recipe. They are even sold in markets.",
    "[00:01:50.000] First, the stems are peeled, cut, and washed. We also have thinly sliced potatoes, eggplant, and raw papaya.",
    "[00:02:16.000] Spices include ginger-cumin-chili paste and mustard-poppy seed paste. Some sugar, salt, and turmeric are also needed.",
    "[00:02:23.000] We have yellow split pea dumplings (bora) ready. You could also use chickpea dumplings or lentil 'bori'.",
    "[00:02:35.000] Let's start. We are cooking on a wood-fire 'unun'. Adding mustard oil to the hot pan.",
    "[00:02:48.000] Temper the oil with dried red chili, bay leaf, and panch phoron.",
    "[00:03:04.000] First, lightly fry the eggplants. Then add the potatoes and raw papaya.",
    "[00:03:36.000] Add salt and turmeric for frying.",
    "[00:03:51.000] Once the vegetables are lightly fried, add the tender pointed gourd stems (loti) and sauté them together.",
    "[00:04:30.000] Now add the ginger, cumin, and green chili paste and sauté until the raw smell disappears.",
    "[00:05:07.000] Pour in water. Since it's a 'Rosa', we need enough water for the vegetables to boil and soften.",
    "[00:05:38.000] Once the vegetables are boiled, add the pre-prepared split pea dumplings (bora).",
    "[00:06:02.000] Add a pinch of sugar for balance and finally the mustard-poppy seed paste.",
    "[00:06:12.000] Cover for one minute and it's done. Meanwhile, Mouma also made crispy pointed gourd leaf fritters.",
    "[00:06:53.000] Potol Lotir Rosa is ready! It is typically served as a slightly bitter starter with rice.",
    "[00:07:36.000] The taste is wonderful! The leaf fritters are also very crunchy and delicious.",
    "[00:07:48.000] Many thanks to Mouma and her mother. Please subscribe and share your feedback. Thank you!"
  ]
}