{
  "metadata": {
    "title": "RAAN BHAJI | Seasonal Greens with Lentils | Rural Recipes of Nashik, Maharastra",
    "channel_name": "Rural Recipes",
    "publish_date": "2025-09-06",
    "view_count": 539,
    "like_count": 14,
    "duration": "10:12",
    "original_audio_language": "Hindi / Marathi",
    "video_id": "fdHAL_1k0mA",
    "url": "https://www.youtube.com/watch?v=fdHAL_1k0mA",
    "description": "In this episode of Rural Recipes, we explore the tribal heartland of Nashik, Maharashtra, traveling to the remote village of Pimpalsond. We document 'Raan Bhaji', a legendary regional delicacy consisting of seasonal wild greens harvested during the first rains of the monsoon. These greens are known for their high medicinal and nutritional value. We showcase two preparations: 'Tera Bhaji' (a mix of 13 types of wild greens) and 'Koli Bhaji' (White Musli greens), cooked traditionally with homemade Mahua oil.",
    "ingredients_detected": [
      "Raan Bhaji (Wild Seasonal Greens - 13 types)",
      "Koli Bhaji (White Musli greens)",
      "Mahua Oil (Mohwa ka tel)",
      "Vaal/Varun (Split beans/Lentils)",
      "Lashun (Garlic)",
      "Hari Mirch Chutney (Stone-ground green chili and cumin)",
      "Adrak-Lashun Paste (Ginger-garlic paste)",
      "Jeera (Cumin seeds)",
      "Mohari (Mustard seeds)",
      "Haldi (Turmeric powder)",
      "Khada Namak (Rock salt)",
      "Pani (Water)"
    ]
  },
  "transcription_hindi": [
    "[00:00:12.000] नमस्ते, रूरल रेसिपी यूट्यूब चैनल में आपका स्वागत है। हम नासिक जिले के आदिवासी क्षेत्रों की खोज कर रहे हैं।",
    "[00:00:20.000] आज हम पिंपलसोंड नामक एक बहुत ही खास गाँव जा रहे हैं, जहाँ हम एक नहीं बल्कि दो रेसिपी पेश करेंगे।",
    "[00:00:37.000] सफर लंबा है लेकिन चारों तरफ हरियाली के साथ बहुत सुंदर है। हम गाँव पहुँच गए हैं।",
    "[00:00:54.000] हम 'रान भाजी' का दस्तावेजीकरण कर रहे हैं, जो एक महत्वपूर्ण आदिवासी रेसिपी है। ये जंगली साग मानसून की पहली सात दिनों के भीतर काटे जाते हैं।",
    "[00:01:07.000] रान भाजी महाराष्ट्र के आदिवासी क्षेत्र का एक सिग्नेचर आइटम है। स्थानीय लोग जंगल में मिलने वाली 25 से 30 विभिन्न प्रकार की जंगली पत्तियों का उपयोग करते हैं।",
    "[00:01:28.000] एक संस्करण 'तेरा भाजी' (13 प्रकार के साग) है। ग्रामीण इन सागों के आने पर 'रान भाजी उत्सव' मनाने के लिए इकट्ठा होते हैं।",
    "[00:01:47.000] ये साग होली तक उपलब्ध रहते हैं। प्रत्येक किस्म विटामिन, आयरन, कैल्शियम और खनिजों से भरपूर होती है, इसीलिए ये मुख्य भोजन हैं।",
    "[00:02:26.000] मेरे साथ रतन जी की माँ और पत्नी हैं। वे दो प्रकार की भाजी बनाएंगी: 'तेरा भाजी' और 'कोली भाजी'।",
    "[00:02:43.000] हम आज महुआ के तेल का उपयोग कर रहे हैं। वे फल को सुखाते हैं, बीजों को तोड़ते हैं और मशीन में तेल निकालते हैं—यह गाढ़ा और थोड़ा खट्टा होता है।",
    "[00:03:05.000] अन्य सामग्रियों में साबुत लहसुन, हरी मिर्च की चटनी (जीरे के साथ पिसी हुई मिर्च) और अदरक-लहसुन का पेस्ट शामिल है।",
    "[00:03:25.000] सबसे पहले, हम 'तेरा भाजी' बनाते हैं। उबलते पानी के एक बर्तन (तौली) में 13 प्रकार के साग डाले जाते हैं।",
    "[00:03:47.000] इसमें दाल (वाल/वरुण) डाली जाती है। इसे नरम होने तक 7 से 10 मिनट तक उबालना पड़ता है।",
    "[00:04:22.000] अब, हम उबले हुए साग में पत्थर पर पिसी हुई मिर्च की चटनी, जीरा और लहसुन मिलाते हैं।",
    "[00:04:50.000] एक अलग कदम में, महुआ का तेल गरम किया जाता है। गरम होने पर तड़के के लिए जीरा, राई और लहसुन डाला जाता है।",
    "[00:05:09.000] तेल गाढ़ा होता है और स्वाद बढ़ाने के लिए इसे अच्छी तरह उबालना पड़ता है। तड़के को साग के ऊपर डाल दिया जाता है।",
    "[00:05:28.000] तेरा भाजी तैयार है! यह बहुत अच्छी दिख रही है। चखने से पहले, हम स्थानीय मुखौटा बनाने की परंपरा के बारे में जानते हैं।",
    "[00:05:38.000] पिंपलसोंड 'भवड़ा' उत्सव में उपयोग किए जाने वाले 'सौगी' मुखौटों के लिए जाना जाता है, जो प्रकृति का जश्न मनाने वाली 250-300 साल पुरानी परंपरा है।",
    "[00:06:14.000] शिवराम जी 50 साल से ये मुखौटे बना रहे हैं। ये मुखौटे उत्सवों और गणतंत्र दिवस परेड जैसे राष्ट्रीय आयोजनों में भी दिखाए जाते हैं।",
    "[00:07:01.000] अब, दूसरी डिश: 'कोली भाजी' (सफेद मूसली का साग)। साग को छोटे टुकड़ों में काटकर धो लिया जाता है।",
    "[00:07:13.000] महुआ का तेल फिर से गरम किया जाता है। इसमें लहसुन, जीरा और मिर्च-अदरक-लहसुन की चटनी डाली जाती है।",
    "[00:08:04.000] थोड़ी हल्दी डाली जाती है, उसके बाद कोली साग। प्रक्रिया सरल है, बिल्कुल किसी भी अन्य पत्तेदार साग को पकाने की तरह।",
    "[00:08:17.000] खड़ा नमक डाला जाता है। पानी की ज़रूरत नहीं है; साग धीमी आँच पर अपनी नमी में ही पक जाएगा।",
    "[00:08:37.000] यह बहुत जल्दी पक जाता है। कोली भाजी तैयार है!",
    "[00:08:53.000] भोजन को 'भाकरी' (बाजरे की रोटी) के साथ परोसा जाता है। मैं पहले कोली भाजी चख रहा हूँ।",
    "[00:09:13.000] इसका स्वाद बहुत ही उच्च गुणवत्ता वाली हरी पत्तेदार सब्जी जैसा है। बहुत ही पौष्टिक।",
    "[00:09:40.000] दोनों तैयारियाँ उत्कृष्ट हैं। इस अनूठी परंपरा को साझा करने के लिए रतन जी और परिवार को धन्यवाद।",
    "[00:10:00.000] पिंपलसोंड गाँव से, हम अपने अगले एपिसोड में एक और अनूठी रेसिपी लाएंगे। रूरल रेसिपी देखते रहें!"
  ],
  "transcription_english": [
    "[00:00:12.000] Hello, good morning! Welcome to Rural Recipes. We are exploring the tribal areas of Nashik, Maharashtra.",
    "[00:00:20.000] Today we are traveling to a very special village called Pimpalsond, where we will present not one, but two recipes.",
    "[00:00:37.000] The journey is long but beautiful, with lush greenery everywhere. We've arrived at the village.",
    "[00:00:54.000] We are documenting 'Raan Bhaji', an important tribal recipe. These wild greens are harvested within the first seven days of the monsoon.",
    "[00:01:07.000] Raan Bhaji is a signature item of the Maharashtra tribal region. Locals use 25 to 30 different types of wild leaves found in the forest.",
    "[00:01:28.000] One version is 'Tera Bhaji' (meaning 13 greens). Villagers gather to celebrate a Raan Bhaji festival when these greens emerge.",
    "[00:01:47.000] These greens are available until Holi. Each variety is rich in vitamins, iron, calcium, and minerals, which is why they are a staple.",
    "[00:02:26.000] I'm joined by Ratan ji's mother and wife. They will cook two types: 'Tera Bhaji' and 'Koli Bhaji'.",
    "[00:02:43.000] We're using Mahua oil today. They dry the fruit, crack the seeds, and extract oil in a machine—it's thick and slightly tangy.",
    "[00:03:05.000] Other ingredients include whole garlic, green chili chutney (chilies ground with cumin), and ginger-garlic paste.",
    "[00:03:25.000] First, we make 'Tera Bhaji'. 13 types of greens are added to a pot (Tauli) of boiling water.",
    "[00:03:47.000] Sautéed lentils (Vaal/Varun) are added to the pot. It needs to boil for 7 to 10 minutes until soft.",
    "[00:04:22.000] Now, we add the stone-ground chili chutney, cumin, and garlic to the boiled greens.",
    "[00:04:50.000] In a separate step, Mahua oil is heated. When hot, cumin, mustard seeds, and garlic are added for tempering (tadka).",
    "[00:05:09.000] The oil is thick and needs to be boiled well to enhance its flavor. The tempering is poured over the greens.",
    "[00:05:28.000] The Tera Bhaji is ready! It looks wonderful. Before we taste, we learn about the local mask-making tradition.",
    "[00:05:38.000] Pimpalsond is known for 'Sawgi' masks used in the 'Bhavada' festival, a 250-300 year old tribal tradition celebrating nature.",
    "[00:06:14.000] Shivram ji has been making these masks for 50 years. These masks are used in festivals and even showcased at national events like the Republic Day parade.",
    "[00:07:01.000] Now, for the second item: 'Koli Bhaji' (White Musli greens). The greens are cut into small pieces and washed.",
    "[00:07:13.000] Mahua oil is heated again. Sautéed garlic, cumin, and the chili-ginger-garlic chutney are added.",
    "[00:08:04.000] A bit of turmeric is added, followed by the Koli greens. The process is simple, much like cooking any other leafy green.",
    "[00:08:17.000] Rock salt is added. No water is needed; the greens will cook in their own moisture on a low flame.",
    "[00:08:37.000] It cooks very quickly. The Koli Bhaji is ready!",
    "[00:08:53.000] The meal is served with 'Bhakar' (millet flatbread). I'm trying the Koli Bhaji first.",
    "[00:09:13.000] It tastes like a very high-quality green leafy vegetable. Very nutritious.",
    "[00:09:40.000] Both preparations are excellent. Thank you, Ratan ji and family, for sharing this unique tradition.",
    "[00:10:00.000] From Pimpalsond village, we will bring you one more unique recipe in our next episode. Keep watching Rural Recipes!"
  ]
}