{
  "metadata": {
    "title": "RANTI KOMRA | Stir-fried wild chicken specialty | Traditional Rural Recipes of Nashik, Maharastra",
    "channel_name": "Rural Recipes",
    "publish_date": "2025-09-06",
    "view_count": 320,
    "like_count": 8,
    "duration": "08:52",
    "original_audio_language": "Dangi / Marathi / Hindi",
    "video_id": "Ie9HJnF2Cac",
    "url": "https://www.youtube.com/watch?v=Ie9HJnF2Cac",
    "description": "In this episode, Rural Recipes explores the tribal village of Chichpara in Surgana, Nashik. Chichpara, meaning 'Tamarind Village', is the setting for a traditional preparation of 'Ranti Komra' (Wild Chicken). We document the use of rare Khursani (Niger Seed) oil and traditional Dangi tribal culture, including unique musical instruments like the Thali Gana and Dhak.",
    "ingredients_detected": [
      "Ranti Komra (Wild/Jungle Chicken)",
      "Khursani Oil (Niger Seed Oil)",
      "Kanda (Onions - sliced)",
      "Lashun (Garlic - crushed)",
      "Adrak (Ginger - crushed)",
      "Kadi Patta (Fresh Curry Leaves)",
      "Rai (Mustard Seeds)",
      "Tikhat Mith (Homemade tribal spice blend)",
      "Haldi (Turmeric Powder)",
      "Lal Mirch Powder (Red Chili Powder)",
      "Namak (Salt)",
      "Hara Dhaniya (Fresh Coriander Leaves)",
      "Garam Pani (Hot Water)"
    ]
  },
  "transcription_hindi": [
    "[00:00:11.000] सुप्रभात! रूरल रेसिपी यूट्यूब चैनल में आपका स्वागत है।",
    "[00:00:15.000] हम नासिक जिले के आदिवासी क्षेत्रों की खोज कर रहे हैं।",
    "[00:00:18.000] हम अब सुरगाना में हैं और यहाँ की कुछ पारंपरिक रेसिपीज़ का दस्तावेजीकरण करेंगे।",
    "[00:00:24.000] यहाँ से हम एक छोटे से गाँव चीजपाड़ा जाएंगे और वहाँ की एक पारंपरिक चिकन रेसिपी दिखाएंगे।",
    "[00:00:48.000] हम दिनेश जी के घर पहुँच गए हैं। इस गाँव का नाम बहुत दिलचस्प है—चीजपाड़ा।",
    "[00:00:53.000] स्थानीय भाषा में इमली को 'चीज' कहा जाता है, और यहाँ कभी इमली के बहुत सारे पेड़ थे, इसलिए इसका नाम यह पड़ा।",
    "[00:01:02.000] दिनेश जी, आज आपके घर में क्या बन रहा है?",
    "[00:01:04.000] रंटी कोमड़ा। यह जंगल में रहने वाला मुर्गा है। हम इसे खुद जाकर पकड़ते हैं।",
    "[00:01:12.000] तो यह जंगली मुर्गा है! और आज रसोइया कौन होगा? मेरी पत्नी।",
    "[00:01:19.000] नमस्ते! इनका नाम सोनी दिनेश भोये है।",
    "[00:01:30.000] ये दिनेश के पिता पोपट जी हैं। ये कई आदिवासी वाद्ययंत्र बजाते हैं। पोपट जी, यह कौन सा वाद्ययंत्र है?",
    "[00:01:46.000] यह 'थाली गाना' है। यह एक विशिष्ट प्रकार की घास से बना होता है।",
    "[00:01:53.000] इसका काला चिपकने वाला हिस्सा मधुमक्खी के मोम (beeswax) से बना होता है।",
    "[00:02:00.000] और यह दूसरा वाद्ययंत्र 'ढाक' है। इसे पैर से बाँधकर रात में शादियों के दौरान बजाया जाता है।",
    "[00:02:14.000] यह जानवर की खाल से बना होता है और इसमें 'खैर' की लकड़ी का उपयोग किया जाता है।",
    "[00:02:32.000] आज की तैयारी में जंगली मुर्गे का उपयोग किया जा रहा है, जिसे रंटी कोमड़ा कहते हैं। इसे पकड़ने के लिए वे मछली पकड़ने वाले जाल की तरह एक विशेष जाल का उपयोग करते हैं।",
    "[00:02:49.000] आइए सामग्री को समझते हैं। हम अपने ही खेतों के 'खुरसानी' तेल (नाइजर सीड ऑयल) का उपयोग कर रहे हैं।",
    "[00:03:02.000] नासिक प्याज के लिए प्रसिद्ध है, इसलिए हमारे पास प्रचुर मात्रा में प्याज, लहसुन, अदरक, धनिया और कड़ी पत्ता है।",
    "[00:03:17.000] मसालों के लिए हमारे पास 'तिखट मीठ' (घर का बना मसाला), हल्दी, नमक, लाल मिर्च पाउडर और राई है।",
    "[00:03:36.000] इसका मांस काफी चर्बी वाला होता है। खुरसानी तेल काफी अनोखा है; यह हिमालयी क्षेत्रों में उपयोग किए जाने वाले तीखे तेल के समान है।",
    "[00:03:57.000] सबसे पहले, वह गर्म तेल में कड़ी पत्ता और राई डालती हैं, उसके बाद प्याज।",
    "[00:04:09.000] प्याज के हल्का लाल होने पर, वह कुचला हुआ अदरक और लहसुन का पेस्ट डालती हैं।",
    "[00:04:23.000] मांस बनाने की बुनियादी प्रक्रिया समान है, लेकिन यहाँ राई, कड़ी पत्ता और स्थानीय मसाला इसे अलग बनाते हैं।",
    "[00:04:44.000] अब वह तीखेपन के लिए मसाले डालती हैं: घर का बना मसाला, हल्दी, रंग के लिए लाल मिर्च पाउडर और नमक।",
    "[00:05:19.000] अब जंगली मुर्गा बर्तन में जाता है। आप देख सकते हैं कि इसमें काफी प्राकृतिक चर्बी है।",
    "[00:05:40.000] इसे तेज़ आँच पर पकाने की ज़रूरत है। वह हर कुछ मिनटों में इसे चलाती हैं ताकि चर्बी पिघलकर मांस पर अच्छी तरह लग जाए।",
    "[00:06:06.000] अब प्राकृतिक चर्बी पिघल रही है और करी में अपना तेल छोड़ रही है।",
    "[00:06:20.000] तेज़ आँच पर 15 मिनट भूनने के बाद, वह बर्तन में गर्म पानी डालती हैं।",
    "[00:06:42.000] भूनने से मांस आधा पक चुका है, इसलिए इसे नरम होने में अब ज़्यादा समय नहीं लगेगा।",
    "[00:06:50.000] यह गाँव पूरी तरह से आदिवासी है। यहाँ लगभग 95 परिवार हैं, लगभग 450 लोग रहते हैं।",
    "[00:07:07.000] यहाँ बोली जाने वाली भाषा 'डांगी' है, जो महाराष्ट्र और गुजरात के सीमावर्ती बेल्ट में उपयोग की जाने वाली एक बोली है।",
    "[00:07:20.000] कुछ लोग कोंकणी भी बोलते हैं। व्यंजन लगभग तैयार है।",
    "[00:07:45.000] अंत में, वह गार्निश के रूप में ताज़ा धनिया पत्ती डालती हैं।",
    "[00:08:01.000] हमारा रंटी कोमड़ा तैयार है! मैं इसे अभी चख रहा हूँ।",
    "[00:08:11.000] इसका टेक्सचर देसी मुर्गे जैसा है लेकिन स्वाद बहुत गहरा और जंगली है। यह बहुत ही स्वादिष्ट है।",
    "[00:08:27.000] सोनी और दिनेश, इस पारंपरिक रेसिपी के लिए धन्यवाद। यह दोपहर के भोजन का एक शानदार अनुभव था।",
    "[00:08:35.000] हम आपसे महाराष्ट्र के एक और गाँव में नई रेसिपी के साथ मिलेंगे। धन्यवाद!"
  ],
  "transcription_english": [
    "[00:00:11.000] Good morning! Welcome to the Rural Recipes YouTube channel.",
    "[00:00:15.000] We are exploring the tribal areas of Nashik district.",
    "[00:00:18.000] We are now in Surgana and we will be documenting some of the traditional recipes here.",
    "[00:00:24.000] From here, we will go to Chichpara, a small village, and document a traditional chicken recipe.",
    "[00:00:48.000] We have arrived at the home of Dinesh ji. This village has an interesting name—Chichpara.",
    "[00:00:53.000] Locally, tamarind is called 'Chich', and since there were many tamarind trees here once, it got this name.",
    "[00:01:02.000] Dinesh ji, what is being prepared in your home today?",
    "[00:01:04.000] Ranti Komra. It's a chicken that lives in the wild/jungle. We go and catch it ourselves.",
    "[00:01:12.000] So this is wild chicken! And who will be the cook today? My wife.",
    "[00:01:19.000] Namaste! Her name is Soni Dinesh Bhoye.",
    "[00:01:30.000] This is Popat ji, Dinesh's father. He plays many tribal instruments. Popat ji, what is this instrument?",
    "[00:01:46.000] This is the 'Thali Gana'. It is made from a specific type of grass.",
    "[00:01:53.000] The black adhesive part is made from honeycomb beeswax.",
    "[00:02:00.000] And this other instrument is the 'Dhak'. It is strapped to the leg and played during weddings at night.",
    "[00:02:14.000] It is made of animal hide and the wood used is 'Khair' wood.",
    "[00:02:32.000] Today's preparation uses wild chicken, called Ranti Komra. They use a special net to catch it, just like fishing.",
    "[00:02:49.000] Let's understand the ingredients. We are using 'Khursani' oil (Niger Seed Oil) from our own fields.",
    "[00:03:02.000] Nashik is famous for onions, so we have plenty of onions, garlic, ginger, coriander, and curry leaves.",
    "[00:03:17.000] For spices, we have 'Tikhat Mith' (homemade masala), turmeric, salt, red chili powder, and mustard seeds.",
    "[00:03:36.000] The meat is very fatty. Khursani oil is quite unique; it's similar to the pungent oil used in Himalayan regions.",
    "[00:03:57.000] First, she adds curry leaves and mustard seeds to the hot oil, followed by the onions.",
    "[00:04:09.000] Once the onions turn slightly red, she adds the crushed ginger and garlic paste.",
    "[00:04:23.000] The basic process of making meat is similar, but here the mustard seeds, curry leaves, and local masala make it different.",
    "[00:04:44.000] Now she adds the spices for heat: the homemade masala, turmeric, red chili powder for color, and salt.",
    "[00:05:19.000] Now the wild chicken goes into the pot. You can see it has a lot of natural fat (charbi).",
    "[00:05:40.000] This needs to cook on high flame. Every few minutes she stirs it to ensure the fat melts and coats the meat.",
    "[00:06:06.000] The natural fat is melting now and releasing its own oil into the curry.",
    "[00:06:20.000] After 15 minutes of frying on high flame, she adds hot water to the pot.",
    "[00:06:42.000] The meat is partially cooked from frying, so it won't take much longer to become tender.",
    "[00:06:50.000] This village is entirely tribal. There are about 95 families, roughly 450 people living here.",
    "[00:07:07.000] The language spoken here is 'Dangi', a dialect used in the border belt of Maharashtra and Gujarat.",
    "[00:07:20.000] Some people also speak Konkani. The dish is almost ready.",
    "[00:07:45.000] Finally, she adds fresh coriander leaves as a garnish.",
    "[00:08:01.000] Our Ranti Komra is ready! I am trying it now.",
    "[00:08:11.000] It has the texture of country chicken but the flavor is much deeper and more gamy. It is very flavorful.",
    "[00:08:27.000] Thank you, Soni and Dinesh, for this traditional recipe. It was an excellent lunch experience.",
    "[00:08:35.000] We will see you in another village of Maharashtra with a new recipe. Thank you!"
  ]
}