{
  "metadata": {
    "title": "SEWRA BHAJI | A Seasonal Delicacy | From The Heart Of Tribal Forest",
    "channel_name": "Rural Recipes",
    "publish_date": "2025-09-06",
    "view_count": 533,
    "like_count": 21,
    "duration": "08:04",
    "original_audio_language": "Hindi / Marathi",
    "video_id": "l5WOKEOKD_4",
    "url": "https://www.youtube.com/watch?v=l5WOKEOKD_4",
    "description": "In this episode of Rural Recipes, we explore the tribal heartland of Maharashtra, traveling to the village of Dodhare. We meet Mukund ji, a social worker and traditional Pavri dancer, to document the preparation of 'Sewra Bhaji' (also referred to as Shevra Bhaji). This seasonal wild vegetable emerges with the first rains and requires careful cleaning and specific traditional cooking techniques.",
    "ingredients_detected": [
      "Sewra (Wild seasonal vegetable)",
      "Bondara Leaves (for throat safety)",
      "Soybean Oil",
      "Lashun (Garlic)",
      "Mohari (Mustard Seeds)",
      "Jeera (Cumin Seeds)",
      "Haldi (Turmeric Powder)",
      "Lal Chatni (Red Chili Chutney)",
      "Pyaz ka masala (Onion Masala)",
      "Mixed Masala",
      "Mith (Salt)",
      "Nagali Flour (for Roti)",
      "Pani (Water)"
    ]
  },
  "transcription_hindi": [
    "[00:00:12.000] नमस्ते, आदाब। हम महाराष्ट्र के आदिवासी क्षेत्रों की खोज कर रहे हैं और पारंपरिक व्यंजनों का दस्तावेजीकरण कर रहे हैं।",
    "[00:00:19.000] आज हम लगभग एक घंटे की यात्रा करके डोधारे नामक गाँव जा रहे हैं।",
    "[00:00:27.000] हम वहाँ से आज का नया एपिसोड आपके लिए लेकर आएंगे।",
    "[00:00:43.000] मुकुंद जी आ गए हैं। नमस्ते! चलिए उनके घर चलते हैं।",
    "[00:00:52.000] आज हम 'शेवरा भाजी' (सेवरा भाजी) बना रहे हैं। हम इसे नागली (रागी) की रोटी के साथ खाएंगे।",
    "[00:01:04.000] जब बारिश शुरू होती है, तो कई जंगली पौधे प्राकृतिक रूप से उगते हैं। आदिवासी समुदाय विभिन्न 'भाजी' बनाने के लिए खाद्य किस्मों की कटाई करते हैं।",
    "[00:01:15.000] इनमें से एक है सेवरा।",
    "[00:01:20.000] इसे जंगल में खोजना थका देने वाला काम है, इसलिए मैं मुकुंद जी के फसल लेकर लौटने का इंतज़ार करूँगा।",
    "[00:01:34.000] आपको मिल गया? हाँ, यह सेवरा है। यह पहली बारिश के बाद उगना शुरू होता है।",
    "[00:01:42.000] क्या पूरे पौधे को खाया जा सकता है? नहीं, आपको ऊपर की पत्तियों को हटाना होगा और तनों को छीलना होगा।",
    "[00:01:53.000] एक विशिष्ट हिस्सा है जिसे आपको हटाना होगा क्योंकि इससे गले में खुजली या जलन हो सकती है।",
    "[00:02:06.000] यह केवल डेढ़ महीने के लिए उपलब्ध होता है। चलिए अब सेवरा भाजी तैयार करते हैं।",
    "[00:02:22.000] मुकुंद जी की पत्नी अब सब्जी को साफ कर रही हैं और काट रही हैं, अनचाहे हिस्सों को हटा रही हैं।",
    "[00:02:33.000] इस पीले हिस्से को हटाने की जरूरत है। ये अन्य पत्तियां क्या हैं? ये बोंडारा की पत्तियां हैं।",
    "[00:02:40.000] उन्हें इसलिए डाला जाता है ताकि सब्जी गले में न लगे। कभी-कभी अंबाडा की पत्तियों का भी इसी कारण से उपयोग किया जाता है क्योंकि वे बहुत खट्टी होती हैं।",
    "[00:02:56.000] आइए मसालों पर नज़र डालते हैं: सोयाबीन तेल, लहसुन, राई, जीरा, हल्दी, लाल मिर्च की चटनी और नमक।",
    "[00:03:13.000] हमारे पास दो प्रकार के घर के बने मसाले भी हैं: एक प्याज का मसाला और एक मिक्स मसाला, दोनों यहाँ आमतौर पर उपयोग किए जाते हैं।",
    "[00:03:33.000] यह सेवरा भाजी नागली रोटियों के साथ सबसे अच्छी लगती है।",
    "[00:03:53.000] मुकुंद जी 2011 से एक सामाजिक कार्यकर्ता हैं और एक पारंपरिक 'पावरी' नर्तक भी हैं।",
    "[00:04:07.000] पावरी नृत्य में, मैं शेर की भूमिका निभाता हूँ। एक शेर के रूप में अभिनय करने के लिए दो लोगों की आवश्यकता होती है—यह बहुत कठिन है और इसमें पूर्ण समन्वय की आवश्यकता होती है।",
    "[00:04:33.000] मैं इस प्रदर्शन के लिए समूह का नेता हूँ।",
    "[00:04:45.000] आइए प्रक्रिया को समझते हैं। साफ की गई सब्जी को धोया जाता है और फिर उबलते पानी में डाल दिया जाता है।",
    "[00:04:56.000] इसे 15 से 20 मिनट तक उबालने की जरूरत है। एक बार जब यह पूरी तरह से पक जाए और नरम हो जाए, तो इसे पारंपरिक लकड़ी के मथनी (रवि) का उपयोग करके मथने की आवश्यकता होती है।",
    "[00:05:11.000] हम इसे एक गाढ़े, सूप जैसी स्थिरता में मथते हैं। फिर हम हल्दी, लाल मिर्च की चटनी और नमक मिलाते हैं।",
    "[00:05:20.000] हम इसे फिर से मथते हैं ताकि यह सुनिश्चित हो सके कि सब कुछ पूरी तरह से मिल गया है।",
    "[00:05:31.000] यह लगभग तैयार है; अब तड़के के लिए। हम सोयाबीन तेल गर्म करते हैं और अपने खेतों का कुचला हुआ लहसुन डालते हैं।",
    "[00:05:49.000] तेल गर्म होने पर, हम लहसुन, फिर जीरा और फिर राई डालते हैं।",
    "[00:06:03.000] फिर हम घर का बना प्याज मसाला और मिक्स मसाला डालते हैं।",
    "[00:06:14.000] हम इस तड़के को मथी हुई सब्जी में डालते हैं और चलाते हैं।",
    "[00:06:35.000] हम वांछित गाढ़ापन पाने के लिए उबालने के चरण के बचे हुए पानी को वापस मिलाते हैं।",
    "[00:06:46.000] सेवरा भाजी अब तैयार है। हम इसे एक-दो मिनट के लिए उबलने देंगे और फिर आँच से उतार लेंगे।",
    "[00:07:05.000] हम इसे थोड़ा ठंडा होने देंगे। यह बहुत गर्म होने के बजाय थोड़ा ठंडा होने पर अधिक स्वादिष्ट लगता है।",
    "[00:07:22.000] मैं अब इसे नागली रोटी के साथ चख रहा हूँ। यह एक गाढ़ी तड़का दाल की तरह दिखती है।",
    "[00:07:28.000] यह बहुत स्वादिष्ट है! और यह गले में बिल्कुल भी नहीं चुभती है।",
    "[00:07:37.000] यह पारंपरिक महाराष्ट्र रेसिपी की आज की प्रस्तुति थी। हमारे साथ इसे साझा करने के लिए धन्यवाद, मुकुंद जी।",
    "[00:07:45.000] हम आपसे महाराष्ट्र के एक और गाँव में नई रेसिपी के साथ मिलेंगे। कृपया सब्सक्राइब करें और लाइक करें। धन्यवाद!"
  ],
  "transcription_english": [
    "[00:00:12.000] Hello, Namaste, Aadab. We are exploring the tribal areas of Maharashtra and documenting traditional recipes.",
    "[00:00:19.000] Today we are traveling about an hour to a village called Dodhare.",
    "[00:00:27.000] We will bring you today's new episode from there.",
    "[00:00:43.000] Mukund ji has arrived. Namaste! Let's go to his home.",
    "[00:00:52.000] Today we are making 'Shevra Bhaji' (Sewra Bhaji). We will have it with Nagali (finger millet) roti.",
    "[00:01:04.000] When the rains start, many wild plants grow naturally. Tribal communities harvest edible varieties to make different 'bhajis'.",
    "[00:01:15.000] One of these is Sewra.",
    "[00:01:20.000] Finding it in the forest is tiring, so I'll wait for Mukund ji to return with the harvest.",
    "[00:01:34.000] You found it? Yes, this is Sewra. It starts growing after the first rains.",
    "[00:01:42.000] Can the whole plant be eaten? No, you have to remove the top leaves and peel the stems.",
    "[00:01:53.000] There is a specific part you must remove because it can cause a stinging sensation in the throat.",
    "[00:02:06.000] It is only available for about a month and a half. Let's go prepare the Sewra Bhaji now.",
    "[00:02:22.000] Mukund ji's wife is now cleaning and cutting the vegetable, removing the unwanted parts.",
    "[00:02:33.000] This yellow part needs to be removed. What are these other leaves? These are Bondara leaves.",
    "[00:02:40.000] They are added so the vegetable doesn't sting the throat. Sometimes Ambada leaves are used for the same reason because they are very sour.",
    "[00:02:56.000] Let's look at the spices: Soybean oil, garlic, mustard seeds, cumin, turmeric, red chili chutney, and salt.",
    "[00:03:13.000] We also have two types of homemade masalas: an onion masala and a mixed masala, both commonly used here.",
    "[00:03:33.000] This Sewra Bhaji is best enjoyed with Nagali rotis.",
    "[00:03:53.000] Mukund ji is a social worker since 2011 and also a traditional 'Pavri' dancer.",
    "[00:04:07.000] In the Pavri dance, I perform as the lion. It requires two people to act as one lion—it's very difficult and requires perfect coordination.",
    "[00:04:33.000] I am the group leader for this performance.",
    "[00:04:45.000] Let's understand the process. The cleaned vegetable is washed and then put into boiling water.",
    "[00:04:56.000] It needs to boil for 15 to 20 minutes. Once it is fully cooked and soft, it needs to be mashed using a traditional wooden masher (Ravi).",
    "[00:05:11.000] We mash it into a thick, soup-like consistency. Then we add turmeric, red chili chutney, and salt.",
    "[00:05:20.000] We mash it again to ensure everything is mixed perfectly.",
    "[00:05:31.000] It's almost ready; now for the tempering (tadka). We heat soybean oil and add crushed garlic from our own fields.",
    "[00:05:49.000] Once the oil is hot, we add garlic, then cumin, and then mustard seeds.",
    "[00:06:03.000] Then we add the homemade onion masala and the mixed masala.",
    "[00:06:14.000] We pour this tempering into the mashed vegetable and stir.",
    "[00:06:35.000] We add back some of the reserved water from the boiling stage to reach the desired consistency.",
    "[00:06:46.000] The Sewra Bhaji is now ready. We'll let it simmer for a couple of minutes and then take it off the fire.",
    "[00:07:05.000] We'll let it cool slightly. It tastes better when it has cooled down a bit rather than being boiling hot.",
    "[00:07:22.000] I'm trying it now with Nagali roti. It looks like a thick Tadka Dal.",
    "[00:07:28.000] It's very tasty! And it doesn't sting the throat at all.",
    "[00:07:37.000] This was today's presentation of a traditional Maharashtra recipe. Thank you, Mukund ji, for sharing this with us.",
    "[00:07:45.000] We will see you in another village of Maharashtra with a new recipe. Please subscribe and like if you enjoyed this. Thank you!"
  ]
}