{
  "metadata": {
    "title": "শাউর চিংড়ি | Shaur Curry with Prawn | Rural Recipes",
    "channel_name": "Rural Recipes",
    "publish_date": "2024-07-07",
    "view_count": 251,
    "like_count": 13,
    "duration": "07:59",
    "original_audio_language": "Bengali",
    "video_id": "pzAJQA_-2Rw",
    "url": "https://www.youtube.com/watch?v=pzAJQA_-2Rw",
    "description": "In this episode, Rural Recipes visits Sarta village in West Midnapore to discover a unique regional vegetable called 'Shaur' (a variety of aquatic taro/colocasia). Local artisan Akhil Jana and his wife Shivani demonstrate how to prepare Shaur with Bagda Prawns in a rich, creamy gravy made with poppy seeds, melon seeds, and yogurt.",
    "ingredients_detected": [
      "Shaur (Aquatic Taro stems)",
      "Bagda Chingri (Prawns)",
      "Alu (Potatoes)",
      "Sorsher Tel (Mustard Oil)",
      "Posto Bata (Poppy seed paste)",
      "Char Magaj Bata (Melon seed paste)",
      "Tok Doi (Yogurt)",
      "Pyaj Bata (Onion paste)",
      "Ada Bata (Ginger paste)",
      "Tomato (chopped)",
      "Elach Bata (Cardamom paste)",
      "Shukno Lonka (Dried red chilies)",
      "Tejpata (Bay leaves)",
      "Holud Guro (Turmeric powder)",
      "Lonka Guro (Red chili powder)",
      "Chini & Lobon (Sugar & Salt)",
      "Jol (Water)"
    ]
  },
  "transcription_bengali": [
    "[00:00:10.000] আমরা চলে এসছি আপনাদের সামনে আমাদের নতুন এপিসোড তুলে ধরার জন্য।",
    "[00:00:18.000] এই মুহূর্তে আমরা রয়েছি পশ্চিম মেদিনীপুরের সবং ব্লকের সার্তা গ্রামে।",
    "[00:00:26.000] এই অঞ্চলের একটি বিখ্যাত আঞ্চলিক খাবার আপনাদের সামনে আজকে পরিবেশন করব - শাউড় চিংড়ি।",
    "[00:00:33.000] চিংড়ি মাছ তো বুঝলাম, এই শাউড়টা কি? জলা জায়গায় এটার চাষ হয়, যা মূলত গ্রীষ্মকালীন সবজি।",
    "[00:00:41.000] শীতকালে চাষ শুরু হয়, গ্রীষ্মকালে জল কমে গেলে ফলন তোলা হয়। জল বেড়ে গেলে আর চাষ হয় না।",
    "[00:00:54.000] আমরা এসছি অখিল জানার বাড়িতে, যিনি একজন সফল মাদুর শিল্পী ও উদ্যোক্তা।",
    "[00:01:14.000] অখিলদা জানাচ্ছেন, এটাকে সোলা কচু বা বাক্স কচুও বলা হয়। এই চত্বরে এর ব্যাপক চাষ হয়।",
    "[00:01:31.000] এই অঞ্চলে ধর্মীয় উৎসবে হাজার হাজার মানুষের খাবারের তালিকায় এটি প্রধান সবজি হিসেবে থাকে।",
    "[00:01:53.000] শাউরের মাঝখানের অংশটা মাখনের মতো নরম এবং কোনো চুলকানি থাকে না। মুখে দিলেই যেন গলে যায়।",
    "[00:02:11.000] ওনার স্ত্রী শিবানী জানা আমাদের এই রান্নাটি করে দেখাবেন।",
    "[00:02:22.000] শিবানীদি উপকরণগুলো দেখাচ্ছেন: শাউর আর আলু ছোট ছোট ডুমো করে কাটা।",
    "[00:02:30.000] রান্নায় লাগবে সরষের তেল, নুন, টমেটো কুচি, চিনি আর পোস্ত বাটা।",
    "[00:02:38.000] সাথে চার মগজ বাটা, লঙ্কা গুঁড়ো, হলুদ, আদা বাটা, শুকনো লঙ্কা আর তেজপাতা।",
    "[00:02:50.000] পেঁয়াজ বাটা, টক দই আর এলাচ বাটাও লাগবে। আমরা বাগদা চিংড়ি ব্যবহার করছি।",
    "[00:03:07.000] প্রথমে শাউর আর আলু নুন-হলুদ দিয়ে মাখিয়ে নিচ্ছেন।",
    "[00:03:19.000] কড়াই গরম হলে তেল দিয়ে শাউর আর আলুগুলো ভাজতে দিয়ে দিলেন।",
    "[00:03:38.000] ৫ মিনিট ভাজার পর এগুলো বেশ লালচে হয়ে এলে নামিয়ে নিলেন।",
    "[00:03:55.000] ওই তেলেই শুকনো লঙ্কা আর তেজপাতা ফোড়ন দিলেন।",
    "[00:04:08.000] সামান্য চিনি, ২ চামচ আদা বাটা আর পেঁয়াজ বাটা (২টি পেঁয়াজ) দিয়ে কষানো শুরু করলেন।",
    "[00:04:30.000] এরপর হলুদ, ঝালের জন্য লঙ্কা গুঁড়ো আর ২ চামচ টক দই দিয়ে দিলেন।",
    "[00:04:47.000] টমেটো কুচি আর বেশ অনেকটা চার মগজ ও পোস্ত বাটা দিয়ে দিলেন।",
    "[00:05:07.000] আধ চামচ নুন দিয়ে মশলা কষানো হলে ভাজা শাউর আর আলুগুলো দিয়ে দিলেন।",
    "[00:05:24.000] এবার চিংড়ি মাছগুলো দিয়ে দিলেন। চিংড়ি মাছ আলাদা করে না ভেজে সরাসরি মশলার সাথেই রান্না হবে।",
    "[00:05:40.000] চিংড়ি মাছগুলো লাল হয়ে গেছে। শেষে সুগন্ধের জন্য এলাচ বাটা দিয়ে দিলেন।",
    "[00:05:58.000] সামান্য চিনি আর খুব অল্প জল দিয়ে ঢাকা দিলেন। রান্নাটি প্রায় নিজের জলেই সেদ্ধ হবে।",
    "[00:06:15.000] গ্যাস বন্ধ করে শাউড় চিংড়ি নামিয়ে নেওয়া হলো। দেখতে দারুণ লোভনীয় হয়েছে।",
    "[00:06:27.000] এই গরমে শিবানীদির মেহনত সার্থক। চার মগজ, পোস্ত আর চিংড়ির কম্বিনেশনটা সুপারহিট হবেই।",
    "[00:06:45.000] খেয়ে দেখলাম, সত্যিই ফাটাফাটি খেতে হয়েছে! অসাধারণ স্বাদ।",
    "[00:06:55.000] উত্তরবঙ্গে কিন্তু শাউর বা সোলা কচু এভাবে রান্না হয় না; ওখানে মুগের ডাল দিয়ে বা কালোজিরে ফোড়নে ভাজা খাওয়া হয়।",
    "[00:07:25.000] অখিলদা এবং বৌদিকে অসংখ্য ধন্যবাদ এই গরমে আমাদের রেসিপিটি করে দেখানোর জন্য।",
    "[00:07:44.000] দেখা হবে অন্য কোনো গ্রামে অন্য কোনো রেসিপি নিয়ে। এটা রুরাল রেসিপি!"
  ],
  "transcription_english": [
    "[00:00:10.000] We are here to present our new episode to you.",
    "[00:00:18.000] Currently, we are in Sarta village in the Sabang block of West Midnapore.",
    "[00:00:26.000] We will feature a famous regional dish today called 'Shaur Chingri'.",
    "[00:00:33.000] I understand prawns (chingri), but what is this 'Shaur'? It is farmed here in marshy lands and is a summer vegetable.",
    "[00:00:41.000] Cultivation starts in winter in waterlogged areas, and the harvest is taken in summer. It's not grown when water levels rise.",
    "[00:00:54.000] We are at the house of Akhil Jana, a famous and successful Madur (mat) artisan and entrepreneur.",
    "[00:01:14.000] Akhil explains: Shaur is also known as 'Sola Kochu' or 'Baksho Kochu'. It is extensively farmed in this belt.",
    "[00:01:31.000] It is a primary vegetable during religious festivals where thousands are fed, as it makes curries very tasty.",
    "[00:01:53.000] The middle portion of Shaur is considered the 'prime' part—extraordinarily soft like butter and non-itchy.",
    "[00:02:11.000] It has no itchiness and melts in the mouth. His wife, Shivani Jana, will demonstrate the cooking.",
    "[00:02:22.000] Shivani explains the ingredients: Shaur and potatoes cut into small cubes.",
    "[00:02:30.000] We need mustard oil, salt, chopped tomatoes, sugar, and poppy seed paste.",
    "[00:02:38.000] We also use melon seed paste (char magaj), chili powder, turmeric, ginger paste, dried chilies, and bay leaves.",
    "[00:02:50.000] There is also onion paste, yogurt, and cardamom paste. We are using Bagda Prawns.",
    "[00:03:07.000] She starts by marinating the Shaur and potatoes with salt and turmeric.",
    "[00:03:19.000] Once the pan is hot, she adds oil and fries the Shaur and potatoes.",
    "[00:03:38.000] After 5 minutes, they have turned golden. She removes them from the pan.",
    "[00:03:55.000] She adds a bit more oil to the pan and tempers it with dried red chilies and bay leaves.",
    "[00:04:08.000] A pinch of sugar is added, followed by 2 spoons of ginger paste and onion paste (from 2 onions).",
    "[00:04:30.000] She adds turmeric, red chili powder, and 2 spoons of yogurt.",
    "[00:04:47.000] Chopped tomatoes and a generous amount of melon seed and poppy seed paste go in next.",
    "[00:05:07.000] Half a spoon of salt is added. Once the masala is sautéed, she adds the fried Shaur and potatoes.",
    "[00:05:24.000] Now she adds the prawns. Interestingly, they aren't fried separately but cooked directly in the masala.",
    "[00:05:40.000] Prawns don't take much time; they have already turned red. She adds cardamom paste at the end for aroma.",
    "[00:05:58.000] A touch more sugar and a very small amount of water are added. The dish is cooked almost in its own juices.",
    "[00:06:15.000] The gas is turned off and the 'Shaur Chingri' is served. It looks incredibly tempting.",
    "[00:06:27.000] Shivani's effort in this summer heat is worth it. The combination of melon seeds, poppy seeds, and prawns is always a hit.",
    "[00:06:45.000] I'm tasting it now. It's fantastic (fatafati)! Truly delicious.",
    "[00:06:55.000] I mentioned that in North Bengal, Shaur is eaten differently—either fried with nigella seeds or cooked with moong dal.",
    "[00:07:25.000] Many thanks to Akhil Babu and Shivani for demonstrating this recipe in this heat. Please share your feedback!",
    "[00:07:44.000] See you in another village with another recipe. This is Rural Recipes!"
  ]
}