{
  "metadata": {
    "title": "গুঁড়া মাছ দিয়ে সজনে পাতা-র ছ্যাঁকা | Tiny fishes cooked with Moringa leaves",
    "channel_name": "Rural Recipes",
    "publish_date": "2024-03-29",
    "view_count": 419,
    "like_count": 18,
    "duration": "08:02",
    "original_audio_language": "Bengali (Rajbangshi Dialect)",
    "video_id": "LJZ1PVVWPmY",
    "url": "https://www.youtube.com/watch?v=LJZ1PVVWPmY",
    "description": "In this episode, we visit the home of Bhaswati Barman, a popular Bhawaiya singer, to learn a traditional Rajbangshi dish: Gura Mach (tiny river fish) cooked with Sojne Pata (Moringa leaves) and Chhyaka (natural alkali).",
    "ingredients_detected": [
      "Sojne Pata (Moringa leaves)",
      "Kachu Pata (Taro leaves)",
      "Gura Mach (Tiny river fish: Mouka, Darka, Puti)",
      "Chhyaka/Khaar (Natural alkali from banana plant ash)",
      "Mustard Oil (Sorisar Tel)",
      "Garlic (Rosun)",
      "Green Chilies (Kancha Lonka)",
      "Turmeric (Holud)",
      "Salt (Lobon)",
      "Water"
    ]
  },
  "transcription_bengali": [
    "[00:00:10.200] রুরাল রেসিপি ইউটিউব চ্যানেলের একটা ব্র্যান্ড নিউ এপিসোড নিয়ে আমরা ফিরে এসছি।",
    "[00:00:17.500] আজকে আমি আছি একটা ভীষণ সুন্দর শান্ত গ্রামে, চারিদিকে ছায়াঘন পরিবেশ।",
    "[00:00:41.300] আজ আমি রান্না করিম গুড়া মাছ দিয়ে সোজনা পাতার ছ্যাকা।",
    "[00:01:00.400] এই গুড়া মাছগুলো ছোট নদী থেকে ধরা। এগুলোকে আমরা মৌকা মাছ, দাড়ি বা পুঁটি মাছ বলি।",
    "[00:01:14.200] মাছ ধরার জন্য আমরা 'জাকই' ব্যবহার করি আর মাছ রাখার ঝুড়িকে 'খোলই' বলি।",
    "[00:01:34.500] উপকরণের মধ্যে সজনে পাতার সাথে কিছু কচু পাতাও মিশিয়ে ধুয়ে রাখা আছে।",
    "[00:01:50.150] মাছগুলো নুন আর হলুদ দিয়ে আগে থেকেই মাখিয়ে রাখা হয়েছে।",
    "[00:02:17.400] কড়াই গরম হয়ে গেছে। এবার মাছ ভাজার জন্য সরিষার তেল দিয়ে নিচ্ছি।",
    "[00:02:39.200] মাছগুলো খুব কড়া বা খুব নরম নয়, মাঝারিভাবে ভেজে নিতে হবে।",
    "[00:03:10.500] মাছ ভাজা হয়ে গেছে, এবার এগুলোকে একটি পাত্রে নামিয়ে রাখছি।",
    "[00:03:25.300] ওই কড়াইতে আবার সামান্য তেল দিয়ে থেঁতো করা রসুন ফোরন দিয়ে লালচে করে ভেজে নেব।",
    "[00:03:41.200] এরপর চেরা কাঁচা লঙ্কাগুলো দিয়ে দিলাম। সুন্দর একটা গন্ধ বেরোচ্ছে।",
    "[00:03:48.450] এবার সজনে পাতা আর কচু পাতাগুলো কড়াইতে দিয়ে দুইবার নেড়ে নিতে হবে।",
    "[00:04:22.100] এবার দিচ্ছি 'ছ্যাকা' বা ক্ষার। এটি আঠিয়া কলার ছাইয়ের জল, যা রাজবংশী খাবারের সিক্রেট আইটেম।",
    "[00:04:42.200] ছ্যাকার সাথে পরিমাণমতো সাধারণ জল দিয়ে পাতাগুলো সেদ্ধ হতে দিতে হবে।",
    "[00:04:55.350] স্বাদমতো লবণ আর শিল্পাটায় বাটা মরিচ ও রসুন দিয়ে ভালো করে মিশিয়ে দিচ্ছি।",
    "[00:05:28.100] ভাস্বতী যে ট্রেডিশনাল পোশাকটি পরেছে তাকে 'পাটানি' বলা হয়।",
    "[00:05:40.400] এই পোশাকটি নিয়ে ভাস্বতী একটি ছোট রাজবংশী গানও গেয়ে শোনাল।",
    "[00:06:05.250] ছ্যাকা ঠিকমতো লেগেছে কিনা চেক করার জন্য হাতায় একটু হলুদ নিয়ে ঝোলে মেশাতে হয়; লাল হলে বুঝতে হবে তৈরি।",
    "[00:06:21.400] এবার আগে থেকে ভেজে রাখা মাছগুলো সব দিয়ে দিতে হবে।",
    "[00:06:40.100] ছ্যাকা পুরোপুরি তৈরি। এবার এটাকে আমরা গরম গরম নামিয়ে নেব।",
    "[00:07:10.300] ভাস্বতী বর্মন একজন রাজ্যস্তরের ভাওয়াইয়া শিল্পী, তিনি আমাদের রেসিপিটি সুন্দরভাবে করে দেখালেন।",
    "[00:07:33.500] আমাদের চ্যানেলটি সাবস্ক্রাইব করবেন এবং ভিডিওটি কেমন লাগলো কমেন্টে জানাবেন। ধন্যবাদ।"
  ],
  "transcription_english": [
    "[00:00:10.200] We've returned with a brand new episode of the Rural Recipes YouTube channel.",
    "[00:00:17.500] Today I am in a very beautiful, peaceful village surrounded by lush greenery.",
    "[00:00:41.300] Today I will cook tiny river fish (Gura Mach) with Moringa leaves (Sojne Pata) in an alkali broth.",
    "[00:01:00.400] These tiny fish are caught from small rivers. We call them Mouka, Dari, or Puti fish.",
    "[00:01:14.200] We use a 'Jakoi' trap to catch the fish and a 'Kholoi' basket to store them.",
    "[00:01:34.500] The main ingredients are Moringa leaves mixed with some Taro leaves, already washed.",
    "[00:01:50.150] The tiny fish have been marinated beforehand with salt and turmeric.",
    "[00:02:17.400] The pan is hot now. I am adding mustard oil to fry the fish.",
    "[00:02:39.200] The fish should be fried to a medium consistency—neither too crispy nor too soft.",
    "[00:03:10.500] The fish are fried; now I am taking them out into a bowl.",
    "[00:03:25.300] Adding a little more oil to the same pan to temper it with crushed garlic, frying it until reddish.",
    "[00:03:41.200] Now I have added the slit green chilies. It releases a wonderful aroma.",
    "[00:03:48.450] Add the Moringa and Taro leaves into the pan and stir them a couple of times.",
    "[00:04:22.100] Now adding 'Chhyaka' or alkali water made from banana plant ash—a secret Rajbangshi ingredient.",
    "[00:04:42.200] Add some plain water along with the alkali so that the leaves can boil and soften.",
    "[00:04:55.350] Adding salt to taste and a coarse paste of chilies and garlic ground on a stone (Shil-pata).",
    "[00:05:28.100] The traditional dress Bhaswati is wearing is called 'Patani'.",
    "[00:05:40.400] Bhaswati sang a short Rajbangshi song about this traditional attire.",
    "[00:06:05.250] To check if the alkali is perfect, mix a bit of turmeric on the spatula with the broth; if it turns red, it's ready.",
    "[00:06:21.400] Now add the previously fried tiny river fish back into the pan.",
    "[00:06:40.100] The Chhyaka is fully ready. Now we will serve it hot.",
    "[00:07:10.300] Bhaswati Barman is a state-level Bhawaiya singer who demonstrated this heritage recipe beautifully.",
    "[00:07:33.500] Please subscribe to our channel and let us know your feedback in the comments. Thank you."
  ]
}