{
  "metadata": {
    "title": "Wasta Chicken | Bamboo Shoot and Chicken Fusion | Traditional Rural Recipe of Palghar, Maharashtra |",
    "channel_name": "Rural Recipes",
    "publish_date": "2025-02-24",
    "view_count": 132,
    "like_count": 6,
    "duration": "09:47",
    "original_audio_language": "Hindi / Marathi / Warli",
    "video_id": "A4bhGhJ4VGM",
    "url": "https://www.youtube.com/watch?v=A4bhGhJ4VGM",
    "description": "In this episode of Rural Recipes, we explore the western coast of Maharashtra's Palghar district. After visiting the scenic Chinchani Beach and the historic Tarapur Fort, we arrive at the home of Warli artist Sanjay Parar in Vangaon. He and his wife demonstrate a rare regional specialty: 'Wasta Chicken'. This dish combines country chicken with 'Wasta' (fermented bamboo shoots) in a unique steam-cooking method that uses zero added water.",
    "ingredients_detected": [
      "Country Chicken (Desi Chicken)",
      "Wasta (Fermented Bamboo Shoots)",
      "Soybean Oil",
      "Kanda (Onions)",
      "Tamatar (Tomatoes)",
      "Adrak-Lashun Paste (Ginger-Garlic Paste)",
      "Hirvi Mirchi Chutney (Green Chili Paste)",
      "Tikhat Masala (Local spice blend)",
      "Halad (Turmeric Powder)",
      "Mith (Salt)",
      "Fresh Coriander Leaves"
    ]
  },
  "transcription_hindi": [
    "[00:00:11.000] रूरल रेसिपी यूट्यूब चैनल में आपका स्वागत है। महाराष्ट्र के इस आदिवासी जिले को एक्सप्लोर करते हुए हम इसके एक मुख्य आकर्षण: पश्चिमी तट पर आ गए हैं।",
    "[00:00:27.000] हम चिंचानी बीच पर हैं। यह जगह बहुत अच्छी तरह से जुड़ी हुई है; डहाणू स्टेशन 40 मिनट की दूरी पर है और मुंबई से यहाँ आने में सिर्फ 2 घंटे लगते हैं।",
    "[00:00:41.000] तुकाराम जी, चलिए वनगाँव चलते हैं। रास्ते में हमें एक और मुख्य आकर्षण मिला: तारापुर किला, जो समुद्र तट के बहुत करीब है।",
    "[00:01:07.000] हम एक और वारली कलाकार, संजय परार के घर पहुँच गए हैं।",
    "[00:01:18.000] संजय जी, रूरल रेसिपी में आपका स्वागत है। आपने बताया था कि आज आप हमारे लिए एक पारंपरिक व्यंजन बनाएंगे।",
    "[00:01:28.000] हम देसी चिकन का उपयोग करके 'वास्ता चिकन' बना रहे हैं। वास्ता हम बाँस के कोपलों (bamboo shoots) को कहते हैं।",
    "[00:01:36.000] बाँस के कोपल आमतौर पर बारिश के मौसम में निकलते हैं। चूँकि अभी जनवरी है, तो आपको ये कहाँ से मिले?",
    "[00:02:00.000] संजय समझाते हैं: इन्हें साल भर खाने के लिए, हम मानसून में इनकी कटाई करते हैं, उन्हें काटते हैं और नमक के साथ एक मटके (भरनी) में सुरक्षित रख देते हैं।",
    "[00:02:16.000] इस सुरक्षित वास्ता का उपयोग चिकन, सूखी मछली के साथ किया जा सकता है, या इसे साइड डिश के रूप में अकेले भी खाया जा सकता है।",
    "[00:02:31.000] पश्चिमी तट पर बाँस के कोपल वाला चिकन मिलना एक आश्चर्य है! मैं आमतौर पर बाँस के कोपलों को उत्तर-पूर्व, जैसे मिजोरम या नागालैंड से जोड़कर देखता हूँ।",
    "[00:02:46.000] खाना पकाने का काम बाहर संजय की पत्नी करेंगी। नमस्ते! उन्होंने सब कुछ तैयार कर रखा है।",
    "[00:03:09.000] आइए मसालों पर नज़र डालते हैं: मिर्च की चटनी, अदरक-लहसुन का पेस्ट, कटे हुए टमाटर, प्याज, हल्दी (हलद), तीखा मसाला (स्थानीय मसाला मिश्रण), और नमक (मीठ)।",
    "[00:03:34.000] चिकन पहले से ही कटा हुआ है। हम तैयारी के लिए सोयाबीन तेल का उपयोग कर रहे हैं।",
    "[00:03:54.000] वह सीधे कच्चे चिकन में मसाले डालकर शुरुआत करती हैं: हल्दी, नमक और हरी मिर्च की चटनी।",
    "[00:04:12.000] इसके बाद, कटे हुए टमाटर, प्याज और मुख्य सामग्री—सुरक्षित वास्ता (बाँस के कोपल) डाले जाते हैं।",
    "[00:04:32.000] सब कुछ थोड़े से तेल के साथ हाथों से मिलाया जाता है, मसालों को चिकन में अच्छी तरह मला जाता है।",
    "[00:04:51.000] इसे मिट्टी के बर्तन में पकाया जा रहा है। दिलचस्प बात यह है कि खाना पकाने के दौरान इसमें बिल्कुल भी पानी नहीं डाला जाएगा।",
    "[00:04:57.000] यह पूरी तरह से अपने ही रस में पकेगा। भाप की प्रक्रिया में मदद करने के लिए, बर्तन के ऊपर पानी से भरा ढक्कन रखा जाता है।",
    "[00:05:13.000] संजय बताते हैं कि उनके मिट्टी के बर्तन वाले चिकन को एक बार NDTV गुड टाइम्स के 'चक ले इंडिया' प्रोग्राम में दिखाया गया था।",
    "[00:05:41.000] बर्तन को लकड़ी की आग पर रखा जाता है। इसे अच्छी तरह पकने के लिए लगभग 20 से 25 मिनट की आवश्यकता होती है।",
    "[00:06:25.000] 10 मिनट के बाद, वह चिकन को चलाती हैं। आप देख सकते हैं कि प्याज और चिकन ने अपना पानी छोड़ दिया है।",
    "[00:06:49.000] वह ऊपर के ढक्कन पर ताज़ा पानी डालती हैं। जब यह पानी उबलने लगता है, तो यह संकेत देता है कि अंदर का चिकन अच्छी तरह से पक रहा है।",
    "[00:07:04.000] हम इस बैच के लिए लगभग आधा किलो चिकन और 100-150 ग्राम बाँस के कोपलों का उपयोग कर रहे हैं।",
    "[00:07:14.000] जब तक खाना पकता है, संजय अपनी कला के बारे में बात करते हैं। उन्होंने अपनी दादी से वारली पेंटिंग सीखी, जो शादियों के लिए रस्म वाले 'चौक' पेंटिंग बनाती थीं।",
    "[00:07:35.000] संजय ने अपनी कला के लिए मलेशिया और पूरे भारत की यात्रा की है। महामारी के दौरान, उन्होंने कोरोना के बारे में एक पेंटिंग भी बनाई थी।",
    "[00:08:05.000] चिकन तैयार है! वह ढक्कन से पानी हटाती हैं और अंतिम स्पर्श के रूप में ताज़ा धनिया पत्ती डालती हैं।",
    "[00:08:11.000] यह आश्चर्यजनक है कि वास्ता चिकन बिना पानी की एक भी बूंद डाले बनाया गया है।",
    "[00:08:52.000] इसका स्वाद सामान्य चिकन से बहुत अलग है; भाप में पकने से इसे एक अनूठा टेक्सचर मिलता है।",
    "[00:09:03.000] यह 'भाकरी' (बाजरे की रोटी) के साथ बहुत स्वादिष्ट लगता है।",
    "[00:09:08.000] मेरा दिन शानदार रहा—बीच, किला और फिर यह वास्ता चिकन। संजय सभी को इस पारंपरिक भोजन को चखने के लिए अपने गाँव आने का निमंत्रण देते हैं।",
    "[00:09:33.000] आप यहाँ वारली पेंटिंग और उनकी पारंपरिक विरासत का भी अनुभव कर सकते हैं। अगले एपिसोड में मिलते हैं!"
  ],
  "transcription_english": [
    "[00:00:11.000] Welcome to the Rural Recipes YouTube channel. While exploring this tribal district of Maharashtra, we've arrived at a major attraction: the west coast.",
    "[00:00:27.000] We are at Chinchani Beach. This place is well-connected; Dahanu station is 40 minutes away, and Mumbai is just a 2-hour drive.",
    "[00:00:41.000] Tukaram ji, let's head to Vangaon. On the way, we found another major attraction: Tarapur Fort, which is very close to the beach.",
    "[00:01:07.000] We have arrived at the home of another Warli artist, Sanjay Parar.",
    "[00:01:18.000] Sanjay ji, welcome to Rural Recipes. You mentioned you'd make a traditional dish for us today.",
    "[00:01:28.000] We are making 'Wasta Chicken' using desi chicken. Wasta is what we call bamboo shoots.",
    "[00:01:36.000] Bamboo shoots usually emerge during the rainy season. Since it's currently January, how did you get them?",
    "[00:02:00.000] Sanjay explains: To eat them year-round, we harvest them in the monsoon, chop them, and preserve them in a pot (bharni) with salt.",
    "[00:02:16.000] This preserved wasta can be used with chicken, dried fish, or even eaten on its own as a side dish.",
    "[00:02:31.000] Finding bamboo shoot chicken on the west coast is a surprise! I usually associate bamboo shoots with the North East, like Mizoram or Nagaland.",
    "[00:02:46.000] The cooking will be done outdoors by Sanjay's wife. Namaste! She has everything prepared.",
    "[00:03:09.000] Let's look at the spices: chili chutney, ginger-garlic paste, chopped tomatoes, onions, turmeric (halad), tikhat masala (local spice mix), and salt (mith).",
    "[00:03:34.000] The chicken is already cut. We are using soybean oil for the preparation.",
    "[00:03:54.000] She starts by adding the spices directly to the raw chicken: turmeric, salt, and green chili chutney.",
    "[00:04:12.000] Next, the chopped tomatoes, onions, and the star ingredient—the preserved Wasta (bamboo shoots)—are added.",
    "[00:04:32.000] Everything is mixed together by hand with a bit of oil, massaging the spices into the chicken.",
    "[00:04:51.000] This is being cooked in a clay pot. Interestingly, no water will be added during the cooking process.",
    "[00:04:57.000] It will cook entirely in its own juices. To help the steaming process, a lid containing water is placed on top of the pot.",
    "[00:05:13.000] Sanjay mentions that his traditional clay pot chicken was once featured on the 'Chak Le India' program on NDTV Good Times.",
    "[00:05:41.000] The pot is placed on the wood fire. It needs about 20 to 25 minutes to cook thoroughly.",
    "[00:06:25.000] After 10 minutes, she stirs the chicken. You can see the onions and chicken have released their own water.",
    "[00:06:49.000] She pours fresh water onto the top lid. When this water starts steaming, it indicates the chicken inside is cooking well.",
    "[00:07:04.000] We are using about half a kilo of chicken and 100-150 grams of bamboo shoots for this batch.",
    "[00:07:14.000] While it cooks, Sanjay talks about his art. He learned Warli painting from his grandmother, who used to make ritualistic 'Chowk' paintings for weddings.",
    "[00:07:35.000] Sanjay has traveled to Malaysia and across India for his art. During the pandemic, he even made a painting about Corona, showing hospitals open while temples were closed.",
    "[00:08:05.000] The chicken is done! She removes the water from the lid and adds fresh coriander leaves as a final touch.",
    "[00:08:11.000] It's amazing that Wasta Chicken is made without adding a single drop of water.",
    "[00:08:52.000] The flavor is very different from normal chicken; the steam-cooking gives it a unique texture.",
    "[00:09:03.000] It tastes wonderful with 'Bhakar' (millet flatbread).",
    "[00:09:08.000] I've had a fabulous day—beach, fort, and then this Wasta Chicken. Sanjay invites everyone to visit his village to try this traditional food.",
    "[00:09:33.000] You can also experience Warli painting and their traditional heritage here. See you in the next episode!"
  ]
}