{
  "metadata": {
    "title": "Village Food Cooking (Mutton / Lal Maans) By Indian Woman on Stone Stove - Real Rajasthani Life",
    "channel_name": "Sanjeev Kumar Gupta",
    "publish_date": "2019-06-30",
    "view_count": 27682,
    "like_count": 261,
    "duration": "13:00",
    "original_audio_language": "Hindi/Rajasthani",
    "video_id": "IoXHNv1Jp7w",
    "url": "https://www.youtube.com/watch?v=IoXHNv1Jp7w",
    "description": "This video captures the scene at the Nagaur fair in Rajasthan, where a woman prepares mutton (Lal Maans) on a traditional stone stove.",
    "ingredients_detected": [
      "mutton",
      "oil",
      "red chili paste",
      "tomatoes",
      "green chilies",
      "garlic paste",
      "salt",
      "water"
    ]
  },

  "transcription_hindi": [
    "[00:00:00.000] दोस्तों, आज हम राजस्थान के नागौर पशु मेले में हैं।",
    "[00:00:10.000] यहाँ हम देखेंगे कि एक राजस्थानी परिवार पत्थर के चूल्हे पर मटन कैसे बनाता है।",
    "[00:00:20.000] यह देखिए, चूल्हे पर हांडी रखी है। यह मटन बन रहा है।",
    "[00:01:13.000] सब्ज़ी बनाओ, फोटो खींचो। ₹151 नेक देना होगा।",
    "[00:01:48.000] अब इसमें तेल गरम होने के बाद लाल मिर्च का पेस्ट डाला जा रहा है।",
    "[00:02:18.000] ये लोग सीकरी से आए हैं और अपनी संस्कृति के बारे में बता रहे हैं।",
    "[00:03:51.000] गले में जो गहना पहना है, उसे 'तेवटा' कहते हैं। यह सोने का बना है।",
    "[00:04:03.000] अब हांडी में मटन के टुकड़े डाले जा रहे हैं।",
    "[00:07:07.000] शादी को 15 साल हो गए हैं और छह बच्चे हैं।",
    "[00:08:55.000] स्वाद के लिए इसमें ढेर सारा कुटा हुआ लहसुन डाला गया है।",
    "[00:10:52.000] मेले में ऊंटों और बैलों की गहमागहमी देखने लायक है।",
    "[00:12:20.000] मटन की सब्ज़ी अब पूरी तरह तैयार है।"
  ],

  "transcription_english": [
    "[00:00:00.000] Friends, today we are at the Nagaur cattle fair in Rajasthan.",
    "[00:00:10.000] Here we will see how a Rajasthani family cooks mutton on a stone stove.",
    "[00:00:20.000] Look, the pot is on the stove. Mutton is being prepared.",
    "[00:01:13.000] Make the curry, take photos. You'll have to give 151 rupees as a gift.",
    "[00:01:48.000] Now, red chili paste is being added after the oil has heated up.",
    "[00:02:18.000] These people have come from Sikari and are talking about their culture.",
    "[00:03:51.000] The ornament worn around the neck is called 'Tevta'. It is made of gold.",
    "[00:04:03.000] Now the mutton pieces are being added to the pot.",
    "[00:07:07.000] It has been 15 years since the marriage, and there are six children.",
    "[00:08:55.000] A lot of crushed garlic has been added for flavor.",
    "[00:10:52.000] The hustle and bustle of camels and bulls at the fair is worth seeing.",
    "[00:12:20.000] The mutton curry is now completely ready."
  ]
}