{
  "metadata": {
    "title": "ग्वार फली सब्जी - Original Cluster Beans Curry Recipe : Rajasthani Village Style Food Cooking Khana",
    "channel_name": "Sanjeev Kumar Gupta",
    "publish_date": "2019-07-10",
    "view_count": 11968,
    "like_count": 261,
    "duration": "10:05",
    "language": "Hindi / Rajasthani",
    "video_id": "IONCU8AtmS0",
    "url": "https://www.youtube.com/watch?v=IONCU8AtmS0",
    "description": "Original Rajasthani village-style Cluster Beans (Gwar Phali) curry recipe. The video demonstrates traditional cleaning, cutting, and cooking methods in a clay pot over a wood-fire stove."
  },
  "ingredients_detected": [
    "Cluster Beans (Gwar Phali)",
    "Vegetable Oil (Veg Oil)",
    "Ground Red Chili (Pisi Lal Mirch)",
    "Ground Turmeric (Pisi Haldi)",
    "Ground Garlic (Pisa Lahsun)",
    "Ground Coriander (Pisa Dhaniya)",
    "Salt (Namak)",
    "Water (Paani)"
  ],
  "transcription_hindi": [
    "[00:00:15.000] ग्वार फली के दोनों सिरों को काट कर सफाई करें।",
    "[00:00:36.000] ग्वार फली के छोटे-छोटे टुकड़े कर लें।",
    "[00:00:44.000] पारंपरिक मिट्टी के चूल्हे पर हांडी (मिट्टी का बर्तन) रखें।",
    "[00:00:49.000] बर्तन में तेल डालें और इसे गर्म होने दें।",
    "[00:01:27.000] तेल गरम हुआ या नहीं, यह देखने के लिए थोड़ा लहसुन डालकर जाँच करें।",
    "[00:02:00.000] पीसी हुई लाल मिर्च में थोड़ा पानी मिलाकर घोल तैयार करें और उसे गरम तेल में डालें।",
    "[00:02:18.000] अब इसमें पीसी हुई हल्दी और धनिया पाउडर डालें।",
    "[00:02:39.000] मसालों को अच्छी तरह से भूनें।",
    "[00:02:54.000] स्वादानुसार नमक डालें।",
    "[00:03:21.000] अब पिसा हुआ लहसुन डालें और खुशबू आने तक भूनें।",
    "[00:05:29.000] कटी हुई ग्वार फली को मसाले में डालें।",
    "[00:07:06.000] सब्जी को पकने के लिए पर्याप्त पानी डालें।",
    "[00:07:13.000] इसे ढक दें और 10-15 मिनट तक पकने दें जब तक कि फली मुलायम न हो जाए।",
    "[00:08:56.000] ग्वार फली की सब्जी तैयार है।"
  ],
  "transcription_english": [
    "[00:00:15.000] Start by trimming the both ends of the cluster beans to clean them.",
    "[00:00:36.000] Cut the cleaned cluster beans into small, uniform pieces.",
    "[00:00:44.000] Place the clay pot (handi) over the traditional wood-fire mud stove.",
    "[00:00:49.000] Pour vegetable oil into the pot and let it heat up.",
    "[00:01:27.000] Test if the oil is hot enough by dropping a small amount of garlic into it.",
    "[00:02:00.000] Mix ground red chili with some water and pour the slurry into the hot oil.",
    "[00:02:18.000] Add ground turmeric and coriander powder to the mix.",
    "[00:02:39.000] Stir and roast the spices thoroughly.",
    "[00:02:54.000] Add salt according to taste.",
    "[00:03:21.000] Add ground garlic paste and sauté until the raw smell disappears.",
    "[00:05:29.000] Put the cut cluster beans into the spicy masala base.",
    "[00:07:06.000] Add water to cook the beans and stir everything together.",
    "[00:07:13.000] Cover the pot and let it simmer for about 10-15 minutes until the beans are soft-cooked.",
    "[00:08:56.000] The authentic cluster bean curry is ready to be served."
  ]
}