{
  "metadata": {
    "title": "Indian Village Cooking Dal Dhokli - Rajasthani Food By Primitive Technology HD Video",
    "channel_name": "Sanjeev Kumar Gupta",
    "publish_date": "2019-07-12",
    "view_count": 3009,
    "like_count": 34,
    "duration": "05:49",
    "original_audio_language": "Hindi / Rajasthani",
    "video_id": "S6w89vXwNmw",
    "url": "https://www.youtube.com/watch?v=S6w89vXwNmw",
    "description": "Traditional Rajasthani Dal Dhokli prepared by a village woman using primitive technology. The video showcases the authentic cooking process on a mud stove with clay cookware."
  },
  "ingredients_detected": [
    "Green Moong Dal (Hari Moong Dal)",
    "Chana Dal",
    "Wheat Flour (Gehu ka Atta)",
    "Vegetable Oil",
    "Mustard Seeds",
    "Cumin Seeds (Jeera)",
    "Whole Red Chili",
    "Black Cardamom",
    "Black Pepper",
    "Turmeric Powder (Haldi)",
    "Red Chili Powder",
    "Salt",
    "Garlic (Lahsun)",
    "Water",
    "Coriander Leaves (for garnish)",
    "Lemon Juice (for garnish)"
  ],
  "transcription_hindi": [
    "[00:00:20.000] गरम मिट्टी के बर्तन में तेल डालें और उसमें साबुत लाल मिर्च, काली इलायची, जीरा और काली मिर्च का तड़का लगाएं।",
    "[00:00:31.000] भीगी हुई हरी मूंग दाल और चने की दाल को धोकर तड़के में डालें।",
    "[00:00:54.000] दाल पकाने के लिए पर्याप्त पानी डालें।",
    "[00:01:07.000] दाल में हल्दी पाउडर, लाल मिर्च पाउडर और नमक डालें।",
    "[00:01:33.000] लहसुन को पत्थर पर पीसकर दाल में मिलाएं।",
    "[00:01:55.000] ढोकली के लिए गेहूं के आटे में नमक और लाल मिर्च पाउडर मिलाएं।",
    "[00:02:16.000] आटे में थोड़ा तेल और पानी डालकर थोड़ा कड़ा (सख्त) आटा गूंथ लें।",
    "[00:03:23.000] गूंथे हुए आटे की छोटी-छोटी लोइयां लें और उन्हें चपटा करके बीच में एक छेद बनाएं।",
    "[00:03:49.000] इन चपटी ढोकली की गोलियों को उबलती हुई दाल के बर्तन में डालें।",
    "[00:04:23.000] इसे लगभग आधे घंटे तक धीमी आंच पर पकने दें।",
    "[00:05:00.000] स्वादिष्ट दाल ढोकली तैयार है। इसे ताज़ा धनिया, घी और नींबू के रस के साथ गरमा-गरम परोसें।"
  ],
  "transcription_english": [
    "[00:00:20.000] Start by adding oil to the heated clay pot and temper it with whole red chili, black cardamom, cumin seeds, and black pepper.",
    "[00:00:31.000] Add washed, soaked green moong dal and chana dal to the tempering.",
    "[00:00:54.000] Pour in enough water to cook the lentils.",
    "[00:01:07.000] Add ground turmeric, red chili powder, and salt to the pot.",
    "[00:01:33.000] Grind fresh garlic and add it to the mixture for extra flavor.",
    "[00:01:55.000] For the Dhokli, take wheat flour and mix it with salt and red chili powder.",
    "[00:02:16.000] Add a little oil and water to the flour and knead it into a firm (hard) dough.",
    "[00:03:23.000] Take small portions of the dough, flatten them into discs, and make a small hole in the center.",
    "[00:03:49.000] Add these dough discs into the pot with the boiling lentils.",
    "[00:04:23.000] Let the mixture simmer and cook for about half an hour.",
    "[00:05:00.000] The delicious Dal Dhokli is ready. Garnish with coriander leaves, ghee, and lemon juice before serving."
  ]
}