{
  "metadata": {
    "title": "राजस्थान की बियर Indian Village Woman Cooking Makka Rabdi - Rajasthani Food By Primitive Technology",
    "channel_name": "Sanjeev Kumar Gupta",
    "publish_date": "2019-07-13",
    "view_count": 4624,
    "like_count": 23,
    "duration": "05:00",
    "language": "Hindi/Rajasthani",
    "video_id": "Kffsl57qVDo",
    "url": "https://www.youtube.com/watch?v=Kffsl57qVDo",
    "description": "Makka Rabri, often called the 'Beer of Rajasthan,' is a traditional rustic dish prepared by village women using primitive methods. It is made using buttermilk and ground maize, slow-cooked on a mud stove for an authentic village taste."
  },
  "ingredients_detected": [
    "Buttermilk (Chhachh) - used as the base liquid for the rabri",
    "Ground maize (Makka) - the main grain used for thickening",
    "Salt (Namak) - added for basic seasoning",
    "Cumin seeds (Jeera) - roasted and ground to be added during serving",
    "Black salt (Kala Namak) - used as a garnish for extra flavor"
  ],
  "transcription_hindi": [
    "[00:00:07.000] मक्का की राबड़ी के लिए सबसे पहले खट्टी छाछ ली जाती है।",
    "[00:00:18.000] अब इसमें पिसा हुआ मक्का आटा मिलाया जा रहा है।",
    "[00:00:40.000] स्वाद के लिए इसमें नमक मिलाया जा रहा है।",
    "[00:00:45.000] छाछ और मक्का के आटे के मिश्रण को हाथों से अच्छी तरह मिलाया जा रहा है ताकि इसमें गुठलियां न रहें।",
    "[00:01:19.000] अब इस मिश्रण वाले मिट्टी के बर्तन को जलते हुए चूल्हे पर रखा जा रहा है।",
    "[00:01:45.000] चूल्हे की आग को तेज करने के लिए खोखली नली से फूंक मारी जा रही है।",
    "[00:01:56.000] राबड़ी को लगातार चलाया जा रहा है ताकि छाछ फटे नहीं और मिश्रण अच्छी तरह पके।",
    "[00:02:25.000] छाछ को उबलने दिया जा रहा है और उसे बीच-बीच में हिलाया जा रहा है।",
    "[00:03:36.000] इसे धीमी आंच पर तब तक पकाया जा रहा है जब तक कि यह गाढ़ा और नरम न हो जाए।",
    "[00:03:57.000] जब राबड़ी अच्छी तरह पककर गाढ़ी हो जाती है, तब इसे आग से उतार लिया जाता है।",
    "[00:04:13.000] तैयार राबड़ी को एक छोटे बर्तन में निकाला जा रहा है।",
    "[00:04:30.000] इसे भुने हुए पिसे जीरे और काले नमक के साथ सजाकर परोसा जा रहा है।",
    "[00:04:34.000] इसे गर्म या ठंडा दोनों तरह से खाया जा सकता है।"
  ],
  "transcription_english": [
    "[00:00:07.000] First, sour buttermilk is taken as the base for the Makka Rabri.",
    "[00:00:18.000] Now, ground maize powder is being added into the buttermilk.",
    "[00:00:40.000] Salt is added to the mixture for seasoning.",
    "[00:00:45.000] The mixture is being stirred thoroughly by hand to ensure there are no lumps.",
    "[00:01:19.000] The clay pot containing the mixture is now placed on the burning wood stove.",
    "[00:01:45.000] Air is blown through a hollow pipe to stoke the fire and keep the fuel burning.",
    "[00:01:56.000] The Rabri must be stirred continuously to prevent the buttermilk from curdling and to ensure even cooking.",
    "[00:02:25.000] The mixture is allowed to reach its boiling point while being stirred occasionally.",
    "[00:03:36.000] It is left to simmer on low heat until the consistency becomes thick and soft.",
    "[00:03:57.000] Once the Rabri has thickened and cooked through, the pot is removed from the fire.",
    "[00:04:13.000] The prepared Rabri is being poured into a smaller serving vessel.",
    "[00:04:30.000] It is garnished with roasted cumin seed powder and black salt for serving.",
    "[00:04:34.000] The dish is now ready and can be served either hot or cold."
  ]
}