{
  "metadata": {
    "title": "Amazing Bullock- Powered Oil Factory In Indian Village, Rajasthan India : Primitive technology",
    "channel_name": "Sanjeev Kumar Gupta",
    "publish_date": "2019-07-10",
    "view_count": 152516,
    "like_count": 1776,
    "duration": "03:29",
    "language": "Hindi",
    "video_id": "TLtJcEPHVeU",
    "url": "https://www.youtube.com/watch?v=TLtJcEPHVeU",
    "description": "In this video, we see how sesame oil is being extracted using bullocks even in today's times in a village in Rajasthan, India. This primitive technology showcases the traditional extraction process called 'Ghani'."
  },
  "ingredients_detected": [
    "Sesame seeds (Til) - the primary seed for oil extraction",
    "Sesame oil (Tilli ka tel) - the resulting pure oil"
  ],
  "transcription_hindi": [
    "[00:00:01.000] इस वीडियो में दोस्तों देखते हैं, बैलों की मदद से कैसे तिलों से तेल निकाला जा रहा है आज के जमाने में भी, राजस्थान के गाँव में।",
    "[00:00:20.000] घानी (पारंपरिक तेल निकालने की मशीन) में सफेद तिल डाले जा रहे हैं।",
    "[00:00:27.000] बैल घानी के चारों ओर घूमना शुरू करता है जिससे मूसल घूमता है और तिलों को पीसता है।",
    "[00:00:40.000] पिसे हुए तिलों से धीरे-धीरे तेल बाहर आने लगता है।",
    "[00:01:00.000] घानी के ऊपर भारी पत्थर और बोरे रखे गए हैं ताकि मूसल पर दबाव बना रहे और तेल अच्छी तरह निकले।",
    "[00:01:21.000] घानी के अंदर तिलों का पेस्ट (तिलकुट्टा) बनता जा रहा है और तेल ऊपर तैर रहा है।",
    "[00:01:31.000] तेल निकालने वाला व्यक्ति शुद्ध तिल्ली के तेल की कीमत ₹280 प्रति किलो बता रहा है।",
    "[00:01:44.000] ग्राहक को ताजा और शुद्ध तेल मापकर थैली में दिया जा रहा है।",
    "[00:01:50.000] दुकानदार बता रहा है कि यह तेल खाने के काम आता है और इसे खाने से शरीर में शक्ति आती है।",
    "[00:01:58.000] यह तेल हर मौसम में खाया जा सकता है और यह थकान और कई बीमारियों को दूर करने में सहायक है।",
    "[00:02:14.000] दुकानदार के अनुसार, अगर आप इसे 5-10 दिन लगातार खाएंगे, तो आपको अपने शरीर में ऊर्जा और शक्ति महसूस होगी।",
    "[00:02:51.000] यहाँ 'तिलकुट्टा' और 'घानी का तेल' उपलब्ध है, जैसा कि बैनर पर लिखा है।"
  ],
  "transcription_english": [
    "[00:00:01.000] In this video, friends, let's see how oil is being extracted from sesame seeds with the help of bullocks, even in today's era, in a village in Rajasthan.",
    "[00:00:20.000] White sesame seeds are being poured into the 'Ghani' (traditional oil extraction machine).",
    "[00:00:27.000] The bullock starts moving around the Ghani, causing the pestle to rotate and crush the sesame seeds.",
    "[00:00:40.000] Oil gradually starts to separate from the crushed sesame seeds.",
    "[00:01:00.000] Heavy stones and bags are placed on the Ghani to maintain pressure on the pestle for efficient extraction.",
    "[00:01:21.000] A paste called 'Tilkutta' is forming inside the Ghani, with the oil floating on top.",
    "[00:01:31.000] The oil extractor mentions that the pure sesame oil (Tilli ka tel) is priced at ₹280 per kg.",
    "[00:01:44.000] Pure, fresh oil is being measured and given to a customer in a plastic bag.",
    "[00:01:50.000] The seller explains that this oil is used for consumption and provides strength to the body.",
    "[00:01:58.000] He adds that it can be consumed in any season and helps eliminate fatigue and various ailments.",
    "[00:02:14.000] According to the seller, if consumed for 5-10 days regularly, one will feel a significant boost in energy and strength.",
    "[00:02:51.000] 'Tilkutta' and 'Ghani oil' are available here, as seen on the display banner."
  ]
}