{
  "metadata": {
    "title": "Indian Village Men Making India ( Roti) Flat bread Over Brick Stove desi Style",
    "channel_name": "Sanjeev Kumar Gupta",
    "publish_date": "2017-03-30",
    "view_count": 3222,
    "like_count": 18,
    "duration": "04:02",
    "language": "Hindi",
    "video_id": "dA2uO0P4HV0",
    "url": "https://www.youtube.com/watch?v=dA2uO0P4HV0",
    "description": "This video captures traditional flatbread (Roti) making in an Indian village. It shows men kneading dough and cooking rotis over a handmade brick stove, reflecting rustic culinary traditions."
  },
  "ingredients_detected": [
    "wheat flour (gehu ka atta)",
    "water (paani)"
  ],
  "transcription_hindi": [
    "[00:00:05.000] भारतीय गाँव में रोटी बनाने की पारंपरिक प्रक्रिया की शुरुआत।",
    "[00:00:08.000] गेहूं का आटा और पानी मिलाकर आटा गूंथना।",
    "[00:00:30.000] गूंथे हुए आटे से छोटी लोइयाँ बनाना और उन्हें हाथों से थपथपाकर गोल आकार (रोटी) देना।",
    "[00:00:46.000] तैयार रोटी को गर्म तवे पर रखना।",
    "[00:00:54.000] रोटी को तवे से हटाकर सीधे आग पर या गर्म राख के पास खड़ा करके सेंकना।",
    "[00:01:21.000] रोटी को दोनों तरफ से सुनहरा और कुरकुरा होने तक अच्छी तरह सेंकना।",
    "[00:02:01.000] तैयार रोटियों का ढेर जिसे अखबार पर रखा गया है।",
    "[00:02:15.000] एक साथ कई रोटियों को तैयार करने की सामूहिक प्रक्रिया।",
    "[00:03:31.000] गाँव के पुरुषों द्वारा खुली जगह पर सामूहिक रूप से भोजन पकाने का दृश्य।"
  ],
  "transcription_english": [
    "[00:00:05.000] Starting the traditional process of making roti in an Indian village.",
    "[00:00:08.000] Kneading the dough by mixing wheat flour and water.",
    "[00:00:30.000] Creating small dough balls and shaping them by hand-patting into round rotis.",
    "[00:00:46.000] Placing the shaped roti onto a hot griddle.",
    "[00:00:54.000] Removing the roti from the griddle and placing it directly next to the fire or hot embers to puff up.",
    "[00:01:21.000] Thoroughly roasting the roti on both sides until golden and crisp.",
    "[00:02:01.000] A stack of prepared rotis placed on a newspaper.",
    "[00:02:15.000] The collective process of preparing multiple rotis simultaneously.",
    "[00:03:31.000] A scene of village men cooking together in an open field."
  ]
}