{
  "metadata": {
    "title": "Indian Village Woman Making Food on Stone Stove - Real Rajasthani Life HD Video",
    "channel_name": "Sanjeev Kumar Gupta",
    "publish_date": "2019-06-29",
    "view_count": 20424,
    "like_count": 124,
    "duration": "05:20",
    "language": "Hindi/Rajasthani",
    "video_id": "7fgK9cud7e4",
    "url": "https://www.youtube.com/watch?v=7fgK9cud7e4",
    "description": "In this video, we visit the Pushkar Mela in Rajasthan to witness a local woman preparing traditional rotis on a stone stove. The video provides a glimpse into the authentic rural life and culinary practices of Rajasthani village women."
  },
  "ingredients_detected": [
    "wheat flour (gehu ka atta)",
    "water (paani)"
  ],
  "transcription_hindi": [
    "[00:00:01.000] चलिए दोस्तों चलते हैं पुष्कर मेले जहाँ पर एक राजस्थानी गाँव की औरत रोटियां बना रही है।",
    "[00:00:07.000] जरा देखते हैं कि वह रोटियां कैसे बनाती हैं।",
    "[00:00:13.000] लोई तैयार करना और उसे बेलना।",
    "[00:00:36.000] तैयार रोटी को गर्म तवे पर रखना।",
    "[00:00:44.000] मेले के दृश्य और ऊँट गाड़ी।",
    "[00:00:53.000] रोटी को बेलने और पकाने की प्रक्रिया जारी है।",
    "[00:01:21.000] तवे पर रोटी को पलटना।",
    "[00:01:31.000] लोई बनाना और उसे सूखे आटे में लपेटना।",
    "[00:01:42.000] तैयार रोटियों को एक के ऊपर एक रखना।",
    "[00:01:55.000] तवे पर रोटी का अच्छे से सिकना।",
    "[00:02:04.000] नई लोई तैयार करना।",
    "[00:02:30.000] आटे की लोई को गोल आकार देना।",
    "[00:03:11.000] रोटियों को तवे पर अच्छी तरह से सेंकना।",
    "[00:03:45.000] पकी हुई रोटियों को इकट्ठा करना।",
    "[00:04:10.000] रोटियां बनाने की पूरी प्रक्रिया का नज़ारा।"
  ],
  "transcription_english": [
    "[00:00:01.000] Friends, let's head to the Pushkar Mela where a Rajasthani village woman is making rotis.",
    "[00:00:07.000] Let's see how she prepares the rotis.",
    "[00:00:13.000] Preparing the dough ball and starting to roll it.",
    "[00:00:36.000] Placing the rolled roti onto the hot griddle.",
    "[00:00:44.000] Scenes from the fair including a camel cart.",
    "[00:00:53.000] The process of rolling and cooking the rotis continues.",
    "[00:01:21.000] Flipping the roti on the griddle for even cooking.",
    "[00:01:31.000] Shaping a new dough ball and coating it with dry flour.",
    "[00:01:42.000] Stacking the freshly prepared rotis together.",
    "[00:01:55.000] The roti roasting perfectly on the griddle.",
    "[00:02:04.000] Preparing another batch of dough balls.",
    "[00:02:30.000] Skillfully shaping the dough into perfect circles.",
    "[00:03:11.000] Ensuring the rotis are well-roasted on the heat.",
    "[00:03:45.000] Gathering the cooked rotis.",
    "[00:04:10.000] An overview of the entire roti-making process."
  ]
}