{
  "metadata": {
    "title": "Bendakaya Vankaya Kaaram Pulusu | Spicy Bhendi Brinjal Curry | South Indian Style Okra Curry",
    "channel_name": "Vismai Food",
    "publish_date": "2018-08-14",
    "view_count": 346881,
    "like_count": 3303,
    "duration": "02:33",
    "language": "Telugu",
    "video_id": "hWnNJhFHrTU",
    "url": "https://www.youtube.com/watch?v=hWnNJhFHrTU",
    "description": "Rayalaseema special Bendakaya Vankaya Kaaram Pulusu recipe explained in detail.",
    "ingredients_detected": [
      "3 tsps Oil (for frying)",
      "12 Okra/Bhendi pieces",
      "5 Brinjal pieces",
      "1/4 Cup Oil (for curry base)",
      "1 tsp Mustard seeds",
      "1 tsp Cumin seeds",
      "1 tsp Chana Dal",
      "1 tsp Urad Dal",
      "2 Dry Red Chillies",
      "2 Sprigs Curry Leaves",
      "4 Green Chillies (slit)",
      "7 Crushed Garlic Pods",
      "1/2 tsp Turmeric powder",
      "Salt (to taste)",
      "1 Medium Onion (cut into petals)",
      "1 Tomato (chopped)",
      "1 tbsp Red Chilli powder",
      "1 tbsp Coriander powder",
      "250ml Water",
      "1/4 tsp Asafoetida (Hing)",
      "2 tbsps Jaggery",
      "2 tsps Coriander leaves (chopped)"
    ]
  },
  "transcription_telugu": [
    "[00:00:00.000] హలో ఫుడీస్, వెల్కమ్ టు విస్మయ్ ఫుడ్. ఇవాళ యమ్మీ టేస్టీ రెసిపీ బెండకాయ వంకాయ కారం పులుసు.",
    "[00:00:07.000] రుచుల కోసం ఎక్కడెక్కడో ఏవేవో తిరుగుతుంటాం కానీ కొన్ని పాత కాలపు వంటకాల రుచే వేరు. ఇది రాయలసీమ స్పెషల్.",
    "[00:00:15.000] ఒక్క మెతుకు కూడా వదలకుండా మొత్తం ఈ పులుసు తోనే భోజనాలు చేస్తారు అంత కమ్మగా ఉంటుంది ఈ పులుసు. సో లెట్స్ స్టార్ట్.",
    "[00:00:21.000] ముందుగా దీని కోసం రెండు టీస్పూన్ల ఆయిల్ హీట్ చేసి అందులో 12 బెండకాయ ముక్కలు వేసి మీడియం ఫ్లేమ్ లో 70% వరకు ఫ్రై చేసుకోండి.",
    "[00:00:36.000] ఇప్పుడు నాలుగైదు వంకాయ ముక్కలు వేసి 70% కుక్ అయ్యాక ఓ బౌల్ లో తీసుకోండి.",
    "[00:00:52.000] ఇప్పుడు అదే కడాయిలో పావు కప్పు నూనె హీట్ చేసుకొని అందులో ఆవాలు, జీలకర్ర, శనగపప్పు, మినప్పప్పు, ఎండుమిరపకాయలు, కరివేపాకు వేసి ఎర్రగా వేపుకోండి.",
    "[00:01:09.000] ఇప్పుడు నాలుగు పచ్చిమిర్చి చీలికలు, ఏడు చితక్కొట్టిన వెల్లుల్లి, అర చెంచా పసుపు, సాల్ట్ వేసి కలిపి ఉల్లిపాయ ముక్కలు వేసి పచ్చి వాసన పోయేదాకా మాత్రమే వేపుకోండి.",
    "[00:01:28.000] ఇప్పుడు పండిన ఓ టమాటో తరుగు వేసి టొమాటోస్ సాఫ్ట్ గా అయ్యేదాకా మగ్గించుకోండి.",
    "[00:01:36.000] ఇప్పుడు ఓ టేబుల్ స్పూన్ కారం, ఓ టేబుల్ స్పూన్ ధనియాల పొడి వేసి పచ్చి వాసన పోయేదాకా వేపుకోండి.",
    "[00:01:45.000] పావు లీటర్ నీళ్లు పోసుకొని పులుసుని మసల కాగనివ్వండి.",
    "[00:01:52.000] పులుసు మరుగుతున్నప్పుడు బెండకాయ వంకాయ ముక్కలు వేసి కలుపుకోండి.",
    "[00:02:02.000] ఇంగువ, బెల్లం, కొత్తిమీర వేసి నూనె పైకి తేలేదాకా సిమ్ లోనే పులుసును ఉడకనివ్వండి.",
    "[00:02:13.000] నూనె పైకి తేలిందా యమ్మీ బెండకాయ పులుసు రెడీ."
  ],
  "transcription_english": [
    "[00:00:00.000] Hello Foodies, welcome to Vismai Food. Today's yummy tasty recipe is Okra Brinjal Spicy Stew.",
    "[00:00:07.000] We roam around searching for tastes, but the taste of some old-time recipes is unique. This is a Rayalaseema Special.",
    "[00:00:15.000] You will eat the entire meal with this stew without leaving a single grain; it is that tasty. So let's start.",
    "[00:00:21.000] First, heat 2 teaspoons of oil and fry 12 okra pieces on medium flame until 70% done.",
    "[00:00:36.000] Now add 5 pieces of brinjal and once 70% cooked, take them into a bowl.",
    "[00:00:52.000] In the same pan, heat 1/4 cup of oil and add mustard seeds, cumin, chana dal, urad dal, dry red chillies, and curry leaves; fry until golden.",
    "[00:01:09.000] Add 4 green chillies, 7 crushed garlic pods, 1/2 tsp turmeric, and salt; then add onion petals and fry only until the raw smell disappears.",
    "[00:01:28.000] Add one chopped tomato and cook until soft and the raw smell disappears.",
    "[00:01:36.000] Add 1 tbsp chilli powder and 1 tbsp coriander powder; fry until the raw smell goes away.",
    "[00:01:45.000] Pour 250ml of water and let the stew come to a boil.",
    "[00:01:52.000] When the stew is boiling, add the fried okra and brinjal pieces and mix.",
    "[00:02:02.000] Add asafoetida, 2 tbsp jaggery, and coriander; let it simmer on low flame until the oil floats to the top.",
    "[00:02:13.000] Once the oil floats to the top, the yummy okra stew is ready."
  ]
}