{
  "metadata": {
    "title": "Chicken Pickle | చికెన్ పచ్చడి | Chicken Pickle With Tips In Telugu | How To Make Chicken Pickle at Home",
    "channel_name": "Vismai Food",
    "publish_date": "2018-10-12",
    "view_count": 7244595,
    "like_count": 114385,
    "duration": "02:44",
    "language": "Telugu",
    "video_id": "IA4zeP4zVR0",
    "url": "https://www.youtube.com/watch?v=IA4zeP4zVR0",
    "description": "Chicken pickle recipe with tips by Vismai Food.",
    "ingredients_detected": [
      "1 Kg Chicken (with bones, cleaned)",
      "1 tsp Salt (for boiling)",
      "1/2 tsp Turmeric (for boiling)",
      "500ml Oil (for deep frying)",
      "1/2 Cup (60gms) Freshly ground ginger-garlic paste",
      "1 tsp Methi powder",
      "1 tbsp Garam masala (optional)",
      "50gms Salt",
      "50gms Red chilli powder",
      "1/4 Cup (50-60ml) Lemon juice"
    ]
  },
  "transcription_telugu": [
    "[00:00:00.000] హలో ఫుడీస్, వెల్కమ్ టు విస్మయ్ ఫుడ్. ఈరోజు ఛానల్ లో చాలా మంది రిక్వెస్ట్ చేసిన చికెన్ పచ్చడి ఆంధ్ర స్టైల్ లో చూపిస్తున్నాను.",
    "[00:00:23.000] ముందుగా శుభ్రం చేసుకున్న 1 కిలో చికెన్ (ఎముకలతో సహా)ని నాన్-స్టిక్ కడాయిలో వేసుకోండి.",
    "[00:00:30.000] ఇందులో ఒక టేబుల్ స్పూన్ ఉప్పు, అర చెంచా పసుపు వేసి మీడియం ఫ్లేమ్ మీద నీళ్లన్నీ ఇగిరిపోయేంత వరకు కుక్ చేయండి.",
    "[00:00:47.000] మరో కడాయిలో అర కేజీ నూనెని వేడి చేసి, అందులో ఉడికించిన చికెన్ ముక్కలను వేసి గలగలా అనేంత వరకు క్రిస్పీగా వేయించాలి.",
    "[00:01:03.000] బాగా ఫ్రై అయిన చికెన్ ని తీసి పక్కన పెట్టుకోండి.",
    "[00:01:12.000] అదే నూనెలో అర కప్పు (60 గ్రాములు) ఫ్రెష్ గా రుబ్బుకున్న అల్లం వెల్లుల్లి పేస్ట్ వేసి పచ్చి వాసన పోయే వరకు వేపుకోండి. ఇది చాలా ముఖ్యం.",
    "[00:01:28.000] అల్లం వెల్లుల్లి పేస్ట్ వేగాక చికెన్ ముక్కలను కూడా వేసి రెండు మూడు నిమిషాలు కలపండి.",
    "[00:01:38.000] ఇందులో ఒక టేబుల్ స్పూన్ మెంతి పొడి వేయండి. మీకు కావాలంటే ఒక టేబుల్ స్పూన్ గరం మసాలా కూడా వేసుకోవచ్చు.",
    "[00:01:47.000] ఇప్పుడు 50 గ్రాముల ఉప్పు వేసి మూడు నాలుగు నిమిషాలు వేయించిన తర్వాత 50 గ్రాముల కారం వేసి బాగా కలుపుకోవాలి.",
    "[00:02:02.000] కారం వేసాక నురగలా పైకి వస్తుంది, అప్పుడు స్టవ్ ఆఫ్ చేసి పచ్చడిని పూర్తిగా చల్లారనివ్వాలి.",
    "[00:02:11.000] చల్లారిన తర్వాతే 50-60ml నిమ్మరసం కలుపుకుని ఎయిర్ టైట్ జార్ లో భద్రపరుచుకోవాలి.",
    "[00:02:24.000] రెండు రోజుల తర్వాత ఈ పచ్చడి తింటే చాలా రుచిగా ఉంటుంది. ఈ పచ్చడి వేడి చేస్తుంది కాబట్టి మజ్జిగ ఎక్కువగా తాగండి."
  ],
  "transcription_english": [
    "[00:00:00.000] Hello Foodies, welcome to Vismai Food. Today, I'm showing the much-requested Andhra-style Chicken Pickle.",
    "[00:00:23.000] Put 1kg of cleaned chicken (with bones) into a non-stick pan.",
    "[00:00:30.000] Add 1 tbsp salt and 1/2 tsp turmeric; cook on medium flame until all water evaporates.",
    "[00:00:47.000] Heat 500ml oil in another pan, add the cooked chicken pieces, and fry until they are crispy and crunchy.",
    "[00:01:03.000] Once perfectly fried, remove the chicken pieces and set them aside.",
    "[00:01:12.000] In the same oil, add 1/2 cup (60gms) of freshly ground ginger-garlic paste and sauté until the raw smell disappears.",
    "[00:01:28.000] Add the fried chicken back to the pan and mix for 2-3 minutes on medium flame.",
    "[00:01:38.000] Add 1 tsp methi powder. You can also add 1 tbsp garam masala if you want it spicier.",
    "[00:01:47.000] Add 50gms salt, fry for 3-4 minutes, then add 50gms red chilli powder and mix well.",
    "[00:02:02.000] When the oil starts foaming, turn off the heat and let the pickle cool down completely.",
    "[00:02:11.000] Once fully cooled, add 50-60ml lemon juice and store in an airtight jar.",
    "[00:02:24.000] Enjoy the pickle after 2 days for the best taste. Since this pickle is heaty, drink plenty of buttermilk."
  ]
}