{
  "metadata": {
    "title": "Mango Pickle | మామిడికాయ తురుము పచ్చడి | In 5 mins | పెళ్ళిళ్ళ  స్పెషల్ మామిడికాయ తురుము పచ్చడి",
    "channel_name": "Vismai Food",
    "publish_date": "2019-04-01",
    "view_count": 1919138,
    "like_count": 21936,
    "duration": "02:40",
    "language": "Telugu",
    "video_id": "OYqaHcJXwOs",
    "url": "https://www.youtube.com/watch?v=OYqaHcJXwOs",
    "description": "Quick and tasty 5-minute Instant Mango Grated Pickle (Mamidikaya Thurumu Pachadi). A wedding-style recipe from Vismai Food.",
    "ingredients_detected": [
      "3 Tender Mangoes (washed, peeled, and dried)",
      "1/4 Cup Mustard seeds (approx. 50g)",
      "1 tsp Fenugreek seeds (Methi)",
      "1/2 Cup Sea salt (approx. 1 tbsp less than 1/2 cup)",
      "1/2 Cup + 1 tbsp Red chilli powder",
      "1/2 tsp Turmeric powder",
      "200ml Sesame oil or Groundnut oil",
      "1 tsp Mustard seeds (for tempering)",
      "1/4 tsp Hing (Asafoetida)",
      "10-12 Garlic pods (slightly crushed)",
      "5-6 Dry Red Chillies"
    ]
  },
  "transcription_telugu": [
    "[00:00:00.000] హలో ఫుడీస్, వెల్కమ్ టు విస్మయ్ ఫుడ్. ఇవాల్టి స్పెషల్ పెళ్ళిళ్ళలో వడ్డించే ఇన్ స్టంట్ మామిడికాయ తురుము పచ్చడి. ఇది ఐదు నిమిషాల్లో తయారవుతుంది.",
    "[00:00:27.000] ముందుగా మూడు మామిడికాయలను కడిగి, తుడిచి, పైన తొక్క తీసి సన్నగా తురుముకోవాలి.",
    "[00:00:46.000] మసాలా కోసం ఆవాలు మరియు మెంతులను లో ఫ్లేమ్ మీద సువాసన వచ్చే వరకు వేయించి, పూర్తిగా చల్లారిన తర్వాత మెత్తని పౌడర్ చేసుకోవాలి.",
    "[00:01:02.000] ఒక వెడల్పాటి బౌల్ లో మామిడి తురుము (3 కప్పులు), ఉప్పు (1/2 కప్పు కంటే తక్కువ), కారం (1/2 కప్పు కంటే కొంచెం ఎక్కువ), పసుపు మరియు ఆవాల పొడి వేసి బాగా కలుపుకోవాలి.",
    "[00:01:52.000] తాలింపు కోసం 200ml నూనె వేడి చేసి ఆవాలు, ఇంగువ, దంచిన వెల్లుల్లి మరియు ఎండుమిర్చి వేసి వేయించాలి.",
    "[00:02:10.000] ఈ తాలింపును పచ్చడిలో వేసి బాగా కలపాలి. ఇన్ స్టంట్ గా తినాలంటే వేడి నూనె కలపవచ్చు, ఎక్కువ రోజులు నిల్వ ఉండాలంటే నూనె పూర్తిగా చల్లారిన తర్వాత కలపాలి.",
    "[00:02:30.000] ఈ పచ్చడిని ఎయిర్ టైట్ జార్ లో భద్రపరుచుకుంటే ఒకటి నుండి మూడు నెలల పాటు నిల్వ ఉంటుంది. వేడి వేడి అన్నంలో నెయ్యి వేసుకుని తింటే చాలా బాగుంటుంది."
  ],
  "transcription_english": [
    "[00:00:00.000] Hello Foodies, welcome to Vismai Food. Today's special is the wedding-style Instant Mango Grated Pickle. It gets ready in just 5 minutes.",
    "[00:00:27.000] First, wash, dry, and peel three mangoes, then grate them finely.",
    "[00:00:46.000] For the masala, dry roast mustard seeds and fenugreek seeds on a low flame until aromatic. Once cooled, grind into a fine powder.",
    "[00:01:02.000] In a wide bowl, combine the grated mango (3 cups), sea salt (slightly less than 1/2 cup), red chilli powder (slightly more than 1/2 cup), turmeric, and the mustard powder; mix well.",
    "[00:01:52.000] For tempering, heat 200ml of oil and add mustard seeds, hing, crushed garlic, and dry red chillies; sauté well.",
    "[00:02:10.000] Add this tempering to the pickle and mix thoroughly. For instant use, add hot oil; for long preservation, add completely cooled oil.",
    "[00:02:30.000] Store this pickle in an air-tight jar to preserve it for 1 to 3 months. It tastes best with hot rice and ghee."
  ]
}