{
  "metadata": {
    "title": "Masala Egg Fry | మసాల గుడ్డు కారం ఫ్రై | గుంటూరు స్పెషల్ | Egg Fry recipe in telugu @VismaiFood",
    "channel_name": "Vismai Food",
    "publish_date": "2019-04-02",
    "view_count": 2091624,
    "like_count": 25819,
    "duration": "03:09",
    "language": "Telugu",
    "video_id": "ZEoJGBUukwU",
    "url": "https://www.youtube.com/watch?v=ZEoJGBUukwU",
    "description": "Try this Guntur Special Masala Egg Curry. A must try recipe from Vismai Food.",
    "ingredients_detected": [
      "Eggs",
      "Coriander seeds",
      "Cinnamon",
      "Green cardamom",
      "Star anise",
      "Cloves",
      "Garlic",
      "Poppy seeds",
      "Dry coconut",
      "Oil",
      "Onions",
      "Green chilies",
      "Salt",
      "Turmeric powder",
      "Red chili powder",
      "Ginger-garlic paste",
      "Mint leaves",
      "Coriander leaves"
    ]
  },
  "transcription_telugu": [
    "[00:00] హలో ఫుడీస్, వెల్కమ్ టు విస్మయ్ ఫుడ్. ఇవాల్టి స్పెషల్ \"మసాలా గుడ్డు కారం ఫ్రై\".",
    "[00:05] ఎంత బావుంటుందో... నా మాటలతో నేను చెప్పలేను.",
    "[00:10] నేను ఈ రెసిపీ గుంటూరు జిల్లా నరసరావుపేటలో తిన్నాను.",
    "[00:13] స్పెషల్ అకేషన్స్ కి కానీ, ఏదైనా వీకెండ్స్ లో కానీ, బ్యాచిలర్స్ కానీ ఈ రెసిపీని ఒకసారి ట్రై చేసి చూడండి.",
    "[00:18] రోజూ ఇదే కావాలంటారు. నిజంగా అంత బావుంటుంది.",
    "[00:21] రోజూ తినే దానికంటే కూడా కచ్చితంగా ఆ రోజు నాలుగు ముద్దలు ఎక్కువే తింటారు.",
    "[00:26] అన్నిటికీ మించి చాలా తృప్తిగా భోజనం చేస్తారు.",
    "[00:29] లెట్స్ నాట్ వెయిట్, స్టార్ట్ చేసేద్దాం నరసరావుపేట స్పెషల్ మసాలా గుడ్డు కారం ఫ్రై.",
    "[00:34] ముందుగా పాన్ లో 2 టీస్పూన్ల ధనియాలు, ఓ చిన్న దాల్చిన చెక్క, నాలుగు యాలకులు, ఓ అనాస పువ్వు వేయండి.",
    "[00:41] ఆరేడు లవంగాలు, ఎనిమిది వెల్లుల్లి, రెండు టీస్పూన్ల గసగసాలు, పావుకప్పు ఎండు కొబ్బరి ముక్కలు.",
    "[00:47] లో ఫ్లేమ్ మీద మంచి సువాసన వచ్చేంత వరకు రోస్ట్ చేసుకోండి.",
    "[01:21] ఇవన్నీ జార్ లో వేసి ఫైన్ గా పౌడర్ చేసుకోండి.",
    "[01:26] ఇప్పుడు పాన్ లో అర కప్పు ఆయిల్ హీట్ చేసుకోండి.",
    "[01:30] బాయిల్ చేసిన నాలుగు గుడ్లు వేసి మూత పెట్టండి.",
    "[01:38] మీడియం ఫ్లేమ్ మీద లైట్ గోల్డెన్ బ్రౌన్ కలర్ వచ్చే వరకు ఫ్రై చేయండి.",
    "[01:46] అదే పాన్ లో మూడు పెద్ద ఉల్లిపాయల సన్నని తరుగు వేయండి.",
    "[01:51] రెండు పచ్చిమిర్చి, సాల్ట్ వేసి ఉల్లిపాయలు పింక్ కలర్ వచ్చే వరకు మగ్గించండి.",
    "[02:03] అర చెంచా పసుపు, ఒక టేబుల్ స్పూన్ కారం వేసి కలపండి.",
    "[02:11] ఒక టీస్పూన్ అల్లం వెల్లుల్లి పేస్ట్ వేసి ఫ్రై చేయండి.",
    "[02:18] ఎగ్స్ ని నాలుగు ముక్కలుగా కట్ చేయండి.",
    "[02:25] మసాలా పౌడర్ వేసి జాగ్రత్తగా కలపండి.",
    "[02:35] పుదీనా తరుగు, కొత్తిమీర తరుగు వేసి దింపేయండి.",
    "[02:41] అంతే! వేడి వేడి అన్నంలో తింటే చాలా బావుంటుంది.",
    "[03:03] త్వరలో విస్మయ్ ఫుడ్ వెబ్సైట్ స్టార్ట్ అవుతుంది."
  ],
  "transcription_english": [
    "[00:00] Hello Foodies, Welcome to Vismai Food. Today's special is \"Masala Egg Spicy Fry\".",
    "[00:05] I cannot express in words how good it tastes.",
    "[00:10] I ate this recipe in Narasaraopet, Guntur district.",
    "[00:13] For special occasions, weekends, or bachelors, please try this recipe once.",
    "[00:18] You will want this every day. It is truly that good.",
    "[00:21] You will eat a few extra mouthfuls for sure.",
    "[00:26] Above all, you will have a very satisfying meal.",
    "[00:29] Let’s not wait, let’s start the Narasaraopet Special Masala Egg Spicy Fry.",
    "[00:34] First add coriander seeds, cinnamon, cardamom, and star anise to a pan.",
    "[00:41] Add cloves, garlic, poppy seeds, and dry coconut pieces.",
    "[00:47] Roast on low flame until aromatic.",
    "[01:21] Grind the roasted ingredients into a fine powder.",
    "[01:26] Heat half a cup of oil in a pan.",
    "[01:30] Add boiled eggs and cover with a lid.",
    "[01:38] Fry until light golden brown.",
    "[01:46] Add finely chopped onions to the same pan.",
    "[01:51] Add green chilies and salt, cook until pink.",
    "[02:03] Add turmeric and red chili powder.",
    "[02:11] Add ginger-garlic paste and fry well.",
    "[02:18] Cut eggs into four pieces.",
    "[02:25] Add ground masala and coat carefully.",
    "[02:35] Add chopped mint and coriander leaves.",
    "[02:41] That’s it! Enjoy with hot rice.",
    "[03:03] Vismai Food website is coming soon."
  ]
}
