{
  "metadata": {
    "title": "Pala Puri Recipe | పాల పూరీ | వందల ఏళ్ళనాటి అంతరించిపోయిన రెసిపీ | మళ్ళీ మళ్ళీ తినలన్పించే పూరీ",
    "channel_name": "Vismai Food",
    "publish_date": "2019-04-04",
    "view_count": 5168048,
    "like_count": 66842,
    "duration": "03:38",
    "language": "Telugu",
    "video_id": "W1L3dkK2XHY",
    "url": "https://www.youtube.com/watch?v=W1L3dkK2XHY",
    "description": "Lost recipe of Andhra Pradesh – Pala Puri. A centuries-old traditional sweet made with milk, wheat flour, and nuts. Authentic festival sweet recipe shared by Vismai Food.",
    "ingredients_detected": [
      "Wheat flour",
      "Salt",
      "Ghee",
      "Water",
      "Poppy seeds",
      "Rice flour",
      "Cashew nuts",
      "Fresh coconut",
      "Milk",
      "Sugar",
      "Cardamom powder",
      "Oil"
    ]
  },
  "transcription_telugu": [
    "[00:00:00.000] హలో ఫుడీస్, వెల్కమ్ టు విస్మయ్ ఫుడ్. ఇవాల్టి స్పెషల్ తెలుగు వాళ్లు ఎప్పుడో మర్చిపోయినటువంటి స్పెషల్ పాల పూరీల రెసిపీ.",
    "[00:00:07.000] ఇది వందల ఏళ్లనాటి రెసిపీ.",
    "[00:00:09.000] ఈ విధానాన్ని దాదాపుగా అందరూ మర్చిపోయారు.",
    "[00:00:11.000] ఇప్పుడు మనం చేస్తున్న పాల పూరీలకి, ఈ పూరీలకి ఎక్కడా పొంతన లేదు.",
    "[00:00:16.000] ఈ రెసిపీని నాకు \"అంతరించిపోయిన రుచులు\" అనే పుస్తకం రాస్తున్నటువంటి డాక్టర్ జి.వి. పూర్ణచంద్ గారు షేర్ చేశారు.",
    "[00:00:21.000] అతిశయోక్తి అనుకోకపోతే ఓ మాట చెప్తాను.",
    "[00:00:23.000] అమృతం ఎలా ఉంటుందో తెలియదు కానీ, ఈ పూరీలు తింటుంటే అమృతం ఇలాగే ఉంటుంది.",
    "[00:00:29.000] ఇంకా చెప్పాలంటే ఇదే బాగుంది అని అనిపించక మానదు.",
    "[00:00:32.000] ఈ మాటలు అన్నిటికీ మించి చాలా హెల్దీ ఈ పూరీలు.",
    "[00:00:35.000] పిల్లలైతే అడిగి మరీ తింటారు అంత బావుంటాయి ఈ పూరీలు.",
    "[00:00:38.000] పర్ఫెక్ట్ ఫెస్టివల్ రెసిపీ ఇది. లెట్స్ స్టార్ట్.",
    "[00:00:41.000] ముందుగా బౌల్ లో ఓ కప్పు గోధుమ పిండి వేసుకోండి.",
    "[00:00:44.000] ఇందులో ఓ చిటికెడు ఉప్పు, రెండు టేబుల్ స్పూన్ల నెయ్యి వేసి బాగా కలుపుకోండి.",
    "[00:00:51.000] ఆ తర్వాత కొద్ది కొద్దిగా నీళ్లు పోసుకుంటూ పిండిని గట్టిగా కలుపుకొని ముప్పై నిమిషాలు పక్కన ఉంచండి.",
    "[00:01:01.000] మిక్సీ జార్ లో గసగసాలు, బియ్యప్పిండి వేసి ఫైన్ గా పౌడర్ చేసుకోండి.",
    "[00:01:08.000] జీడిపప్పు వేసి పలుకు లేకుండా ఫైన్ గా పౌడర్ చేయండి.",
    "[00:01:13.000] పచ్చి కొబ్బరి తురుము వేసి పాలతో వెన్నలా పేస్ట్ చేయండి.",
    "[00:01:21.000] రెసిపీలో రుచి ఇక్కడే ఉంది.",
    "[00:01:28.000] మందపాటి అడుగున్న గిన్నెలో ఈ పేస్ట్ వేసి...",
    "[00:01:36.000] ఓ లీటరు చిక్కటి పాలు వేసి లో ఫ్లేమ్ మీద మరిగించండి.",
    "[00:01:40.000] అడుగంటకుండా నిరంతరం కలుపుతూ ఉండాలి.",
    "[00:01:55.000] ముప్పావు కప్పు పంచదార, యాలకుల పొడి వేసి మరిగించండి.",
    "[00:02:07.000] సాంబార్ లా చిక్కగా అయ్యాక దింపి చల్లారనివ్వండి.",
    "[00:02:12.000] పిండిని చిన్న ఉండలుగా చేసి పల్చటి పూరీలుగా ఒత్తుకోండి.",
    "[00:02:25.000] ఫోర్క్ తో గాట్లు పెట్టండి.",
    "[00:02:34.000] వేడి నూనెలో పూరీలు క్రిస్పీగా వేపుకోండి.",
    "[00:02:46.000] చల్లారిన పూరీలను పాల మిశ్రమంలో 15 సెకన్లు ముంచి తీయండి.",
    "[00:02:59.000] పైగా పాల మిశ్రమం పోసుకొని తింటే అమృతంలా ఉంటుంది.",
    "[00:03:10.000] ఈ పాల మిశ్రమం రెండు మూడు రోజులు నిల్వ ఉంటుంది.",
    "[00:03:23.000] నచ్చిందా ఈ అంతరించిపోయిన పాల పూరీల రెసిపీ?",
    "[00:03:30.000] త్వరలో విస్మయ్ ఫుడ్ వెబ్సైట్ స్టార్ట్ అవుతుంది. గెట్ రెడీ."
  ],
  "transcription_english": [
    "[00:00:00.000] Hello Foodies, Welcome to Vismai Food. Today's special is a forgotten traditional Pala Puri recipe.",
    "[00:00:07.000] This is a recipe that dates back hundreds of years.",
    "[00:00:09.000] Almost everyone has forgotten this method.",
    "[00:00:11.000] There is no comparison between modern milk puris and these puris.",
    "[00:00:16.000] This recipe was shared by Dr. G.V. Poornachand from his book \"Antharinchipoyina Ruchulu\".",
    "[00:00:23.000] I don’t know how nectar tastes, but these puris feel like nectar.",
    "[00:00:32.000] More than anything, these puris are very healthy.",
    "[00:00:38.000] This is a perfect festival recipe. Let’s start.",
    "[00:00:41.000] Take one cup of wheat flour in a bowl.",
    "[00:00:44.000] Add salt and ghee and mix well.",
    "[00:00:51.000] Add water gradually and knead stiff dough, rest for 30 minutes.",
    "[00:01:01.000] Grind poppy seeds and rice flour into fine powder.",
    "[00:01:08.000] Add cashew nuts and grind finely.",
    "[00:01:13.000] Add fresh coconut and milk, grind into butter-like paste.",
    "[00:01:36.000] Add paste to a heavy-bottomed pan with milk and cook on low flame.",
    "[00:01:55.000] Add sugar and cardamom powder and cook until thick.",
    "[00:02:12.000] Roll dough into thin puris and prick with fork.",
    "[00:02:34.000] Deep fry puris until crispy.",
    "[00:02:46.000] Dip puris in milk mixture for 15 seconds.",
    "[00:02:59.000] Pour more milk mixture on top and enjoy.",
    "[00:03:30.000] Vismai Food website is launching soon. Get ready."
  ]
}
