{
  "metadata": {
    "title": "Ugadi Pachadi | వేద కాలం నాటి ఉగాది పచ్చడి | అసలైన ఉగాది పచ్చడి తెలియాలంటే ఈ వీడియో చుడండి",
    "channel_name": "Vismai Food",
    "publish_date": "2019-04-05",
    "view_count": 1532091,
    "like_count": 22394,
    "duration": "01:46",
    "language": "Telugu",
    "video_id": "78xFRYVh-Wg",
    "url": "https://www.youtube.com/watch?v=78xFRYVh-Wg",
    "description": "For Complete Recipe With Ingredients visit www.vismaifood.com\n\nFor more videos subscribe to our channel :\nwww.youtube.com/channel/UCBSwcEOp0PMwhvE6FVjgITw?sub_confirmation=1\n\n#ugadiPacchadi #RealUgadiPacchadi #AsalainaUgadiPacchadi",
    "ingredients_detected": [
      "Jaggery (Bellam)",
      "Sugarcane pieces (optional)",
      "Neem flowers (Veppapuvvu)",
      "Tender mango buds (Mamidipindelu)",
      "Black pepper powder (Miriyala podi)",
      "Rock salt (Rati uppu)",
      "Fresh tamarind extract (Kotha chintapandu rasam)",
      "Water"
    ]
  },
  "transcription_telugu": [
    "[00:00] హలో ఫుడీస్, వెల్కమ్ టు విస్మయ్ ఫుడ్. ఇవాల్టి స్పెషల్ సబ్స్క్రైబర్స్ మోస్ట్ రిక్వెస్టెడ్ రెసిపీ షడ్రసోపేతమైన ఉగాది పచ్చడి.",
    "[00:08] నేను మీకు అసలైన శశాస్త్రీయమైన ఉగాది పచ్చడి చెప్పబోతున్నాను.",
    "[00:12] ఇది దాదాపుగా మనం మర్చిపోయినటువంటి విధానం.",
    "[00:15] కాలానుగుణంగా ఇంటికి, ఊరికి, ప్రాంతానికి తగ్గట్టుగా రకరకాలుగా చేసేస్తున్నారు ఈ ఉగాది పచ్చడి.",
    "[00:21] కానీ నేను మీకు నిజమైన షడ్రసోపేతమైన ఉగాది పచ్చడి చెప్పబోతున్నాను.",
    "[00:25] ఈ పచ్చడికి ముందుగా అర కప్పు బెల్లం తురుము తీసుకోండి.",
    "[00:28] వెనుకటికి బెల్లం కూడా వాడేవారు కాదు. కేవలం చిన్న చిన్న చెరుకు గడ ముక్కలు వాడేవారు.",
    "[00:33] కుదిరితే అవే వాడుకోండి.",
    "[00:35] తర్వాత కేవలం మూడు టేబుల్ స్పూన్ల వేపపూత, కాడలు లేనిది వేసుకోండి.",
    "[00:39] ఇందులో కేవలం అర కప్పు చిన్న చిన్న మామిడి పిందెల ముక్కలు మాత్రమే వేయాలి.",
    "[00:44] అందరూ మామిడికాయ ముక్కలు వేసేస్తుంటారు. ఇది సరైన పద్ధతి కాదు.",
    "[00:47] ఎందుకంటే ఈ పచ్చడికి పులుపు చింతపండు నుండి వస్తుంది.",
    "[00:53] ఇప్పుడు ముప్పావు చెంచా మిరియాల పొడి వేసుకోండి.",
    "[01:00] మనకి తెలిసిన కారం మిరియాలు, శొంఠి మాత్రమే.",
    "[01:10] రుచికి సరిపడా కేవలం రాతి ఉప్పుని మాత్రమే వాడుకోండి.",
    "[01:14] ఆ తర్వాత 50 గ్రాముల చిక్కటి కొత్త చింతపండు రసం మాత్రమే పోసుకోవాలి.",
    "[01:20] ఇందులో 300 ml నీళ్ళు పోసుకొని బెల్లాన్ని కరిగించుకోండి.",
    "[01:24] ఈ విధానాన్ని నేను పెద్దల్ని అడిగి తెలుసుకున్నది.",
    "[01:42] ఫుడీస్ అందరికీ ఉగాది శుభాకాంక్షలు."
  ],
  "transcription_english": [
    "[00:00] Hello Foodies, Welcome to Vismai Food. Today's special is the most requested recipe – the six-taste Ugadi Pachadi.",
    "[00:08] I am going to explain the authentic and traditional Ugadi Pachadi.",
    "[00:12] This is a method that we have almost forgotten.",
    "[00:15] Over time, this recipe has been altered based on region and households.",
    "[00:21] But I am sharing the true six-flavor Ugadi Pachadi.",
    "[00:25] First, take half a cup of grated jaggery.",
    "[00:28] In olden days, jaggery was not used; only sugarcane pieces were used.",
    "[00:33] If possible, use sugarcane pieces.",
    "[00:35] Add three tablespoons of neem flowers without stems.",
    "[00:39] Add only half a cup of tender mango buds.",
    "[00:44] Adding raw mango pieces is incorrect.",
    "[00:47] The sour taste should come from tamarind, not mango.",
    "[00:53] Add three-quarter teaspoon of black pepper powder.",
    "[01:00] Earlier, only black pepper and dry ginger were used for spice.",
    "[01:10] Add rock salt as needed.",
    "[01:14] Add 50 grams of fresh tamarind extract.",
    "[01:20] Add 300 ml water and dissolve the jaggery.",
    "[01:24] This method was learned from elders and scholars.",
    "[01:42] Happy Ugadi to all Foodies."
  ]
}
