{
  "metadata": {
    "title": "Mango Coconut Pulihora | మామిడికాయ కొబ్బరి పులిహోర | మా టిప్స్ తో పర్ఫెక్ట్ గా వస్తుంది",
    "channel_name": "Vismai Food",
    "publish_date": "2019-04-06",
    "view_count": 1488809,
    "like_count": 20751,
    "duration": "00:02:50",
    "language": "Telugu",
    "video_id": "mWHcEyyUAd4",
    "url": "https://www.youtube.com/watch?v=mWHcEyyUAd4&list=PLD2vlKwLAN3AoDW8dziT7BDqzc39ysKSz&index=104",
    "description": "Buy MEYER pans at www.potsandpans.in \nLink: http://bit.ly/2V3Iufp\n15% Discount code: VIS15\n\nVisit https://www.vismaifood.com/\nFor More Recipes and to Purchase our Products.\n\nFor Complete Recipe With Ingredients visit www.vismaifood.com\n\nHey Foodies. Welcome to Vismai Food.\n\nIn general, mangoes are available in the summer season, we should definitely try this mango coconut pulihora. It is quite different from the regular pulihora recipe.\n#Pulihora #MangoPulihora #CoconutPulihora #MangoCoconutPulihora #UgadiSpecial #UgadiRecipe\n\nFor more interesting recipes, please do subscribe to our channel:\n\nwww.youtube.com/channel/UCBSwcEOp0PMwhvE6FVjgITw?sub_confirmation=1\nhttps://www.youtube.com/vismaifood\n\nFollow us on Social Media:\n\nhttps://twitter.com/VismaiF\nhttps://www.instagram.com/vismaifoodies/\nhttps://www.facebook.com/Vismai-Food-...\n\nVismai Food Staff\n\nExecutive Producer: Swetha Paruchuri\nCamera: Phani Sudhir\nEdit: Teja, Ajith",
    "ingredients_detected": [
      "Rice",
      "Water",
      "Turmeric",
      "Oil",
      "Peanuts",
      "Dry Red Chilies",
      "Chana Dal",
      "Urad Dal",
      "Mustard Seeds",
      "Cumin Seeds",
      "Asafoetida",
      "Green Chilies",
      "Raw Mango",
      "Salt",
      "Fresh Grated Coconut"
    ]
  },
  "transcription_telugu": [
    "[00:00] విస్మయ్ ఫుడ్ వీక్షకులందరికీ ఉగాది శుభాకాంక్షలు.",
    "[00:03] ప్రతి రోజు మీ జీవితం విస్మయాలతో నిండిపోవాలని కోరుకుంటోంది విస్మయ్ ఫుడ్ టీమ్.",
    "[00:06] భలే ఉంటుంది కదా? ప్రతి రోజు 'వవ్ (wow)' అనిపిస్తూ ఉంటే?",
    "[00:10] అలా విస్మయం చెందాలంటే విస్మయ్ ఫుడ్ ఈజ్ ది రైట్ ఛానల్ (right channel).",
    "[00:13] ఈ రోజు స్పెషల్ విస్మయ్ ఫుడ్ లో కొబ్బరి మామిడికాయ పులిహోర.",
    "[00:16] చాలా బావుంటుంది. ఏదైనా పండగలకు కానీ, డే టు డే లైఫ్ (day-to-day life) లో కానీ.",
    "[00:19] రెగ్యులర్ గా చేసుకునే నిమ్మకాయ పులిహోరకు బదులు, ఈ సీజన్ లో దొరికేటువంటి మామిడికాయతో చేస్తే ఎంత బావుంటుందో.",
    "[00:25] పుల్ల పుల్లగా, కమ్మగా చాలా బావుంటుంది ఈ పులిహోర.",
    "[00:28] తిన్నకొద్దీ తినాలనిపించే విధంగా రావడానికి కొన్ని మైన్యూట్ టిప్స్ (minute tips) ఉన్నాయి. లెట్స్ స్టార్ట్.",
    "[00:33] కుక్కర్ లో ఓ కప్పు కడిగిన బియ్యం వేసుకోండి.",
    "[00:35] అందులో రెండు కప్పుల నీళ్లు, అర చెంచా పసుపు, ఓ టీస్పూన్ నూనె వేసి కేవలం హై ఫ్లేమ్ మీదే మూడు విజిల్స్ రానివ్వండి.",
    "[00:45] హై ఫ్లేమ్ మీద వండితేనే అన్నం పొడిపొడిగా వస్తుంది కుక్కర్ లో.",
    "[00:48] పసుపు వేసే తీరులోనే పులిహోర రుచే మార్చేయొచ్చు.",
    "[00:51] ఇలా అన్నంతో పాటు పసుపు వేస్తే అన్నానికి పసుపు బాగా పడుతుంది.",
    "[00:55] విలేజ్ లో జరిగే పెళ్లిళ్ల స్టైల్ లో చేయాలంటే వేడి వేడిగా వార్చిన అన్నంలో పచ్చి పసుపు నూనె కలుపుతారు. ఆహా... ఆ రుచే వేరు అది ఇంకా బావుంటుంది అది మరోసారి చెప్తాను.",
    "[01:04] ఇప్పుడు పొడిపొడిగా వండుకున్నటువంటి అన్నాన్ని అడుగు నుండి కేవలం అట్లకాడతోనే కలుపుకోండి అప్పుడు మెతుకు విరగదు.",
    "[01:10] ఇప్పుడు ఈ అన్నాన్ని పళ్ళెంలో పోసి పూర్తిగా చల్లారనివ్వండి ఫ్యాన్ కింద పెట్టి.",
    "[01:15] ఇప్పుడు అడుగు మందంగా ఉన్నటువంటి ఇలాంటి పాన్ లో పావు కప్పు ఆయిల్ హీట్ చేసుకొని, పావు కప్పు వేరుశనగ పప్పు వేసి లో ఫ్లేమ్ మీద వేపుకోండి.",
    "[01:23] అప్పుడు శనగపప్పు అట్టడుగు పొరల దాకా వేగుతుంది తింటున్నప్పుడు మజా వస్తుంది.",
    "[01:28] మీకు ఇంకా క్రంచీగా కావాలి తినేటప్పుడు అనుకుంటే ఎర్రగా వేపుకొని తీసి పక్కన ఉంచి ఆఖరున కలుపుకోండి.",
    "[01:34] ఇప్పుడు మూడు ఎండుమిర్చి తరుగు, ఓ టేబుల్ స్పూన్ పచ్చి శనగపప్పు, ఓ టేబుల్ స్పూన్ పొట్టు మినప్పప్పు ఫ్లేవర్ చాలా బావుంటుంది.",
    "[01:41] ఓ టీస్పూన్ ఆవాలు, ఓ టీస్పూన్ జీలకర్ర వేసి, ఓ నిమిషం పాటు మీడియం ఫ్లేమ్ మీద వేపుకోండి...",
    "[01:46] అర టీస్పూన్ ఇంగువ, నాలుగు పచ్చిమిర్చి చీలికలు వేసి తాలింపు మంచి సువాసన వచ్చేంత వరకు వేపుకోండి.",
    "[01:54] ఇప్పుడు ఓ కప్పు చెక్కు తీసి తురుముకున్న పచ్చి మామిడికాయ తురుము వేసుకోండి.",
    "[01:57] పులుపు ఇష్టపడేవారు కప్పు బియ్యానికి కప్పు మామిడి తురుము వేసుకోండి, లేదంటే ముప్పావు కప్పు వేసుకోండి.",
    "[02:02] వాస్తవానికి కప్పు రైస్ కి కప్పు మామిడి తురుము ఉంటేనే రుచిగా ఉంటుంది.",
    "[02:06] జస్ట్ మామిడికాయలోని పసరు వాసన పోతే చాలు.",
    "[02:08] ఆ తర్వాత సాల్ట్, అర కప్పు పచ్చి కొబ్బరి తురుము వేసుకోండి.",
    "[02:13] పచ్చి కొబ్బరి తురుము వేసుకొని ఓ నిమిషం పాటు ఫ్రై చేసుకొని స్టవ్ ఆఫ్ చేసేసి...",
    "[02:18] పూర్తిగా చల్లార్చుకున్నటువంటి అన్నాన్ని వేసి అట్లకాడతో తాలింపును పట్టించండి.",
    "[02:23] కాస్త చల్లారాక చేత్తో కలుపుకుంటే ఇంకా బాగా పడుతుంది తాలింపు.",
    "[02:26] అంతే! యు ఆర్ డన్ (You are done)!",
    "[02:28] పుల్లగా, కమ్మగా, కారంగా చాలా బావుంటుంది ఈ పులిహోర.",
    "[02:31] మధ్య మధ్యలో ఎండుమిర్చి, పచ్చిమిర్చి కొరుక్కుంటూ తింటుంటే ఉంటుంది ఈ పులిహోర... ఆహా... చాలా బావుంటుంది.",
    "[02:38] మీకు నచ్చిందా? మరి అయితే మీరు ట్రై చేసి మీకు ఎలా కుదిరిందో కచ్చితంగా ఆ పిక్ ని విస్మయ్ ఫుడ్ ఇన్స్టాగ్రామ్ లో పోస్ట్ చేయండి.",
    "[02:43] త్వరలో విస్మయ్ ఫుడ్ సైట్ లాంచ్ అవ్వబోతుంది అందులో నేను మీకు బోల్డన్ని కిచెన్ ఐటమ్స్ అందుబాటులోకి తేబోతున్నాను ఆన్లైన్ లో గెట్ రెడీ."
  ],
  "transcription_english": [
    "[00:00] Happy Ugadi to all Vismai Food viewers.",
    "[00:03] The Vismai Food team wishes that your life is filled with wonders every day.",
    "[00:06] Isn't it great? If every day feels like 'wow'?",
    "[00:10] To be amazed like that, Vismai Food is the right channel.",
    "[00:13] Today's special on Vismai Food is Coconut Mango Pulihora (Tamarind Rice style).",
    "[00:16] It tastes very good. Be it for any festivals or day-to-day life.",
    "[00:19] Instead of the regular Lemon Pulihora, if you make it with the raw mango available in this season, it tastes so good.",
    "[00:25] Tangy, savory, this Pulihora is delicious.",
    "[00:28] There are some minute tips to make it so tasty that you'd want to eat more as you eat. Let's start.",
    "[00:33] Add one cup of washed rice to a pressure cooker.",
    "[00:35] Add two cups of water, half a teaspoon of turmeric, and one teaspoon of oil, and let it whistle three times on high flame only.",
    "[00:45] The rice comes out fluffy in the cooker only if cooked on high flame.",
    "[00:48] The taste of Pulihora can change just by the way turmeric is added.",
    "[00:51] If you add turmeric along with the rice like this, the turmeric coats the rice well.",
    "[00:55] To make it in the style of village weddings, they mix raw turmeric and oil into piping hot drained rice. Aha... that taste is distinct and even better. I will tell you about that another time.",
    "[01:04] Now, mix the fluffy cooked rice gently from the bottom using only a flat ladle so that the grains don't break.",
    "[01:10] Now pour this rice onto a plate and let it cool completely under a fan.",
    "[01:15] Now heat a quarter cup of oil in a heavy-bottomed pan like this, add a quarter cup of peanuts, and roast on a low flame.",
    "[01:23] This way the peanuts roast to the inner layers, and you get the real taste while eating.",
    "[01:28] If you want it even more crunchy while eating, roast them until red, take them out, set aside, and mix them in at the end.",
    "[01:34] Now add three chopped dry red chilies, one tablespoon of chana dal, and one tablespoon of split black gram (urad dal) with skin; the flavor is very good.",
    "[01:41] Add one teaspoon of mustard seeds, one teaspoon of cumin seeds, and fry for a minute on medium flame.",
    "[01:46] Add half a teaspoon of asafoetida and four slit green chilies, and fry until the tempering releases a nice aroma.",
    "[01:54] Now add one cup of peeled and grated raw mango.",
    "[01:57] Those who like sourness can add one cup of mango grate for one cup of rice, otherwise add three-quarter cup.",
    "[02:02] Actually, it tastes best if there is one cup of mango grate for one cup of rice.",
    "[02:06] Just the raw green smell of the mango needs to go away.",
    "[02:08] After that, add salt and half a cup of fresh grated coconut.",
    "[02:13] Add the fresh coconut grate, fry for a minute, and turn off the stove.",
    "[02:18] Add the completely cooled rice and mix the tempering well using a flat ladle.",
    "[02:23] If you mix it with your hand after it cools down a bit, the tempering coats the rice even better.",
    "[02:26] That's it! You are done!",
    "[02:28] Sour, savory, and spicy, this Pulihora is very good.",
    "[02:31] While eating, biting into the dry chilies and green chilies in between... Aha... it is very good.",
    "[02:38] Did you like it? Then try it and definitely post the picture of how it turned out for you on Vismai Food Instagram.",
    "[02:43] The Vismai Food website is launching soon, where I will be bringing you many kitchen items online. Get ready."
  ]
}
