{
  "metadata": {
    "title": "Chutneypodi|చట్నీ పొడి| ఈ పొడి ఉంటె ఎప్పుడంటే అప్పుడు చట్నీ రెడీ| #INSTANTCHUTNEYPOWDER|Telugu",
    "channel_name": "Vismai Food",
    "publish_date": "2018-11-19",
    "view_count": 984271,
    "like_count": 13975,
    "duration": "02:16",
    "language": "Telugu",
    "video_id": "tvJccAPSjfA",
    "url": "https://www.youtube.com/watch?v=tvJccAPSjfA",
    "description": "For more videos subscribe to our channel :\nwww.youtube.com/channel/UCBSwcEOp0PMwhvE6FVjgITw?sub_confirmation=1\n\nINGREDIENTS\n200GMS PEANUTS\n1/4CUP SESAME SEEDS\n2 SPRIGS CURRY LEAVES\nHALF DRY COCONUT PIECES\nSALT\n2TSPS CHILLI POWDER\n2TSPS COROANDER POWDER\n2TSPS ROASTED CUMIN POWDER\n1TSP SUGAR\n1 PINCH HING(ASOFEITIDA)\n\nచట్నీ పొడి| ఈ పొడి ఉంటె ఎప్పుడంటే అప్పుడు చట్నీ రెడీ| #INSTANTCHUTNEYPOWDER | #chutneypodi | Telugu",
    "ingredients_detected": [
      "Peanuts (పల్లీలు) - 200g",
      "Sesame seeds (నువ్వులు) - 1/4 cup",
      "Curry leaves (కరివేపాకు) - 2 sprigs",
      "Dry coconut pieces (ఎండు కొబ్బరి ముక్కలు) - half",
      "Chili powder (కారం) - 2 tbsp",
      "Roasted coriander powder (ధనియాల పొడి) - 2 tsp",
      "Roasted cumin powder (జీలకర్ర పొడి) - 2 tsp",
      "Salt (ఉప్పు) - as needed",
      "Sugar (పంచదార) - 1 tsp optional",
      "Asafoetida (ఇంగువ) - a pinch",
      "Tamarind (చింతపండు) - lemon sized",
      "Roasted gram / Putnala pappu (శనగపప్పు) - 50g"
    ]
  },
  "transcription_telugu": [
    "[00:00] హలో ఫుడీస్, వెల్కమ్ టు విస్మయ్ ఫుడ్.",
    "[00:01] ఇవాల్టి యమ్మీ, అరోమాటిక్, సింపుల్ రెసిపీ \"ఇన్స్టంట్ చట్నీ పౌడర్\".",
    "[00:06] ఇందులో ఎన్నో అమేజింగ్ వెరైటీస్ ఉన్నాయి. మిగిలినవి నేను మరోసారి చూపిస్తాను.",
    "[00:11] చాలా టైమ్ సేవ్ చేస్తుంది. ఎనీ సౌత్ ఇండియన్ బ్రేక్ ఫాస్ట్ (Any South Indian Breakfast) తో చాలా బాగా సూట్ అయిపోతుంది ఈ పౌడర్.",
    "[00:18] ఇంకా చెప్పాలంటే వేపుడు కూరల్లో ఆఖరున ఈ పొడి చల్లి చూడండి. కూరకి ఎంత రుచినిస్తుందో.",
    "[00:23] నన్ను వదిలేస్తే ఇంకా ఇంకా చాలా చెప్తూనే ఉంటాను.",
    "[00:26] బై ది వే (By the way) మీకో ముఖ్యమైన విషయం చెప్పాలి.",
    "[00:28] ఈ పొడి పర్ఫెక్ట్ గా రావడానికి బోల్డన్ని టిప్స్, ట్రిక్స్ ఉన్నాయి.",
    "[00:32] అవన్నీ వీడియో చివర్లో చెప్తాను. తప్పకుండా వీడియో చివరి వరకు చూడండి ఈ రెసిపీ. లెట్స్ స్టార్ట్.",
    "[00:37] కడాయిలో 200 గ్రాముల పల్లీలు వేసి లో ఫ్లేమ్ (low flame) మీదే చక్కగా వేపుకోండి.",
    "[00:41] హై ఫ్లేమ్ మీద వేపితే అంత రుచిగా ఉండవు పల్లీలు.",
    "[00:44] వీటిని పూర్తిగా చల్లార్చి పొట్టు తీసి ఉంచుకోండి.",
    "[00:46] ఇప్పుడు పావు కప్పు నువ్వులు వేసి లో ఫ్లేమ్ మీదే మంచి సువాసన వచ్చేంత వరకు వేపుకోండి.",
    "[00:53] ఇప్పుడు ఓ చిప్ప ఎండు కొబ్బరి ముక్కలు వేసి లో ఫ్లేమ్ మీద మాత్రమే పచ్చి వాసన పోయేంత వరకు వేపుకోండి.",
    "[01:00] ఇప్పుడు రెండు రెబ్బల కరివేపాకు వేసి, లో ఫ్లేమ్ మీదే పూర్తిగా తేమ పోయి డ్రై అయ్యేంత వరకు వేపుకోండి.",
    "[01:06] ఇప్పుడు వేపుకున్నవన్నీ పూర్తిగా చల్లారిన తర్వాత మాత్రమే మిక్సీ జార్ లో వేసుకోండి.",
    "[01:11] దీనిలో నిమ్మకాయంత చింతపండు, 50 గ్రాముల శనగపప్పు (పుట్నాల పప్పు) వేసి...",
    "[01:16] పొట్టు తీసినటువంటి పల్లీలు వేసుకోండి.",
    "[01:18] వీటిని మెత్తగా మిక్సీ జార్ ని ఆపి ఆపి వేస్తూ పౌడర్ చేసుకోండి.",
    "[01:21] ఇందులో రెండు టేబుల్ స్పూన్ల కారం, రెండు టీస్పూన్లు వేయించిన ధనియాల పొడి, రెండు టీస్పూన్లు వేయించిన జీలకర్ర పొడి.",
    "[01:29] రుచికి సరిపడా ఉప్పు, నచ్చితే ఓ టీస్పూన్ పంచదార, ఓ చిటికెడు ఇంగువ వేసి...",
    "[01:34] బాగా కలుపుకొని మెత్తగా గ్రైండ్ చేసుకోండి మళ్ళీ.",
    "[01:38] మీరు ఈ పొడిని గ్రైండ్ చేసుకునేటప్పుడు ఆపి ఆపి గ్రైండ్ చేసుకోవాలి.",
    "[01:42] ఒకటేసారి గ్రైండ్ చేస్తే అది ముద్దగా అయిపోతుంది పొడి.",
    "[01:45] వేడి మీద గ్రైండ్ చేసినా కూడా ముద్దగానే అయిపోతుంది. ఇది మీరు గుర్తుంచుకోవాలి.",
    "[01:49] మీకు ఎప్పుడు కావాలన్నా కొంత చట్నీ పౌడర్ తీసుకోవడం, అందులో కొద్దిగా నీళ్లు యాడ్ చేసుకొని...",
    "[01:54] మీకు నచ్చినంత చిక్కగా కలుపుకుంటే, మీకు కావాల్సినటువంటి చట్నీ పౌడర్ రెడీ.",
    "[01:58] బై ది వే (By the way) మీకో విషయం. మీరు ఇంట్లో తయారు చేసిన రెసిపీస్ అన్నిటినీ విస్మయ్ ఫుడ్ ఇన్స్టాగ్రామ్ లో పోస్ట్ చేయండి. నేను మీకు అక్కడ రెస్పాన్స్ ఇస్తాను.",
    "[02:05] మీకు నచ్చిందా? ఈ ఇన్స్టంట్, అరోమాటిక్, డెలిక్టబుల్ (delectable) చట్నీ పౌడర్?",
    "[02:10] అయితే మీరు లైక్ చేసి, మీరు ట్రై చేసి, మీకు ఎలా కుదిరిందో కామెంట్ చేసి చెప్తారా?"
  ],
  "transcription_english": [
    "[00:00] Hello Foodies, Welcome to Vismai Food.",
    "[00:01] Today's yummy, aromatic, simple recipe is \"Instant Chutney Powder\".",
    "[00:06] There are so many amazing varieties in this. I will show the rest another time.",
    "[00:11] It saves a lot of time. This powder suits very well with any South Indian breakfast.",
    "[00:18] Moreover, try sprinkling this powder at the end in stir-fry curries. See how much taste it adds to the curry.",
    "[00:23] If you let me go on, I will keep telling you more and more.",
    "[00:26] By the way, I have to tell you an important thing.",
    "[00:28] There are many tips and tricks to get this powder perfect.",
    "[00:32] I will tell all of them at the end of the video. Definitely watch the video till the end for this recipe. Let's start.",
    "[00:37] Add 200 grams of peanuts in a pan and roast nicely on low flame only.",
    "[00:41] If roasted on high flame, peanuts won't taste as good.",
    "[00:44] Cool them completely and remove the skin.",
    "[00:46] Now add a quarter cup of sesame seeds and roast on low flame until a nice aroma comes.",
    "[00:53] Now add half a dried coconut shell (pieces) and roast only on low flame until the raw smell goes away.",
    "[01:00] Now add two sprigs of curry leaves and roast on low flame until the moisture is gone and they become dry.",
    "[01:06] Now, add all the roasted ingredients to a mixer jar only after they have cooled down completely.",
    "[01:11] Add lemon-sized tamarind, 50 grams of roasted gram (putnala pappu) into this...",
    "[01:16] Add the peeled peanuts.",
    "[01:18] Grind these into a powder by pulsing the mixer (stopping and starting).",
    "[01:21] Add two tablespoons of chili powder, two teaspoons of roasted coriander powder, two teaspoons of roasted cumin powder.",
    "[01:29] Add salt sufficient for taste, one teaspoon of sugar if you like, and a pinch of asafoetida...",
    "[01:34] Mix well and grind finely again.",
    "[01:38] When you grind this powder, you must pulse grind it (stop and grind).",
    "[01:42] If you grind it all at once, the powder will become lumpy (paste-like).",
    "[01:45] Even if you grind it while it's hot, it will become lumpy. You must remember this.",
    "[01:49] Whenever you want, take some chutney powder, add a little water to it...",
    "[01:54] Mix it to your desired consistency, and your required chutney powder is ready.",
    "[01:58] By the way, one thing. Post all the recipes you make at home on Vismai Food Instagram. I will respond to you there.",
    "[02:05] Did you like it? This instant, aromatic, delectable chutney powder?",
    "[02:10] Then will you like, try, and comment to tell me how it turned out for you?"
  ]
}
