{
  "metadata": {
    "title": "Haldiram's Style Palli Pakoda | హల్దిరామ్స్ స్టైల్ పల్లీ పకోడా | Perfect Taste",
    "channel_name": "Vismai Food",
    "publish_date": "2019-04-08",
    "view_count": 1849870,
    "like_count": 23014,
    "duration": "02:10",
    "language": "Telugu",
    "video_id": "mBWT2L4RBNs",
    "url": "https://www.youtube.com/watch?v=mBWT2L4RBNs",
    "description": "Visit https://www.vismaifood.com/\nFor More Recipes and to Purchase our Products.\n\nFor Complete Recipe With Ingredients visit www.vismaifood.com\n\nHello Foodies. Welcome to Vismai Food.\n\nHere is the spicy and tasty Palli Pakoda in Haldiram's fashion. This Haldiram's style palli pakoda is very easy to prepare and please follow our tips to get the best taste. This recipe is most loved by kids and can be made as snacks within no time.\n#PalliPakoda #HaliramsStylePalliuPakoda #Palli #Pakoda\n\nFor more interesting recipes, please do subscribe to our channel:\n\nwww.youtube.com/channel/UCBSwcEOp0PMwhvE6FVjgITw?sub_confirmation=1\nhttps://www.youtube.com/vismaifood\n\nFollow us on Social Media:\n\nhttps://twitter.com/VismaiF\nhttps://www.instagram.com/vismaifoodies/\nhttps://www.facebook.com/Vismai-Food-...",
    "ingredients_detected": [
      "వేరుశనగ పప్పు (peanuts)",
      "నిమ్మరసం (lemon juice)",
      "రైస్ ఫ్లవర్ (rice flour)",
      "శనగపిండి (gram flour / besan)",
      "కారం (chili powder)",
      "గరం మసాలా (garam masala)",
      "చాట్ మసాలా (chat masala)",
      "అల్లం వెల్లుల్లి పేస్ట్ (ginger-garlic paste, optional)",
      "కూరిగాయలు (if using green chili & cumin paste)",
      "కరివేపాకు (curry leaves, optional)"
    ]
  },
  "transcription_telugu": [
    "[00:00] హలో ఫుడీస్, వెల్కమ్ టు విస్మయ్ ఫుడ్. ఇవాల్టి స్పెషల్ పర్ఫెక్ట్ క్రంచీ హల్దీరామ్స్ స్టైల్ పల్లీ పకోడి.",
    "[00:06] మంచి టైమ్ పాస్ స్నాక్ ఇది. చాలా బావుంటాయి సరిగ్గా కుదిరితే.",
    "[00:10] ఇప్పుడు నేను మీకు పర్ఫెక్ట్ హల్దీరామ్స్ స్టైల్ చూపించబోతున్నాను. అలాగే మన స్టైల్ కూడా చెప్పబోతున్నాను. లెట్స్ స్టార్ట్.",
    "[00:16] ముందుగా మిక్సింగ్ బౌల్ లో 200 గ్రాముల వేరుశనగ పప్పు తీసుకోండి.",
    "[00:20] ఇందులో సాల్ట్, పావు కప్పు బియ్యప్పిండి, పావు కప్పు శనగపిండి.",
    "[00:25] ముప్పావు చెంచా కారం, పావు చెంచా గరం మసాలా, పావు చెంచా చాట్ మసాలా.",
    "[00:30] ఓ చెక్క నిమ్మరసం పిండుకోండి.",
    "[00:32] నిమ్మరసం పిండటం వల్ల చేదు రాదు ఏ డౌట్ అక్కర్లేదు.",
    "[00:35] ఇవన్నీ ముందు వేరుశనగ పప్పుకి బాగా పట్టించుకోండి.",
    "[00:38] మీకు ఇంకా స్పైసీగా కావాలి అనుకుంటే ఇందులో ఓ టీస్పూన్ అల్లం వెల్లుల్లి పేస్ట్ కూడా వేసుకోండి, నేను వేయడం లేదు.",
    "[00:43] ఇవన్నీ వేసి బాగా కోట్ చేసుకున్నాక, చాలా కొద్ది కొద్దిగా నీళ్లు చిలకరించుకుంటూ...",
    "[00:48] ఈ పిండిని కాస్త గట్టిగానే కలుపుకోవాలి.",
    "[00:50] లూజ్ గా పిండిని కలిపితే వేరుశనగ పప్పు పైన కోటింగ్ నిలబడదు. కచ్చితంగా ముద్దగానే కలుపుకోవాలి.",
    "[00:55] ఇందులో కారం కంటే కూడా పచ్చిమిర్చి, జీలకర్ర కలిపి దంచి పేస్ట్ చేస్తే చాలా బావుంటుంది. ఇది మన స్టైల్.",
    "[01:01] అలా కూడా ట్రై చేయండి మీకు నచ్చితే.",
    "[01:03] ఇప్పుడు కచ్చితంగా నూనె బాగా వేడెక్కాక మాత్రమే, మంటని లో ఫ్లేమ్ కి తగ్గించి వేరుశనగ పప్పుని పొడిపొడిగా నూనెలో వేసుకోండి.",
    "[01:12] వేసుకున్న వెంటనే గరిట పెట్టేయకండి. ఓ నిమిషం పాటు అలా వదిలేయండి.",
    "[01:16] ఆ తర్వాత మంటని మీడియం ఫ్లేమ్ లోకి పెట్టి క్రిస్పీగా అయ్యేంత వరకు వేపుకోండి.",
    "[01:20] నూనె వేడెక్కకుండా వేరుశనగ పప్పు వేస్తే గనక ఈ పకోడి నూనెను బాగా పీల్చేస్తాయి.",
    "[01:25] వీటిని మీరు హై ఫ్లేమ్ మీద వేపితే గనక పైన కోటింగ్ చక్కగా వేగుతుంది. కానీ లోపల శనగపప్పు పచ్చిగానే ఉండిపోతుంది.",
    "[01:31] కాబట్టి జాగ్రత్తగా టైమ్ తీసుకొని వేపండి.",
    "[01:34] మీడియం ఫ్లేమ్ మీద లైట్ గోల్డెన్ బ్రౌన్ కలర్ రాగానే, వెంటనే హై ఫ్లేమ్ మీద పెట్టి ఓ నిమిషం వేపుకుంటే చక్కటి గోల్డెన్ బ్రౌన్ కలర్ వస్తుంది.",
    "[01:41] అప్పుడు తీసి పక్కన ఉంచుకోండి.",
    "[01:43] మీకు నచ్చితే ఇందులో ఓ రెబ్బ కరివేపాకు కూడా వేసి వేయించుకొని తీసి ఇందులో కలుపుకోవచ్చు.",
    "[01:47] వేడి మీద కాస్త మెత్తగా అనిపించొచ్చు, గాలికి చల్లారాక క్రిస్పీగా అవుతాయి.",
    "[01:51] మీరు ఎప్పుడు చేసినా పర్ఫెక్ట్ టేస్ట్ రావాలంటే మా టిప్స్ ఫాలో అవ్వండి. ఇందులో రుచంతా మీరు వేపడంలోనే ఉంది.",
    "[01:57] మీకు నచ్చిందా? మరి అయితే మీరు ఎప్పుడు ట్రై చేస్తున్నారు? ఎప్పుడు ఆ పిక్ ని విస్మయ్ ఫుడ్ ఇన్స్టాగ్రామ్ లో పోస్ట్ చేస్తున్నారు?",
    "[02:03] బై ది వే (By the way) వెరీ సూన్ విస్మయ్ ఫుడ్ సైట్ స్టార్ట్ అవ్వబోతోంది. అందులో నేను మీకు బోల్డన్ని ట్రడిషనల్ కిచెన్ ఐటమ్స్ అందుబాటులోకి తేబోతున్నాను. గెట్ రెడీ."
  ],
  "transcription_english": [
    "[00:00] Hello Foodies, Welcome to Vismai Food. Today's special is perfect crunchy Haldiram's style Palli Pakodi (Peanut Fritters).",
    "[00:06] It's a great time-pass snack. They taste very good if made correctly.",
    "[00:10] Now I am going to show you the perfect Haldiram's style. Also, I will tell you our style. Let's start.",
    "[00:16] First, take 200 grams of peanuts in a mixing bowl.",
    "[00:20] Add salt, quarter cup rice flour, and quarter cup gram flour (besan) to this.",
    "[00:25] Add three-quarter teaspoon chili powder, quarter teaspoon garam masala, and quarter teaspoon chat masala.",
    "[00:30] Squeeze juice of half a lemon.",
    "[00:32] Squeezing lemon juice won't make it bitter, no need to doubt.",
    "[00:35] First, coat the peanuts well with all these ingredients.",
    "[00:38] If you want it more spicy, you can add a teaspoon of ginger-garlic paste to this; I am not adding it.",
    "[00:43] After coating well with all these, sprinkle very little water at a time...",
    "[00:48] ...and mix this dough a bit stiff/hard.",
    "[00:50] If you mix the dough loosely, the coating won't stick to the peanuts. You must definitely mix it like a stiff mass.",
    "[00:55] In this, rather than chili powder, if you crush green chilies and cumin seeds into a paste and add it, it tastes very good. This is our style.",
    "[01:01] Try that way too if you like.",
    "[01:03] Now, only after the oil is very hot, reduce the flame to low and drop the peanuts into the oil so they are separated.",
    "[01:12] Do not use the ladle immediately after dropping them. Leave them for a minute.",
    "[01:16] Then turn the flame to medium and fry until they become crispy.",
    "[01:20] If you add peanuts without the oil being hot enough, these pakodis will absorb a lot of oil.",
    "[01:25] If you fry them on high flame, the outer coating will fry nicely. But the peanut inside will remain raw.",
    "[01:31] So fry carefully taking time.",
    "[01:34] Once they turn light golden brown on medium flame, immediately switch to high flame and fry for a minute to get a nice golden brown color.",
    "[01:41] Then remove and set aside.",
    "[01:43] If you like, you can also fry a sprig of curry leaves and mix it in this.",
    "[01:47] They might feel a bit soft while hot, but they will become crispy once cooled in open air.",
    "[01:51] If you want perfect taste whenever you make it, follow our tips. The taste lies in how you fry them.",
    "[01:57] Did you like it? So when are you trying it? When are you posting that pic on Vismai Food Instagram?",
    "[02:03] By the way, very soon Vismai Food site is starting. I am going to bring many traditional kitchen items online for you there. Get ready."
  ]
}
