{
  "metadata": {
    "title": "Pakam Garelu in Telugu | పాకం గారెలు | అమ్మమ్మల కాలం నాటి విధానం | తూర్పుగోదావరి జిల్లా స్పెషల్",
    "channel_name": "Vismai Food",
    "publish_date": "2019-04-13",
    "view_count": 219945,
    "like_count": 2588,
    "duration": "02:29",
    "language": "Telugu",
    "video_id": "oC2jgMvRMk0",
    "url": "https://www.youtube.com/watch?v=oC2jgMvRMk0",
    "description": "Pakam Garelu is one of the famous Andhra Recipes. This sweet is rich in iron and protein. Traditional East Godavari district special sweet prepared using urad dal vadas soaked in jaggery syrup.",
    "ingredients_detected": [
      "Urad Dal (Minapappu)",
      "Jaggery (Bellam)",
      "Water",
      "Black Pepper Powder",
      "Cardamom Powder",
      "Salt",
      "Oil"
    ]
  },
  "transcription": {
    "transcription_telugu": [
      "[00:00] హలో ఫుడీస్, వెల్కమ్ టు విస్మయ్ ఫుడ్. ఇవాల్టి స్పెషల్ తూర్పు గోదావరి జిల్లా స్పెషల్ పాకం గారెలు.",
      "[00:06] ప్రసాదాల స్పెషల్ రెసిపీ ఇది. పండగ ఏదైనా సరే పర్ఫెక్ట్ ఈ రెసిపీ.",
      "[00:09] పిల్లలు చాలా ఇష్టంగా తింటారు.",
      "[00:11] ఈ పాకం గారెల్లోనే మారుతున్న కాలానికి ఏవేవో రుచులు వచ్చి చేరాయి, తీరు తెన్నులు మారిపోయాయి.",
      "[00:18] నేను మీకు అమ్మమ్మల కాలం నాటి పాకం గారెల రెసిపీ చెప్పబోతున్నాను పర్ఫెక్ట్ కొలతలతో.",
      "[00:24] తూర్పు గోదావరి జిల్లా కాకినాడకి దగ్గరలో ఉన్నటువంటి మరుమళ్ళ పల్లె ఈ పాకం గారెలకి చాలా ఫేమస్.",
      "[00:30] ఇప్పుడు పాకం కోసం మినప్పప్పుకి డబల్ బెల్లం తీసుకోవాలి. 500 గ్రాములు.",
      "[00:35] బెల్లం ఎంత తీసుకుంటే నీళ్లు కూడా సమానంగా తీసుకొని బెల్లాన్ని కరగనివ్వండి.",
      "[00:40] ఈ బెల్లం మరుగుతున్నప్పుడు పైన ఓ తేట ఏర్పడుతుంది, దీన్ని తీసేయండి.",
      "[00:45] ఆ తర్వాత ఈ పాకాన్ని మరో రెండు మూడు పొంగులు రానిచ్చి దింపేసుకోండి.",
      "[00:52] ఇప్పుడు ఇందులో అర టీస్పూన్ మిరియాల పొడి, అర టీస్పూన్ యాలకుల పొడి వేసుకొని పక్కన ఉంచుకోండి.",
      "[01:01] గారెల కోసం పావు కిలో మినప్పప్పు నాలుగు గంటలు నానబెట్టుకోండి.",
      "[01:04] దీన్ని ఫైన్ గా జస్ట్ రెండు మూడు చెంచాల నీళ్లు వేసుకొని గట్టిగా ఫైన్ గా పేస్ట్ చేసుకోండి.",
      "[01:10] దీన్ని మిక్సీలో వేసేకంటే కూడా గ్రైండర్ లో గ్రైండ్ చేస్తే ఇంకా బాగా వస్తాయి గారెలు.",
      "[01:15] ఇప్పుడు ఇందులో జస్ట్ రెండు చిటికెడుల సాల్ట్, కొద్దిగా నీళ్లు వేసి బాగా కలుపుకోండి పిండిని.",
      "[01:20] పిండి మరీ గట్టిగానూ ఉండకూడదు అలా అని జారుగానూ అస్సలు ఉండకూడదు.",
      "[01:26] ఇప్పుడు చేతినంతా బాగా తడి చేసుకొని గారెలుగా చేసుకొని వేడి వేడి నూనెలో వేసుకోండి.",
      "[01:31] మీడియం ఫ్లేమ్ మీద కాస్త క్రీమ్ కలర్ వచ్చేంత వరకు ఫ్రై చేసుకోండి.",
      "[01:39] ఆ తర్వాత హై ఫ్లేమ్ మీద ఫ్రై చేసుకోండి.",
      "[01:42] గోల్డెన్ బ్రౌన్ కలర్ వచ్చేదాకా ఫ్రై చేసుకోండి.",
      "[01:50] వేడి మీదే బెల్లం పాకంలో వేసి 30 నిమిషాలు నాననివ్వండి.",
      "[01:56] అంతే! పాకం గారెలు రెడీ.",
      "[02:24] త్వరలో విస్మయ్ ఫుడ్ సైట్ స్టార్ట్ అవ్వబోతోంది గెట్ రెడీ."
    ],
    "transcription_english": [
      "[00:00] Hello Foodies, Welcome to Vismai Food. Today's special is East Godavari district special Paakam Gaarelu.",
      "[00:06] This is a special prasadam recipe, perfect for any festival.",
      "[00:09] Children love to eat this.",
      "[00:18] I am going to share the traditional grandmother-style Paakam Gaarelu recipe with perfect measurements.",
      "[00:30] For the syrup, take double the quantity of jaggery compared to urad dal – 500 grams.",
      "[00:35] Take equal water and dissolve the jaggery.",
      "[00:40] Remove the scum that forms while boiling.",
      "[00:45] Let it boil for 2–3 more bubbles and remove from heat.",
      "[00:52] Add black pepper powder and cardamom powder and keep aside.",
      "[01:01] Soak 250g urad dal for 4 hours.",
      "[01:04] Grind into a fine, stiff batter with very little water.",
      "[01:15] Add two pinches of salt and mix well.",
      "[01:26] Shape into vadas and fry in hot oil.",
      "[01:42] Fry until golden brown.",
      "[01:50] Soak hot vadas in jaggery syrup for 30 minutes.",
      "[01:56] Paakam Gaarelu are ready.",
      "[02:24] Vismai Food website launching soon."
    ]
  }
}
