{
  "metadata": {
    "title": "#SemiyaCurdbath | సేమియా కర్డ్ బాత్ | సేమియా దద్దోజనం | Simple Easy Curd bath | Body Cooling Breakfast",
    "channel_name": "Vismai Food",
    "publish_date": "2018-10-14",
    "view_count": 471855,
    "like_count": 7725,
    "duration": "02:28",
    "language": "Telugu",
    "video_id": "4-m2In9voWs",
    "url": "https://www.youtube.com/watch?v=4-m2In9voWs",
    "description": "Simple and easy body cooling breakfast Semiya Curd Bath recipe by Vismai Food.",
    "ingredients_detected": [
      "1 Cup Semiya (Vermicelli)",
      "2 Cups Water",
      "1 tsp Salt",
      "1 Cup Thick Curd",
      "1/2 Cup Milk",
      "2 tbsps Oil",
      "1 tsp Mustard seeds",
      "1 tsp Cumin seeds",
      "1 tsp Chana Dal",
      "1 tsp Urad Dal",
      "1 tbsp Chopped Ginger",
      "2-3 Green Chillies (chopped)",
      "2 Dry Red Chillies",
      "1 Sprig Curry leaves",
      "2 tbsps Pomegranate seeds (optional)",
      "1 tbsp Chopped Coriander"
    ]
  },
  "transcription_telugu": [
    "[00:00:00.000] హలో ఫుడీస్, వెల్కమ్ టు విస్మయ్ ఫుడ్. ఇవాల్టి మన స్పెషల్ రెసిపీ సేమియా కర్డ్ బాత్.",
    "[00:00:07.000] ఎండాకాలంలో కడుపుకి ఎంతో హాయినిచ్చే ఈ బ్రేక్ ఫాస్ట్ చాలా త్వరగా అయిపోతుంది. పిల్లలు కూడా చాలా ఇష్టంగా తింటారు.",
    "[00:00:20.000] ముందుగా ఒక కప్పు సేమియాని రెండు కప్పుల మరిగే నీళ్లలో వేసి ఉడికించుకోవాలి. ఇందులో ఒక టీస్పూన్ ఉప్పు వేయండి.",
    "[00:00:35.000] సేమియా మెత్తగా ఉడికిన తర్వాత నీళ్లన్నీ వడకట్టి, వెంటనే చన్నీళ్లు పోయాలి. దీనివల్ల సేమియా పొడిపొడిగా ఉంటుంది.",
    "[00:00:50.000] ఇప్పుడు ఒక బౌల్ లో ఉడికించిన సేమియా, ఒక కప్పు గడ్డ పెరుగు, అర కప్పు పాలు పోసి బాగా కలుపుకోవాలి. పాలు పోయడం వల్ల పులుపు రాకుండా ఉంటుంది.",
    "[00:01:05.000] పోపు కోసం రెండు టేబుల్ స్పూన్ల నూనె వేడి చేసి ఆవాలు, జీలకర్ర, శనగపప్పు, మినప్పప్పు వేసి వేయించండి.",
    "[00:01:18.000] ఇందులో అల్లం తరుగు, పచ్చిమిర్చి తరుగు, ఎండుమిర్చి, కరివేపాకు వేసి ఎర్రగా వేపుకోవాలి.",
    "[00:01:32.000] ఈ పోపుని సేమియా పెరుగు మిశ్రమంలో వేసి బాగా కలుపుకోండి.",
    "[00:01:45.000] చివరగా దానిమ్మ గింజలు, కొత్తిమీర తరుగు చల్లుకుంటే ఎంతో రుచికరమైన సేమియా కర్డ్ బాత్ రెడీ.",
    "[00:02:00.000] దీన్ని వెంటనే సర్వ్ చేసుకుంటే చాలా బాగుంటుంది. మీరు కూడా ట్రై చేసి ఎలా ఉందో చెప్పండి."
  ],
  "transcription_english": [
    "[00:00:00.000] Hello Foodies, welcome to Vismai Food. Today's special recipe is Semiya Curd Bath.",
    "[00:00:07.000] This breakfast is very soothing for the stomach during summer and is quick to make. Kids love it too.",
    "[00:00:20.000] First, boil 1 cup of semiya in 2 cups of boiling water. Add 1 tsp of salt.",
    "[00:00:35.000] Once cooked soft, drain the water and immediately pour cold water over it to keep it non-sticky.",
    "[00:00:50.000] In a bowl, mix the cooked semiya with 1 cup of thick curd and 1/2 cup of milk. Milk prevents it from becoming too sour.",
    "[00:01:05.000] For tempering, heat 2 tbsps oil and add mustard seeds, cumin, chana dal, and urad dal.",
    "[00:01:18.000] Add chopped ginger, green chillies, dry red chillies, and curry leaves; fry until golden.",
    "[00:01:32.000] Add this tempering to the semiya-curd mixture and mix well.",
    "[00:01:45.000] Finally, garnish with pomegranate seeds and chopped coriander.",
    "[00:02:00.000] Serve immediately for the best taste. Do try this and let us know your feedback."
  ]
}