{
  "metadata": {
    "title": "Madras Style Parotta Kurma | పరోటా కుర్మా | పరోట, పూరి చపాతీ, దోశల్లోకి ఈ కుర్మా బావుంటుంది",
    "channel_name": "Vismai Food",
    "publish_date": "2019-04-14",
    "view_count": 1067208,
    "like_count": 11526,
    "duration": "03:05",
    "language": "Telugu",
    "video_id": "wUUzlwtbmfc",
    "url": "https://www.youtube.com/watch?v=wUUzlwtbmfc",
    "description": "This Parotta Kurma is an excellent side-dish gravy for Chapathi, Dosa and puri. This mixed vegetable kurma incorporates all the goodness of healthy vegetables into a tasty curry.",
    "ingredients_detected": [
      "Fresh Coconut",
      "Poppy Seeds (Gasa Gasa)",
      "Oil",
      "Bay Leaf",
      "Stone Flower (Patthar Phool)",
      "Marathi Mogga",
      "Star Anise",
      "Cinnamon",
      "Cardamom",
      "Cloves",
      "Onion",
      "Green Chillies",
      "Tomato",
      "Curry Leaves",
      "Ginger Garlic Paste",
      "Green Peas / Beans",
      "Potato",
      "Carrot",
      "French Beans",
      "Turmeric Powder",
      "Red Chilli Powder",
      "Salt",
      "Garam Masala Powder",
      "Coriander Leaves",
      "Water"
    ]
  },
  "transcription": {
    "transcription_telugu": [
      "[00:00] హలో ఫుడీస్, వెల్కమ్ టు విస్మయ్ ఫుడ్. ఇవాల్టి స్పెషల్ పరోటా కోర్మా.",
      "[00:05] ఈ టైప్ ఆఫ్ కోర్మా తెలుగు రాష్ట్రాల్లో ఉన్నప్పటికీ కాస్త తక్కువే. కానీ తమిళనాడు, కేరళ ప్రాంతాల్లో చాలా ఎక్కువ.",
      "[00:11] వేడి వేడిగా పరోటా, పూరీ, చపాతీ, దోశ దేనిలోకైనా సరే చాలా చాలా బావుంటుంది.",
      "[00:17] అసలు ఇది వండుతుంటే ఇల్లు ఇల్లంతా ఘుమాయించిపోతుంది అంతే.",
      "[00:21] చాలా బావుంటుంది ఎప్పుడు చేసినా చాలా ఎంజాయ్ చేస్తారు ఇంటిల్లిపాది.",
      "[00:25] లెట్స్ స్టార్ట్.",
      "[00:26] ముందుగా పాన్ లో ఓ కప్పు పచ్చి కొబ్బరి తురుము వేసుకోండి.",
      "[00:28] ఇందులో ఓ టేబుల్ స్పూన్ గసగసాలు వేసి లో ఫ్లేమ్ మీద కొబ్బరి పొడిపొడిగా అయ్యేంత వరకు రోస్ట్ చేసుకోండి కేవలం లో ఫ్లేమ్ మీదే.",
      "[00:36] తర్వాత జార్ లో వేసి ఫైన్ గా పేస్ట్ చేసుకోండి నీళ్ళతో.",
      "[00:41] ఆ తర్వాత కుక్కర్ లో అర కప్పు ఆయిల్ హీట్ చేసుకోండి.",
      "[00:45] అందులో ఓ బిర్యానీ ఆకు, రెండు పత్తర్ ఫూల్, ఓ మరాఠీ మొగ్గ, ఓ అనాస పువ్వు.",
      "[00:50] ఈ రెండూ అస్సలు స్కిప్ చేయకండి ఫ్లేవర్ చాలా బావుంటుంది ఈ కర్రీకి.",
      "[00:53] ఓ ఇంచు దాల్చిన చెక్క, మూడు యాలకులు, నాలుగు లవంగాలు వేసి మంచి సువాసన వచ్చేంత వరకు ఫ్రై చేసుకోండి.",
      "[01:01] ఇప్పుడు ఓ పెద్ద ఉల్లిపాయ సన్నని తరుగు మాత్రమే వేసి రెండు మూడు నిమిషాల పాటు హై ఫ్లేమ్ మీద ఫ్రై చేసుకోండి.",
      "[01:07] ఆ తర్వాత మూడు పచ్చిమిర్చి కూడా యాడ్ చేసి ఆనియన్స్ బ్రౌన్ అయ్యేంత వరకు ఫ్రై చేసుకోండి.",
      "[01:13] ఆ తర్వాత ఓ పెద్ద టొమాటో తరుగు, ఓ రెబ్బ కరివేపాకు, ఓ టేబుల్ స్పూన్ ఫ్రెష్ గా రుబ్బుకున్నటువంటి అల్లం వెల్లుల్లి పేస్ట్ వేసి...",
      "[01:20] టొమాటోస్ మగ్గి, వెల్లుల్లి పేస్ట్ పచ్చి వాసన పోయేంత వరకు నిదానంగా ఫ్రై చేసుకోండి.",
      "[01:26] టొమాటోస్ మగ్గిపోయాక ముందుగా పావు కప్పు ఫ్రెష్ బీన్స్ వేసుకోండి.",
      "[01:29] ఇవి మీరు ఫ్రోజెన్ బీన్స్ వాడుతున్నట్లయితే డైరెక్ట్ గా వాష్ చేసి వేసేసుకోవచ్చు.",
      "[01:33] ఫ్రెష్ వి అయితే గనక 30 నిమిషాల పాటు వేడి నీళ్ళలో నానబెట్టుకొని వేసుకోండి.",
      "[01:37] లేదంటే కూరంతా ఉడికినా ఇవి పలుకుగా తగులుతూ ఉంటాయి కోర్మాలో.",
      "[01:41] ఇవి వేసి రెండు మూడు నిమిషాల పాటు మగ్గించుకున్నాక...",
      "[01:44] ఓ పెద్ద చెక్కు తీసి ముక్కలుగా కట్ చేసుకున్నటువంటి బంగాళాదుంప, ఓ చిన్న క్యారెట్ సన్నని తరుగు...",
      "[01:49] 10 ఫ్రెంచ్ బీన్స్ అంగుళం సైజు ముక్కలు వేసి రెండు మూడు నిమిషాల పాటు ఫ్రై చేసుకోండి.",
      "[01:54] ఈ కుర్మాని శ్వేత దగ్గరగా ఎక్కువగా వెజిటబుల్స్ తగిలేలా చేస్తోంది.",
      "[01:58] మీకు కావాలంటే వెజిటబుల్స్ క్వాంటిటీ తగ్గించుకోండి. అప్పుడు గ్రేవీ ఎక్కువగా వస్తుంది.",
      "[02:03] ఇప్పుడు ఇందులో అర టీస్పూన్ పసుపు, ఓ టేబుల్ స్పూన్ కారం, సాల్ట్...",
      "[02:08] ఓ టీస్పూన్ విస్మయ్ ఫుడ్ స్పెషల్ గరం మసాలా పౌడర్ వేసి మసాలాలని కూరగాయ ముక్కలకి బాగా పట్టించండి.",
      "[02:15] ఆ తర్వాత గ్రైండ్ చేసుకున్నటువంటి కొబ్బరి గసగసాల పేస్ట్ వేసి...",
      "[02:19] కొంచెం నీళ్లు పోసుకొని ఓ రెండు మూడు నిమిషాల పాటు ఉడకనివ్వండి.",
      "[02:25] ఆ తర్వాత 400 ml నీళ్లు పోసుకొని కుక్కర్ మూత పెట్టి...",
      "[02:29] రెండు విజిల్స్ హై ఫ్లేమ్ మీద, ఓ విజిల్ లో ఫ్లేమ్ మీద రానివ్వండి. అప్పుడే ముక్కలు మెత్తగా ఉడుకుతాయి.",
      "[02:35] కుక్కర్ లోంచి ఆవిరంతా పోయాక మరో మూడు నిమిషాలు హై ఫ్లేమ్ మీద ఉడకనివ్వండి, మీకు కూర దగ్గరగా కావాలనుకుంటే.",
      "[02:42] ఆ తర్వాత ఓ కట్ట కాడలతో సహా కొత్తిమీర తరుగు వేసి దింపేసుకోండి.",
      "[02:46] అంతే! యు ఆర్ డన్ (You are done).",
      "[02:48] ఈ కూర మీకు వేడి వేడిగా పూరీ, పరాఠా, చపాతీ, దోశ దేనిలోకైనా చాలా బావుంటుంది.",
      "[02:53] చాలా ఎంజాయ్ చేస్తారు.",
      "[02:55] మీకు నచ్చిందా? మీకు ఎలా కుదిరిందో కచ్చితంగా ఆ పిక్ ని విస్మయ్ ఫుడ్ ఇన్స్టాగ్రామ్ లో పోస్ట్ చేయండి, కామెంట్ సెక్షన్ లోనూ తెలియజేయండి.",
      "[03:02] బై ది వే (By the way) త్వరలో విస్మయ్ ఫుడ్ వెబ్సైట్ స్టార్ట్ కాబోతోంది గెట్ రెడీ."
    ],
    "transcription_english": [
      "[00:00] Hello Foodies, Welcome to Vismai Food. Today's special is Parotta Kurma.",
      "[00:05] Although this type of Kurma exists in Telugu states, it is a bit less common. But it is very popular in Tamil Nadu and Kerala regions.",
      "[00:11] It tastes very very good with piping hot Parotta, Poori, Chapati, or Dosa.",
      "[00:17] In fact, while cooking this, the whole house fills with a wonderful aroma.",
      "[00:21] It is very good; the whole family enjoys it a lot whenever it is made.",
      "[00:25] Let's start.",
      "[00:26] First, add one cup of grated fresh coconut to a pan.",
      "[00:28] Add one tablespoon of poppy seeds and roast on low flame until the coconut becomes dry.",
      "[00:36] Then grind it into a fine paste with water.",
      "[00:41] Heat half a cup of oil in a cooker.",
      "[00:45] Add bay leaf, stone flower, Marathi mogga, and star anise.",
      "[00:50] Do not skip these; they give excellent flavor to the curry.",
      "[00:53] Add cinnamon, cardamom, cloves and fry until aromatic.",
      "[01:01] Add finely chopped onion and fry on high flame.",
      "[01:07] Add green chillies and fry until onions turn brown.",
      "[01:13] Add chopped tomato, curry leaves, ginger-garlic paste...",
      "[01:20] ...and fry until tomatoes soften and raw smell disappears.",
      "[01:26] Add fresh beans/peas.",
      "[01:29] Frozen ones can be added directly after washing.",
      "[01:33] Fresh ones should be soaked in hot water for 30 minutes.",
      "[01:37] Otherwise they will remain hard in the Kurma.",
      "[01:41] Cook for two to three minutes.",
      "[01:44] Add potato cubes and chopped carrot...",
      "[01:49] ...and French beans; fry for a few minutes.",
      "[01:54] This Kurma is made thick with vegetables.",
      "[01:58] Reduce vegetables if you want more gravy.",
      "[02:03] Add turmeric, chilli powder, and salt.",
      "[02:08] Add Vismai Food special garam masala and mix well.",
      "[02:15] Add coconut-poppy seed paste.",
      "[02:19] Add little water and cook for a few minutes.",
      "[02:25] Add 400 ml water and close the cooker lid.",
      "[02:29] Pressure cook: 2 whistles on high, 1 on low flame.",
      "[02:35] Cook further if you want thicker curry.",
      "[02:42] Add chopped coriander leaves and turn off the stove.",
      "[02:46] That’s it! You are done.",
      "[02:48] This curry tastes great with Poori, Paratha, Chapati, or Dosa.",
      "[02:53] You will enjoy it a lot.",
      "[02:55] Share your dish on Vismai Food Instagram and comment below.",
      "[03:02] By the way, Vismai Food website is launching soon."
    ]
  }
}
