{
  "metadata": {
    "title": "Andhra Special Veg Khadi | ఆంధ్రా స్పెషల్ మజ్జిగ పులుసు | వందల ఏళ్ళ నాటి మజ్జిగ పులుసు",
    "channel_name": "Vismai Food",
    "publish_date": "2019-04-16",
    "view_count": 621034,
    "like_count": 7093,
    "duration": "03:37",
    "language": "Telugu",
    "video_id": "O4BZuDmn0N4",
    "url": "https://www.youtube.com/watch?v=O4BZuDmn0N4",
    "description": "Today we are going to prepare a famous Andhra traditional recipe Majjiga Pulusu. It is simple and easy to prepare within no time and less ingredients.",
    "ingredients_detected": [
      "Cumin Seeds",
      "Coriander Seeds",
      "Chana Dal",
      "Mustard Seeds",
      "Fenugreek Seeds",
      "Black Pepper",
      "Rice",
      "Dried Red Chillies",
      "Drumstick",
      "Radish",
      "Brinjal (Eggplant)",
      "Green Chillies",
      "Okra (Lady’s Finger)",
      "Bottle Gourd",
      "Tomato",
      "Tamarind",
      "Salt",
      "Curd (Buttermilk)",
      "Turmeric Powder",
      "Ghee",
      "Garlic (Optional)",
      "Asafoetida (Optional)",
      "Curry Leaves",
      "Coriander Leaves",
      "Water"
    ]
  },
  "transcription": {  
  "transcription_telugu": [
    "[00:00] హలో ఫుడీస్, వెల్కమ్ టు విస్మయ్ ఫుడ్. ఇవాల్టి స్పెషల్ ఆంధ్రుల స్పెషల్ మజ్జిగ పులుసు.",
    "[00:06] ఈ మజ్జిగ పులుసు వెనుకటి విధానం.",
    "[00:08] ఈ స్టైల్ లో దాదాపుగా మజ్జిగ పులుసు పెట్టడం మర్చిపోయారు.",
    "[00:11] మన దేశమంతటా మజ్జిగ పులుసులు ఉన్నాయి. ఒక్కొక్కరిది ఒక్కొక్క తీరు.",
    "[00:15] కొన్ని టిప్స్ ఫాలో అయితే గొప్ప రుచి ఉంటుంది ఈ మజ్జిగ పులుసు.",
    "[00:19] మన ఛానల్ లో ఆల్రెడీ ఓ మజ్జిగ పులుసు ఉంది.",
    "[00:21] ఆ మజ్జిగ పులుసుకి ఈ అమ్మమ్మల కాలం నాటి మజ్జిగ పులుసుకి ఎక్కడా పొంతనే ఉండదు.",
    "[00:26] ఇది రిచ్ ఇన్ టేస్ట్ అండ్ ఫ్లేవర్.",
    "[00:28] ఈ మజ్జిగ పులుసు మా కొలతలతో ఓసారి చేసి పెట్టి చూడండి.",
    "[00:31] అందరూ చాలా ఎంజాయ్ చేస్తారు.",
    "[00:33] అంత పర్ఫెక్ట్ టేస్ట్ వస్తుంది. లెట్స్ స్టార్ట్.",
    "[00:35] ముందుగా ఓ బౌల్ లో ఓ టీస్పూన్ జీలకర్ర, రెండు టీస్పూన్ల ధనియాలు, రెండు టీస్పూన్ల పచ్చిశనగపప్పు.",
    "[00:41] ఓ టీస్పూన్ ఆవాలు, ముప్పావు చెంచా మెంతులు, ఓ టీస్పూన్ మిరియాలు.",
    "[00:46] ఓ టీస్పూన్ బియ్యం. చిక్కదనం కోసం అస్సలు స్కిప్ చేయకండి.",
    "[00:49] రెండు ఎండుమిర్చి వేసి ఇవి మునిగేంత వరకు నీళ్లు పోసి ఓ ముప్పై నిమిషాలు నానబెట్టుకోండి.",
    "[00:55] ఆ తర్వాత ఫైన్ గా పేస్ట్ చేసుకోండి.",
    "[00:58] ఇప్పుడు బౌల్ లో 750 ml నీళ్లు పోసుకొని, ఓ పీచు తీసుకున్నటువంటి ములక్కాడ.",
    "[01:03] పావు ముల్లంగి ముక్కలు, ఓ పొడుగు వంకాయ ముక్కలు, రెండు పచ్చిమిర్చి, ఓ లేత బెండకాయ, చిన్న సొరకాయ ముక్కలు.",
    "[01:11] ఓ పెద్ద టొమాటో ముక్కలు, అర కప్పు చింతపండు రసం.",
    "[01:15] ఇది జస్ట్ రెండు రెబ్బల చింతపండు నుంచి తీసినటువంటి రసం. చాలా కొద్దిగా వాడాలి చింతపండు.",
    "[01:20] రుచికి సరిపడా సాల్ట్, కాడలతో సహా రెండు రెబ్బల కరివేపాకు వేసి మూత పెట్టి ముక్కల్ని మెత్తగా ఉడికించుకోండి.",
    "[01:31] ముక్కలు మెత్తగా ఉడికాక, అర లీటర్ కమ్మటి పెరుగు తీసుకోండి.",
    "[01:35] ఇప్పుడు ఆవాలు ధనియాల పేస్ట్ లో 100 ml నీళ్లు పోసి బాగా కలుపుకొని...",
    "[01:39] పెరుగులో పోసి ఎక్కడా ఉండలు లేకుండా బాగా చిలుక్కోండి.",
    "[01:44] ఇది చాలా ఇంపార్టెంట్ లేదంటే పెరుగు గడ్డలు గడ్డలుగా మిగిలిపోతుంది.",
    "[01:49] ఇప్పుడు ఈ పెరుగు మిక్చర్ ని ఉడికించుకున్నటువంటి కూరగాయ ముక్కల్లో పోసి కాసిన్ని నీళ్లు పోసి...",
    "[01:55] రుచికి సరిపడా సాల్ట్, అర టీస్పూన్ పసుపు వేసి బాగా కలుపుకొని...",
    "[02:00] నిదానంగా 15 నుంచి 20 నిమిషాల పైనే ఈ మజ్జిగ పులుసు చిక్కబడి మంచి సువాసన వచ్చేంత వరకు కేవలం లో ఫ్లేమ్ (low flame) మీద మరగనివ్వాలి.",
    "[02:08] ఇది చాలా ఇంపార్టెంట్. మీరు లో ఫ్లేమ్ మీద మరిగిస్తేనే ఫ్లేవర్స్ అన్నీ రిలీజ్ అవుతాయి.",
    "[02:13] అప్పుడే మజ్జిగ పులుసుకి రుచి.",
    "[02:15] ప్రతి 30 సెకన్లకు ఒకసారి కలుపుతూ ఉండాలి. అడుగు మందంగా ఉన్నటువంటి గిన్నెనే వాడాలి.",
    "[02:20] లేదంటే త్వరగా అడుగు పడుతుంది రుచంతా మారిపోతుంది.",
    "[02:23] ఇది మరిగేలోపు రెండు టీస్పూన్ల నెయ్యి కరిగించుకోండి.",
    "[02:26] ఇందులో ఓ టీస్పూన్ ఆవాలు, అర టీస్పూన్ మెంతులు, అర టీస్పూన్ జీలకర్ర, రెండు ఎండుమిర్చి, నాలుగు ఐదు వెల్లుల్లి దంచినవి, ఇది ఆప్షనల్.",
    "[02:35] ఓ రెబ్బ కరివేపాకు వేసి తాలింపుని బాగా వేయించుకోండి.",
    "[02:39] ఇందులో నేను వెల్లుల్లి వాడాను. మీకు నచ్చితే వెల్లుల్లి స్కిప్ చేసేసి ఇంగువ వేసుకోండి.",
    "[02:44] ఇప్పుడు నిదానంగా మరుగుతున్నటువంటి ఈ మజ్జిగ పులుసులో పోసి వెంటనే మూత పెట్టేయండి.",
    "[02:49] దీనివల్ల తాలింపు ఫ్లేవర్ అంతా పులుసుకి పడుతుంది.",
    "[02:51] ఆ తర్వాత ఓ నిమిషం పాటు మరగనిచ్చి, కాస్త కొత్తిమీర కాడలతో సహా వేసి కలుపుకొని దింపేసుకోండి.",
    "[02:57] అంతే! ఆథెంటిక్ ఆంధ్రా మజ్జిగ పులుసు రెడీ.",
    "[03:01] ఇందులో మీరు గుర్తుంచుకోవలసింది అడుగు మందంగా ఉన్నటువంటి గిన్నెలోనే పులుసు కాచాలి.",
    "[03:06] లేదంటే అడుగు త్వరగా పడుతుంది, రుచంతా మారిపోతుంది.",
    "[03:08] మీకు కావాలంటే కాయగూరలు పెంచుకోండి తగ్గించుకోండి.",
    "[03:12] మీరు ఈ విధంగా ఒకసారి మజ్జిగ పులుసు కాస్తే, కచ్చితంగా మళ్లీ మళ్లీ చేసుకొని తింటారు ఇంటిల్లిపాది చాలా ఎంజాయ్ చేస్తారు.",
    "[03:19] మీకు నచ్చిందా? మరి అయితే మీరు తప్పకుండా ట్రై చేసి మీకు ఎలా కుదిరిందో కచ్చితంగా ఆ పిక్ ని విస్మయ్ ఫుడ్ ఇన్స్టాగ్రామ్ లో పోస్ట్ చేయండి.",
    "[03:25] బై ది వే (By the way), త్వరలో విస్మయ్ ఫుడ్ వెబ్సైట్ స్టార్ట్ అవ్వబోతోంది. అందులో నేను మీకు బోల్డన్ని కిచెన్ ఐటమ్స్ అన్నీ అందుబాటులోకి తెస్తాను. గెట్ రెడీ."
  ],
  "transcription_english": [
    "[00:00] Hello Foodies, Welcome to Vismai Food. Today's special is Andhra Special Majjiga Pulusu (Buttermilk Stew).",
    "[00:06] This is an old/traditional method of making Majjiga Pulusu.",
    "[00:08] People have almost forgotten making Majjiga Pulusu in this style.",
    "[00:11] There are Majjiga Pulusu variations all over our country. Everyone has their own way.",
    "[00:15] If you follow a few tips, this Majjiga Pulusu will taste great.",
    "[00:19] There is already a Majjiga Pulusu recipe on our channel.",
    "[00:21] There is no comparison between that Majjiga Pulusu and this grandmother's era Majjiga Pulusu.",
    "[00:26] This is rich in taste and flavor.",
    "[00:28] Try making this Majjiga Pulusu once with our measurements.",
    "[00:31] Everyone will enjoy it a lot.",
    "[00:33] It tastes that perfect. Let's start.",
    "[00:35] First, in a bowl, add one teaspoon cumin seeds, two teaspoons coriander seeds, two teaspoons chana dal.",
    "[00:41] One teaspoon mustard seeds, three-quarter teaspoon fenugreek seeds, one teaspoon black pepper.",
    "[00:46] One teaspoon rice. Do not skip this at all for thickness.",
    "[00:49] Add two dried red chilies, pour water until they are submerged, and soak for thirty minutes.",
    "[00:55] After that, grind it into a fine paste.",
    "[00:58] Now pour 750 ml of water into a bowl, add one drumstick with fiber removed.",
    "[01:03] Quarter cup radish pieces, one long brinjal cut into pieces, two green chilies, one tender okra (ladies finger), small bottle gourd pieces.",
    "[01:11] One big tomato cut into pieces, half a cup of tamarind juice/extract.",
    "[01:15] This is juice extracted from just two strands of tamarind. Use very little tamarind.",
    "[01:20] Add salt to taste, two sprigs of curry leaves along with stems, cover with a lid, and cook the vegetables until soft.",
    "[01:31] Once the vegetables are cooked soft, take half a liter of sour curd.",
    "[01:35] Now add 100 ml of water to the mustard-coriander paste, mix well...",
    "[01:39] ...pour it into the curd and whisk well without any lumps.",
    "[01:44] This is very important, otherwise the curd will remain as lumps.",
    "[01:49] Now pour this curd mixture into the cooked vegetables, add some water...",
    "[01:55] ...add salt to taste, half a teaspoon turmeric, mix well...",
    "[02:00] ...and let it simmer slowly on low flame for more than 15 to 20 minutes until this Majjiga Pulusu thickens and releases a nice aroma.",
    "[02:08] This is very important. All flavors will release only if you boil it on low flame.",
    "[02:13] Only then Majjiga Pulusu gets its taste.",
    "[02:15] You must keep stirring every 30 seconds. Use only a heavy-bottomed vessel.",
    "[02:20] Otherwise, it will burn at the bottom quickly and the entire taste will change.",
    "[02:23] While this is boiling, melt two teaspoons of ghee.",
    "[02:26] Add one teaspoon mustard seeds, half teaspoon fenugreek seeds, half teaspoon cumin seeds, two dried red chilies, four to five crushed garlic cloves (this is optional).",
    "[02:35] Add a sprig of curry leaves and fry the tempering well.",
    "[02:39] I used garlic in this. If you like, skip garlic and add asafoetida.",
    "[02:44] Now pour this tempering into the slowly boiling Majjiga Pulusu and cover immediately with a lid.",
    "[02:49] Because of this, the entire flavor of the tempering gets absorbed by the stew.",
    "[02:51] After that, let it boil for a minute, add some coriander leaves along with stems, mix, and take it off the stove.",
    "[02:57] That's it! Authentic Andhra Majjiga Pulusu is ready.",
    "[03:01] What you need to remember here is to boil the stew only in a heavy-bottomed vessel.",
    "[03:06] Otherwise, the bottom will burn quickly, and the taste will change.",
    "[03:08] Increase or decrease vegetables as per your wish.",
    "[03:12] If you make Majjiga Pulusu this way once, the whole family will definitely make and eat it again and again and enjoy it a lot.",
    "[03:19] Did you like it? Then definitely try it and post the picture of how it turned out for you on Vismai Food Instagram.",
    "[03:25] By the way, the Vismai Food website is starting soon. I will bring many kitchen items available to you there. Get ready."
  ]
}
}