{
  "metadata": {
    "title": "Soya Kheema Masala | వెజ్ ఖీమ మసాలా|మీల్ మేకర్ ఖీమ మసాలా ఇలా చేయండి చపాతీ, రైస్, రోటి లోకి పర్ఫెక్ట్",
    "channel_name": "Vismai Food",
    "publish_date": "2019-04-18",
    "view_count": 925208,
    "like_count": 10052,
    "duration": "02:22",
    "language": "Telugu",
    "video_id": "i6eCN-K2LV8",
    "url": "https://www.youtube.com/watch?v=i6eCN-K2LV8",
    "description": "Here is the Soya Kheema Masala which is a best fit for rice, roti and chapati. Please try this recipe and share it with your family and friends.",
    "ingredients_detected": [
      "soya chunks (meal maker)",
      "onions",
      "tomatoes",
      "ginger",
      "garlic",
      "green chilies",
      "oil",
      "salt",
      "turmeric powder",
      "red chilli powder",
      "coriander powder",
      "garam masala",
      "cumin seeds",
      "coriander leaves"
    ]
  },
  "transcription": {
  "transcription_telugu": [
    "[00:00] హలో ఫుడీస్, వెల్కమ్ టు విస్మయ్ ఫుడ్. ఇవాల్టి స్పెషల్ సోయా ఖీమా మసాలా. అదేనండి మీల్ మేకర్ కైమా మసాలా.",
    "[00:08] ఇది మీరు వేడి వేడిగా అన్నంలో కానీ, పూరీ, చపాతీ, దోశ, ఇడ్లీ దేనిలోకైనా తినండి.",
    "[00:13] చాలా చాలా బావుంటుంది.",
    "[00:15] వెజిటేరియన్స్ హ్యాపీగా ఎంజాయ్ చేయొచ్చు.",
    "[00:17] నాన్-వెజిటేరియన్స్ కి నిజంగా ఇది మటన్ ఖీమానేనా? అని అనుకుంటారు అంత పర్ఫెక్ట్ గా ఉంటుంది, అంత పర్ఫెక్ట్ టేస్ట్ వస్తుంది ఇది.",
    "[00:25] చాలా బావుంటుంది ట్రై చేయండి. లెట్స్ స్టార్ట్.",
    "[00:27] ముందుగా పాన్ లో అర కప్పు ఆయిల్ హీట్ చేసుకోండి. దీనికి కాస్త ఆయిల్ ఎక్కువ ఉంటేనే రుచి.",
    "[00:32] ఇందులో రెండు మీడియం సైజ్ ఉల్లిపాయల సన్నని తరుగు వేసి, మీడియం ఫ్లేమ్ (medium flame) మీద మాత్రమే ఆనియన్స్ పింక్ గా అయ్యేంత వరకు ఫ్రై చేసుకోండి.",
    "[00:39] ఆ తర్వాత రెండు పచ్చిమిర్చి సన్నని తరుగు వేసి ఫ్రై చేసుకోండి.",
    "[00:43] ఆనియన్స్ పచ్చి వాసన పోతే చాలు బ్రౌన్ చేయకండి.",
    "[00:46] ఇప్పుడు ఇందులో ఓ టీస్పూన్ అల్లం వెల్లుల్లి పేస్ట్ వేసి రెండు నిమిషాల పాటు బాగా ఫ్రై చేసుకోండి.",
    "[00:53] ఇప్పుడు ఓ పెద్ద టొమాటో సన్నని తరుగు వేసి, టొమాటోస్ మెత్తగా మగ్గేదాకా మీడియం ఫ్లేమ్ మీదే ఫ్రై చేసుకోండి.",
    "[01:00] ఈ కూరకి ఒక్కొక్కటిగా వేసుకుంటూ నిదానంగా ఫ్రై చేసుకుంటేనే మంచి రుచి.",
    "[01:04] ఇప్పుడు సాల్ట్, ఓ టీస్పూన్ కారం, ఓ టీస్పూన్ వేయించిన జీలకర్ర పొడి, అర టీస్పూన్ విస్మయ్ ఫుడ్ స్పెషల్ గరం మసాలా, పావు చెంచా పసుపు వేసి మసాలాలన్నీ బాగా ఫ్రై చేసుకోండి.",
    "[01:15] ఇప్పుడు ముప్పావు కప్పు మీల్ మేకర్ గ్రాన్యూల్స్ గా దొరుకుతుంది. దాన్ని 30 నిమిషాలు వేడి నీళ్ళలో నానబెట్టినది నీరు పిండి వేసుకోండి.",
    "[01:21] మీకు గ్రాన్యూల్స్ గాని దొరక్కపోతే మీల్ మేకర్ ని వేడి నీటిలో నానబెట్టి 30 నిమిషాల తర్వాత మిక్సీలో వేసి ఖీమాగా చేసుకోండి.",
    "[01:29] దీన్ని రెండు మూడు నిమిషాల పాటు బాగా ఫ్రై చేసుకోండి.",
    "[01:32] రెండు మూడు నిమిషాలు అనే దానికంటే కూడా పచ్చి వాసన పోయి మంచి సువాసన రావాలి అందాక ఫ్రై చేసుకోండి.",
    "[01:37] అలా చేసుకుంటేనే కూరకు మంచి రుచి.",
    "[01:39] దీనిలోని పచ్చి వాసన పోయాక 150 ml వాటర్ పోసుకొని బాగా కలుపుకొని నిదానంగా లో ఫ్లేమ్ మీద ఉడకనివ్వండి.",
    "[01:47] ఆ తర్వాత రెండు టేబుల్ స్పూన్ల పుదీనా తరుగు వేసి కలుపుకొని నీరు ఇగిరిపోయి నూనె సెపరేట్ అయ్యే దాకా లో ఫ్లేమ్ మీద కుక్ చేసుకోండి.",
    "[01:54] చూడండి ఈ కన్సిస్టెన్సీ ఉండాలి కూరకి.",
    "[01:57] మీరు ఈ కూరలో ఆయిల్ తక్కువ వేసినా, సరిగ్గా టైమ్ తీసుకొని ఒక్కొక్కటిగా వేసుకుంటూ జాగ్రత్తగా కుక్ చేసుకోకపోయినా నేను మీకు చెప్పినటువంటి ఎగ్జాక్ట్ పర్ఫెక్ట్ టేస్ట్ రాదని గుర్తుంచుకోండి చాలు.",
    "[02:07] చాలా సింపుల్. కొద్దిగా జాగ్రత్తగా ఓపికగా చేస్తే చాలు పర్ఫెక్ట్ టేస్ట్ వస్తుంది.",
    "[02:12] మీకు నచ్చిందా ఈ కర్రీ? మరి అయితే మీరు ట్రై చేసి మీకు ఎలా కుదిరిందో కచ్చితంగా ఆ పిక్ ని విస్మయ్ ఫుడ్ ఇన్స్టాగ్రామ్ లో పోస్ట్ చేయండి.",
    "[02:19] బై ది వే (By the way) త్వరలో విస్మయ్ ఫుడ్ వెబ్సైట్ స్టార్ట్ అవ్వబోతోంది గెట్ రెడీ."
  ],
  "transcription_english": [
    "[00:00] Hello Foodies, Welcome to Vismai Food. Today's special is Soya Kheema Masala. Yes, Meal Maker Kheema Masala.",
    "[00:08] You can eat this with piping hot rice, Puri, Chapati, Dosa, or Idli.",
    "[00:13] It tastes very very good.",
    "[00:15] Vegetarians can happily enjoy this.",
    "[00:17] Non-vegetarians will truly wonder if this is Mutton Kheema? It is that perfect, it gives such a perfect taste.",
    "[00:25] It is very good, do try it. Let's start.",
    "[00:27] First, heat half a cup of oil in a pan. This tastes good only if there is a bit more oil.",
    "[00:32] Add finely chopped pieces of two medium-sized onions and fry only on medium flame until the onions turn pink.",
    "[00:39] After that, add finely chopped green chilies and fry.",
    "[00:43] It is enough if the raw smell of onions goes away, do not brown them.",
    "[00:46] Now add a teaspoon of ginger-garlic paste to this and fry well for two minutes.",
    "[00:53] Now add finely chopped pieces of one large tomato and fry on medium flame until the tomatoes become soft and mushy.",
    "[01:00] For this curry, adding ingredients one by one and frying slowly gives good taste.",
    "[01:04] Now add salt, one teaspoon chili powder, one teaspoon roasted cumin powder, half teaspoon Vismai Food special garam masala, and quarter teaspoon turmeric and fry the spices well.",
    "[01:15] Now take three-quarter cup of Meal Maker granules (Soya granules). Squeeze out the water from the granules which have been soaked in hot water for 30 minutes and add them.",
    "[01:21] If you don't find granules, soak the meal maker chunks in hot water and after 30 minutes, grind them in a mixer to make kheema.",
    "[01:29] Fry this well for two to three minutes.",
    "[01:32] Rather than saying two to three minutes, fry until the raw smell goes away and a nice aroma comes.",
    "[01:37] Only if done like that, the curry gets a good taste.",
    "[01:39] Once the raw smell is gone, pour 150 ml of water, mix well, and let it cook slowly on low flame.",
    "[01:47] After that, add two tablespoons of chopped mint leaves, mix, and cook on low flame until the water evaporates and oil separates.",
    "[01:54] See, the curry should have this consistency.",
    "[01:57] Just remember that if you add less oil to this curry, or if you don't take time to add ingredients one by one and cook carefully, you won't get the exact perfect taste I told you about.",
    "[02:07] It's very simple. Just a little care and patience is enough to get the perfect taste.",
    "[02:12] Did you like this curry? Then try it and definitely post the picture of how it turned out for you on Vismai Food Instagram.",
    "[02:19] By the way, Vismai Food website is starting soon, get ready."
  ]
}
}