{
  "metadata": {
    "title": "Chicken Majjiga Pulusu | భీమవరం స్పెషల్ చికెన్ మజ్జిగ పులుసు | Chicken Khadi",
    "channel_name": "Vismai Food",
    "publish_date": "2019-04-21",
    "view_count": 295253,
    "like_count": 4698,
    "duration": "02:45",
    "language": "Telugu",
    "video_id": "ihWwKk6ZcOM",
    "url": "https://www.youtube.com/watch?v=ihWwKk6ZcOM",
    "description": "Visit https://www.vismaifood.com/ For More Recipes and to Purchase our Products.\n\nHey Foodies. Welcome to Vismai Food.\n\nChicken Majjiga Pulusu is a famous recipe in Andhra especially it is a Bhimavaram Special Recipe. We ensure you the best taste if you follow our tips as explained in this video. Please do not forget to share this video with your family and friends.\n#ChickenMajjigaPulusu #MajjigaPulusu #ChickenRecipe #BhimavaramRecipes",
    "ingredients_detected": [
      "chicken",
      "majjiga (buttermilk)",
      "onion",
      "tomato",
      "ginger",
      "garlic",
      "green chilies",
      "oil",
      "curry leaves",
      "turmeric powder",
      "red chili powder",
      "coriander powder",
      "garam masala",
      "salt",
      "coriander leaves"
    ]
  },
  "transcription": {
  "transcription_telugu": [
    "[00:00] హలో ఫుడీస్, వెల్కమ్ టు విస్మయ్ ఫుడ్.",
    "[00:01] ఇవాల్టి స్పెషల్ భీమవరం స్పెషల్ చికెన్ మజ్జిగ పులుసు.",
    "[00:06] ఈ చికెన్ మజ్జిగ పులుసు గోదావరి జిల్లాలో చాలా చాలా ఫేమస్. ఎస్పెషల్లీ క్షత్రియ కమ్యూనిటీలో.",
    "[00:12] తిన్న కొద్దీ తినాలనిపిస్తుంది ఈ మజ్జిగ పులుసు.",
    "[00:16] ఇది చేసిన రోజున ఇంకేం చేసినా... ఆహా.. దీంతోనే ఊడ్చి పడేస్తారు అంతే.",
    "[00:21] చాలా తృప్తిగా భోజనం చేస్తారు. చేయడం కూడా చాలా తేలిక.",
    "[00:25] మీరు ఎప్పుడు చేసినా బ్లాక్ బస్టర్ సినిమానే ఈ మజ్జిగ పులుసు.",
    "[00:29] లెట్స్ స్టార్ట్.",
    "[00:30] ముందుగా పావు కప్పు నూనెని వేడి చేసుకోండి.",
    "[00:32] వేడెక్కిన నూనెలో నాలుగు చీరిన పచ్చిమిర్చి, రెండు రెబ్బల కరివేపాకు వేసి కాస్త వేయించుకోండి.",
    "[00:38] ఇప్పుడు పెద్ద ఉల్లిపాయ తరుగు వేసి వేయించుకోండి.",
    "[00:40] ఈ ఉల్లిపాయలు మరీ సన్నగా తరుక్కుంటే కూర తయారయ్యే పాటికి ఎక్కువగా బ్రౌన్ అయిపోతాయి.",
    "[00:46] కాబట్టి కాస్త పెద్దగానే తరుక్కోండి ఉల్లిపాయలు.",
    "[00:48] ఉల్లిపాయలు జస్ట్ కాస్త వేగాక, ఓ టీస్పూన్ అల్లం వెల్లుల్లి పేస్ట్ వేసి ఓ నిమిషం పాటు ఫ్రై చేసుకోండి.",
    "[00:54] ఇప్పుడు అర్ధగంట ఉప్పు నీటిలో నానబెట్టుకున్నటువంటి పావు కిలో చికెన్ వేసి బాగా కలుపుకొని...",
    "[00:59] చికెన్ ఎంత సాధ్యమైతే అంత బాగా క్రిస్పీగా ఫ్రై చేసుకోండి మీడియం ఫ్లేమ్ మీద మాత్రమే.",
    "[01:06] యాక్చువల్ గా ఈ పులుసుకి పెరుగు, చికెన్ ఈక్వల్ క్వాంటిటీ లో తీసుకోవాలి.",
    "[01:10] అలా చేస్తే కూరలా అవుతుందని శ్వేత ఎప్పుడూ పెరుగుకి సగం క్వాంటిటీ చికెన్ తీసుకుంటుంది.",
    "[01:15] మీకు నచ్చితే ఈ పెరుగు, చికెన్ ఈక్వల్ క్వాంటిటీ లో వాడుకోండి.",
    "[01:17] దానికి తగ్గట్టుగా ఇంగ్రిడియంట్స్ ని అడ్జస్ట్ చేసుకోండి.",
    "[01:20] ఇప్పుడు ఇందులో అర టీస్పూన్ పసుపు, సాల్ట్ వేసి కలుపుకోండి.",
    "[01:28] ఈ చికెన్ ఉడికేలోపు ఓ పది పచ్చిమిర్చి వేసి మెత్తగా ఫైన్ గా పేస్ట్ చేసుకోండి.",
    "[01:33] మెత్తగా గ్రైండ్ చేసుకున్నటువంటి ఈ పచ్చిమిర్చి పేస్ట్ వేసి బాగా కలుపుకోండి.",
    "[01:38] యాక్చువల్ గా ఈ మజ్జిగ పులుసులో కారం వేయరు, వేయకండి.",
    "[01:44] దింపడానికి ఐదు నిమిషాల ముందు ఓ టీస్పూన్ గరం మసాలా వేసుకొని బాగా కలుపుకొని...",
    "[01:48] చికెన్ ని చక్కగా ఫ్రై చేసుకోండి.",
    "[01:51] చికెన్ వేగాక తీసి చల్లార్చుకోండి.",
    "[01:53] ఇప్పుడు అర కిలో పెరుగుని బాగా చిలుక్కోండి.",
    "[01:57] 100 ml నీళ్లు పోసి ఎక్కడా గడ్డలు లేకుండా చిలుక్కోండి.",
    "[02:03] ఆ తర్వాత రుచికి సరిపడా సాల్ట్ వేసుకోండి.",
    "[02:07] పెరుగు కాస్త చిక్కగా ఉంటేనే రుచిగా ఉంటుందని గుర్తుపెట్టుకోండి.",
    "[02:11] ఇప్పుడు పాన్ లో ఓ టీస్పూన్ నూనె వేడి చేసి, అందులో అర టీస్పూన్ మెంతులు, రెండు ఎండుమిర్చి...",
    "[02:16] అర టీస్పూన్ ఆవాలు, అర టీస్పూన్ జీలకర్ర వేసి వేయించుకోండి.",
    "[02:21] ఇప్పుడు చిలుక్కునటువంటి పెరుగులో పావు చెంచా పసుపు, వేయించుకున్నటువంటి తాలింపు...",
    "[02:25] ఫ్రై చేసుకున్నటువంటి చికెన్ వేసి బాగా కలుపుకోండి.",
    "[02:29] ఆ తర్వాత 30 నిమిషాలు రెస్ట్ ఇవ్వండి.",
    "[02:32] అంతే! యు ఆర్ డన్ (You are done)!",
    "[02:33] ఎప్పుడు చేసినా బ్లాక్ బస్టర్ గ్యారెంటీడ్ రెసిపీ.",
    "[02:36] నచ్చిందా మీకు? మరి అయితే మీరు ట్రై చేసి మీకు ఎలా కుదిరిందో కచ్చితంగా ఆ పిక్ ని విస్మయ్ ఫుడ్ ఇన్స్టాగ్రామ్ లో పోస్ట్ చేయండి.",
    "[02:42] బై ది వే (By the way) సబ్స్క్రయిబ్ చేయడం అస్సలు మర్చిపోకండి."
  ],
  "transcription_english": [
    "[00:00] Hello Foodies, Welcome to Vismai Food.",
    "[00:01] Today's special is Bhimavaram Special Chicken Majjiga Pulusu (Chicken Buttermilk Stew).",
    "[00:06] This Chicken Majjiga Pulusu is very famous in Godavari district. Especially in the Kshatriya community.",
    "[00:12] You will feel like eating more as you eat this Majjiga Pulusu.",
    "[00:16] On the day you make this, whatever else you make... Aha... people will wipe this off completely.",
    "[00:21] You will have a very satisfying meal. It is also very easy to make.",
    "[00:25] Whenever you make it, this Majjiga Pulusu is a blockbuster movie.",
    "[00:29] Let's start.",
    "[00:30] First, heat a quarter cup of oil.",
    "[00:32] In the heated oil, add four slit green chilies and two sprigs of curry leaves and fry slightly.",
    "[00:38] Now add chopped big onion and fry.",
    "[00:40] If you chop these onions too finely, they will brown too much by the time the curry is done.",
    "[00:46] So, chop the onions slightly large.",
    "[00:48] After the onions are just slightly fried, add a teaspoon of ginger-garlic paste and fry for a minute.",
    "[00:54] Now add a quarter kilo of chicken soaked in salt water for half an hour and mix well...",
    "[00:59] Fry the chicken as crispy as possible only on medium flame.",
    "[01:06] Actually, for this stew, curd and chicken should be taken in equal quantity.",
    "[01:10] Swetha always takes half the quantity of chicken to curd, thinking it becomes like a curry otherwise.",
    "[01:15] If you like, use equal quantities of this curd and chicken.",
    "[01:17] Adjust the ingredients accordingly.",
    "[01:20] Now add half a teaspoon of turmeric and salt to this and mix.",
    "[01:28] While this chicken is cooking, take ten green chilies and grind them into a soft fine paste.",
    "[01:33] Add this finely ground green chili paste and mix well.",
    "[01:38] Actually, red chili powder is not added in this Majjiga Pulusu, do not add it.",
    "[01:44] Five minutes before taking it off, add a teaspoon of garam masala, mix well...",
    "[01:48] ...and fry the chicken nicely.",
    "[01:51] Once the chicken is fried, remove and let it cool.",
    "[01:53] Now whisk half a kilo of curd well.",
    "[01:57] Pour 100 ml of water and whisk without any lumps anywhere.",
    "[02:03] After that, add salt to taste.",
    "[02:07] Remember that it tastes good only if the curd is slightly thick.",
    "[02:11] Now heat a teaspoon of oil in a pan, add half a teaspoon of fenugreek seeds, two dry red chilies...",
    "[02:16] ...half a teaspoon of mustard seeds, half a teaspoon of cumin seeds and fry.",
    "[02:21] Now add a quarter teaspoon of turmeric, the fried tempering...",
    "[02:25] ...and the fried chicken into the whisked curd and mix well.",
    "[02:29] After that, give it a rest for 30 minutes.",
    "[02:32] That's it! You are done!",
    "[02:33] Whenever made, it's a guaranteed blockbuster recipe.",
    "[02:36] Did you like it? So, you try it and definitely post the pic of how it turned out for you on Vismai Food Instagram.",
    "[02:42] By the way, don't forget to subscribe at all."
  ]
  }
}
