{
  "metadata": {
    "title": "Oats Pongal | ఓట్స్ పొంగల్ | ఓట్స్ తో కట్టే పొంగలి | ఓట్స్ తో చాల ఈజీ గా టేస్టీ గా ఉండే కట్టే పొంగలి",
    "channel_name": "Vismai Food",
    "publish_date": "2019-04-22",
    "view_count": 344764,
    "like_count": 4620,
    "duration": "02:06",
    "language": "Telugu",
    "video_id": "Rs0xb2oxaIU",
    "url": "https://www.youtube.com/watch?v=Rs0xb2oxaIU",
    "description": "Buy MEYER pans at www.potsandpans.in \nLink: http://bit.ly/2SNB2bq\n15% Discount code: VIS15\n\nVisit https://www.vismaifood.com/\nFor More Recipes and to Purchase our Products.\n\nHey Foodies, Welcome to Vismai Food.\n\nInt this we are going to learn how to make Pongal with oats. This Oats Pongal is a healthy breakfast dish for kids and for everyone.\nPlease try this and share your experience with us.\n#OatsPongal #Pongal #Oats #VenPongal #HowToMakePongal\n\nFor more interesting recipes, please do subscribe to our channel:\n\nwww.youtube.com/channel/UCBSwcEOp0PMwhvE6FVjgITw?sub_confirmation=1\nhttps://www.youtube.com/vismaifood\n\nFollow us on Social Media:\n\nhttps://twitter.com/VismaiF\nhttps://www.instagram.com/vismaifoodies/\nhttps://www.facebook.com/Vismai-Food-...\n\nChole Masala | చోలే మసాలా | పూరి, చపాతీ, రైస్ ఎందులోకైన మా స్టైల్ లో కూర చాల రుచిగా ఉంటుంది\nhttps://youtu.be/62o8ALF72tE\n\nMix Veg Pakoda | Veg Pakoda in Telugu | ఈ కూరగాయలన్నీ వేసి ఇలా పకోడీ చేయండి చాలా ఇష్టంగా తింటారు\nhttps://youtu.be/MggAO-P1KCI\n\nBoti Fry | బోటి గోంగూర ఫ్రై | Boti Fry Recipe | Hyderabadi Style Boti Fry\nhttps://youtu.be/QlGzDXnPlMg\n\nVismai Food Staff\n\nExecutive Producer: Swetha Paruchuri\nCamera: Phani Sudhir\nEdit: Teja, Ajith",
    "ingredients_detected": [
      "oats",
      "moong dal",
      "rice",
      "ginger",
      "green chili",
      "curry leaves",
      "ghee",
      "cashews",
      "salt",
      "water"
    ]
  },
  "transcription": {
  "transcription_telugu": [
    "[00:00] హలో ఫుడీస్, వెల్కమ్ టు విస్మయ్ ఫుడ్. ఇవాల్టి ఎనర్జీ ప్యాక్డ్ బ్రేక్ ఫాస్ట్ (Energy packed breakfast) ఓట్స్ పొంగల్.",
    "[00:06] చాలా బావుంటుంది దీని టేస్ట్. చేయడం కూడా తేలికే.",
    "[00:09] రెగ్యులర్ గా తినే పొంగల్ కంటే హెల్త్ పాయింట్ ఆఫ్ వ్యూ లో ఇది చాలా బెస్ట్ ఇంకా టేస్ట్ కూడా చాలా బావుంటుంది. లెట్స్ స్టార్ట్.",
    "[00:15] ముందుగా పాన్ లో అర కప్పు పెసరపప్పు వేసి, లో ఫ్లేమ్ మీద మాత్రమే అడుగు మందంగా ఉన్నటువంటి గిన్నెలో...",
    "[00:21] మంచి సువాసన వచ్చేంత వరకు, లైట్ గోల్డెన్ బ్రౌన్ కలర్ వచ్చేంత వరకు రోస్ట్ చేసుకోండి.",
    "[00:26] తర్వాత కడిగి, మెత్తగా కుక్కర్ లో మూడు విజిల్స్ వచ్చేంత వరకు కుక్ చేసుకొని పక్కన ఉంచుకోండి.",
    "[00:32] ఇప్పుడు అదే కడాయిలో ఓ కప్పు ఓట్స్ వేసి లో ఫ్లేమ్ మీద లైట్ గోల్డెన్ బ్రౌన్ కలర్ వచ్చేంత వరకు కలుపుతూ రోస్ట్ చేసుకోండి.",
    "[00:39] ఇది రోస్ట్ అవ్వడానికి కనీసం ఐదు నిమిషాల టైమ్ పడుతుంది.",
    "[00:42] ఇప్పుడు పాన్ లో మూడున్నర కప్పుల నీళ్లు పోసుకొని మరగనివ్వండి.",
    "[00:46] నీళ్లు మరుగుతున్నప్పుడు రోస్టెడ్ ఓట్స్ వేసి కుక్ చేసుకోండి.",
    "[00:53] ఇప్పుడు సాల్ట్ వేసి ఓట్స్ ని కంప్లీట్ గా కుక్ చేసుకోండి.",
    "[00:56] కంప్లీట్ గా కుక్ చేసుకోవడం అంటే పట్టుకుంటే మెత్తగా ఉడికి ఉండాలి.",
    "[01:00] ఆ స్టేజ్ లో మెత్తగా ఉడికించుకొని గ్రైండ్ చేసుకొని ఎనుపుకున్నటువంటి పెసరపప్పు పేస్ట్ వేసి బాగా కలుపుకోండి.",
    "[01:06] ఈ పెసరపప్పు వేసాక మరీ గట్టిగా అనిపిస్తే గనక మరో అర కప్పు వాటర్ పోసుకొని ఉడికించుకోండి.",
    "[01:11] యాక్చువల్ గా నేను చెప్పిన కొలత నీళ్లు సరిపోతాయి.",
    "[01:14] దీన్ని ఓ రెండు నిమిషాల పాటు ఉడకనివ్వండి సిమ్ లో.",
    "[01:17] ఇప్పుడు మరో పాన్ లో పావు కప్పు నెయ్యి వేడి చేసుకొని, అందులో 10 నుంచి 12 జీడిపప్పు, పావు చెంచా ఇంగువ వేసి ఫ్రై చేసుకోండి.",
    "[01:25] ఇప్పుడు అర టీస్పూన్ జీలకర్ర, చిన్న అల్లం తరుగు, అర టీస్పూన్ మిరియాలు, రెండు పచ్చిమిర్చి చీలికలు వేసి ఓ నిమిషం పాటు ఫ్రై చేసుకోండి.",
    "[01:33] ఆ తర్వాత రెండు రెబ్బల కరివేపాకు వేసుకొని ఫ్రై చేసుకొని పొంగల్ లో కలుపుకోండి.",
    "[01:41] ఈ ఓట్స్ పొంగల్ వండుకునేటప్పుడు కాస్త జారుగానే వండుకోండి.",
    "[01:44] చల్లారే కొద్దీ గట్టి పడిపోతుంది.",
    "[01:46] ఇది మీరు వేడిగా తింటేనే చాలా చాలా రుచిగా ఉంటుంది చల్లారినప్పటి కంటే అని గుర్తుంచుకోండి చాలు.",
    "[01:52] చాలా ఎంజాయ్ చేస్తారు ఈ పొంగల్.",
    "[01:54] ఈవెన్ (Even) ఇది మీరు డిన్నర్ గా కూడా ట్రై చేయొచ్చు చాలా బావుంటుంది.",
    "[01:57] నచ్చిందా? మరి అయితే మీరు ట్రై చేసి మీకు ఎలా కుదిరిందో కచ్చితంగా ఆ పిక్ ని విస్మయ్ ఫుడ్ ఇన్స్టాగ్రామ్ లో పోస్ట్ చేయండి.",
    "[02:02] బై ది వే (By the way) త్వరలో విస్మయ్ ఫుడ్ వెబ్సైట్ స్టార్ట్ అవ్వబోతోంది గెట్ రెడీ."
  ],
  "transcription_english": [
    "[00:00] Hello Foodies, Welcome to Vismai Food. Today's energy-packed breakfast is Oats Pongal.",
    "[00:06] Its taste is very good. It is also easy to make.",
    "[00:09] From a health point of view, this is much better than the regular Pongal we eat, and the taste is also very good. Let's start.",
    "[00:15] First, add half a cup of moong dal in a pan, and roast it only on low flame in a heavy-bottomed vessel...",
    "[00:21] ...until it releases a nice aroma and turns light golden brown color.",
    "[00:26] After that, wash it and cook it in a cooker until soft for three whistles and keep it aside.",
    "[00:32] Now, in the same kadai, add one cup of oats and roast on low flame while stirring until they turn light golden brown color.",
    "[00:39] It takes at least five minutes to roast.",
    "[00:42] Now pour three and a half cups of water into a pan and let it boil.",
    "[00:46] When the water is boiling, add the roasted oats and cook.",
    "[00:53] Now add salt and cook the oats completely.",
    "[00:56] Cook completely means if you touch it, it should be soft and cooked.",
    "[01:00] At that stage, add the moong dal paste that has been cooked soft and mashed, and mix well.",
    "[01:06] After adding this moong dal, if it feels too thick, add another half cup of water and cook.",
    "[01:11] Actually, the water measurement I mentioned will be sufficient.",
    "[01:14] Let this cook for two minutes on simmer.",
    "[01:17] Now heat a quarter cup of ghee in another pan, add 10 to 12 cashew nuts and a quarter teaspoon of asafoetida and fry.",
    "[01:25] Now add half a teaspoon of cumin seeds, small chopped ginger pieces, half a teaspoon of pepper, and two slit green chilies and fry for a minute.",
    "[01:33] After that, add two sprigs of curry leaves, fry, and mix it into the Pongal.",
    "[01:41] When cooking this Oats Pongal, cook it a bit runny.",
    "[01:44] It hardens as it cools down.",
    "[01:46] Just remember that it tastes very very good when you eat it hot compared to when it cools down.",
    "[01:52] You will enjoy this Pongal a lot.",
    "[01:54] Even you can try this for dinner, it will be very good.",
    "[01:57] Did you like it? Then try it and definitely post the picture of how it turned out for you on Vismai Food Instagram.",
    "[02:02] By the way, Vismai Food website is starting soon, get ready."
  ]
  }
}
