{
  "metadata": {
    "title": "Dry Fruit Laddu | డ్రై ఫ్రూట్ లడ్డూ | పంచదార వాడకుండా చేసిన ఆరోగ్యకరమైన లడ్డు | Sweet Without Sugar",
    "channel_name": "Vismai Food",
    "publish_date": "2019-04-23",
    "view_count": 3057576,
    "like_count": 37663,
    "duration": "03:03",
    "language": "Telugu",
    "video_id": "07w4ouUffFs",
    "url": "https://www.youtube.com/watch?v=07w4ouUffFs",
    "description": "Hello foodies. Welcome to Vismai Food.\n\nVisit https://www.vismaifood.com/\nFor More Recipes and to Purchase our Products.\n\nDry Fruit Laddu is a healthy choice for health-conscious people. Taste this and pack your body with energy.\n#DryFruitsLaddu #DryFruitLaddu #DryFruitsLadoo #DryFruitLadoo #Ladoo #Laddu #Sweets #IndianSweets #HealthySweets\n\nFor more interesting recipes, please do subscribe to our channel:\nwww.youtube.com/channel/UCBSwcEOp0PMwhvE6FVjgITw?sub_confirmation=1\nhttps://www.youtube.com/vismaifood\n\nFollow us on Social Media:\nhttps://twitter.com/VismaiF\nhttps://www.instagram.com/vismaifoodies/\nhttps://www.facebook.com/Vismai-Food-...\n\nVismai Food Staff\nExecutive Producer: Swetha Paruchuri\nCamera: Phani Sudhir\nEdit: Teja, Ajith",
    "ingredients_detected": [
      "dry fruits",
      "nuts",
      "dates",
      "jaggery",
      "ghee",
      "cardamom"
    ]
  },
  "transcription": {
  "transcription_telugu": [
    "[00:00] హలో ఫుడీస్, వెల్కమ్ టు విస్మయ్ ఫుడ్. ఇవాల్టి స్పెషల్ పర్ఫెక్ట్ టేస్టీ డ్రై ఫ్రూట్ లడ్డూ.",
    "[00:06] ఇది చాలా చాలా హెల్దీ. ఎప్పుడైనా వీకెండ్ లో ఒకసారి చేసుకొని...",
    "[00:09] రోజు జాబ్స్ కి వెళ్ళే వారు, స్కూల్స్ కి వెళ్ళే కిడ్స్ కి లేదా హౌస్ వైఫ్స్, ప్రెగ్నెంట్ లేడీస్ ఎవరైనా సరే...",
    "[00:15] కాస్త ఆకలి అనిపించినప్పుడు 11 గంటల అప్పుడు కానీ లేదా సాయంత్రాలు కానీ ఓ లడ్డూ తిని చూడండి.",
    "[00:20] ఎంత ఫిల్లింగ్ గా ఉంటుందో, ఎంతో హెల్దీ ఈ లడ్డూ.",
    "[00:23] ఇంకో విషయం ఏంటంటే ఇందులో షుగర్ లేనే లేదు.",
    "[00:27] చాలా చాలా బాగుంటుంది. పర్ఫెక్ట్ మీరు స్వీట్ షాప్ లో కొని తెచ్చుకున్నటువంటి లడ్డూ టేస్ట్ వస్తుంది.",
    "[00:32] లెట్స్ నాట్ వెయిట్ (Let's not wait), స్టార్ట్ చేసేద్దాం.",
    "[00:33] ముందుగా పాన్ లో ఓ టేబుల్ స్పూన్ నెయ్యి కరిగించుకోండి.",
    "[00:37] దీన్ని గోంద్ అంటారు. ఇది ఓ చెట్టు బంక.",
    "[00:41] దీనికి ఎన్నో ఎన్నో హెల్త్ బెనిఫిట్స్ ఉన్నాయి.",
    "[00:43] ప్రెగ్నెంట్ లేడీస్ కి, ఎదుగుతున్న పిల్లలకి, మోకాళ్ళ నొప్పులు ఉన్న వాళ్ళకి చాలా మంచిది ఈ బంక.",
    "[00:48] అన్ని ఆయుర్వేదిక్ షాప్స్ లో దొరుకుతుంది తప్పకుండా.",
    "[00:50] ఇది వేసి నెయ్యిలో వేయించుకోండి. కాసేపటికి సగ్గుబియ్యం పొంగినట్టు పొంగుతుంది. ఆ తర్వాత తీసి చల్లార్చుకోండి.",
    "[00:58] ఇప్పుడు అదే కడాయిలో మరో అర టీస్పూన్ నెయ్యి కరిగించుకొని...",
    "[01:01] పావు కప్పు జీడిపప్పు పలుకులు వేసి లైట్ గోల్డెన్ బ్రౌన్ కలర్ రాగానే తీసి పక్కన ఉంచుకోండి.",
    "[01:09] అదే కడాయిలో పావు కప్పు బాదం పలుకులు, పావు కప్పు పిస్తా పలుకులు, పావు కప్పు కర్బూజా గింజలు - అదే మనం సారపప్పు అంటాం కదా - అది వేసి...",
    "[01:17] లో ఫ్లేమ్ (low flame) మీద లైట్ గోల్డెన్ బ్రౌన్ కలర్ రాగానే తీసి చల్లార్చుకోండి.",
    "[01:21] గోల్డెన్ బ్రౌన్ కలర్ వచ్చేంత వరకు ఏది వేపకండి. అలా వేపితే చల్లారే పాటికి మాడిపోతాయి.",
    "[01:26] మీకు నచ్చితే ఇందులో మరో పావు కప్పు ఎండు ద్రాక్ష కూడా వేసుకోవచ్చు, నేను వేయలేదు. కాస్త పుల్ల పుల్లగా ఉంటుందని. మీకు నచ్చితే వేసుకోండి.",
    "[01:33] ఇప్పుడు ఓ టేబుల్ స్పూన్ గసగసాలు వేసి, ఎర్రగా వేపి తీసి పక్కన ఉంచుకోండి.",
    "[01:40] ఇప్పుడు పావు కప్పు ఎండు కొబ్బరి పొడి వేసి లైట్ గోల్డెన్ బ్రౌన్ కలర్ వచ్చేంత వరకు వేపుకొని తీసి పక్కన ఉంచుకోండి.",
    "[01:47] ఇప్పుడు వేయించుకున్న గోంద్ ని అప్పడాల కర్రతో బాగా పౌడర్ గా చేసుకోండి.",
    "[01:51] ఈ గోంద్ వేస్తే రుచికి రుచి ఆరోగ్యానికి ఆరోగ్యం. దొరక్కపోతే స్కిప్ చేసేయండి.",
    "[01:58] దీన్ని ఫ్రై చేసుకున్నటువంటి డ్రై ఫ్రూట్స్ లో వేసి బాగా కలుపుకోండి.",
    "[02:02] ఇప్పుడు మిక్సీ జార్ లో సీడ్ లెస్ (seedless) ఓ కప్పు పండు ఖర్జూరం వేసి కోర్స్ గా గ్రైండ్ చేసుకోండి.",
    "[02:08] ఆ తర్వాత కడాయిలో ఓ టీస్పూన్ నెయ్యి వేడి చేసుకొని, ఖర్జూరం పేస్ట్ వేసి...",
    "[02:12] దాంతో పాటు డ్రై ఫ్రూట్స్, అర టీస్పూన్ యాలకుల పొడి, పావు చెంచా జాజికాయ పొడి.",
    "[02:18] ఇది చాలా మంచి ఫ్లేవర్ ఇస్తుంది అస్సలు స్కిప్ చేయకండి.",
    "[02:23] ఇవన్నీ వేసి ఓ నిమిషం పాటు లో ఫ్లేమ్ మీద బాగా కలుపుకోండి అన్ని కలిసేటట్టు.",
    "[02:28] ఆ తర్వాత స్టవ్ ఆఫ్ చేసి గోరువెచ్చగా అయ్యేంత వరకు ఆగండి.",
    "[02:32] గోరువెచ్చగా అయ్యాక చేతులకి నెయ్యి రాసుకొని లడ్డూలుగా చుట్టుకోండి.",
    "[02:36] పూర్తిగా చల్లారాక ఎయిర్ టైట్ జార్ (air-tight jar) లో పెట్టుకుంటే కనీసం పది రోజుల పైన నిల్వ ఉంటాయి.",
    "[02:41] ఎంతో టేస్టీ, అంతకు మించి చాలా చాలా హెల్దీ.",
    "[02:44] మా కొలతలతో ఓసారి చేసి చూడండి. పర్ఫెక్ట్ అండి చాలా బాగా వచ్చాయి అని మీరు కచ్చితంగా కామెంట్ చేస్తారు.",
    "[02:50] అంత బాగా వస్తాయి ఈ లడ్డూలు.",
    "[02:52] మీకు నచ్చిందా? మరి అయితే మీరు ట్రై చేసి మీకు ఎలా కుదిరిందో కచ్చితంగా ఆ పిక్ ని విస్మయ్ ఫుడ్ ఇన్స్టాగ్రామ్ లో పోస్ట్ చేయండి.",
    "[02:58] బై ది వే (By the way) సబ్స్క్రైబ్ చేసి కామెంట్ చేయడం అస్సలు మర్చిపోకండి."
  ],
  "transcription_english": [
    "[00:00] Hello Foodies, Welcome to Vismai Food. Today's special is the perfect tasty Dry Fruit Laddu.",
    "[00:06] This is very, very healthy. Make it once on a weekend and...",
    "[00:09] ...for those going to daily jobs, kids going to schools, or housewives, pregnant ladies, anyone...",
    "[00:15] ...when feeling slightly hungry at 11 o'clock or in the evenings, try eating one laddu.",
    "[00:20] This laddu is so filling and very healthy.",
    "[00:23] Another thing is that there is absolutely no sugar in this.",
    "[00:27] It tastes very, very good. You will get the perfect taste of a laddu bought from a sweet shop.",
    "[00:32] Let's not wait, let's start.",
    "[00:33] First, melt a tablespoon of ghee in a pan.",
    "[00:37] This is called Gond (Edible Gum). It is the gum from a tree.",
    "[00:41] This has many, many health benefits.",
    "[00:43] This gum is very good for pregnant ladies, growing children, and those with knee pains.",
    "[00:48] It is definitely available in all Ayurvedic shops.",
    "[00:50] Add this and fry in ghee. After a while, it puffs up like sago pearls. Then remove and let it cool.",
    "[00:58] Now in the same kadai, melt another half teaspoon of ghee...",
    "[01:01] ...add a quarter cup of cashew nuts and once they turn light golden brown, remove and set aside.",
    "[01:09] In the same kadai, add a quarter cup of almond pieces, a quarter cup of pistachio pieces, a quarter cup of melon seeds - which we call 'saarappu' - and...",
    "[01:17] ...fry on low flame until they turn light golden brown and then remove and cool.",
    "[01:21] Do not fry anything until deep golden brown. If you do, they will burn by the time they cool down.",
    "[01:26] If you like, you can also add another quarter cup of raisins (dry grapes) to this, I didn't add them. Because it might taste slightly sour. Add if you like.",
    "[01:33] Now add a tablespoon of poppy seeds, roast them until red, remove and set aside.",
    "[01:40] Now add a quarter cup of dry coconut powder and roast until light golden brown color, remove and set aside.",
    "[01:47] Now crush the fried Gond into a fine powder using a rolling pin.",
    "[01:51] Adding this Gond gives taste as well as health. If you don't find it, skip it.",
    "[01:58] Add this to the fried dry fruits and mix well.",
    "[02:02] Now in a mixer jar, add a cup of seedless dates and grind coarsely.",
    "[02:08] After that, heat a teaspoon of ghee in a kadai, add the dates paste...",
    "[02:12] ...along with dry fruits, half a teaspoon cardamom powder, and a quarter teaspoon nutmeg powder.",
    "[02:18] This gives a very good flavor, do not skip it at all.",
    "[02:23] Add all these and mix well on low flame for a minute until everything combines.",
    "[02:28] After that, turn off the stove and wait until it becomes lukewarm.",
    "[02:32] Once lukewarm, grease your hands with ghee and roll into laddus.",
    "[02:36] Once completely cooled, store in an air-tight jar, they will last for at least more than ten days.",
    "[02:41] Very tasty, and beyond that, very, very healthy.",
    "[02:44] Try making it once with our measurements. You will definitely comment saying, \"Perfect, they turned out very well.\"",
    "[02:50] These laddus turn out that well.",
    "[02:52] Did you like it? Then try it and definitely post the picture of how it turned out for you on Vismai Food Instagram.",
    "[02:58] By the way, don't forget to subscribe and comment at all."
  ]
  }
}
