{
  "metadata": {
    "title": "కరకరలాడే చేమగడ్డ వేపుడు | Colocasia Fry | మా స్టైల్ చేస్తే జీవితంలో మర్చిపోరు దీని రుచి",
    "channel_name": "Vismai Food",
    "publish_date": "2019-04-24",
    "view_count": 1414610,
    "like_count": 13522,
    "duration": "03:08",
    "language": "Telugu",
    "video_id": "w8Ogo0veh3g",
    "url": "https://www.youtube.com/watch?v=w8Ogo0veh3g",
    "description": "For Complete Recipe With Ingredients visit www.vismaifood.com\n\nHey Foodies. Welcome to Vismai Food.\n\nFor U DICTIONARY APP\nhttps://dn66q.app.goo.gl/vkud14\n\nFor Sambar Karam Recipe\nhttps://youtu.be/vxA7yjzSX9A\n\nFor PappuCharu\nhttps://youtu.be/0GU02trZPn8\n\nFor MiryalaCharu\nhttps://youtu.be/beTciuqSFB4\n\nChamagadda Fry/ Colocasia Fry is an excellent fried dish. It is also called as Chamadumpala Fry or Arbi Fry. It is cut into pieces and deep fried until it is fried. Please try, share this with your friends and family.\n#ChamaGaddaFry #CalacosiaFry #ChamaDumpalaFry #FryRecipesInTelugu #ChamaGadda #ChamaDumpa\n\nFor more interesting recipes, please do subscribe to our channel:\n\nwww.youtube.com/channel/UCBSwcEOp0PMwhvE6FVjgITw?sub_confirmation=1\nhttps://www.youtube.com/vismaifood\n\nFollow us on Social Media:\n\nhttps://twitter.com/VismaiF\nhttps://www.instagram.com/vismaifoodies/\nhttps://www.facebook.com/Vismai-Food-...\n\nChole Masala | చోలే మసాలా | పూరి, చపాతీ, రైస్ ఎందులోకైన మా స్టైల్ లో కూర చాల రుచిగా ఉంటుంది\nhttps://youtu.be/62o8ALF72tE\n\nMix Veg Pakoda | Veg Pakoda in Telugu | ఈ కూరగాయలన్నీ వేసి ఇలా పకోడీ చేయండి చాలా ఇష్టంగా తింటారు\nhttps://youtu.be/MggAO-P1KCI\n\nBoti Fry | బోటి గోంగూర ఫ్రై | Boti Fry Recipe | Hyderabadi Style Boti Fry\nhttps://youtu.be/QlGzDXnPlMg\n\nVismai Food Staff\n\nExecutive Producer: Swetha Paruchuri\nCamera: Phani Sudhir\nEdit: Teja, Ajith",
    "ingredients_detected": [
      "colocasia",
      "oil",
      "turmeric powder",
      "red chili powder",
      "curry leaves",
      "ginger",
      "garlic",
      "green chili",
      "salt"
    ]
  },
  "transcription": {
  "transcription_telugu": [
    "[00:00] హలో ఫుడీస్, వెల్కమ్ టు విస్మయ్ ఫుడ్.",
    "[00:03] ఇవాల్టి స్పెషల్ ది బెస్ట్ క్రిస్పీ క్రంచీ చేమగడ్డ వేపుడు.",
    "[00:07] వేడి వేడి అన్నంలో నెయ్యి వేసుకొని తిన్నా, పప్పుచారు లేదంటే మిరియాల రసంలో కానీ నంచుకుని తింటుంటే...",
    "[00:13] అబ్బబ్బబ్బబ్బా... పదాలు లేవు వెతకడానికి ఆ రుచిని వర్ణించడానికి. అంత బావుంటుంది.",
    "[00:19] అసలు ఒట్టిగా కూర్చొని చిప్స్ లా కూడా తినేయొచ్చు మా స్టైల్ లో చేస్తే.",
    "[00:23] చాలా చాలా బావుంటుంది. ఎప్పుడు చేసినా పర్ఫెక్ట్ టేస్ట్ రావడానికి కొన్ని టిప్స్ ఉన్నాయి జాగ్రత్తగా ఫాలో అవ్వండి. వీడియో చివరి వరకు చూడండి. లెట్స్ స్టార్ట్.",
    "[00:30] ముందుగా పావు కిలో చేమగడ్డల్ని కడిగి ఓ విజిల్ వచ్చేంత వరకు ఉడికించుకొని చెక్కు తీసుకున్నవి తీసుకోండి.",
    "[00:36] వీటిని అర ఇంచ్ సైజు ముక్కలుగా కట్ చేసుకోండి. మరీ చిన్నవిగా కట్ చేసుకోకండి.",
    "[00:41] మీరు కుక్కర్ లో ఓ విజిల్ కంటే ఎక్కువగా ఉడికిస్తే టూత్ పేస్ట్ అయిపోతుంది కలుపుకునేటప్పుడు అని గుర్తుంచుకోండి.",
    "[00:46] సాఫ్ట్ గా ఉడికించుకోవాలి కానీ పట్టుకుంటే గట్టిగా ఉండాలి.",
    "[00:50] ఇప్పుడు ఈ ముక్కల్ని కాస్త వెడల్పాటి బౌల్ లో వేసుకొని, రెండు టీస్పూన్ల బియ్యప్పిండి, పావు చెంచా పసుపు...",
    "[00:56] సాల్ట్, ఓ టీస్పూన్ కారం, అర టీస్పూన్ ఆమ్చూర్ పౌడర్.",
    "[01:01] ఇది ఆప్షనల్ వేస్తే పుల్ల పుల్లగా భలే ఉంటాయి.",
    "[01:04] ఇవన్నీ వేసి నెమ్మదిగా ముక్కలు చిదిరిపోకుండా బియ్యప్పిండి పట్టించండి.",
    "[01:08] చేమగడ్డల్లోని చెమ్మ బియ్యం పిండిని పీల్చేస్తుంది.",
    "[01:11] కానీ మనకు అడిషనల్ క్రిస్పీగా ఉండాలి కదా చేమగడ్డ ఫ్రై?",
    "[01:14] అందుకని చెమ్మ పీల్చేశాక మళ్ళీ ఓ టేబుల్ స్పూన్ బియ్యప్పిండి వేసి బాగా పట్టించండి ముక్కలకి.",
    "[01:19] ఆ తర్వాత బియ్యప్పిండి ముక్కల నుండి విడిపోకుండా రెండు టేబుల్ స్పూన్ల ఆయిల్ వేసి నెమ్మదిగా కోట్ చేయండి.",
    "[01:29] ఇప్పుడు వేడి వేడి నూనెలో వేసి రెండు నిమిషాలు అలాగే వదిలేయండి.",
    "[01:33] ఆ తర్వాత నెమ్మదిగా గరిట పెట్టి తిప్పుతూ కరకరలాడేంత వరకు ఫ్రై చేసుకోండి.",
    "[01:38] మీరు నూనె వేడెక్కకుండా గాని వేస్తే చేమగడ్డలు నూనెని బాగా పీల్చేస్తాయి.",
    "[01:43] లైట్ గోల్డెన్ బ్రౌన్ కలర్ వచ్చేంత వరకు మీడియం ఫ్లేమ్ మీద వేపుకోవాలి.",
    "[01:47] ఆ తర్వాత హై ఫ్లేమ్ మీద వేపుకుంటే క్రిస్పీగా క్రంచీగా ఉంటాయి.",
    "[01:51] మీరు మసాలాలు ఎంత బాగా కోట్ చేసినా, ఈ ఫ్రై చేయడం అనేది సరిగ్గా చేయకపోతే మీకు సరైన టేస్ట్ రాదని గుర్తుంచుకోండి.",
    "[01:57] ఇవి ఇప్పుడు చక్కగా గోల్డెన్ కలర్ రాగానే తీసి పక్కన ఉంచుకోండి.",
    "[02:00] ఇప్పుడు మరో పాన్ లో రెండు టీస్పూన్ల ఆయిల్ వేడి చేసుకొని, అందులో దంచిన మూడు వెల్లుల్లి, రెండు ఎండుమిర్చి...",
    "[02:06] అర టీస్పూన్ ఆవాలు, అర టీస్పూన్ మినప్పప్పు, ఓ రెబ్బ కరివేపాకు వేసి తాలింపుని బాగా వేయించుకోండి.",
    "[02:14] అప్పుడు ఫ్రై చేసుకున్నటువంటి చేమగడ్డ వేసి, ఓ టేబుల్ స్పూన్ సాంబార్ కారం వేసుకోండి.",
    "[02:19] ఈ సాంబార్ కారం రెసిపీ కోసం డిస్క్రిప్షన్ బాక్స్ లో లింక్ ఉంచాను చూడండి. పర్ఫెక్ట్ సాంబార్ కారం రెసిపీ అది.",
    "[02:25] ఇది వేస్తేనే అసలు మజా ఉంటుంది. మీకు ఇది దొరక్కపోతే గనక మామూలు కారమే వాడుకోండి.",
    "[02:30] ఇవి వేసి బాగా టాస్ చేసుకోండి.",
    "[02:33] ఆ తర్వాత తీసి, మూత పెట్టకుండా ఓ టిష్యూ నాప్కిన్ గాని లేదంటే ఓ క్లాత్ గాని కప్పి బౌల్ లో ఉంచండి.",
    "[02:39] మూత పెడితే మెత్తబడిపోతాయి. ఇలా క్లాత్ వేస్తే ఎంత సేపైనా సరే క్రిస్పీగా ఉంటాయి.",
    "[02:44] ఈ చేమగడ్డ వేపుడులోనే ఎన్నో ఎన్నో వెరైటీస్ ఉన్నాయి అవన్నీ మరోసారి చూపిస్తాను.",
    "[02:49] అందాక దీన్ని తింటూ తనివి తీరా ఎంజాయ్ చేయండి.",
    "[02:52] పప్పుచారుతో, చారుతో గాని ఓ సారి ట్రై చేసి చూడండి.",
    "[02:55] చాలా బాగున్నాయండి మీరు చెప్పినట్టు అని కచ్చితంగా అంటారు. ఇది అప్రిసియేషన్ గ్యారంటీడ్ రెసిపీ.",
    "[03:01] బై ది వే ఫ్రెండ్స్ (By the way friends), మంచి లాంగ్వేజ్ నేర్చుకోవడానికి బెస్ట్ యాప్ అంటే యూ-డిక్షనరీ (U-Dictionary) యాప్. దాని కోసం డిస్క్రిప్షన్ బాక్స్ లోని లింక్ చూడండి."
  ],
  "transcription_english": [
    "[00:00] Hello Foodies, Welcome to Vismai Food.",
    "[00:03] Today's special is the best crispy crunchy Colocasia Fry (Chama Gadda Vepudu).",
    "[00:07] Eating it with piping hot rice and ghee, or as a side dish with Pappu Charu (Lentil Stew) or Pepper Rasam...",
    "[00:13] Oh my god... there are no words to find to describe that taste. It is that good.",
    "[00:19] You can even eat it just like chips if made in our style.",
    "[00:23] It is very very good. There are some tips to get perfect taste every time you make it, follow them carefully. Watch the video till the end. Let's start.",
    "[00:30] First, take 250gms of colocasia, wash them, boil for one whistle, and peel them.",
    "[00:36] Cut them into half-inch sized pieces. Do not cut them too small.",
    "[00:41] Remember that if you cook for more than one whistle in the cooker, it will become like toothpaste while mixing.",
    "[00:46] They should be cooked soft but should feel firm when touched.",
    "[00:50] Now put these pieces in a slightly wide bowl, add two teaspoons of rice flour, quarter teaspoon turmeric...",
    "[00:56] ...salt, one teaspoon chili powder, half teaspoon dry mango powder (amchur powder).",
    "[01:01] This is optional, but if added, they taste tangy and great.",
    "[01:04] Add all these and coat the rice flour gently without breaking the pieces.",
    "[01:08] The moisture in colocasia absorbs the rice flour.",
    "[01:11] But we need the colocasia fry to be additionally crispy, right?",
    "[01:14] So after the moisture is absorbed, add another tablespoon of rice flour and coat the pieces well.",
    "[01:19] After that, add two tablespoons of oil so that the rice flour doesn't separate from the pieces and coat gently.",
    "[01:29] Now drop them in hot oil and leave them for two minutes.",
    "[01:33] After that, slowly stir with a ladle and fry until they become crunchy.",
    "[01:38] If you add colocasia without the oil being hot enough, they will absorb a lot of oil.",
    "[01:43] You must fry on medium flame until they turn light golden brown color.",
    "[01:47] After that, if fried on high flame, they will be crispy and crunchy.",
    "[01:51] Remember that no matter how well you coat the spices, if this frying is not done correctly, you won't get the right taste.",
    "[01:57] Once they turn a nice golden color, remove and set aside.",
    "[02:00] Now heat two teaspoons of oil in another pan, add three crushed garlic cloves, two dry red chilies...",
    "[02:06] ...half teaspoon mustard seeds, half teaspoon urad dal, one sprig of curry leaves and fry the tempering well.",
    "[02:14] Then add the fried colocasia and add one tablespoon of Sambar Karam (Spicy Sambar Powder).",
    "[02:19] I have put the link for this Sambar Karam recipe in the description box, check it out. It's a perfect Sambar Karam recipe.",
    "[02:25] The real taste comes only if you add this. If you don't find this, use normal chili powder.",
    "[02:30] Add these and toss well.",
    "[02:33] After that, remove it and place in a bowl covered with a tissue napkin or a cloth without putting a lid.",
    "[02:39] If you put a lid, they will become soft. If you cover with a cloth like this, they will stay crispy for any amount of time.",
    "[02:44] There are many many varieties in this colocasia fry itself, I will show them another time.",
    "[02:49] Until then, eat this and enjoy to your heart's content.",
    "[02:52] Try it once with Pappu Charu or Rasam.",
    "[02:55] You will definitely say, \"It's very good, just as you said.\" This is an appreciation guaranteed recipe.",
    "[03:01] By the way friends, U-Dictionary app is the best app to learn a good language. Check the link in the description box for that."
  ]
  }
}
