{
  "metadata": {
    "title": "Avakaya Veg Fried Rice | ఆవకాయ వెజ్ ఫ్రైడ్ రైస్ | అన్నం మిగిలిందా? 5 mins లో ఆవకాయ ఫ్రైడ్ రైస్ రెడీ",
    "channel_name": "Vismai Food",
    "publish_date": "2019-04-25",
    "view_count": 291883,
    "like_count": 4381,
    "duration": "01:50",
    "language": "Telugu",
    "video_id": "SwM8kafqMtg",
    "url": "https://www.youtube.com/watch?v=SwM8kafqMtg",
    "description": "Buy MEYER pans at www.potsandpans.in \nLink: http://bit.ly/2SNB2bq\n15% Discount code: VIS15\n\nVisit https://www.vismaifood.com/\nFor More Recipes and to Purchase our Products.\n\nHey all. Have you ever tried preparing fried rice with avakaya? If yes, share your experience. If not, please try with our tips and tricks.\n#Avakaya #FriedRice #AvakayaFriedRice #VegFriedRice\n\nFor more interesting recipes, please do subscribe to our channel:\nwww.youtube.com/channel/UCBSwcEOp0PMwhvE6FVjgITw?sub_confirmation=1\nhttps://www.youtube.com/vismaifood\n\nFollow us on Social Media:\nhttps://twitter.com/VismaiF\nhttps://www.instagram.com/vismaifoodies/\nhttps://www.facebook.com/Vismai-Food-...\n\nChole Masala | చోలే మసాలా | పూరి, చపాతీ, రైస్ ఎందులోకైన మా స్టైల్ లో కూర చాల రుచిగా ఉంటుంది\nhttps://youtu.be/62o8ALF72tE\n\nMix Veg Pakoda | Veg Pakoda in Telugu | ఈ కూరగాయలన్నీ వేసి ఇలా పకోడీ చేయండి చాలా ఇష్టంగా తింటారు\nhttps://youtu.be/MggAO-P1KCI\n\nBoti Fry | బోటి గోంగూర ఫ్రై | Boti Fry Recipe | Hyderabadi Style Boti Fry\nhttps://youtu.be/QlGzDXnPlMg\n\nVismai Food Staff\nExecutive Producer: Swetha Paruchuri\nCamera: Phani Sudhir\nEdit: Teja, Ajith",
    "ingredients_detected": [
      "avakaya (mango pickle)",
      "rice",
      "vegetables",
      "oil",
      "salt",
      "spices",
      "ginger",
      "green chili",
      "onion",
      "garlic"
    ]
  },
"transcription": {
  "transcription_telugu": [
    "[00:00] హలో ఫుడీస్, వెల్కమ్ టు విస్మయ్ ఫుడ్.",
    "[00:01] ఇవాల్టి స్పెషల్ విస్మయ్ ఫుడ్ స్పెషల్ ఆవకాయ వెజ్ ఫ్రైడ్ రైస్.",
    "[00:07] అవునండి ఫ్రైడ్ రైస్ విత్ ఆవకాయ.",
    "[00:09] రెగ్యులర్ ఫ్రైడ్ రైస్ మన తెలుగోళ్ళకి అస్సలు ఆననే ఆనదు.",
    "[00:13] బావుంది కానీ... అని ఏదో లాగుతారు.",
    "[00:16] కానీ ఇది తిని చూడండి... అసలు దీర్ఘాలు కాదు కదా.. మాటలు లేవు అంత బావుంది అని కచ్చితంగా చెప్తారు.",
    "[00:23] అన్నం మిగిలిపోయినా ఇది చేసేసుకోవచ్చు చాలా చాలా బావుంటుంది.",
    "[00:26] లెట్స్ స్టార్ట్ విస్మయ్ ఫుడ్ స్పెషల్ ఆవకాయ ఫ్రైడ్ రైస్.",
    "[00:30] ముందుగా పాన్ లో మూడు టేబుల్ స్పూన్ల ఆయిల్ హీట్ చేసుకోండి.",
    "[00:33] అందులో ఓ చిన్న ఉల్లిపాయ సన్నని తరుగు వేసి, పావు కప్పు సన్నని క్యారెట్ తరుగు...",
    "[00:37] మూడు ఫ్రెంచ్ బీన్స్ సన్నని తరుగు, పావు కప్పు క్యాబేజీ తరుగు.",
    "[00:41] ఇవన్నీ వేసి హై ఫ్లేమ్ (High flame) మీద 30 సెకండ్స్ పాటు బాగా టాస్ చేసుకోండి.",
    "[00:45] కాయగూరల్ని పూర్తిగా అస్సలు ఫ్రై చేయకండి.",
    "[00:48] ఇప్పుడు ఓ టీస్పూన్ లైట్ సోయా సాస్, ఓ టేబుల్ స్పూన్ రెడ్ చిల్లీ సాస్...",
    "[00:53] ఓ టీస్పూన్ టొమాటో కెచప్ వేసి బాగా కలుపుకొని సాసెస్ (Sauces) ని ఓ 30 సెకండ్స్ పాటు హై ఫ్లేమ్ మీద ఉడకనివ్వండి.",
    "[01:00] ఇప్పుడు పావు కప్పు మామిడికాయ పచ్చడి వేసుకొని బాగా కలుపుకోండి.",
    "[01:07] బాగా కలుపుకున్నాక ఓ కప్పు బియ్యాన్ని పొడిపొడిగా వండుకున్నది వేసుకోండి.",
    "[01:12] తర్వాత చాలా కొద్దిగా సాల్ట్ వేసి, హై ఫ్లేమ్ మీద సాసెస్, ఆవకాయని అన్నానికి బాగా పట్టించి...",
    "[01:18] దింపే ముందు రెండు టేబుల్ స్పూన్ల స్ప్రింగ్ ఆనియన్స్ చల్లుకొని దింపేసుకోండి.",
    "[01:21] దీంట్లోనే చికెన్ ఆవకాయ ఫ్రైడ్ రైస్ ఉంటుంది అబ్బబ్బబ్బా.. ఇంకెంత బావుంటుందో అది మరోసారి చెప్తాను.",
    "[01:27] కానీ ఈ టైప్ ఆఫ్ ఫ్రైడ్ రైస్ మీరు ఒక్కసారి తిన్నారంటే, మళ్లీ మళ్లీ చేస్తూనే ఉంటారు.",
    "[01:31] తిన్నవాళ్లు అడిగి మరీ చేయించుకొని తింటారు అంత బావుంటుంది.",
    "[01:35] అంత పర్ఫెక్ట్ రెసిపీ ఇది.",
    "[01:37] తప్పకుండా ట్రై చేయండి విస్మయ్ ఫుడ్ స్పెషల్ ఆవకాయ ఫ్రైడ్ రైస్.",
    "[01:40] మీకు నచ్చిందా? మరి అయితే మీరు ట్రై చేసి మీకు ఎలా కుదిరిందో కచ్చితంగా ఆ పిక్ ని విస్మయ్ ఫుడ్ ఇన్స్టాగ్రామ్ లో పోస్ట్ చేయండి.",
    "[01:46] బై ది వే (By the way) సబ్స్క్రైబ్ చేయడం అస్సలు మర్చిపోకండే."
  ],
  "transcription_english": [
    "[00:00] Hello Foodies, Welcome to Vismai Food.",
    "[00:01] Today's special Vismai Food Special Avakaya (Mango Pickle) Veg Fried Rice.",
    "[00:07] Yes, Fried Rice with Mango Pickle.",
    "[00:09] Regular fried rice doesn't satisfy us Telugu people at all.",
    "[00:13] They might say, \"It's good, but...\" and drag on something.",
    "[00:16] But try eating this... not just dragging words, they will definitely say, \"Speechless, it is that good.\"",
    "[00:23] Even if you have leftover rice, you can make this, it tastes very very good.",
    "[00:26] Let's start Vismai Food Special Avakaya Fried Rice.",
    "[00:30] First, heat three tablespoons of oil in a pan.",
    "[00:33] Add finely chopped pieces of one small onion, quarter cup of finely chopped carrot...",
    "[00:37] ...finely chopped pieces of three French beans, quarter cup of chopped cabbage.",
    "[00:41] Add all these and toss well on high flame for 30 seconds.",
    "[00:45] Do not fry the vegetables completely at all.",
    "[00:48] Now add one teaspoon light soya sauce, one tablespoon red chili sauce...",
    "[00:53] ...one teaspoon tomato ketchup, mix well and let the sauces cook on high flame for 30 seconds.",
    "[01:00] Now add a quarter cup of mango pickle and mix well.",
    "[01:07] After mixing well, add one cup of rice cooked fluffy (grains separated).",
    "[01:12] Then add very little salt, and on high flame, coat the rice well with sauces and pickle...",
    "[01:18] ...before taking it off the stove, sprinkle two tablespoons of spring onions and remove.",
    "[01:21] In this itself, there is Chicken Avakaya Fried Rice... Oh my god.. how good that tastes! I will tell you about it another time.",
    "[01:27] But if you eat this type of fried rice once, you will keep making it again and again.",
    "[01:31] People who ate it will ask for it and make you cook it for them, it tastes that good.",
    "[01:35] This is such a perfect recipe.",
    "[01:37] Definitely try Vismai Food Special Avakaya Fried Rice.",
    "[01:40] Did you like it? Then try it and definitely post the picture of how it turned out for you on Vismai Food Instagram.",
    "[01:46] By the way, don't forget to subscribe at all."
  ]
}
}
    