{
  "metadata": {
    "title": "Pesarapappu Pulusu | రాచిప్పలో | అమ్మలకాలం నాటి పెసరపప్పు పులుసు| Moong Dal Rasam| Vismai food",
    "channel_name": "Vismai Food",
    "publish_date": "2019-05-03",
    "view_count": 853782,
    "like_count": 6910,
    "duration": "02:18",
    "language": "Telugu",
    "video_id": "LbknayuKPoM",
    "url": "https://www.youtube.com/watch?v=LbknayuKPoM",
    "description": "For Complete Recipe and To Purchase Our Products visit https://www.vismaifood.com/\n\nPesarapappu Pulusu or Moongdal Sambar is a popular dish in South India. Here is the complete cooking guide. Please try this and share your experience with us. For recipes step by step directions in english and telugu, please stay tuned to www.vismaifood.com\n\n#PesarapappuPulusu #RachippaLoPulusu #Pulusu #Sambar\n\nPlease do not forget to Like, Share and Comment.\nFor more interesting recipes, please do subscribe to our channel:\nwww.youtube.com/channel/UCBSwcEOp0PMwhvE6FVjgITw?sub_confirmation=1\nhttps://www.youtube.com/vismaifood\n\nFollow us on Social Media:\nhttps://twitter.com/VismaiF\nhttps://www.instagram.com/vismaifoodies/\nhttps://www.facebook.com/Vismai-Food-...\n\nVismai Food Staff\nExecutive Producer: Swetha Paruchuri\nCamera: Phani Sudhir\nEdit: Teja, Ajith",
    "ingredients_detected": [
      "moong dal",
      "tamarind",
      "green chili",
      "ginger",
      "salt",
      "turmeric",
      "curry leaves",
      "water"
    ]
  },
  "transcription_telugu": [
    "[00:00] హలో ఫుడీస్, వెల్కమ్ టు విస్మయ్ ఫుడ్. ఇవాల్టి స్పెషల్ రాతి చిప్పలో పెసరపప్పు పులుసు.",
    "[00:05] పులుసులు రాతి చిప్పలో కాస్తే ఆ రుచే వేరు.",
    "[00:08] ఈ పులుసు నెలల పసిపిల్లల నుండి పెద్దవారి వరకు అందరికీ ఎంతో మంచిది.",
    "[00:13] పొట్టకు చాలా తేలికగా అనిపిస్తుంది, రాత్రుళ్ళు కూడా హాయిగా తినొచ్చు.",
    "[00:17] ఈ ఎండాకాలం మరీ మంచిది చాలా చలువ చేస్తుంది కూడా.",
    "[00:21] లెట్స్ స్టార్ట్ (Let's start) పెసరపప్పు పులుసు.",
    "[00:23] ముందు అర కప్పు పెసరపప్పు వేసి లో ఫ్లేమ్ (low flame) మీద మంచి రంగు, సువాసన వచ్చేంత వరకు వేపుకోండి.",
    "[00:29] ఈ పోత మాంటి సబ్స్క్రైబర్స్ లో చాలా మంది పర్చేస్ చేశారు.",
    "[00:32] చేసిన వారు ఇందులోనే వేపి చూడండి ఎంత బాగా వేగుతాయో.",
    "[00:35] డిఫరెన్స్ మీరే చూస్తారు.",
    "[00:37] ఇవి బాగా వేగాక, కడిగి నీళ్లు పోసి మెత్తగా ఉడికించుకోండి.",
    "[00:41] ఇప్పుడు రాతి చిప్పలో 12 సాంబార్ ఉల్లిపాయలు, 5-6 పచ్చిమిర్చి చీలికలు...",
    "[00:47] అర టీస్పూన్ పసుపు, సాల్ట్, 400 ml వాటర్ పోసి...",
    "[00:51] ఇప్పుడు స్టవ్ వెలిగించుకోండి.",
    "[00:53] రాతి చిప్పలో పదార్థాలు లేకుండా స్టవ్ వెలిగించకూడదు, పగుళ్లు వస్తాయి.",
    "[00:57] ఇప్పుడు నిదానంగా మీడియం ఫ్లేమ్ మీద బాగా రెండు మూడు పొంగులు రానివ్వండి.",
    "[01:02] దీనికి కనీసం 15 నుంచి 20 నిమిషాల టైమ్ పడుతుంది.",
    "[01:05] ఉల్లిపాయలు బాగా మగ్గాయి అనుకున్నప్పుడు, మెత్తగా పలుకు లేకుండా ఎనుపుకున్నటువంటి పెసరపప్పు వేసి బాగా కలుపుకొని...",
    "[01:12] 250 ml వాటర్ పోసుకొని బాగా కలుపుకోండి.",
    "[01:15] ఆ తర్వాత మూత పెట్టి లో ఫ్లేమ్ మీద నిదానంగా మరగనివ్వండి.",
    "[01:20] ఈ పులుసు పప్పు చారు కంటే పల్చగా ఉండాలి, గరిట జారుగా ఉండాలి.",
    "[01:25] ఇలా బాగా పొంగుతున్నప్పుడు స్టవ్ ఆఫ్ చేసేసి...",
    "[01:30] ఒకటిన్నర నిమ్మకాయల రసం పోసుకోండి. నాకు ఒకటిన్నర నిమ్మకాయల రసం సరిపోయింది.",
    "[01:34] మీకు తగినట్లుగా మీరు అడ్జస్ట్ చేసుకోండి.",
    "[01:37] ఇప్పుడు రెండు టేబుల్ స్పూన్ల నూనె వేడి చేసుకోండి. నెయ్యితో తాలింపు ఇంకా బావుంటుంది రుచి.",
    "[01:41] ఇందులో రెండు ఎండుమిర్చి తరుగు, అర టీస్పూన్ ఆవాలు, అర టీస్పూన్ జీలకర్ర వేసి వేయించుకొని...",
    "[01:47] రెండు రెబ్బల కరివేపాకు కూడా వేసుకొని వేయించుకోండి.",
    "[01:51] ఇప్పుడు దీన్ని పులుసులో కలుపుకోండి.",
    "[01:53] బాగా కలుపుకున్నాక అర కట్ట కొత్తిమీర తరుగు కూడా వేసుకొని బాగా కలుపుకోండి.",
    "[01:57] అంతే! పులుసు రెడీ.",
    "[01:59] ఈ పులుసు కనీసం నాలుగైదు గంటల పైన వేడిగానే ఉంటుంది రాతి చిప్పలో ఉంచితే.",
    "[02:05] ఎంతో హెల్దీ, రుచి రాతి చిప్పలో వంట.",
    "[02:08] త్వరలో విస్మయ్ ఫుడ్ వెబ్సైట్ లో ఈ రాతి చిప్పలు అందుబాటులో ఉంచుతాను. మీకు నచ్చితే ఆర్డర్ చేయండి.",
    "[02:13] నచ్చిందా ఈ రెసిపీ? మరి అయితే తప్పకుండా ట్రై చేయండి. విస్మయ్ ఫుడ్ వెబ్సైట్ లో చదువుకుంటూ చేసుకోండి."
  ],
  "transcription_english": [
    "[00:00] Hello Foodies, Welcome to Vismai Food. Today's special is Moong Dal Stew (Pesarapappu Pulusu) in a stone vessel.",
    "[00:05] Stews cooked in a stone vessel have a distinct taste.",
    "[00:08] This stew is very good for everyone, from infants to the elderly.",
    "[00:13] It feels very light on the stomach, and you can comfortably eat it at night too.",
    "[00:17] It is especially good in summer as it cools the body.",
    "[00:21] Let's start Moong Dal Stew.",
    "[00:23] First, add half a cup of moong dal and roast on low flame until it gets a nice color and aroma.",
    "[00:29] Many of the Pota Manti subscribers have purchased this.",
    "[00:32] Those who have purchased, try roasting in this and see how well they roast.",
    "[00:35] You will see the difference yourself.",
    "[00:37] After roasting well, wash and cook it with water until soft.",
    "[00:41] Now in the stone vessel, add 12 sambar onions (shallots), 5-6 slit green chilies...",
    "[00:47] ...half teaspoon turmeric, salt, pour 400 ml water...",
    "[00:51] ...now turn on the stove.",
    "[00:53] Do not light the stove without ingredients in the stone vessel, it will crack.",
    "[00:57] Now slowly let it boil well for two to three bubbles on medium flame.",
    "[01:02] This takes at least 15 to 20 minutes.",
    "[01:05] When you think the onions are cooked well, add the soft mashed moong dal without grains and mix well...",
    "[01:12] ...add 250 ml water and mix well.",
    "[01:15] After that, cover with a lid and let it simmer slowly on low flame.",
    "[01:20] This stew should be thinner than lentil soup (pappu charu), it should be flowy.",
    "[01:25] When it boils well like this, turn off the stove...",
    "[01:30] ...and add juice of one and a half lemons. One and a half lemons juice was sufficient for me.",
    "[01:34] Adjust according to your taste.",
    "[01:37] Now heat two tablespoons of oil. Tempering with ghee tastes even better.",
    "[01:41] Add two chopped dry red chilies, half teaspoon mustard seeds, half teaspoon cumin seeds and fry...",
    "[01:47] ...add two sprigs of curry leaves also and fry.",
    "[01:51] Now mix this into the stew.",
    "[01:53] After mixing well, add half a bunch of chopped coriander leaves and mix well.",
    "[01:57] That's it! Stew is ready.",
    "[01:59] This stew stays hot for at least four to five hours if kept in the stone vessel.",
    "[02:05] Very healthy and tasty cooking in a stone vessel.",
    "[02:08] I will soon make these stone vessels available on the Vismai Food website. Order if you like.",
    "[02:13] Did you like this recipe? Then definitely try it. Read and make it on the Vismai Food website."
  ]
}
