{
  "metadata": {
    "title": "Fish Bhurji Recipe | చేపల పోరుటు | ఈజీ గా చేసుకోగలిగే ఫిష్ రెసిపీ | మళ్ళీ మళ్ళీ తినేల చేస్తుంది",
    "channel_name": "Vismai Food",
    "publish_date": "2019-05-04",
    "view_count": 267456,
    "like_count": 3566,
    "duration": "03:12",
    "language": "Telugu",
    "video_id": "qOoNspRyxLE",
    "url": "https://www.youtube.com/watch?v=qOoNspRyxLE",
    "description": "Hello Foodies. Welcome to Vismai Food!\n\nFor Complete Recipe and To Purchase Our Products visit https://www.vismaifood.com/\n\nFish Bhurji is a very tasty & easy recipe to make in less time. Detailed descriptions will be given on the Vismai Food website very shortly. Please try this recipe and share with your family and friends.\n#Fish #FishBhurji #Bhurji #FishRecipes",
    "ingredients_detected": [
      "fish pieces",
      "salt",
      "turmeric powder",
      "mustard seeds",
      "curry leaves",
      "onion",
      "ginger-garlic paste",
      "green chilies",
      "pepper powder",
      "coriander leaves",
      "oil",
      "garam masala"
    ]
  },
  "transcription_telugu": [
    "[00:00] హలో ఫుడీస్, వెల్కమ్ టు విస్మయ్ ఫుడ్. ఇవాల్టి స్పెషల్ సీఫుడ్ (seafood) స్పెషల్ నా ఫేవరెట్ ఫిష్ బుర్జి (Fish Burji).",
    "[00:06] చాలా చాలా బావుంటుంది. పిల్లలు హాయిగా ఎంజాయ్ చేస్తారు.",
    "[00:09] ఒక్క మాట చెప్పనా? భలే తృప్తిగా ఉంటుంది ఇది తిన్న రోజు భోజనం.",
    "[00:13] ఇది రైస్, చపాతీ, పూరీలు దేనిలోకైనా సరే చాలా చాలా బావుంటుంది.",
    "[00:18] చాలా ఎంజాయ్ చేస్తారు. లెట్స్ స్టార్ట్.",
    "[00:21] ముందుగా 500 గ్రాముల బాగా కడిగి శుభ్రం చేసుకున్నటువంటి చేప ముక్కలు తీసుకోండి.",
    "[00:26] ఇందులో సాల్ట్, పసుపు వేసి బాగా పట్టించండి.",
    "[00:31] ఆ తర్వాత 30 నిమిషాలు రెస్ట్ ఇవ్వండి.",
    "[00:36] ఇప్పుడు బౌల్ లో నీళ్లు మరిగించుకోండి.",
    "[00:40] నీళ్లు మరిగాక చేప ముక్కలు వేసి 15 నిమిషాలు మీడియం ఫ్లేమ్ (medium flame) మీద ఉడికించుకోండి.",
    "[00:46] మరీ ఎక్కువ సేపు ఉడికించుకుంటే చిదురైపోతాయి తినడానికి అంత బావుండదు అని గుర్తుంచుకోండి.",
    "[00:53] ఇప్పుడు ఉడికిన చేప ముక్కల్ని ఓ ప్లేట్ లోకి తీసుకొని...",
    "[00:56] చేప పైన ఉండేటువంటి స్కిన్ (skin) తీసేయండి.",
    "[00:58] అలాగే లోపలి ముళ్లు జాగ్రత్తగా టైమ్ తీసుకొని ఏరి పారేసేయండి.",
    "[01:04] అసలు ఇదంతా ఎందుకండీ, బోన్ లెస్ ఫిష్ (boneless fish) తెచ్చుకుంటే అయిపోదా అంటారా? హ్యాపీ ఆ పనే చేయండి.",
    "[01:09] ఈ కూరకి ముళ్లు తక్కువగా ఉండే చేపలు తీసుకుంటే పని సులభం అవుతుంది.",
    "[01:13] ముళ్లు తీసేసుకొని కాస్త పెద్ద పెద్ద పలుకులుగా ఉండేలా చిదుముకోండి. ఎలాగూ కలిపేటప్పుడు కాస్త చిదురవుతుంది.",
    "[01:19] దీనికి ఏ చేపైనా రుచిగానే ఉంటుంది.",
    "[01:23] చూడండి ఇలా ఉండాలి.",
    "[01:28] ఇప్పుడు అడుగు మందంగా ఉండేటువంటి కడాయిలో అర కప్పు నూనె పోసుకోండి.",
    "[01:31] దీనికి నూనె ఎక్కువ ఉంటేనే రుచి. తక్కువ వేస్తే నీచు వాసన వస్తుంది.",
    "[01:35] ఇప్పుడు ఇందులో అర టీస్పూన్ ఆవాలు వేసుకొని వేయించుకోండి.",
    "[01:39] ఇందులో రెండు రెబ్బల కరివేపాకు, ఓ పెద్ద ఉల్లిపాయ తరుగు వేసి రెండు మూడు నిమిషాల పాటు మగ్గించుకోండి.",
    "[01:48] ఆ తర్వాత అప్పుడే రుబ్బుకున్నటువంటి అల్లం వెల్లుల్లి ముద్ద ఓ టీస్పూన్ వేసుకోండి.",
    "[01:52] అప్పటికప్పుడు రుబ్బుకుంటేనే కూరకి మంచి రుచి.",
    "[01:57] ఇప్పుడు అర టీస్పూన్ పసుపు, కొద్దిగా సాల్ట్, మూడు పచ్చిమిర్చి తరుగు వేసి ఉల్లిపాయలు మగ్గేంత వరకు ఫ్రై చేసుకోండి చాలు.",
    "[02:07] ఆ తర్వాత ఫిష్ ముక్కలు వేసి నిదానంగా అడుగు నుండి కదుపుతూ కలుపుకోండి.",
    "[02:11] దీనికి అట్లకాడని వాడితేనే కూర చిదురవ్వదు.",
    "[02:15] ఎంత సేపైనా కానీ అడుగు నుండి కలుపుతూ కలుపుకోండి.",
    "[02:18] ఇప్పుడు మిరియాల పొడి వేసి అడుగు నుండి కలుపుకుంటూ ఫ్రై చేసుకోండి.",
    "[02:22] అలా అడుగు నుండి కలపండి, అలా కలిపి మూడు నిమిషాలు వదిలేయండి.",
    "[02:25] తర్వాత మళ్ళీ కలుపుకోండి.",
    "[02:27] ఇలా చేయడం వల్ల అడుగున్నటువంటి ముక్క వేగుతుంది కాస్త గట్టి పడుతుంది. అంత సాఫ్ట్ (soft) గా ఉండదు.",
    "[02:32] మామూలు కూరల మాదిరిగా ఈ కూరని మాత్రం కలపకండి. కలిపితే కూర రూపమే మారిపోతుంది.",
    "[02:38] దింపే ముందు అర టీస్పూన్ విస్మయ్ ఫుడ్ స్పెషల్ గరం మసాలా వేసుకోండి.",
    "[02:42] అడుగు నుండి కలుపుకుంటూ ఫ్రై చేసుకోండి.",
    "[02:45] వాస్తవానికి ఇలాంటి వేపుళ్లు పోత బాండీల్లో చేస్తేనే ఆ రుచి.",
    "[02:48] అడుగంటినా కూడా అది కూడా క్రిస్పీగా భలే ఉంటుంది తినేటప్పుడు.",
    "[02:52] ఆఖరున కొత్తిమీర తరుగు చల్లుకొని దింపేసుకోండి.",
    "[02:55] మీకు నచ్చితే ఇందులో కారం వేసుకోండి. కానీ యాక్చువల్ గా కారం అంతా మిర్చి నుంచే వస్తే బావుంటుంది రుచి.",
    "[02:59] నచ్చిందా? అయితే తప్పక ట్రై చేయండి, ఇన్స్టాగ్రామ్ లో ఆ పిక్ ని పోస్ట్ చేయండి.",
    "[03:03] బై ది వే (By the way) ఈ రెసిపీ చేసే ముందు ఓసారి డీటెయిల్డ్ (detailed) గా విస్మయ్ ఫుడ్ వెబ్సైట్ లో ఉంచుతాను రెసిపీని.",
    "[03:08] అది చదువుకొని చేయండి పర్ఫెక్ట్ గా వస్తుంది."
  ],
  "transcription_english": [
    "[00:00] Hello Foodies, Welcome to Vismai Food. Today's special is seafood special, my favorite Fish Burji (Scrambled Fish).",
    "[00:06] It tastes very, very good. Children will enjoy it happily.",
    "[00:09] Shall I tell you one thing? The meal on the day you eat this is very satisfying.",
    "[00:13] It tastes very, very good with rice, chapati, or poori.",
    "[00:18] You will enjoy it a lot. Let's start.",
    "[00:21] First, take 500 grams of well-washed and cleaned fish pieces.",
    "[00:26] Add salt and turmeric to this and rub well.",
    "[00:31] After that, give it a rest for 30 minutes.",
    "[00:36] Now boil water in a bowl.",
    "[00:40] Once the water boils, add the fish pieces and cook on medium flame for 15 minutes.",
    "[00:46] Remember that if you cook for too long, they will break apart and won't be good to eat.",
    "[00:53] Now take the cooked fish pieces onto a plate...",
    "[00:56] ...remove the skin on the fish.",
    "[00:58] Also, carefully take your time to pick out and discard the bones inside.",
    "[01:04] You might ask, \"Why all this trouble? Can't we just get boneless fish?\" Happily do that.",
    "[01:09] If you take fish with fewer bones for this curry, the work becomes easier.",
    "[01:13] After removing bones, mash it into slightly large chunks. Anyway, it will break apart a bit while mixing.",
    "[01:19] Any fish tastes good for this.",
    "[01:23] See, it should be like this.",
    "[01:28] Now pour half a cup of oil into a heavy-bottomed kadai.",
    "[01:31] This tastes good only if there is more oil. If you use less, it will smell fishy.",
    "[01:35] Now add half a teaspoon of mustard seeds and fry.",
    "[01:39] Add two sprigs of curry leaves and chopped big onion to this and sauté for two to three minutes.",
    "[01:48] After that, add a teaspoon of freshly ground ginger-garlic paste.",
    "[01:52] The curry tastes good only if ground fresh then and there.",
    "[01:57] Now add half a teaspoon turmeric, a little salt, and three chopped green chilies and fry until the onions become soft, that's enough.",
    "[02:07] After that, add the fish pieces and mix slowly moving from the bottom.",
    "[02:11] The curry won't break apart only if you use a flat ladle for this.",
    "[02:15] No matter how long, keep mixing from the bottom.",
    "[02:18] Now add pepper powder and fry while mixing from the bottom.",
    "[02:22] Mix from the bottom like that, and after mixing, leave it for three minutes.",
    "[02:25] Then mix again.",
    "[02:27] By doing this, the piece at the bottom gets fried and becomes slightly firm. It won't be that soft.",
    "[02:32] Do not mix this curry like regular curries. If you mix, the form of the curry changes.",
    "[02:38] Before taking it off, add half a teaspoon of Vismai Food special Garam Masala.",
    "[02:42] Fry while mixing from the bottom.",
    "[02:45] Actually, such fries taste best only if made in cast iron pans (pota bandilu).",
    "[02:48] Even if it burns at the bottom, that too tastes crispy and great while eating.",
    "[02:52] Finally, sprinkle chopped coriander and take it off.",
    "[02:55] If you like, add red chili powder to this. But actually, the taste is good if the spiciness comes entirely from green chilies/pepper.",
    "[02:59] Did you like it? Then definitely try it, post that pic on Instagram.",
    "[03:03] By the way, before making this recipe, I will keep the recipe detailed on the Vismai Food website.",
    "[03:08] Read that and make it, it will turn out perfect."
  ]
}
