{
  "metadata": {
    "title": "Spicy Egg Masala | గుడ్డు కారం పులుసు | మళ్ళీ మళ్ళీ తినలన్పిచే రాయలసీమ స్పెషల్ గుడ్డు పులుసు | Egg masala",
    "channel_name": "Vismai Food",
    "publish_date": "2018-10-19",
    "view_count": 7366605,
    "like_count": 66339,
    "duration": "02:31",
    "language": "Telugu",
    "video_id": "OQGWDonIKY4",
    "url": "https://www.youtube.com/watch?v=OQGWDonIKY4",
    "description": "Rayalaseema special Spicy Egg Masala Pulusu recipe by Vismai Food.",
    "ingredients_detected": [
      "4 Hard boiled eggs",
      "1/2 Cup Oil (for gravy)",
      "1 tsp Oil (for eggs)",
      "1/4 tsp Turmeric (for eggs)",
      "2 Sprigs Curry leaves",
      "4-5 Green chillies (slit)",
      "1 Large Onion (chopped)",
      "Salt (to taste)",
      "1/2 tsp Turmeric (for gravy)",
      "1 tsp Freshly ground ginger-garlic paste",
      "2 Large ripe Tomatoes (chopped)",
      "1/4 tsp Fenugreek (Methi) seeds",
      "1/4 Cup Tamarind juice",
      "1 tbsp Red chilli powder",
      "1 tbsp Coriander powder",
      "1/2 tsp Garam masala",
      "300ml Water",
      "Small piece of Jaggery (optional)",
      "1/2 Bunch Coriander leaves (with stems)"
    ]
  },
  "transcription_telugu": [
    "[00:00:00.000] హలో ఫుడీస్, వెల్కమ్ టు విస్మయ్ ఫుడ్. ఇవాల్టి స్పెషల్ రాయలసీమ స్పెషల్ మసాలా ఎగ్ పులుసు. దీన్నే గుడ్డు కారం పులుసు అని కూడా అంటారు.",
    "[00:00:23.000] ముందుగా ఒక టీస్పూన్ ఆయిల్ హీట్ చేసి అందులో పావు చెంచా పసుపు వేసి, నాలుగు ఉడికించిన గుడ్లను వేసి మీడియం ఫ్లేమ్ మీద వేయించండి. గుడ్డు బయట లేయర్ వేగాక పక్కన ఉంచుకోండి.",
    "[00:00:40.000] ఒక కడాయిలో అర కప్పు ఆయిల్ హీట్ చేసి రెండు రెబ్బల కరివేపాకు, నాలుగు పచ్చిమిర్చి చీలికలు, ఒక పెద్ద ఉల్లిపాయ తరుగు వేసి పచ్చి వాసన పోయేదాకా వేపుకోండి.",
    "[00:00:58.000] ఇందులో ఉప్పు, అర చెంచా పసుపు, ఒక టీస్పూన్ అల్లం వెల్లుల్లి పేస్ట్ వేసి పచ్చి వాసన పోయేదాకా వేయించండి.",
    "[00:01:07.000] ఇప్పుడు రెండు పెద్ద టమాటోల తరుగు వేసి నూనె పైకి తేలేంత వరకు మగ్గనివ్వండి. టమాటోలు మెత్తగా అయ్యాక మెదుపుకోండి.",
    "[00:01:19.000] పావు చెంచా మెంతులు, పావు కప్పు చింతపండు పులుసు పోసి నూనె పైకి తేలేదాకా ఉడికించాలి.",
    "[00:01:30.000] ఇందులో ఒక టేబుల్ స్పూన్ కారం, ఒక టేబుల్ స్పూన్ ధనియాల పొడి, అర చెంచా గరం మసాలా వేసి పచ్చి వాసన పోయేదాకా ఫ్రై చేయండి.",
    "[00:01:45.000] 300ml నీళ్లు పోసి బాగా కలుపుకుని నూనె పైకి తేలనివ్వండి.",
    "[00:01:54.000] ఇప్పుడు చిన్న బెల్లం గడ్డ (ఆప్షనల్), వేయించి పెట్టుకున్న గుడ్లు, అర కట్ట కొత్తిమీర తరుగు వేసి కలపండి.",
    "[00:02:11.000] సిమ్ లో నాలుగైదు నిమిషాలు ఉడికించుకుంటే ఎంతో రుచికరమైన గుడ్డు పులుసు రెడీ.",
    "[00:02:16.000] చిత్తూరు ప్రాంతంలో దీని రుచి చాలా బాగుంటుంది. మీరు కూడా తప్పకుండా ట్రై చేయండి."
  ],
  "transcription_english": [
    "[00:00:00.000] Hello Foodies, welcome to Vismai Food. Today's special is Rayalaseema special Egg Masala Pulusu, also known as Guddu Karam Pulusu.",
    "[00:00:23.000] Heat 1 tsp oil, add 1/4 tsp turmeric, and fry 4 boiled eggs on medium flame until the outer layer is crisp; set aside.",
    "[00:00:40.000] Heat 1/2 cup oil in a pan, add 2 sprigs of curry leaves, 4-5 green chillies, and one large chopped onion; sauté until the raw smell disappears.",
    "[00:00:58.000] Add salt, 1/2 tsp turmeric, and 1 tsp ginger-garlic paste; sauté until the raw smell is gone.",
    "[00:01:07.000] Add 2 large chopped tomatoes and cook until oil separates. Mash the tomatoes once soft.",
    "[00:01:19.000] Add 1/4 tsp fenugreek seeds and 1/4 cup tamarind juice; cook until oil floats to the top.",
    "[00:01:30.000] Add 1 tbsp red chilli powder, 1 tbsp coriander powder, and 1/2 tsp garam masala; fry until the raw smell goes away.",
    "[00:01:45.000] Pour 300ml water, mix well, and let the oil float.",
    "[00:01:54.000] Add a small piece of jaggery (optional), the fried eggs, and 1/2 bunch chopped coriander.",
    "[00:02:11.000] Simmer on low flame for 4-5 minutes. The delicious Egg Pulusu is ready.",
    "[00:02:16.000] This is a Chittoor specialty. Do try this at home and share your experience."
  ]
}