{
  "metadata": {
    "title": "Mango Pepper Rasam | పచ్చిమామిడికాయతో ఇలా మిరియాల చారు పెడితే చాలా రుచిగా ఉంటుంది!!",
    "channel_name": "Vismai Food",
    "publish_date": "2019-05-10",
    "view_count": 366000,
    "like_count": 5000,
    "duration": "02:47",
    "language": "Telugu",
    "video_id": "wO5o2cE0g68",
    "url": "https://www.youtube.com/watch?v=wO5o2cE0g68",
    "description": "This is Andhra Style Mango Pepper Rasam, rich in pepper flavour and tastes superb!! Please try this and share your experience with us.",
    "ingredients_detected": [
      "Toor Dal",
      "Water",
      "Sour Raw Mango",
      "Fenugreek seeds",
      "Black pepper",
      "Coriander seeds",
      "Dry Red Chillies",
      "Oil",
      "Cumin seeds",
      "Garlic Pods",
      "Asafoetida",
      "Green Chillies",
      "Curry Leaves",
      "Turmeric",
      "Salt",
      "Coriander leaves"
    ]
  },
  "transcription_telugu": [
    "[00:00] Hello Foodies, Welcome to Vismai Food. ఇవాల్టి స్పెషల్ సమ్మర్ స్పెషల్ మామిడికాయ మిరియాల చారు.",
    "[00:05] పుల్ల పుల్లగా కారం కారంగా భలే బాగుంటుంది.",
    "[00:08] అన్నం అంతా ఈ చారుతోనే ఊడ్చి పడేస్తారంటే ఆశ్చర్యం కాదు అంత బాగుంటుంది ఈ చారు.",
    "[00:14] చింతపండు వేసి చారు పెట్టిన దానికి మామిడికాయతో పెట్టిన చారుకి ఎక్కడా పోలిక ఉండదు రుచిలో అంత బాగుంటుంది ఈ చారు.",
    "[00:20] కచ్చితంగా ట్రై చెయ్యాల్సిన రెసిపీ. లెట్స్ స్టార్ట్.",
    "[00:22] ముందుగా కుక్కర్ లో అరకప్పు, అరగంట సేపు నానబెట్టుకున్నటువంటి కందిపప్పు వేసుకోండి.",
    "[00:27] ఇలా నానబెడితే పప్పు మెత్తగా ఉడకడంతో పాటు పప్పులోని టాక్సిన్స్ అన్ని రిలీజ్ అవుతాయి.",
    "[00:30] ఇందులో ఒకటింపావు కప్పు నీళ్లు పోసుకొని మీడియం ఫ్లేమ్ మీద నాలుగు విజిల్స్ వచ్చేంతవరకు మెత్తగా కుక్ చేసుకోండి.",
    "[00:38] ఇప్పుడు ఓ పుల్లటి పచ్చి మామిడికాయని గాట్లు పెట్టి కాయ సగం మునిగేంతవరకు నీళ్లు పోసి...",
    "[00:43] మీడియం ఫ్లేమ్ మీద కాయని మెత్తగా మగ్గించుకోండి.",
    "[00:49] మెత్తగా ఉడికాక గుజ్జు తీసి పక్కన ఉంచుకోండి.",
    "[00:54] ఇప్పుడు మెత్తగా ఉడికిన పప్పుని ఎనుపుకొని పక్కన ఉంచుకోండి.",
    "[00:57] ఇప్పుడు మరో పాన్ లో ముప్పావు చెంచా మెంతులు, ఓ టేబుల్ స్పూన్ మిరియాలు...",
    "[01:02] రెండు టేబుల్ స్పూన్ల ధనియాలు వేసి లో ఫ్లేమ్ మీద మాత్రమే మంచి సువాసన వచ్చేంతవరకు రోస్ట్ చేసుకోవాలి.",
    "[01:09] సగం పైన రోస్ట్ అయ్యాక మూడు ఎండు మిర్చి వేసి రెండు మూడు నిమిషాలు వేపుకొని దింపేసుకొని చల్లార్చుకొని పొడిగా చేసుకోండి.",
    "[01:19] ఇప్పుడు రెండు టేబుల్ స్పూన్ల ఆయిల్ హీట్ చేసుకొని అందులో ఓ టీస్పూన్ జీలకర్ర, రెండు ఎండు మిర్చి తరుగు...",
    "[01:25] ఆరేడు వెల్లుల్లి వేసి రెండు నిమిషాలు వేపుకోండి.",
    "[01:30] ఇప్పుడు పావు చెంచా ఇంగువ, మూడు చీరిన పచ్చిమిర్చి, రెండు రెమ్మల కరివేపాకు వేసి ఫ్రై చేసుకోండి.",
    "[01:40] ఇప్పుడు మెత్తగా ఉడికించుకున్నటువంటి మామిడికాయ గుజ్జులో పావు లీటర్ నీళ్లు పోసి కలుపుకొని తాలింపులో పోసుకొని...",
    "[01:47] మెత్తగా ఎనుపుకున్నటువంటి పప్పు కూడా వేసి బాగా కలుపుకోండి.",
    "[01:54] ఇప్పుడు పావు చెంచా పసుపు, సాల్ట్ వేసి కలుపుకొని...",
    "[02:00] పావు లీటర్ నీళ్లు పోసి కలుపుకొని నిదానంగా పది నిమిషాల పాటు ఉడకనివ్వండి.",
    "[02:09] ఆ తర్వాత గ్రైండ్ చేసుకున్నటువంటి మిరియాల మెంతుల పౌడర్ రెండు టీస్పూన్లు వేసి కలుపుకొని రెండు మూడు నిమిషాల పాటు మరగనివ్వండి.",
    "[02:21] దింపే ముందు రెండు టేబుల్ స్పూన్లు కాడలతో సహా కొత్తిమీర తరుగు వేసుకొని దింపేసుకోండి.",
    "[02:27] అంతే! ది బెస్ట్ మామిడికాయ మిరియాల చారు రెడీ.",
    "[02:32] మీరు ఒక్కసారి ఈ చారు తిన్నారంటే మళ్ళీ వదిలిపెట్టరు అంత బాగుంటుంది పుల్ల పుల్లగా కారం కారంగా.",
    "[02:39] మీకు నచ్చిందా? మరైతే మీరు ట్రై చేసి మీకు ఎలా కుదిరిందో కచ్చితంగా ఆ పిక్ ని విస్మై ఫుడ్ ఇన్స్టాగ్రామ్ లో పోస్ట్ చెయ్యండి.",
    "[02:44] ఇంకా మరిన్ని రెసిపీస్ కోసం vismaifood.com విజిట్ చెయ్యడం మర్చిపోకండి."
  ],
  "transcription_english": [
    "[00:00] Hello Foodies, Welcome to Vismai Food. Today's special is Summer special Mango Pepper Rasam.",
    "[00:05] It tastes deliciously tangy and spicy.",
    "[00:08] It's no surprise if you finish your entire meal just with this rasam, it's that good.",
    "[00:14] The rasam made with tamarind cannot even be compared to this mango rasam, the taste is that unique and superior.",
    "[00:20] Definitely a must-try recipe. Let's start.",
    "[00:22] First, add half a cup of toor dal, soaked for half an hour, into a cooker.",
    "[00:27] Soaking helps the dal cook softly and releases any toxins present in it.",
    "[00:30] Add 1.25 cups of water and pressure cook on medium flame for 4 whistles until soft.",
    "[00:38] Now, take a sour raw mango, make slits in it, add enough water to submerge it halfway...",
    "[00:43] Cover and cook on medium flame until the mango becomes mushy.",
    "[00:49] Once cooked soft, extract the pulp and keep it aside.",
    "[00:54] Now mash the cooked dal into a smooth paste and keep aside.",
    "[00:57] In another pan, add 3/4 teaspoon fenugreek seeds, 1 tablespoon black pepper...",
    "[01:02] Add 2 tablespoons coriander seeds and dry roast them only on low flame until aromatic.",
    "[01:09] Once half roasted, add 3 dry red chilies, fry for 2-3 minutes, remove from heat, cool, and grind into a fine powder.",
    "[01:19] Now heat 2 tablespoons of oil, add 1 teaspoon cumin seeds, pieces of 2 dry red chilies...",
    "[01:25] Add 6-7 garlic pods and fry for two minutes.",
    "[01:30] Now add 1/4 teaspoon asafoetida, 3 slit green chilies, and 2 sprigs of curry leaves and fry.",
    "[01:40] Mix 250ml water into the mango pulp extracted earlier, pour it into the tempering...",
    "[01:47] Add the mashed dal and mix well.",
    "[01:54] Now add 1/4 teaspoon turmeric and salt, mix well...",
    "[02:00] Add another 250ml of water, mix, and let it boil slowly for 10 minutes.",
    "[02:09] After that, add 2 teaspoons of the ground pepper-fenugreek powder, mix, and let it boil for another 2-3 minutes.",
    "[02:21] Before turning off the heat, add 2 tablespoons of chopped coriander leaves along with the stalks and remove from heat.",
    "[02:27] That's it! The best Mango Pepper Rasam is ready.",
    "[02:32] Once you taste this rasam, you won't leave it alone; it's that good, tangy and spicy.",
    "[02:39] Did you like it? Then do try it and definitely post the picture on Vismai Food Instagram sharing how it turned out for you.",
    "[02:44] Don't forget to visit vismaifood.com for more recipes."
  ]
}