{
  "metadata": {
    "title": "4 Types of Healthy Pongal Recipes | Rice, Oats, Korra & Rava Pongal | Vismai Food",
    "channel_name": "Vismai Food",
    "publish_date": "2019-05-11",
    "view_count": 1200000,
    "like_count": 30000,
    "duration": "08:47",
    "language": "Telugu",
    "video_id": "Mv_uJ3x8tqk",
    "url": "https://www.youtube.com/watch?v=Mv_uJ3x8tqk",
    "description": "Learn how to make 4 different types of healthy and delicious Pongal recipes: Classic Rice Pongal (Katte Pongali), Oats Pongal, Korra (Foxtail Millet) Pongal, and Rava (Upma) Pongal. These recipes are perfect for a nutritious breakfast.",
    "ingredients_detected": [
      "Rice (Dosa Rice/Control Rice)",
      "Moong Dal (Pesara Pappu)",
      "Water",
      "Salt",
      "Ghee",
      "Green Chillies",
      "Ginger",
      "Curry Leaves",
      "Cashew Nuts",
      "Cumin Seeds",
      "Pepper Corns",
      "Asafoetida (Inguva)",
      "Oats",
      "Foxtail Millet (Korralu)",
      "Bombay Rava (Semolina)",
      "Chana Dal",
      "Urad Dal",
      "Mustard Seeds"
    ]
  },
  "transcription_telugu": [
    "[00:00] హలో ఫుడీస్ వెల్కమ్ టు విస్మై ఫుడ్. ఈరోజు స్పెషల్ పొంగల్.",
    "[00:05] ఇది నేను మీకు ది బెస్ట్ వే లో చూపించబోతున్నాను. మీరు రెగ్యులర్ గా చేసుకునే పొంగల్ కంటే ఇది ఎన్నో రెట్లు బాగుంటుంది.",
    "[00:10] కొలతల్లో చిన్న మార్పు చేస్తే చాలు, రుచిలో ఎంత తేడా వస్తుందో మీకే తెలుస్తుంది. దీనికి ఓ కిటుకు ఉంది. ఇంకెందుకు ఆలస్యం లెట్స్ స్టార్ట్.",
    "[00:19] ముందుగా ఓ కప్పు అంటే 110 గ్రాముల రైస్ తీసుకోండి. దీనికి సోనా మసూరి రైస్ కంటే కూడా దోశ రైస్ అంటారు కొందరు కంట్రోల్ బియ్యం అంటారు కొందరు, అలాంటి రైస్ ఏ చాలా చాలా బాగుంటుంది.",
    "[00:30] సోనా రైస్ తో పర్ఫెక్ట్ రుచి రానే రాదు. మేము ఇక్కడ కంట్రోల్ బియ్యం వాడుతున్నాం.",
    "[00:40] ఈ కంట్రోల్ బియ్యాన్ని బాగా కడిగి 30 నిమిషాలు నానబెట్టండి.",
    "[00:45] ఇప్పుడు ఓ కప్పు పెసరపప్పు అంటే 110 గ్రాముల్ని తీసుకొని లో ఫ్లేమ్ లో మంచి సువాసన వచ్చేంత వరకు వేపుకోండి.",
    "[00:56] ఇప్పుడు నాలుగు కప్పుల నీళ్లు బాయిల్ చేసుకొని, అందులో సాల్ట్, నానబెట్టుకున్నటువంటి బియ్యం, వేయించుకున్న పెసరపప్పు వేసి మీడియం ఫ్లేమ్ మీద ఉడికించుకోండి.",
    "[01:21] మీకు క్లియర్ కదా? కప్పు బియ్యానికి కప్పు పెసరపప్పు, దీనికి డబల్ నీళ్లు అంటే మొత్తం నాలుగు కప్పుల నీళ్లు పోసాం.",
    "[01:29] పొంగల్ బాగా దగ్గర పడ్డాక సిమ్ లో పెట్టి కడాయిలో నెయ్యి వేయండి. ఇది ఎంత అంటే ఎంతేసినా బాగుంటుంది. నేనైతే ఇక్కడ అర కప్పు వాడుతున్నాను.",
    "[01:40] అందులో మూడు పచ్చిమిర్చి చీలికలు, ఓ టేబుల్ స్పూన్ అల్లం తరుగు, రెండు రెబ్బల కరివేపాకు, మూడు టేబుల్ స్పూన్ల జీడిపప్పు వేసి ఎర్రగా వేపుకోండి.",
    "[01:55] ఇప్పుడు ఓ టేబుల్ స్పూన్ జీలకర్ర, ఓ టేబుల్ స్పూన్ మిరియాలు, రెండు చిటికెళ్ళ ఇంగువ వేసి మంచి సువాసన వచ్చేంత వరకు వేపుకోండి.",
    "[02:06] సిమ్ లో ఉడికించుకుంటున్నటువంటి పొంగల్ లో వేసి బాగా కలిపి స్టవ్ ఆఫ్ చేసి 15 నిమిషాలు దింపేసుకొని పక్కన ఉంచండి.",
    "[02:18] ఇది ఇప్పుడు కాస్త జారుగా ఉన్నా కాసేపటికి గట్టిపడిపోతుంది.",
    "[02:27] మీరు ఈ పొంగల్ మధ్యాహ్నం తిన్నా కూడా పలుకు అస్సలు అవ్వదు ముద్దగానే ఉంటుంది. చాలా చాలా బాగుంటుంది.",
    "[02:37] హలో ఫుడీస్ వెల్కమ్ టు విస్మై ఫుడ్. ఇవాల్టి ఎనర్జీ ప్యాక్డ్ బ్రేక్ ఫాస్ట్ ఓట్స్ పొంగల్. చాలా బాగుంటుంది దీని టేస్ట్, చేయడం కూడా తేలికే.",
    "[02:52] ముందుగా పాన్ లో అర కప్పు పెసరపప్పు వేసి లో ఫ్లేమ్ మీద మాత్రమే అడుగు మందంగా ఉన్నటువంటి గిన్నెలో మంచి సువాసన వచ్చేంత వరకు రోస్ట్ చేసుకోండి.",
    "[03:03] తర్వాత కడిగి మెత్తగా కుక్కర్ లో మూడు విజిల్స్ వచ్చేంత వరకు కుక్ చేసుకొని పక్కన ఉంచుకోండి.",
    "[03:09] ఇప్పుడు అదే కడాయిలో ఓ కప్పు ఓట్స్ వేసి లో ఫ్లేమ్ మీద లైట్ గోల్డెన్ బ్రౌన్ కలర్ వచ్చేంత వరకు కలుపుతూ రోస్ట్ చేసుకోండి.",
    "[03:19] ఇప్పుడు పాన్ లో మూడున్నర కప్పుల నీళ్లు పోసుకొని మరగనివ్వండి. నీళ్లు మరుగుతున్నప్పుడు రోస్టెడ్ ఓట్స్ వేసి కుక్ చేసుకోండి.",
    "[03:30] ఇప్పుడు సాల్ట్ వేసి ఓట్స్ ని కంప్లీట్ గా కుక్ చేసుకోండి.",
    "[03:37] ఆ స్టేజిలో మెత్తగా ఉడికించుకొని గ్రైండ్ చేసుకొని ఎనుపుకున్నటువంటి పెసరపప్పు పేస్ట్ వేసి బాగా కలుపుకోండి.",
    "[03:53] ఇప్పుడు మరో పాన్ లో పావు కప్పు నెయ్యి వేడి చేసుకొని, అందులో 10 నుంచి 12 జీడిపప్పు, పావు చెంచా ఇంగువ వేసి ఫ్రై చేసుకోండి.",
    "[04:02] ఇప్పుడు అర టీస్పూన్ జీలకర్ర, చిన్న అల్లం తరుగు, అర టీస్పూన్ మిరియాలు, రెండు పచ్చిమిర్చి చీలికలు వేసి ఓ నిమిషం పాటు ఫ్రై చేసుకోండి.",
    "[04:10] ఆ తర్వాత రెండు రెబ్బల కరివేపాకు వేసుకొని ఫ్రై చేసుకొని పొంగల్ లో కలుపుకోండి.",
    "[04:18] ఈ ఓట్స్ పొంగల్ వండుకునేటప్పుడు కాస్త జారుగానే వండుకోండి, చల్లారే కొద్దీ గట్టిపడిపోతుంది.",
    "[04:33] హే ఫుడీస్ వెల్కమ్ టు విస్మై ఫుడ్. ఇవాల్టి స్పెషల్ హెల్తీ రెసిపీ కొర్ర పొంగలి. ఇది మామూలు రైస్ తో చేసేటువంటి పొంగల్ కంటే కూడా చాలా బాగుంటుంది.",
    "[04:56] ముందుగా కడాయిలో ఓ కప్పు పెసరపప్పు వేసి లో ఫ్లేమ్ మీద మంచి రంగు వచ్చేంత వరకు వేపుకోండి. ఎర్రగా వేగాక అప్పుడు నీళ్ళలో వేసుకొని బాగా కడుక్కొని ప్రెషర్ కుక్కర్ లో వేసుకోండి.",
    "[05:13] ఇప్పుడు రాత్రంతా నానబెట్టినటువంటి కొర్రలు కప్పు. కప్పుకి కప్పు అనమాట.",
    "[05:23] దీనికి సరిపడా ఉప్పు, ఒకటి కి నాలుగు నీళ్లు పోసి మీడియం ఫ్లేమ్ మీద మాత్రమే నాలుగైదు విజిల్స్ రానివ్వండి.",
    "[05:52] ఇప్పుడు నెయ్యి. నెయ్యి ఎంత వేసినా బాగుంటుంది, నేను మూడు టేబుల్ స్పూన్ల నెయ్యి వేస్తున్నాను.",
    "[05:57] ఇందులో ఒక టేబుల్ స్పూన్ జీలకర్ర, ఓ టీస్పూన్ మిరియాలు, ఓ పిడికెడు జీడిపప్పు వేసి ఎర్రగా వేపుకోండి.",
    "[06:09] అప్పుడు మూడు పచ్చిమిర్చి చీలికలు, ఒక ఇంచ్ సన్నని అల్లం తరుగు, రెండు రెబ్బల కరివేపాకు, రెండు చిటికెళ్ళ ఇంగువ వేసి ఎర్రగా వేపుకొని పొంగల్ లో వేసి కలుపుకోండి.",
    "[06:21] అంతే! మీకు ది బెస్ట్ పొంగలి రుచి వస్తుంది.",
    "[06:38] హే ఫుడీస్ వెల్కమ్ టు విస్మై ఫుడ్. ఇవాల్టి స్పెషల్ ఉప్మా పొంగల్ లేదా రవ్వ పొంగల్.",
    "[06:59] కడాయిలో ముందుగా రెండు టేబుల్ స్పూన్ల నెయ్యిని వేడి చేసుకొని ఓ కప్పు బొంబాయి రవ్వ వేసి లో ఫ్లేమ్ మీద మంచి అరోమా వచ్చేంత వరకు వేపుకోండి.",
    "[07:12] ఇప్పుడు అదే కడాయిలో మరో రెండు టేబుల్ స్పూన్ల నెయ్యి వేడి చేసుకొని అర కప్పు పెసరపప్పు వేసి లో ఫ్లేమ్ మీద దోరగా వేపుకోండి.",
    "[07:28] ఐదు కప్పుల వేడి వేడి నీళ్లు పోసుకొని బాగా కలుపుకొని, మూత పెట్టి పెసరపప్పుని మెత్తగా ఉడికించుకోండి.",
    "[07:44] పెసరపప్పు మెత్తగా ఉడికాక రుచికి సరిపడా ఉప్పు వేసుకొని, వేయించుకున్న బొంబాయి రవ్వ వేసుకొని బాగా కలుపుకోండి ఉండలు లేకుండా.",
    "[07:53] బాగా కలుపుకొని మూత పెట్టి సిమ్ లో మూడు నాలుగు నిమిషాలు ఉడికించుకోండి.",
    "[07:56] ఇప్పుడు కడాయిలో ఐదారు చెంచాల నెయ్యి వేసుకొని ఓ టీస్పూన్ శనగపప్పు, ఓ టీస్పూన్ మినప్పప్పు, అర టీస్పూన్ ఆవాలు, ఒక టీస్పూన్ జీలకర్ర వేసి వేయించుకోండి.",
    "[08:12] ఇవి కాస్త వేగాక ఓ టీస్పూన్ మిరియాలు, రెండు పచ్చిమిర్చి తరుగు, 10 నుంచి 15 జీడిపప్పు పలుకులు, రెండు రెబ్బల కరివేపాకు వేసుకోండి.",
    "[08:27] ఇప్పుడు ఈ తాలింపును ఉప్మాలో వేసి కలిపేసుకొని దింపేసుకోవటమే."
  ],
  "transcription_english": [
    "[00:00] Hello Foodies, Welcome to Vismai Food. Today's special is Pongal.",
    "[00:05] I am going to show you this in the best way. It tastes many times better than the regular Pongal you make.",
    "[00:10] Just a small change in measurements is enough, you will know how much difference it makes in taste. There is a trick to this. Why delay? Let's start.",
    "[00:19] First, take one cup, that is 110 grams of rice. For this, instead of Sona Masoori rice, some call it Dosa rice or Control rice, that kind of rice is very very good.",
    "[00:30] You won't get the perfect taste with Sona rice. We are using Control rice here.",
    "[00:40] Wash this Control rice well and soak it for 30 minutes.",
    "[00:45] Now take one cup of Moong Dal (Green Gram), that is 110 grams, and roast it on low flame until it gives a nice aroma.",
    "[00:56] Now boil four cups of water, add salt, soaked rice, and roasted Moong Dal, and cook on medium flame.",
    "[01:21] Is it clear? For a cup of rice, a cup of Moong Dal, and double the water for this, meaning we added four cups of water in total.",
    "[01:29] Once the Pongal thickens well, put it on simmer, and add ghee to a kadai. You can add as much as you like, it tastes good. I am using half a cup here.",
    "[01:40] Add three slit green chilies, one tablespoon chopped ginger, two sprigs of curry leaves, and three tablespoons of cashew nuts and fry until red.",
    "[01:55] Now add one tablespoon cumin seeds, one tablespoon pepper corns, two pinches of asafoetida and fry until aromatic.",
    "[02:06] Add this to the simmering Pongal, mix well, switch off the stove, remove from heat and keep aside for 15 minutes.",
    "[02:18] Even if it looks a bit loose now, it will thicken after a while.",
    "[02:27] Even if you eat this Pongal in the afternoon, the grains won't separate, it stays mushy. It tastes very very good.",
    "[02:37] Hello Foodies, Welcome to Vismai Food. Today's energy-packed breakfast is Oats Pongal. It tastes very good and is easy to make.",
    "[02:52] First, add half a cup of Moong Dal in a pan and roast it only on low flame in a thick-bottomed vessel until it emits a nice aroma.",
    "[03:03] Then wash it and pressure cook softly for three whistles and keep aside.",
    "[03:09] Now in the same kadai, add one cup of oats and roast on low flame stirring continuously until light golden brown.",
    "[03:19] Now pour three and a half cups of water in a pan and let it boil. When water is boiling, add roasted oats and cook.",
    "[03:30] Now add salt and cook the oats completely.",
    "[03:37] At that stage, add the cooked, mashed Moong Dal paste and mix well.",
    "[03:53] Now heat a quarter cup of ghee in another pan, add 10 to 12 cashew nuts, a quarter spoon of asafoetida and fry.",
    "[04:02] Now add half a teaspoon cumin seeds, small piece of chopped ginger, half a teaspoon pepper, two slit green chilies and fry for a minute.",
    "[04:10] Then add two sprigs of curry leaves, fry, and mix it into the Pongal.",
    "[04:18] When cooking this Oats Pongal, keep it a bit loose, as it thickens upon cooling.",
    "[04:33] Hey Foodies, Welcome to Vismai Food. Today's special healthy recipe is Korra Pongali (Foxtail Millet Pongal). This tastes much better than the regular rice Pongal.",
    "[04:56] First, add a cup of Moong Dal in a kadai and roast on low flame until it gets a nice color. Once roasted red, wash it well in water and put it in a pressure cooker.",
    "[05:13] Now, one cup of Foxtail millets soaked overnight. One cup for one cup.",
    "[05:23] Add sufficient salt, four cups of water (1:4 ratio), and pressure cook on medium flame for four to five whistles.",
    "[05:52] Now Ghee. No matter how much you add, it tastes good. I am adding three tablespoons of ghee.",
    "[05:57] Add one tablespoon cumin seeds, one teaspoon pepper, a fistful of cashew nuts and fry until red.",
    "[06:09] Then add three slit green chilies, one inch finely chopped ginger, two sprigs of curry leaves, two pinches of asafoetida, fry until red and mix into the Pongal.",
    "[06:21] That's it! You get the best Pongal taste.",
    "[06:38] Hey Foodies, Welcome to Vismai Food. Today's special is Upma Pongal or Rava Pongal.",
    "[06:59] First heat two tablespoons of ghee in a kadai, add one cup of Bombay Rava and roast on low flame until a nice aroma comes.",
    "[07:12] Now heat another two tablespoons of ghee in the same kadai, add half a cup of Moong Dal and roast until golden on low flame.",
    "[07:28] Pour five cups of hot water, mix well, cover and cook the Moong Dal until soft.",
    "[07:44] Once the Moong Dal is soft, add salt to taste, add the roasted Bombay Rava and mix well without lumps.",
    "[07:53] Mix well, cover and cook on sim for three to four minutes.",
    "[07:56] Now add five or six spoons of ghee in a kadai, add one teaspoon chana dal, one teaspoon urad dal, half teaspoon mustard seeds, one teaspoon cumin seeds and roast.",
    "[08:12] Once they are fried a bit, add one teaspoon pepper, two chopped green chilies, 10 to 15 cashew nuts, two sprigs of curry leaves.",
    "[08:27] Now add this tempering to the Upma, mix it, and serve."
  ]
}