{
  "metadata": {
    "title": "Kaddu Ki Kheer | Hyderabad's Special Recipe | కద్దూ కీ ఖీర్ | ముస్లిమ్స్ పెళ్ళిళ్ళ స్పెషల్",
    "channel_name": "Vismai Food",
    "publish_date": "2019-05-14",
    "view_count": 1400000,
    "like_count": 17000,
    "duration": "03:04",
    "language": "Telugu",
    "video_id": "jD3Z9x8y7wA",
    "url": "https://www.youtube.com/watch?v=jD3Z9x8y7wA",
    "description": "Hyderabad Special Kaddu Ki Kheer recipe. A rich and delicious dessert made with bottle gourd, milk, and dry fruits. Perfect for Ramadan and special occasions.",
    "ingredients_detected": [
      "Grated Bottle Gourd",
      "Water",
      "Thick Milk",
      "Unsweetened Khoya",
      "Sabudana",
      "Cashew Paste",
      "Sugar",
      "Cardamom Powder",
      "Soaked Almonds",
      "Pistachios"
    ]
  },
  "transcription_telugu": [
    "[00:00] Hello Foodies, Welcome to Vismai Food. ఇవాల్టి స్పెషల్ హైదరాబాద్ స్పెషల్ కద్దూ కీ ఖీర్.",
    "[00:05] సబ్స్క్రైబర్స్ ఎందరో ఈ రెసిపీని అడుగుతూనే ఉన్నారు రోజు కామెంట్స్ లో.",
    "[00:08] వాళ్ళే కాదు ఈ రెసిపీ తిన్నాక మీ చేత్తో మిమ్మల్ని మళ్ళీ మళ్ళీ చేయమని అడుగుతూనే ఉంటారు అంత బాగుంటుంది ఈ రెసిపీ.",
    "[00:14] ఇది రంజాన్ మాసంలో ఇంకా స్పెషల్ హైదరాబాద్ లో. ఎందుకంటే రిచ్ ఇన్ టెక్స్చర్, గ్రేట్ ఇన్ టేస్ట్. ఒకటా? తిన్న కొద్దీ తినాలనిపిస్తుంది అంత బాగుంటుంది ఈ ఖీర్. లెట్స్ స్టార్ట్.",
    "[00:25] ముందుగా ఓ పాన్ లో గింజలు తీసేసినటువంటి లేత సొరకాయ తురుము 500 గ్రాములు తీసుకోండి. దీన్ని రెండు నిమిషాలు వేపుకోండి.",
    "[00:33] ఆ తర్వాత అరకప్పు నీళ్ళు పోసి మీడియం ఫ్లేమ్ మీద నీళ్ళు ఇగిరిపోయి సొరకాయ మెత్తగా ఉడికిపోవాలి. అందాకా కుక్ చేసుకోండి.",
    "[00:43] ఆ తర్వాత తీసి పక్కన ఉంచుకోండి.",
    "[00:48] ఇప్పుడు కచ్చితంగా అడుగు మందంగా ఉన్నటువంటి బౌల్ లో మాత్రమే ఓ లీటర్ చిక్కటి పాలు పోసి మరిగించుకోండి.",
    "[00:54] రెండు పొంగులు రాగానే అరకప్పు వేడి పాలని ఓ కప్పులోకి తీసుకోని...",
    "[01:02] 100 గ్రాముల పచ్చి కోవా వేసి ఎక్కడా గడ్డలు లేకుండా కోవాని కరిగించుకోండి.",
    "[01:07] ఈ కోవా పచ్చిది అంటే పంచదార లేనిది అని గుర్తుంచుకోండి.",
    "[01:17] ఇప్పుడు 30 నిమిషాలు నానబెట్టుకున్నటువంటి అరకప్పు సగ్గుబియ్యం వేసి సగ్గుబియ్యాన్ని మెత్తగా ఉడికించుకోవాలి.",
    "[01:23] దీనికి కనీసం 15 నుంచి 20 నిమిషాల టైం పడుతుంది.",
    "[01:27] పాలని అడుగు నుండి ప్రతి 30 సెకన్లకు ఒకసారి కలుపుతూ అంచుల వెంట మీగడని తీస్తూ పాలల్లో వేస్తూ ఉండాలి అప్పుడే రుచి.",
    "[01:35] సగ్గుబియ్యం ఉడకడానికి ఇంకాస్త పలుకుంది అనుకున్నప్పుడు...",
    "[01:39] కోవా పాలు, 50 గ్రాముల జీడిపప్పు పేస్ట్ వేసి లో ఫ్లేమ్ మీద బాగా కలుపుకోవాలి.",
    "[01:44] లేదంటే త్వరగా అడుగంటేస్తుంది రుచంతా పాడైపోతుంది.",
    "[01:48] రెండు మూడు నిమిషాల పాటు పాలను మరిగించి ఓ పొంగు రానివ్వండి.",
    "[01:52] ఆ తర్వాత ఉడికించుకున్నటువంటి సొరకాయ తురుము వేసి బాగా కలుపుకొని...",
    "[01:56] కేవలం లో ఫ్లేమ్ మీద మాత్రమే 15 నిమిషాల పాటు నిదానంగా మరిగించుకోండి.",
    "[02:01] ప్రతి 30 సెకన్లకు ఒకసారి కలుపుతూ ఉండాలి అంచుల వెంట మీగడని తీస్తూ పాలల్లో వేస్తూ ఉండాలని మాత్రం గుర్తుంచుకోండి.",
    "[02:08] పాలు ఆల్మోస్ట్ ఆల్ చిక్కబడ్డాయి అనుకున్నప్పుడు పావు కిలో పంచదార పోసి పంచదార కరిగి చిక్కబడేంత వరకు ఉడికించుకోండి.",
    "[02:21] దింపే ముందు ఓ టీస్పూన్ యాలకుల పొడి వేసి బాగా కలుపుకోండి.",
    "[02:25] పాలు చిక్కబడుతున్న కొద్దీ అంచుల వెంట కోవా ఏర్పడుతుంది. దాన్ని తీసేస్తూ పాలల్లో వేస్తూ ఉండండి.",
    "[02:31] యాలకుల పొడి వేసాక మరో ఐదు నిమిషాలు లో ఫ్లేమ్ మీద చిక్కబడనిచ్చి దింపేసుకోండి.",
    "[02:35] ఆ తర్వాత ఓ బౌల్ లో తీసుకొని ఖీర్ పైన నానబెట్టుకున్నటువంటి బాదం పలుకులు, పిస్తా పలుకులు వేసుకోండి.",
    "[02:41] ఇది వేడిగా చల్లగా ఎలా తిన్నా పండగే ఆ రోజు.",
    "[02:45] ఒకటి రెండు మూడు కప్పులు లాగించాల్సిందే అంత బాగుంటుంది ఈ ఖీర్.",
    "[02:50] ఈ రెసిపీ గురించి మరింత ఇన్ఫర్మేషన్ కోసం vismaifood.com వెబ్సైట్ విజిట్ చేయండి.",
    "[02:54] మీరు ట్రై చేసి మీకు ఎలా కుదిరిందో కచ్చితంగా ఆ పిక్ ని విస్మై ఫుడ్ ఇన్స్టాగ్రామ్ లో పోస్ట్ చేయండి లేదా vismaifood.com వెబ్సైట్ లో కూడా రెసిపీ కింద పోస్ట్ చేయొచ్చు."
  ],
  "transcription_english": [
    "[00:00] Hello Foodies, Welcome to Vismai Food. Today's special is Hyderabad Special Kaddu Ki Kheer.",
    "[00:05] Many subscribers have been asking for this recipe daily in the comments.",
    "[00:08] Not just them, once you eat this recipe, people will ask you to make it again and again, it is that good.",
    "[00:14] This is even more special during the month of Ramadan in Hyderabad. Because it is rich in texture, great in taste. Not just one, you will feel like eating more and more, this Kheer is that good. Let's start.",
    "[00:25] First, take 500 grams of grated tender bottle gourd with seeds removed in a pan. Fry this for two minutes.",
    "[00:33] After that, add half a cup of water and cook on medium flame until the water evaporates and the bottle gourd becomes soft. Cook until then.",
    "[00:43] Then remove it and keep it aside.",
    "[00:48] Now, pour one liter of thick milk into a bowl that specifically has a thick bottom and boil it.",
    "[00:54] As soon as it boils twice, take half a cup of hot milk into a cup...",
    "[01:02] Add 100 grams of raw khoya (unsweetened mawa) and dissolve the khoya without any lumps.",
    "[01:07] Remember that this khoya is raw, meaning it is unsweetened.",
    "[01:17] Now add half a cup of sago (sabudana) soaked for 30 minutes and cook the sago until soft.",
    "[01:23] This will take at least 15 to 20 minutes.",
    "[01:27] Stir the milk from the bottom every 30 seconds, scraping the cream from the edges and adding it to the milk, only then it tastes good.",
    "[01:35] When you think the sago is still a bit hard to cook...",
    "[01:39] Add the khoya milk and 50 grams of cashew paste and mix well on low flame.",
    "[01:44] Otherwise, it will burn quickly and the taste will be ruined.",
    "[01:48] Boil the milk for two to three minutes and let it come to a boil.",
    "[01:52] After that, add the cooked grated bottle gourd and mix well...",
    "[01:56] Simmer slowly for 15 minutes only on low flame.",
    "[02:01] Keep stirring every 30 seconds and remember to scrape the cream from the edges and add it to the milk.",
    "[02:08] When you think the milk has almost thickened, pour a quarter kilo of sugar and cook until the sugar dissolves and it thickens.",
    "[02:21] Before taking it off, add a teaspoon of cardamom powder and mix well.",
    "[02:25] As the milk thickens, khoya forms along the edges. Keep removing it and adding it to the milk.",
    "[02:31] After adding cardamom powder, let it thicken for another five minutes on low flame and take it off.",
    "[02:35] Then take it in a bowl and add soaked almond flakes and pistachio flakes on top of the Kheer.",
    "[02:41] Whether you eat it hot or cold, that day is a festival.",
    "[02:45] You have to finish one, two, three cups, this Kheer is that good.",
    "[02:50] For more information about this recipe, visit the vismaifood.com website.",
    "[02:54] Do try it and definitely post that pic on Vismai Food Instagram on how it turned out for you, or you can also post it under the recipe on the vismaifood.com website."
  ]
}