{
  "metadata": {
    "title": "Mix Veg Ghee Kichidi | మిక్స్ వెజ్ ఘీ కిచిడి | పిల్లల లంచ్ బాక్స్ కి హేల్తీ పర్ఫెక్ట్ రెసిపీ",
    "channel_name": "Vismai Food",
    "publish_date": "2019-05-15",
    "view_count": 1900000,
    "like_count": 16000,
    "duration": "02:07",
    "language": "Telugu",
    "video_id": "_l_H_g_s_u_8",
    "url": "https://www.youtube.com/watch?v=_l_H_g_s_u_8",
    "description": "Mix Veg Ghee Kichdi is the best, quick and healthy dish. Please try and share this video link with your family and friends. This recipe is perfect for kids' lunch boxes and office lunches as it stays tasty even when cold. It is a light, masala-free comfort food suitable for all ages.",
    "ingredients_detected": [
      "Ghee",
      "Dry Red Chillies",
      "Mustard Seeds",
      "Curry Leaves",
      "Green Chillies",
      "Turmeric",
      "Carrot",
      "French Beans",
      "Brinjal",
      "Potato",
      "Salt",
      "Moong Dal",
      "Sona Masoori Rice",
      "Water",
      "Coriander Leaves"
    ]
  },
  "transcription_telugu": [
    "[00:00] హలో ఫుడీస్ వెల్కమ్ టు విస్మై ఫుడ్. ఇవాల్టి స్పెషల్ మిక్స్ వెజ్ ఘీ కిచిడి.",
    "[00:05] పిల్లల లంచ్ బాక్సులకి, ఆఫీసులకి వెళ్ళేవారికి ఇది పర్ఫెక్ట్. మధ్యాహ్నం తర్వాత కూడా రుచిగానే ఉంటుంది.",
    "[00:10] ఏ కూర చెయ్యాలో అర్థం కానప్పుడు, రోజు చేసుకునే అన్నం కూర ప్లేస్ లో ఓ సారి ఫర్ ఏ చేంజ్ ఇది ట్రై చేసి చూడండి. సూపర్ హిట్ అంతే.",
    "[00:18] ఇందులో మసాలాలు ఏవి లేవు. చాలా హాయిగా ఉంటుంది పొట్టకి తిన్న తర్వాత కూడా. లెట్స్ స్టార్ట్.",
    "[00:23] ముందుగా కుక్కర్ లో అర కప్పు నెయ్యి వేడి చేసుకోండి.",
    "[00:27] ఆ తర్వాత నాలుగు ఎండు మిర్చి వేసి వేయించుకోండి.",
    "[00:32] ఇప్పుడు అర టీస్పూన్ ఆవాలు వేసి చిటపటమనిపించండి.",
    "[00:36] ఆ తర్వాత రెండు రెమ్మల కరివేపాకు, నాలుగు చీరిన పచ్చిమిర్చి వేసి కాసేపు మగ్గించుకోండి.",
    "[00:42] ఆ తర్వాత అర టీస్పూన్ పసుపు, ఓ క్యారెట్ తరుగు, నాలుగు ఫ్రెంచ్ బీన్స్ తరుగు వేసి రెండు నిమిషాల పాటు వేయించుకోండి.",
    "[00:51] ఆ తర్వాత మూడు పొడవు వంకాయ ముక్కలు వేసి రెండు నిమిషాల పాటు మగ్గించుకోండి. ఇందులో మీకు నచ్చితే ఉల్లిపాయలు పెద్ద పెద్ద పాయలుగా చేసి కూడా వేసుకోవచ్చు.",
    "[00:59] ఆ తర్వాత ఓ బంగాళదుంప చెక్కు తీసింది వేసుకొని కలుపుకొని మూడు నిమిషాల పాటు మీడియం ఫ్లేమ్ మీద మగ్గనిచ్చి...",
    "[01:07] రుచికి సరిపడా సాల్ట్, కప్పు పెసరపప్పు, కప్పు ఓ గంట పాటు నానబెట్టుకున్నటువంటి సోనా మసూరి బియ్యం వేసి రెండు నిమిషాల పాటు బియ్యాన్ని వేపుకోండి.",
    "[01:17] ఇలా బియ్యం వేపటం వల్ల కిచిడి పొడిపొడిగా ఉంటుంది.",
    "[01:21] ఇప్పుడు మూడు కప్పుల నీళ్లు పోసి, కుక్కర్ మూత పెట్టి, రెండు విజిల్స్ మీడియం ఫ్లేమ్ మీద, ఓ విజిల్ హై ఫ్లేమ్ మీద రానివ్వండి.",
    "[01:29] ఆ తర్వాత ఇరవై నిమిషాలు వదిలేయండి.",
    "[01:32] ఇరవై నిమిషాల తర్వాత మూత తీసి, అట్లకాడతో అడుగు నుండి కలుపుకోండి. అప్పుడు అన్నం చిదురవ్వదు.",
    "[01:40] ఇప్పుడు మరో రెండు టేబుల్ స్పూన్ల నెయ్యి, కట్ట కొత్తిమీర కాడలతో సహా వేసుకొని దింపేసుకోండి.",
    "[01:46] దీన్ని ఏదైనా రైతాతో లేదంటే టమాటో పచ్చడి, కొత్తిమీర పచ్చడి ఇలాంటి వాటితో చాలా చాలా బాగుంటుంది ఈ కిచిడి.",
    "[01:52] ఇది ఆరు నెలల పసిపాప నుండి పెద్దవారి వరకు అందరూ హాయిగా తినొచ్చు.",
    "[01:57] ఈ రెసిపీ లోని ఇంగ్రిడియంట్స్ ఇంకా మరిన్ని టిప్స్ తెలియాలంటే vismaifood.com వెబ్సైట్ విజిట్ చేయండి. దానికోసం డిస్క్రిప్షన్ బాక్స్ లోని లింక్ చూడండి."
  ],
  "transcription_english": [
    "[00:00] Hello Foodies, Welcome to Vismai Food. Today's special is Mix Veg Ghee Khichdi.",
    "[00:05] This is perfect for kids' lunch boxes and for those going to the office. It tastes good even in the afternoon.",
    "[00:10] When you don't know what curry to make, try this for a change instead of the regular rice and curry. It's a super hit.",
    "[00:18] There are no masalas in this. It feels very light on the stomach even after eating. Let's start.",
    "[00:23] First, heat half a cup of ghee in a cooker.",
    "[00:27] Then add four dry red chilies and fry them.",
    "[00:32] Now add half a teaspoon of mustard seeds and let them splutter.",
    "[00:36] Then add two sprigs of curry leaves, four slit green chilies, and saute for a while.",
    "[00:42] After that, add half a teaspoon of turmeric, one chopped carrot, four chopped French beans, and fry for two minutes.",
    "[00:51] Then add three long chopped brinjal pieces and saute for two minutes. If you like, you can also add large chunks of onion.",
    "[00:59] Then add one peeled and cubed potato, mix well, and let it cook on medium flame for three minutes.",
    "[01:07] Add salt to taste, one cup of moong dal, and one cup of Sona Masoori rice that has been soaked for one hour, and fry the rice for two minutes.",
    "[01:17] Frying the rice like this ensures the khichdi is fluffy and non-sticky.",
    "[01:21] Now pour three cups of water, cover the cooker, and let it whistle twice on medium flame and once on high flame.",
    "[01:29] Then leave it for twenty minutes to rest.",
    "[01:32] After twenty minutes, open the lid and mix gently from the bottom using a flat ladle. This prevents the rice grains from breaking.",
    "[01:40] Now add another two tablespoons of ghee and a bunch of coriander leaves along with the stalks, and remove from heat.",
    "[01:46] This khichdi tastes excellent with any raita, tomato chutney, or coriander chutney.",
    "[01:52] Everyone from six-month-old babies to the elderly can eat this happily.",
    "[01:57] For ingredients and more tips on this recipe, visit the vismaifood.com website. Check the link in the description box for that."
  ]
}