{
  "metadata": {
    "title": "Tomato Karivepaku Pachadi | టోమాటో కరివేపాకు పచ్చడి | అన్నం లోకి ఈ పచ్చడి ముందు ఏదైనా దిగదుడుపే",
    "channel_name": "Vismai Food",
    "publish_date": "2019-05-17",
    "view_count": 212000,
    "like_count": 3200,
    "duration": "02:14",
    "language": "Telugu",
    "video_id": "gX8R5YtX8qI",
    "url": "https://www.youtube.com/watch?v=gX8R5YtX8qI",
    "description": "Tomato Karivepaku Pachadi is a flavorful and healthy chutney made with country tomatoes, curry leaves, and fresh coconut. It pairs perfectly with hot rice, ghee, idli, dosa, and chapati. This recipe is unique as it enhances the classic tomato chutney with rich textures and aromas from sesame and coconut.",
    "ingredients_detected": [
      "Oil",
      "Sesame Seeds",
      "Fresh Grated Coconut",
      "Green Chillies",
      "Curry Leaves",
      "Coriander Leaves",
      "Water",
      "Desi Tomatoes",
      "Salt",
      "Mustard Seeds",
      "Urad Dal",
      "Cumin Seeds",
      "Dry Red Chilli"
    ]
  },
  "transcription_telugu": [
    "[00:00] హలో ఫుడీస్, వెల్కమ్ టు విస్మై ఫుడ్.",
    "[00:01] ఇవాల్టి స్పెషల్ సింపుల్ టేస్టీ ఎరోమాటిక్ టమాటో కరివేపాకు పచ్చడి.",
    "[00:07] రోజువారి పచ్చళ్ళలో రాజు ఎవరంటే మాత్రం టమాటో పచ్చడే కదా?",
    "[00:12] ఈ టమాటో పచ్చడిని ఇంకొక రిచ్ టెక్స్చర్ ఫ్లేవర్స్ యాడ్ చేసి చేస్తే ఇంకెంత బాగుంటుందో కదా?",
    "[00:17] ఎస్, అలాంటిదే ఈ పచ్చడి. లెట్స్ స్టార్ట్.",
    "[00:20] ముందుగా కడాయిలో రెండు టేబుల్ స్పూన్ల ఆయిల్ హీట్ చేసుకొని...",
    "[00:23] అందులో ఓ టీస్పూన్ నువ్వులు వేసి చిటపటమనిపించేంత వరకు వేయించుకోండి.",
    "[00:29] ఆ తర్వాత అరకప్పు పచ్చి కొబ్బరి వేసి జస్ట్ ముప్పై సెకన్లు ఫ్రై చేసుకోండి చాలు.",
    "[00:34] పచ్చడికి మంచి కమ్మదనాన్ని ఇస్తుంది పచ్చి కొబ్బరి.",
    "[00:37] ఇప్పుడు పది కారం గల పచ్చిమిర్చి వేసి మూడు నాలుగు నిమిషాల పాటు మగ్గించుకోండి.",
    "[00:42] మూడు చిన్న కట్టల కరివేపాకు వేసి రెండు మూడు నిమిషాల పాటు ఫ్రై చేసుకోండి.",
    "[00:48] కరివేపాకును పూర్తిగా మాత్రం వేపకండి.",
    "[00:51] ఇప్పుడు ఇందులో ఓ చిన్న కట్ట కాడలతో సహా కొత్తిమీర తరుగు వేసి బాగా కలుపుకోండి.",
    "[00:56] ఇప్పుడు దీన్ని తీసి మిక్సీ జార్ లో వేసి ఫైన్ గా గ్రైండ్ చేసుకోండి కొద్దిగా నీళ్లు యాడ్ చేసుకొని.",
    "[01:03] ఇప్పుడు ఓ టేబుల్ స్పూన్ ఆయిల్ హీట్ చేసుకొని...",
    "[01:06] అందులో 300 గ్రాముల పండు దేశవాళి టమాటోలని మాత్రమే వేసుకోండి.",
    "[01:10] సాల్ట్ వేసి టమాటోలని మెత్తగా మగ్గించుకోండి.",
    "[01:14] ఈ పచ్చడికి మీరు కరివేపాకుని మరీ ఎర్రగా వేపితే ఫ్లేవర్ అంతా తగ్గిపోతుందని గుర్తుంచుకోండి.",
    "[01:20] ముదురు కరివేపాకు అయితే ఇంకా రుచిగా ఉంటుంది.",
    "[01:23] ఇది వేడి వేడి నెయ్యి అన్నంలో కానీ లేదా అట్టు, చపాతీ, ఇడ్లీ ఇలా ఎందులోకైనా సరే చాలా రుచిగా ఉంటుంది.",
    "[01:29] టమాటోలు మెత్తగా గుజ్జుగా అయ్యేంతవరకు టైం తీసుకొని మీడియం ఫ్లేమ్ మీద మగ్గించుకోండి.",
    "[01:34] టమాటోలు గుజ్జుగా అయ్యాక మిక్సీ జార్ లోకి తీసుకొని ఫైన్ గా గ్రైండ్ చేసుకోండి.",
    "[01:40] ఇప్పుడు రెండు టీస్పూన్ల ఆయిల్ హీట్ చేసుకొని...",
    "[01:42] అందులో అర టీస్పూన్ ఆవాలు, అర టీస్పూన్ మినప్పప్పు, అర టీస్పూన్ జీలకర్ర...",
    "[01:47] ఓ ఎండుమిర్చి వేసి తాలింపుని వేపుకోండి.",
    "[01:51] తాలింపుని ఎర్రగా వేపుకున్నాక పచ్చడిలో కలిపేయండి.",
    "[01:54] కరివేపాకు ఫ్లేవర్ ని ఇంగువ డామినేట్ చేస్తుందని వేయలేదు. మీకు నచ్చితే తాలింపులో వేసుకోండి.",
    "[01:58] ఇది ఓ రోజు కంటే బయట నిల్వ ఉండదు. ఫ్రిడ్జ్ లో అయితే రెండు మూడు రోజులు నిల్వ ఉంటుంది.",
    "[02:02] మీకు నచ్చిందా? మరైతే vismaifood.com వెబ్సైట్ విజిట్ చేయండి.",
    "[02:05] డీటెయిల్డ్ గా రెసిపీ చదువుకొని చేయండి.",
    "[02:07] ఇంకా ఈ రెసిపీని మీరు తయారు చేసి ఆ పిక్ ని విస్మై ఫుడ్ ఇన్స్టాగ్రామ్ లో పోస్ట్ చేయడం మాత్రం మర్చిపోకండి."
  ],
  "transcription_english": [
    "[00:00] Hello Foodies, Welcome to Vismai Food.",
    "[00:01] Today's special is simple, tasty, and aromatic Tomato Curry Leaves Chutney.",
    "[00:07] Among daily chutneys, Tomato chutney is the king, isn't it?",
    "[00:12] If we add a richer texture and more flavors to this tomato chutney, imagine how good it would be, right?",
    "[00:17] Yes, this chutney is just like that. Let's start.",
    "[00:20] First, heat two tablespoons of oil in a kadai...",
    "[00:23] Add one teaspoon of sesame seeds and fry until they splutter.",
    "[00:29] Then add half a cup of fresh grated coconut and fry for just 30 seconds, that's enough.",
    "[00:34] Fresh coconut gives a nice nutty taste to the chutney.",
    "[00:37] Now add ten spicy green chilies and saute for three to four minutes.",
    "[00:42] Add three small bunches of curry leaves and fry for two to three minutes.",
    "[00:48] Do not fry the curry leaves completely crisp.",
    "[00:51] Now add a small bunch of chopped coriander leaves along with stalks and mix well.",
    "[00:56] Now transfer this to a mixer jar, add a little water, and grind it into a fine paste.",
    "[01:03] Now heat one tablespoon of oil...",
    "[01:06] Add 300 grams of ripe country (desi) tomatoes only.",
    "[01:10] Add salt and cook the tomatoes until they become soft and mushy.",
    "[01:14] Remember, if you fry the curry leaves too much for this chutney, the flavor will reduce.",
    "[01:20] Using mature curry leaves makes it even tastier.",
    "[01:23] This tastes delicious with hot ghee rice, dosa, chapati, or idli.",
    "[01:29] Take your time and cook on medium flame until the tomatoes become soft and pulpy.",
    "[01:34] Once the tomatoes are mushy, take them into the mixer jar and grind finely.",
    "[01:40] Now heat two teaspoons of oil...",
    "[01:42] Add half a teaspoon mustard seeds, half a teaspoon urad dal, half a teaspoon cumin seeds...",
    "[01:47] Add one dry red chili and fry the tempering.",
    "[01:51] Once the tempering is fried red, mix it into the chutney.",
    "[01:54] I didn't add asafoetida (hing) because it dominates the curry leaf flavor. If you like, you can add it to the tempering.",
    "[01:58] This won't stay fresh outside for more than a day. In the fridge, it stays good for two to three days.",
    "[02:02] Did you like it? Then visit the vismaifood.com website.",
    "[02:05] Read the detailed recipe and make it.",
    "[02:07] Also, don't forget to prepare this recipe and post the picture on Vismai Food Instagram."
  ]
}