{
  "metadata": {
    "title": "Bagara Hua Khana | బగారా అన్నం | తెలంగాణా పెళ్ళిళ్ళ స్పెషల్ | వెజ్ నాన్ వెజ్ కర్రీ లోకి పర్ఫెక్ట్",
    "channel_name": "Vismai Food",
    "publish_date": "2019-05-19",
    "view_count": 6300000,
    "like_count": 160000,
    "duration": "02:28",
    "language": "Telugu",
    "video_id": "R9JzQ1XyQ4s",
    "url": "https://www.youtube.com/watch?v=R9JzQ1XyQ4s",
    "description": "Telangana Special Bagara Rice Recipe. Best served with spicy Chicken or Mutton Curry. A simple and aromatic rice dish popular in Hyderabad and Telangana weddings.",
    "ingredients_detected": [
      "Ghee",
      "Onion",
      "Shah Jeera",
      "Cinnamon Stick",
      "Cloves",
      "Black Pepper",
      "Green Cardamom",
      "Black Cardamom",
      "Green Chillies",
      "Ginger Garlic Paste",
      "Salt",
      "Basmati Rice",
      "Water",
      "Mint Leaves",
      "Coriander Leaves",
      "Garam Masala"
    ]
  },
  "transcription_telugu": [
    "[00:00] హలో ఫుడీస్ వెల్కమ్ టు విస్మై ఫుడ్. ఇవాల్టి స్పెషల్ తెలంగాణ స్పెషల్ బగారా అన్నం.",
    "[00:05] ఆహా ఏముంటుందిలే.. తెలంగాణ పెళ్ళికి పోవాలె బగారా అన్నం తినాలె. అది తరీకా.",
    "[00:10] బెస్ట్ అండ్ సింపుల్ ఫ్లేవర్డ్ రైస్ ఇది. ఈ రైస్ దేనితో అయినా సరే సరైన జోడినే.",
    "[00:15] మటన్, చికెన్, మిర్చీ కా సాలన్, బగారా బైంగన్ ఇంకా ఇంకా.. దేనితో అయినా సరే చాలా చాలా బాగుంటుంది.",
    "[00:21] సో సింపుల్ బట్ టేస్టీ ఈ బగారా అన్నం. లెట్స్ స్టార్ట్.",
    "[00:26] ముందుగా కుక్కర్ లో పావు కప్పు కంటే కాస్త ఎక్కువ నెయ్యి కరిగించుకోండి.",
    "[00:30] ఇందులో ఓ పెద్ద ఉల్లిపాయ నిలువుగా చీరుకున్న చీలికలు వేసి ఫ్రై చేసుకోండి.",
    "[00:36] సగం పైన ఫ్రై అయ్యాక ఓ టీస్పూన్ షాజీరా వేసుకోండి. ఇది తప్పక వేసి తీరాలి లేకపోతే బగారా అన్నంకు రుచే లేదు.",
    "[00:44] లేకపోతే ఈ రెసిపీ మరోసారి చేసుకోండి అంతేకాని ఇది వేయడం మాత్రం మానొద్దు.",
    "[00:48] ఇది వేసి ఫ్రై చేసుకొని, ఓ ఇంచ్ దాల్చిన చెక్క, ఐదు లవంగాలు, అర టీస్పూన్ మిరియాలు, ఐదు యాలకులు, ఓ నల్ల యాలక.. ఇవి వేసి ఫ్రై చేసుకోండి.",
    "[01:02] ఇప్పుడు ఐదు చీరినటువంటి పచ్చిమిర్చి, ఓ టీస్పూన్ అల్లం వెల్లుల్లి పేస్ట్, సాల్ట్ వేసి రెండు నిమిషాల పాటు వేపుకోండి.",
    "[01:12] ఆ తర్వాత గంట పాటు నానబెట్టుకున్నటువంటి బాస్మతి బియ్యం వేసి నిదానంగా అడుగు నుండి కదుపుతూ రెండు నిమిషాల పాటు ఫ్రై చేసుకోండి.",
    "[01:19] ఇలా ఫ్రై చేయడం వల్ల రైస్ ఇంకా పొడి పొడిగా ఉడుకుతుంది.",
    "[01:25] ఇప్పుడు ఓ కప్పు నీళ్లు పోసుకొని కలుపుకోండి. బాస్మతి బియ్యానికి ఓ కప్పుకి ఓ కప్పు నీళ్ళే వాడుకోవాలి అది కూడా గంట సేపు నానబెడితేనే.",
    "[01:33] ఇప్పుడు ఇందులో రెండు టేబుల్ స్పూన్ల పుదీనా తరుగు, రెండు టీస్పూన్ల కొత్తిమీర తరుగు, పావు టీస్పూన్ విస్మై ఫుడ్ స్పెషల్ గరం మసాలా పౌడర్ వేసి బాగా కలుపుకొని...",
    "[01:40] కుక్కర్ మూత పెట్టి కేవలం హై ఫ్లేమ్ మీద మాత్రమే ఓ విజిల్ రానిచ్చి స్టవ్ ఆఫ్ చేసేయండి. ఆ తర్వాత 20 నిమిషాలు రెస్ట్ ఇవ్వండి.",
    "[01:50] 20 నిమిషాల తర్వాత మూత తీసి అడుగు నుండి అట్లకాడతో కలుపుకోండి. అప్పుడు మెతుకు విరగదు.",
    "[01:56] చూసారా ఎంత యమ్మీ గా ఉందో. సంవత్సరం కంటే పాత బాస్మతి బియ్యం వాడితేనే ఇలా వస్తుంది పొడి పొడిగా మీకు.",
    "[02:01] నార్మల్ సోనా మసూరి బియ్యంతో అయితే ఒకటికి ఒకటి ముప్పావు నీళ్లు పోసి, బియ్యం గంట సేపు నానబెట్టుకోండి. మూడు విజిల్స్ హై ఫ్లేమ్ మీదే కుక్ చేసుకోండి.",
    "[02:09] అంతే యు ఆర్ డన్. ఇందులో చాలా మంది ఉల్లిపాయలతో పాటు కరివేపాకు కూడా వేసి వేయిస్తూ ఉంటారు. నేను వేయలేదు, మీకు నచ్చితే అలా కూడా ట్రై చేయొచ్చు.",
    "[02:17] నచ్చిందా? కచ్చితంగా నచ్చి తీరుతుంది చాలా చాలా బాగుంటుంది.",
    "[02:21] మీరు ట్రై చేసి మీకు ఎలా కుదిరిందో కచ్చితంగా ఆ పిక్ ని విస్మై ఫుడ్ ఇన్స్టాగ్రామ్ లో పోస్ట్ చేయండి. బై ది వే ఇంకా ఇంకా యమ్మీ రెసిపీస్ కోసం vismaifood.com వెబ్సైట్ విజిట్ చేయండి."
  ],
  "transcription_english": [
    "[00:00] Hello Foodies, Welcome to Vismai Food. Today's special is Telangana Special Bagara Rice.",
    "[00:05] Oh, it's something else... You must go to a Telangana wedding and eat Bagara Rice. That's the tradition.",
    "[00:10] This is the best and simple flavored rice. This rice pairs well with anything.",
    "[00:15] Mutton, Chicken, Mirchi Ka Salan, Bagara Baingan, and more... it tastes very very good with anything.",
    "[00:21] So simple but tasty, this Bagara Rice. Let's start.",
    "[00:26] First, melt a little more than a quarter cup of ghee in a cooker.",
    "[00:30] Add vertically sliced pieces of one large onion and fry.",
    "[00:36] After frying more than half, add a teaspoon of Shah Jeera. You must add this, otherwise, there is no taste to Bagara Rice.",
    "[00:44] Otherwise, make this recipe another time, but don't skip adding this.",
    "[00:48] Fry this, then add one-inch cinnamon stick, five cloves, half a teaspoon of pepper, five green cardamoms, and one black cardamom... add these and fry.",
    "[01:02] Now add five slit green chilies, a teaspoon of ginger-garlic paste, salt, and fry for two minutes.",
    "[01:12] After that, add Basmati rice that has been soaked for an hour and fry for two minutes, gently stirring from the bottom.",
    "[01:19] Frying like this makes the rice cook even more fluffy.",
    "[01:25] Now pour one cup of water and mix. For Basmati rice, use one cup of water for one cup of rice, only if soaked for an hour.",
    "[01:33] Now add two tablespoons of chopped mint, two teaspoons of chopped coriander, and a quarter teaspoon of Vismai Food special Garam Masala powder, mix well...",
    "[01:40] Cover the cooker and let it whistle once only on high flame, then switch off the stove. Then give it a rest for 20 minutes.",
    "[01:50] After 20 minutes, open the lid and mix from the bottom with a flat ladle. Then the grain won't break.",
    "[01:56] See how yummy it is? You get it this fluffy only if you use Basmati rice older than a year.",
    "[02:01] If using normal Sona Masoori rice, pour 1.75 cups of water for one cup, and soak the rice for an hour. Cook for three whistles on high flame.",
    "[02:09] That's it, you are done. Many people fry curry leaves along with onions in this. I didn't add it, if you like, you can try that too.",
    "[02:17] Did you like it? You will definitely like it, it tastes very very good.",
    "[02:21] Do try it and definitely post the picture on Vismai Food Instagram sharing how it turned out for you. By the way, for more yummy recipes visit vismaifood.com website."
  ]
}