{
  "metadata": {
    "title": "Perfect Crunchy Aloo Bonda | ఆలు బొండా ఇలా చేస్తే పైన క్రిస్పీగా లోపల సాఫ్ట్ గా వస్తుంది",
    "channel_name": "Vismai Food",
    "publish_date": "2019-05-20",
    "view_count": 573000,
    "like_count": 7900,
    "duration": "03:32",
    "language": "Telugu",
    "video_id": "Not Available",
    "url": "https://www.youtube.com/watch?v=Unknown",
    "description": "Learn how to make Perfect Crunchy Aloo Bonda at home. This evening snack recipe is a hit with kids and adults alike. Follow the tips for a crispy outer layer and soft filling.",
    "ingredients_detected": [
      "Potatoes",
      "Water",
      "Oil",
      "Mustard Seeds",
      "Cumin Seeds",
      "Chopped Ginger",
      "Chopped Green Chilli",
      "Curry Leaves",
      "Chopped Onion",
      "Salt",
      "Garam Masala",
      "Coriander Powder",
      "Turmeric",
      "Lemon Juice",
      "Chickpea Flour (Besan)",
      "Rice Flour",
      "Red Chilli Powder"
    ]
  },
  "transcription_telugu": [
    "[00:00] హలో ఫుడీస్, వెల్కమ్ టు విస్మై ఫుడ్. ఇవాల్టి స్పెషల్ క్రిస్పీ పర్ఫెక్ట్ ఆలు బోండా.",
    "[00:05] మంచి ఈవినింగ్ స్నాక్ ఇది. ఇది పిల్లల బాక్సులకు కూడా మీరు పంపించొచ్చు.",
    "[00:09] ఏవైనా స్పెషల్ అకేషన్స్ అప్పుడు కూడా ఇది చేసుకోవచ్చు. పర్ఫెక్ట్ గా క్రిస్పీగా రావడానికి కొన్ని కొలతలు, విధానాలు, టిప్స్ ఉన్నాయి.",
    "[00:16] అవన్నీ జాగ్రత్తగా ఫాలో అవ్వండి వీడియో చివరి వరకు.",
    "[00:19] యూజువల్ గా అందరూ చేసే ఆలు బోండాలో బయట కోటింగ్ చాలా మందంగా వస్తుంది.",
    "[00:22] కానీ నేను చెప్పే టిప్స్ ఫాలో అయితే మీకు పర్ఫెక్ట్ రెసిపీ వస్తుంది. లెట్స్ స్టార్ట్.",
    "[00:26] ముందుగా కుక్కర్ లో రెండు పెద్ద బంగాళదుంపలు వేసి, నీళ్లు పోసి మీడియం ఫ్లేమ్ మీద మూడు విజిల్స్ వచ్చేంతవరకు కుక్ చేసుకోండి.",
    "[00:34] అంటే మెత్తగా ఉడికిపోవాలి ఆలుగడ్డలు.",
    "[00:37] ఆ తర్వాత పైన చెక్కు తీసి పూర్తిగా ఆరనివ్వండి వీటిని.",
    "[00:44] అస్సలు చెమ్మ ఉండనేకూడదు. చెమ్మ ఉంటే బోండాలు సరైన షేప్ లో రావు, నూనెలో వేస్తే విరిగిపోయినా విరిగిపోవచ్చు.",
    "[00:51] ఇప్పుడు వీటిని మెత్తగా మాష్ చేసుకుని పక్కన ఉంచుకోండి.",
    "[01:00] ఇప్పుడు కడాయిలో రెండు టేబుల్ స్పూన్ల ఆయిల్ హీట్ చేసుకుని, అందులో ఓ టీస్పూన్ ఆవాలు, ఓ టీస్పూన్ జీలకర్ర...",
    "[01:06] ఓ టీస్పూన్ అల్లం తరుగు, ఓ పచ్చిమిర్చి తరుగు, ఓ రెబ్బ కరివేపాకు సన్నని తరుగు వేసి తాలింపుని బాగా వేపుకోండి.",
    "[01:16] తాలింపు వేగాక ఓ చిన్న ఉల్లిపాయ సన్నని తరుగు వేసి జస్ట్ పచ్చివాసన పోయేంతవరకు ఫ్రై చేసుకోండి చాలు.",
    "[01:23] ఆ తర్వాత సాల్ట్, అర టీస్పూన్ గరం మసాలా, ఓ టీస్పూన్ ధనియాల పొడి వేసి వేయించుకోండి.",
    "[01:32] ఇప్పుడు మెత్తగా ఎనుపుకున్నటువంటి ఆలు వేసి బాగా కలుపుకోండి.",
    "[01:38] ఆ తర్వాత పావు చెంచా పసుపు వేసి బాగా పట్టించండి.",
    "[01:45] ఇప్పుడు అర చెక్క నిమ్మరసం పిండి బాగా కలుపుకుని, దింపేసుకుని పూర్తిగా చల్లారనివ్వండి ఈ మిక్చర్ ని.",
    "[01:55] ఇప్పుడు మిక్సింగ్ బౌల్ లో ముప్పావు కప్పు శనగపిండి, పావు కప్పు బియ్యప్పిండి...",
    "[02:00] అర చెంచా పసుపు, ఓ టీస్పూన్ కారం వేసి కొద్దిగా నీళ్లు పోసుకుంటూ పిండిని జారుగా అట్ల పిండి మాదిరిగా ఉండాలి.",
    "[02:08] పిండి మరీ జారైతే ఆలు బాల్స్ ని పట్టుకోదు, అలాగే పిండి మరీ గట్టిగా అయితే మీకు కోటింగ్ థిక్ గా వస్తుంది.",
    "[02:17] ఇప్పుడు బంగాళదుంప మిక్చర్ ని నిమ్మకాయ సైజ్ అంత బాల్స్ గా డివైడ్ చేసుకోండి.",
    "[02:23] వీటిని బాల్స్ గా డివైడ్ చేసుకున్నాక, వీటిని ఓ పది నిమిషాల పాటు గాలికి ఆరనివ్వండి.",
    "[02:27] అప్పుడు ఇంకా గట్టిగా అవుతాయి బాల్స్, అప్పుడు పర్ఫెక్ట్ షేప్ లో వస్తాయి.",
    "[02:31] ఇప్పుడు పిండిలో రుచికి సరిపడా సాల్ట్ వేసి కలుపుకోండి.",
    "[02:36] గాలికి ఆరనిచ్చిన ఆలు బాల్స్ ని పిండిలో వేసి, మూడు వేళ్లతో ముంచి పైకి లేపితే ఎక్సెస్ పిండి కిందికి జారుతుంది నెమ్మదిగా.",
    "[02:43] ఆ తర్వాత వదిలిస్తే పిండికి ఉన్నటువంటి మరికాస్త ఎక్సెస్ పిండి జారి పైన కోటింగ్ పల్చగా ఏర్పడుతుంది. అది సరైన బోండా.",
    "[02:50] అప్పుడు వేడి వేడి నూనెలో వేయండి.",
    "[02:54] నూనెలో వేసి మీడియం ఫ్లేమ్ మీద రెండు నిమిషాల పాటు వేపుకోండి.",
    "[03:01] ఆ తర్వాత హై ఫ్లేమ్ మీద లైట్ గోల్డెన్ బ్రౌన్ కలర్ వచ్చేంతవరకు ఫ్రై చేసుకోండి.",
    "[03:06] ఇలాగే మిగిలినవి చేసుకోండి. వేడి వేడిగా పుదీనా చట్నీ లేదంటే టమాటో కెచప్ తో తింటుంటే ఆహా మైమరచిపోతారు అంతే, అంత బాగుంటాయి ఇవి.",
    "[03:14] మీకు దీని గురించి మరిన్ని టిప్స్ డీటెయిల్స్ తెలుసుకోవాలనుకుంటే విత్ ఇంగ్రిడియంట్స్ vismaifood.com వెబ్సైట్ విజిట్ చేయండి.",
    "[03:19] చూడండి ఎంత థిన్ లేయర్ వచ్చిందో బోండాకి. మీకు కూడా ఎగ్జాక్ట్లీ ఇలాగే వస్తాయి.",
    "[03:24] తప్పకుండా ట్రై చేసి మీకు ఎలా కుదిరిందో కచ్చితంగా ఆ పిక్ ని విస్మై ఫుడ్ ఇన్స్టాగ్రామ్ లో పోస్ట్ చేయండి."
  ],
  "transcription_english": [
    "[00:00] Hello Foodies, Welcome to Vismai Food. Today's special is Crispy Perfect Aloo Bonda.",
    "[00:05] This is a great evening snack. You can also pack this in kids' lunch boxes.",
    "[00:09] You can also make this for any special occasions. There are some measurements, methods, and tips to get it perfectly crispy.",
    "[00:16] Follow all of them carefully till the end of the video.",
    "[00:19] Usually, in the Aloo Bonda everyone makes, the outer coating comes out very thick.",
    "[00:22] But if you follow the tips I tell you, you will get the perfect recipe. Let's start.",
    "[00:26] First, put two large potatoes in a cooker, add water, and cook on medium flame for three whistles.",
    "[00:34] Meaning, the potatoes should be cooked soft.",
    "[00:37] After that, peel the skin and let them dry completely.",
    "[00:44] There should be absolutely no moisture. If there is moisture, the bondas won't get the right shape, and they might break when put in oil.",
    "[00:51] Now mash them smoothly and keep aside.",
    "[01:00] Now heat two tablespoons of oil in a kadai, add one teaspoon mustard seeds, one teaspoon cumin seeds...",
    "[01:06] One teaspoon chopped ginger, one chopped green chili, one sprig of finely chopped curry leaves, and fry the tempering well.",
    "[01:16] After the tempering is fried, add one small finely chopped onion and fry just until the raw smell goes away, that's enough.",
    "[01:23] After that, add salt, half a teaspoon garam masala, one teaspoon coriander powder and fry.",
    "[01:32] Now add the smoothly mashed potato and mix well.",
    "[01:38] After that, add a quarter teaspoon of turmeric and mix it in well.",
    "[01:45] Now squeeze half a lemon's juice, mix well, take it off the stove, and let this mixture cool down completely.",
    "[01:55] Now in a mixing bowl, take 3/4 cup chickpea flour (besan), 1/4 cup rice flour...",
    "[02:00] Add half a teaspoon turmeric, one teaspoon chili powder, and add water little by little to make a batter with a consistency like dosa batter.",
    "[02:08] If the batter is too runny, it won't stick to the aloo balls, and if the batter is too thick, you will get a thick coating.",
    "[02:17] Now divide the potato mixture into lemon-sized balls.",
    "[02:23] After dividing them into balls, let them air dry for ten minutes.",
    "[02:27] Then the balls will become firmer, and they will get a perfect shape.",
    "[02:31] Now add salt to taste in the batter and mix.",
    "[02:36] Drop the air-dried aloo balls into the batter, dip using three fingers and lift up so the excess batter slides down slowly.",
    "[02:43] If you release it then, any remaining excess batter will slide off, forming a thin coating on top. That is the correct bonda.",
    "[02:50] Then drop it into hot oil.",
    "[02:54] Put it in the oil and fry on medium flame for two minutes.",
    "[03:01] After that, fry on high flame until it gets a light golden brown color.",
    "[03:06] Make the rest in the same way. Eating them hot with mint chutney or tomato ketchup, oh, you will just lose yourself, they are that good.",
    "[03:14] If you want to know more tips and details about this with ingredients, visit the vismaifood.com website.",
    "[03:19] Look how thin the layer on the bonda turned out. You will also get it exactly like this.",
    "[03:24] Definitely try it and be sure to post the picture of how it turned out for you on Vismai Food Instagram."
  ]
}