{
  "metadata": {
    "title": "Paakam Puri| పాకం పూరీలు|ఈ పద్ధతి లో పూరీలు చేస్తే కనీసం 15 రోజులు నిలవుంటాయ్|Sweet Puri In Telugu",
    "channel_name": "Vismai Food",
    "publish_date": "2019-05-25",
    "view_count": 3500000,
    "like_count": 24000,
    "duration": "02:42",
    "language": "Telugu",
    "video_id": "w7xtjl_WkRp",
    "url": "https://www.youtube.com/watch?v=w7xtjl_WkRp",
    "description": "Learn how to make traditional Andhra special Sweet Puri or Pakam Purilu that stays fresh for at least 15 days. A simple and delicious sweet recipe explained with tips for perfect texture.",
    "ingredients_detected": [
      "Maida/Wheat Flour",
      "Salt",
      "Ghee",
      "Water",
      "Sugar",
      "Cardamom Powder",
      "Oil"
    ]
  },
  "transcription_telugu": [
    "[00:00] హలో ఫుడీస్, వెల్కమ్ టు విస్మై ఫుడ్. ఇవాల్టి స్పెషల్ ఆంధ్రుల స్పెషల్ పాకం పూరీలు.",
    "[00:05] దీన్ని ఇష్టపడని వారు ఎవరైనా ఉంటారా అసలు? పేరు చెప్తేనే ప్రాణం లేచొచ్చేస్తుంది నాలాంటి ఫుడీస్ కైతే.",
    "[00:10] చేయడం కూడా చాలా చాలా తేలిక. ఓ సారి చేసుకుంటే కనీసం 15 రోజుల పాటు నిల్వ ఉంటాయి.",
    "[00:15] కానీ అవి చేసే తీరుని బట్టి ఆధారపడి ఉంటుంది. కాబట్టి జాగ్రత్తగా వీడియో చివరి వరకు చూడండి. లెట్స్ స్టార్ట్.",
    "[00:22] ముందుగా ఓ కప్ అంటే పావు కిలో మైదా తీసుకోండి. ఇక్కడ మీరు గోధుమ పిండి కూడా వాడుకోవచ్చు.",
    "[00:27] ఇందులో పావు చెంచా ఉప్పు, ఓ టేబుల్ స్పూన్ నెయ్యి వేసి, ముందు బ్రెడ్ పొడిలా అయ్యేంత వరకు బాగా కలుపుకోండి.",
    "[00:34] ఆ తర్వాత కొద్ది కొద్దిగా నీళ్లు పోసుకుంటూ మెత్తగా ఎక్కువ సేపు ఒత్తుకోండి.",
    "[00:39] ఎంత బాగా ఒత్తుకుంటే పూరీలు అంత సాఫ్ట్ గా జ్యూసీ గా వస్తాయి.",
    "[00:43] కొందరు ఈ పూరీల్నే అప్పడాల్లా కూడా చేస్తారు. వాటికి ఎక్కువగా ఒత్తుకోనక్కర్లేదు.",
    "[00:47] దీన్ని తడి గుడ్డ కప్పి 30 నిమిషాలు రెస్ట్ ఇవ్వండి.",
    "[00:50] ఇప్పుడు పాకానికి మైదా కి డబల్ పంచదార తీసుకోవాలి. అంటే అర కిలో పంచదార తీసుకోండి.",
    "[00:55] అందులో 150 ml నీళ్లు పోసి కరిగించుకోండి.",
    "[00:59] ఇక్కడ మీరు పట్టే పాకాన్ని బట్టే పూరీల రుచి, నిల్వ అన్నది ఆధారపడి ఉంటుంది.",
    "[01:03] ఓ తీగ పాకం అయితే నాలుగైదు రోజుల పాటు ఫ్రెష్ గా ఉంటాయి. ముదురు పాకం పడితే కనీసం 15 రోజుల పైన నిల్వ ఉంటాయి.",
    "[01:09] శ్వేత ఇక్కడ ఓ తీగ పాకం పట్టింది.",
    "[01:11] తీగ పాకం రాగానే అర టీస్పూన్ యాలకుల పొడి వేసి బాగా కలుపుకొని పక్కన ఉంచుకోండి.",
    "[01:18] ఇప్పుడు నానబెట్టుకున్న పిండిని బాగా ఒత్తుకొని చిన్న చిన్న బాల్స్ గా చేసుకోండి.",
    "[01:26] ముందు రౌండ్ గా పల్చగా ఒత్తుకోండి.",
    "[01:33] ఆ తర్వాత పైన పావు చెంచా నెయ్యి రాసి మధ్యకి ఫోల్డ్ చేసి మరో మడత వేసేయండి కోన్ లాగా.",
    "[01:41] ఆ తర్వాత కాస్త మందంగా ఒత్తుకోండి. మరీ పల్చగా ఒత్తినా బాగుంటాయి కానీ క్రిస్పీగా వస్తాయి.",
    "[01:48] మధ్యస్తంగా ఒత్తితే సాఫ్ట్ గా జ్యూసీ గా ఉంటాయి పూరీలు.",
    "[01:56] ఇప్పుడు కచ్చితంగా వేడి వేడి నూనెలో పూరీలు వేసి బాగా పొంగనివ్వండి.",
    "[02:02] బాండీ డీప్ గా ఉంటే పూరీలు పొంగేందుకు ఎక్కువ అవకాశం ఉంటుంది. నూనె వేడెక్కకుండా పూరీలు వేస్తే బాగా లాగేస్తాయి నూనె అని గుర్తుంచుకోండి.",
    "[02:08] ఇప్పుడు నూనెలో నుంచి తీసి తీయగానే వేడి వేడి పాకంలో వేసి ఓ 30 సెకండ్ల పాటు ఉంచేయండి.",
    "[02:14] వేడి మీద పూరీలు వేస్తేనే పాకం బాగా పీలుస్తాయి, జ్యూసీ గా ఉంటాయి పూరీలు.",
    "[02:18] లేకపోతే పైన కోటింగ్ లా ఉండిపోతుంది.",
    "[02:21] ఈ పూరీలు వేడి వేడిగా ఉంటే ఓ రుచి, చల్లారాక పంచదార పాకం పైన ఫామ్ అయ్యి పలుకులుగా ఏర్పడి మరో రుచి ఉంటుంది.",
    "[02:28] రెండు విధాలుగా చాలా చాలా బాగుంటుంది. మీరు కచ్చితంగా రెండు విధాలు ట్రై చేసి ఎలా వచ్చాయో చెప్తారా?",
    "[02:34] ఈ రెసిపీ లోని ఇంగ్రిడియంట్స్ టిప్స్ కోసం vismaifood.com వెబ్సైట్ విజిట్ చేయండి.",
    "[02:38] మీరు తయారు చేసిన ఆ పిక్ ని విస్మై ఫుడ్ ఇన్స్టాగ్రామ్ లో పోస్ట్ చేయడం అస్సలు మర్చిపోకండి."
  ],
  "transcription_english": [
    "[00:00] Hello Foodies, Welcome to Vismai Food. Today's special is Andhra Special Paakam Purilu (Sweet Poori).",
    "[00:05] Is there anyone who doesn't like this? For foodies like me, just the name brings life back.",
    "[00:10] Making it is also very very easy. If made once, they stay fresh for at least 15 days.",
    "[00:15] But it depends on the way you make them. So watch the video carefully till the end. Let's start.",
    "[00:22] First, take one cup, which is a quarter kilo (250g), of Maida (All-purpose flour). You can also use wheat flour here.",
    "[00:27] Add a quarter spoon of salt and one tablespoon of ghee to it, and mix well until it resembles bread crumbs.",
    "[00:34] Then add water little by little and knead it softly for a longer time.",
    "[00:39] The more you knead, the softer and juicier the pooris will turn out.",
    "[00:43] Some people make these pooris like papads. For those, you don't need to knead as much.",
    "[00:47] Cover it with a wet cloth and let it rest for 30 minutes.",
    "[00:50] Now for the syrup, take double the amount of sugar to maida. So take half a kilo (500g) of sugar.",
    "[00:55] Pour 150 ml of water into it and dissolve.",
    "[00:59] The taste and shelf life of the pooris depend on the consistency of the syrup you make here.",
    "[01:03] If it's a one-string consistency, they stay fresh for four to five days. If you make a thicker syrup, they last for at least 15 days.",
    "[01:09] Swetha has made a one-string consistency syrup here.",
    "[01:11] Once the string consistency is reached, add half a teaspoon of cardamom powder, mix well, and keep aside.",
    "[01:18] Now knead the rested dough well and divide it into small balls.",
    "[01:26] First, roll them out round and thin.",
    "[01:33] Then apply a quarter spoon of ghee on top, fold it to the middle, and fold it again like a cone.",
    "[01:41] Then roll it out slightly thick. Even if rolled thin, they taste good but will turn out crispy.",
    "[01:48] If rolled medium thick, the pooris will be soft and juicy.",
    "[01:56] Now, definitely drop the pooris in hot oil and let them puff up well.",
    "[02:02] If the pan is deep, there is more chance for the pooris to puff up. Remember that if you drop pooris before the oil is hot, they will absorb a lot of oil.",
    "[02:08] Now, as soon as you take them out of the oil, drop them into the hot syrup and leave them for 30 seconds.",
    "[02:14] Only if you drop the pooris while hot, they will absorb the syrup well and become juicy.",
    "[02:18] Otherwise, it will just remain as a coating on top.",
    "[02:21] These pooris have one taste when hot, and another taste when cooled down with the sugar syrup forming crystals on top.",
    "[02:28] Both ways, it tastes very very good. Will you definitely try both ways and tell us how they turned out?",
    "[02:34] For ingredients and tips in this recipe, visit the vismaifood.com website.",
    "[02:38] Don't forget to post the picture of what you made on Vismai Food Instagram."
  ]
}