{
  "metadata": {
    "title": "Street Style Pesara Punukulu with Ginger Chutney | పెసర పునుకులు | Moong Dal Fritters Vismai Food",
    "channel_name": "Vismai Food",
    "publish_date": "2019-05-26",
    "view_count": 550000,
    "like_count": 12000,
    "duration": "01:40",
    "language": "Telugu",
    "video_id": "7gX9XqZkXqI",
    "url": "https://www.youtube.com/watch?v=7gX9XqZkXqI",
    "description": "Learn how to make authentic Andhra Street Style Pesara Punukulu (Moong Dal Fritters). These crispy and fluffy fritters are a popular tea-time snack, especially in the Godavari districts, and taste best when served hot with Ginger Chutney.",
    "ingredients_detected": [
      "Moong Dal (Pesara Pappu)",
      "Urad Dal (Minappappu)",
      "Water",
      "Ginger",
      "Salt",
      "Cumin Seeds",
      "Green Chillies",
      "Coriander Leaves",
      "Oil"
    ]
  },
  "transcription_telugu": [
    "[00:00] హలో ఫుడీస్ వెల్కమ్ టు విస్మై ఫుడ్. ఇవాల్టి స్పెషల్ సింపుల్ అండ్ టేస్టీ రెసిపీ పెసర పునుకులు.",
    "[00:06] వేడి వేడిగా అల్లం పచ్చడితో అదరహో అంతే కదా?",
    "[00:10] బయట క్రంచీగా లోపల సాఫ్ట్ గా భలే బాగుంటాయి ఈ పెసర పునుకులు.",
    "[00:14] కోస్టల్ ఆంధ్రా అంతటా ఈ పెసర పునుకులు దొరికినా గోదావరి జిల్లాలో చాలా ఎక్కువగా చేస్తూ ఉంటారు. ఇంకా స్ట్రీట్ ఫుడ్ గా కూడా దొరుకుతుంది.",
    "[00:21] ఇవి చేయడం చాలా తేలిక... లెట్స్ స్టార్ట్.",
    "[00:23] ముందుగా ఓ కప్పు పెసర పప్పు. అందులో రెండు టేబుల్ స్పూన్ల మినప్పప్పు వేసి...",
    "[00:27] బాగా కడిగి మూడు గంటల పైన నాననివ్వండి.",
    "[00:32] మూడు గంటలు నానిన తర్వాత మిక్సీ జార్ లో వేసి పప్పును ఫైన్ గా పేస్ట్ చేసుకోవాలి...",
    "[00:36] నిదానంగా మాత్రమే హై స్పీడ్ మీద అస్సలు చేయకూడదు. మీరు గ్రైండర్ లో గ్రైండ్ చేసుకుంటే సూపర్బ్ గా వస్తాయి పునుకులు.",
    "[00:42] ఇప్పుడు ఇందులో రెండు ఇంచుల అల్లం తరుగు వేసుకోండి... అల్లం కాస్త ఎక్కువ ఉంటే బాగుంటుంది రుచి.",
    "[00:46] సాల్ట్ కూడా వేసి ఫైన్ గా నిదానంగా పేస్ట్ చేసుకోండి. అలా చేసుకుంటేనే చాలా ఫ్లఫీ గా వస్తాయి పునుకులు లేదంటే హార్డ్ గా వస్తాయి.",
    "[00:53] ఇప్పుడు మెత్తగా గ్రైండ్ చేసుకున్న పిండిలో ఓ టీస్పూన్ జీలకర్ర, రెండు పచ్చి మిర్చి తరుగు, కాస్త కొత్తిమీర తరుగు వేసి...",
    "[00:59] బాగా బీట్ చేసుకోవాలి పిండిని ఇది చాలా ఇంపార్టెంట్.",
    "[01:03] ఇప్పుడు నూనె బాగా వేడెక్కాక చేతులు తడి చేసుకుంటూ పునుకులు వేసుకోండి.",
    "[01:07] నూనె బాగా కాగాక మాత్రమే పునుకులు వేసుకోండి లేదంటే నూనె లాగేస్తాయి.",
    "[01:12] పునుకులు అన్నీ వేసాక ఓ రెండు నిమిషాల పాటు హై ఫ్లేమ్ మీద ఫ్రై చేసుకోండి.",
    "[01:16] కాసేపటికి పునుకులు పైకి తేలుతాయి. అప్పుడు నిదానంగా మీడియం ఫ్లేమ్ మీద క్రిస్పీగా అయ్యి గోల్డెన్ బ్రౌన్ కలర్ వచ్చేంతవరకు ఫ్రై చేసుకోండి.",
    "[01:24] ఇవి వేడి వేడిగా చాలా చాలా బాగుంటాయి అల్లం పచ్చడితో.",
    "[01:27] మీకు బండ్ల మీద దొరికేటువంటి అల్లం పచ్చడి రెసిపీ ఛానల్ లో ఉంది దానికోసం కింద ఉన్న డిస్క్రిప్షన్ బాక్స్ చూడండి.",
    "[01:33] ఇంకా ఇలాంటి యమ్మీ రెసిపీస్ కోసం vismaifood.com వెబ్సైట్ విజిట్ చేయడం మర్చిపోకండి."
  ],
  "transcription_english": [
    "[00:00] Hello Foodies, Welcome to Vismai Food. Today's special simple and tasty recipe is Pesara Punukulu (Moong Dal Fritters).",
    "[00:06] Hot hot with ginger chutney is amazing, right?",
    "[00:10] Crunchy outside and soft inside, these moong dal fritters are very good.",
    "[00:14] Although available all over Coastal Andhra, they make it a lot in Godavari districts. It is also available as street food.",
    "[00:21] Making them is very easy... Let's start.",
    "[00:23] First, take one cup of moong dal. Add two tablespoons of urad dal to it...",
    "[00:27] Wash well and let soak for over three hours.",
    "[00:32] After soaking for three hours, transfer to a mixer jar and make a fine paste...",
    "[00:36] Grind slowly only, never on high speed. If you grind in a wet grinder, the fritters come out superbly.",
    "[00:42] Now add two inches of chopped ginger to this... if ginger is a bit more, the taste is good.",
    "[00:46] Add salt too and grind to a fine paste slowly. Only if done like that, the fritters come out very fluffy, otherwise they become hard.",
    "[00:53] Now in the softly ground batter, add one teaspoon cumin seeds, two chopped green chillies, and some chopped coriander...",
    "[00:59] Beat the batter well, this is very important.",
    "[01:03] Now after the oil heats up well, wet your hands and drop the fritters.",
    "[01:07] Add fritters only after the oil is hot, else they absorb oil.",
    "[01:12] After adding all the fritters, fry on high flame for two minutes.",
    "[01:16] After a while, the fritters float to the top. Then slowly fry on medium flame until they become crispy and turn golden brown.",
    "[01:24] These taste very very good hot with ginger chutney.",
    "[01:27] The recipe for the ginger chutney available on street carts is on the channel, for that check the description box below.",
    "[01:33] And for such yummy recipes don't forget to visit vismaifood.com website."
  ]
}