{
  "metadata": {
    "title": "Mango kahdi| మామిడికాయ మజ్జిగచారు|ఉడిపి స్టైల్|పుల్ల పుల్లగా అన్నం లోకి భలే ఉంటుంది ఈ చారు",
    "channel_name": "Vismai Food",
    "publish_date": "2019-05-27",
    "view_count": 60000,
    "like_count": 1300,
    "duration": "01:42",
    "language": "Telugu",
    "video_id": "Unknown",
    "url": "Unknown",
    "description": "Mango Majjiga Charu is a healthy, tasty, and quick recipe with less oil. It is a summer special that is good for health and digestion. This satvic food makes you feel light after eating. It goes well with rice and even spicy dosas.",
    "ingredients_detected": [
      "Raw Mango",
      "Fresh Coconut",
      "Green Chillies",
      "Curry Leaves",
      "Water",
      "Curd",
      "Salt",
      "Oil",
      "Fenugreek Seeds",
      "Asafoetida",
      "Mustard Seeds",
      "Dry Red Chillies"
    ]
  },
  "transcription_telugu": [
    "[00:00] హలో ఫుడీస్, వెల్కమ్ టు విస్మై ఫుడ్. ఇవాల్టి స్పెషల్ హెల్తీ టేస్టీ మామిడికాయ మజ్జిగ చారు.",
    "[00:05] పుల్ల పుల్లగా ఆహా భలే ఉంటుంది ఇది.",
    "[00:08] ఇది యాక్చువల్ గా అన్నం లోకి చాలా బాగుంటుంది. కానీ నాకు మాత్రం కారప్పొడి అట్ల లోకి సూపర్భ్ గా ఉంటుంది అనిపిస్తుంది.",
    "[00:14] అబ్బో మాటల్లో చెప్పలేనంత బాగుంటుంది నాకైతే ఇది.",
    "[00:17] మస్ట్ ట్రై రెసిపీ ఇది. లెట్స్ స్టార్ట్.",
    "[00:20] ముందుగా జార్ లో ఓ పుల్లటి పచ్చి మామిడికాయ తురుము వేసుకోండి.",
    "[00:23] అందులో అర కప్పు పచ్చి కొబ్బరి, ఐదు పచ్చిమిర్చి, రెండు రెబ్బల కరివేపాకు వేసి కాసిన్ని నీళ్ళతో ఫైన్ గా పేస్ట్ చేసుకోండి.",
    "[00:30] ఇప్పుడు అర లీటర్ కమ్మటి పెరుగునే తీసుకోండి.",
    "[00:33] ఇందులో సాల్ట్ వేసి ఎక్కడా గడ్డలు లేకుండా బాగా చిలుక్కోండి.",
    "[00:38] ఇప్పుడు గ్రైండ్ చేసుకున్నటువంటి మామిడికాయ మిక్స్చర్ వేసి బాగా కలుపుకోండి.",
    "[00:42] ఇది సాత్విక ఆహారం. అరుగుదల చాలా బాగుంటుంది. బాడీ కి చాలా తేలికగా అనిపిస్తుంది తిన్న తర్వాత కూడా.",
    "[00:50] ఇప్పుడు రెండు టేబుల్ స్పూన్ల నూనెను వేడి చేసుకొని, అర చెంచా మెంతులు, పావు చెంచా ఇంగువ, అర టీ స్పూన్ ఆవాలు వేసి చిటపటమనిపించండి.",
    "[00:57] ఫ్రెండ్స్ మీరెప్పుడైనా నిజమైన ఇంగువ చూసారా? నేను మీకు మరో వీడియోలో చూపిస్తాను. హైదరాబాద్ లో ఎక్కడ దొరుకుతుందో ఆ షాప్ పేరు కూడా చెప్తాను. మా ఇంట్లో ఆ ఇంగువనే వాడతాం.",
    "[01:06] ఇప్పుడు మీరు వీడియోలో చూస్తున్నది అందరికీ అవైలబుల్ గా ఉండేటువంటి ఇంగువలో ఏవేవో కలిపేసి డైల్యూట్ చేసినటువంటి ఇంగువ. ఒరిజినల్ ఇంగువ అసలు అలా ఉండనే ఉండదు. అవన్నీ నేను మరో వీడియోలో చెప్తాను.",
    "[01:17] ఇప్పుడు రెండు ఎండుమిర్చి, ఓ రెబ్బ కరివేపాకు వేసి బాగా వేయించుకొని పెరుగు మిక్స్చర్ లో కలుపుకోండి.",
    "[01:22] ఇది మేము థిక్ గా చేసాం. కావాలనుకుంటే మీరు పల్చగా కూడా చేసుకోవచ్చు. నచ్చితే మిరియాలు, అల్లం కూడా గ్రైండ్ చేసేటప్పుడు వేసుకోవచ్చు.",
    "[01:29] నచ్చిందా? కచ్చితంగా నచ్చి తీరుతుంది. చాలా చాలా బాగుంటుంది.",
    "[01:33] మీరు ట్రై చేసి మీకు ఎలా కుదిరిందో కచ్చితంగా ఆ పిక్ ని విస్మై ఫుడ్ ఇన్స్టాగ్రామ్ లో పోస్ట్ చేయండి. మరిన్ని యమ్మీ రెసిపీస్ కోసం vismaifood.com వెబ్సైట్ విజిట్ చేయడం అస్సలు మర్చిపోకండి."
  ],
  "transcription_english": [
    "[00:00] Hello Foodies, Welcome to Vismai Food. Today's special is healthy and tasty Mango Buttermilk Stew.",
    "[00:05] It tastes tangy and aha, it is just great.",
    "[00:08] It is actually very good with rice. But I feel it tastes superb with spicy dosa (karappodi atlu).",
    "[00:14] Oh, words can't describe how good it tastes to me.",
    "[00:17] This is a must-try recipe. Let's start.",
    "[00:20] First, add grated sour raw mango into a jar.",
    "[00:23] Add half a cup of fresh coconut, five green chilies, two sprigs of curry leaves, and grind into a fine paste with some water.",
    "[00:30] Now take half a liter of fresh/tasty curd.",
    "[00:33] Add salt to it and whisk it well without any lumps.",
    "[00:38] Now add the ground mango mixture and mix well.",
    "[00:42] This is a satvic food. Digestion is very good. The body feels very light even after eating.",
    "[00:50] Now heat two tablespoons of oil, add half a teaspoon of fenugreek seeds, quarter teaspoon of asafoetida, half a teaspoon of mustard seeds and let them splutter.",
    "[00:57] Friends, have you ever seen real asafoetida? I will show you in another video. I will also tell you the shop name where it is available in Hyderabad. We use that asafoetida in our home.",
    "[01:06] What you are seeing in the video now is the diluted asafoetida mixed with other things available to everyone. Original asafoetida won't be like that at all. I will tell you all that in another video.",
    "[01:17] Now add two dry red chilies, a sprig of curry leaves, fry well and add to the curd mixture.",
    "[01:22] We made this thick. If you want, you can make it thinner. If you like, you can also add pepper and ginger while grinding.",
    "[01:29] Did you like it? You will definitely like it. It tastes very very good.",
    "[01:33] Do try it and definitely post the pic on Vismai Food Instagram sharing how it turned out for you. Don't forget to visit vismaifood.com website for more yummy recipes."
  ]
}