{
  "metadata": {
    "title": "#stuffedBrinjal| వంకాయ వెల్లులి కారం| ఈ విధంగా ఓ సారి ట్రై చేసి చుడండి మళ్ళీ పాత పద్ధతి జోలికిపోరు",
    "channel_name": "Vismai Food",
    "publish_date": "2018-10-20",
    "view_count": 1523831,
    "like_count": 14854,
    "duration": "02:12",
    "language": "Telugu",
    "video_id": "WHSUT-c89uc",
    "url": "https://www.youtube.com/watch?v=WHSUT-c89uc",
    "description": "Rayalaseema special Stuffed Brinjal (Vankaya Vellulli Karam) recipe by Vismai Food.",
    "ingredients_detected": [
      "1 tsp Oil (for roasting)",
      "7-8 Dry Red Chillies",
      "2 tsps Coriander seeds",
      "2 tbsps Peanuts",
      "1 tbsp Chana dal",
      "1 tbsp Urad dal",
      "10-12 Garlic pods",
      "7-8 Tender Brinjals",
      "Oil (for frying brinjals)",
      "Salt (to taste)",
      "1/4 Cup Oil (for cooking)",
      "2 tbsps Ghee"
    ]
  },
  "transcription_telugu": [
    "[00:00:00.000] హలో ఫుడీస్, వెల్కమ్ టు విస్మయ్ ఫుడ్. ఇవాల్టి స్పెషల్ రాయలసీమ వెడ్డింగ్ స్పెషల్ వంకాయ వెల్లుల్లి కారం.",
    "[00:00:21.000] ముందుగా స్టఫ్ఫింగ్ కోసం ఒక టీస్పూన్ ఆయిల్ హీట్ చేసి, అందులో 7-8 ఎండుమిర్చి వేసి రెండు మూడు నిమిషాలు మీడియం ఫ్లేమ్ మీద రోస్ట్ చేయండి.",
    "[00:00:30.000] ఇందులో రెండు టీస్పూన్ల ధనియాలు, రెండు టేబుల్ స్పూన్ల వేరుశనగ పప్పు, ఒక టేబుల్ స్పూన్ శనగపప్పు, ఒక టేబుల్ స్పూన్ మినప్పప్పు వేయండి.",
    "[00:00:37.000] అలాగే 10-12 వెల్లుల్లి రెబ్బలు వేసి లో ఫ్లేమ్ మీద మంచి సువాసన వచ్చే వరకు ఫ్రై చేసి చల్లారనివ్వండి.",
    "[00:00:46.000] చల్లారాక మిక్సీ జార్ లో వేసి మెత్తని పౌడర్ లా గ్రైండ్ చేసుకోవాలి.",
    "[00:00:54.000] ఇప్పుడు 7-8 లేత వంకాయల్ని తీసుకుని రెండు పక్కల గాట్లు పెట్టుకోండి. లేత వంకాయలైతే కూర చాలా రుచిగా ఉంటుంది.",
    "[00:01:05.000] వీటిని వేడి నూనెలో వేసి మీడియం ఫ్లేమ్ మీద బాగా మగ్గించుకోవాలి. వంకాయ సాఫ్ట్ గా అయ్యాక తీసి పక్కన పెట్టుకోండి.",
    "[00:01:17.000] గ్రైండ్ చేసిన పౌడర్ లో ఉప్పు కలిపి, మగ్గించిన వంకాయల్లో జాగ్రత్తగా స్టఫ్ చేయండి. మిగిలిన పొడిని పక్కన ఉంచండి.",
    "[00:01:37.000] కడాయిలో పావు కప్పు ఆయిల్ హీట్ చేసి, స్టఫ్ చేసిన వంకాయలు, మిగిలిన పొడిని వేయండి.",
    "[00:01:49.000] ఇప్పుడు రెండు టేబుల్ స్పూన్ల నెయ్యి వేసి లో ఫ్లేమ్ మీద మూడు నాలుగు నిమిషాలు ఫ్రై చేయండి. నెయ్యి వల్ల మంచి అరోమా వస్తుంది.",
    "[00:01:58.000] వేడివేడి అన్నంలో ఈ వంకాయ వెల్లుల్లి కారం అద్భుతంగా ఉంటుంది. తప్పకుండా ట్రై చేయండి."
  ],
  "transcription_english": [
    "[00:00:00.000] Hello Foodies, welcome to Vismai Food. Today's special is Rayalaseema wedding special Stuffed Brinjal with Garlic (Vankaya Vellulli Karam).",
    "[00:00:21.000] For the stuffing, heat 1 tsp oil and roast 7-8 dry red chillies on medium flame for 2-3 minutes.",
    "[00:00:30.000] Add 2 tsps coriander seeds, 2 tbsps peanuts, 1 tbsp chana dal, and 1 tbsp urad dal.",
    "[00:00:37.000] Add 10-12 garlic pods and roast on low flame until aromatic, then let it cool down.",
    "[00:00:46.000] Once cooled, grind it into a fine powder in a mixer jar.",
    "[00:00:54.000] Take 7-8 tender brinjals and make slits on two sides. Using tender brinjals makes the curry taste better.",
    "[00:01:05.000] Fry them in hot oil on medium flame until they are soft. Once cooked, set them aside.",
    "[00:01:17.000] Mix salt into the ground powder and carefully stuff it into the fried brinjals. Keep the remaining powder aside.",
    "[00:01:37.000] Heat 1/4 cup oil in a pan, add the stuffed brinjals and the leftover powder.",
    "[00:01:49.000] Add 2 tbsps of ghee and fry on low flame for 3-4 minutes. Ghee adds a wonderful aroma to the dish.",
    "[00:01:58.000] This Stuffed Brinjal tastes amazing with hot rice. Do try this at home."
  ]
}