{
  "metadata": {
    "title": "Masala Chaas|మసాలా మజ్జిగ| మా కొలతల్లో ఓ సారి మసాలా మజ్జిగ చేసి చూడండి ఎంతో రుచిగా ఉంటుంది",
    "channel_name": "Vismai Food",
    "publish_date": "2019-05-29",
    "view_count": 1200000,
    "like_count": 3200,
    "duration": "01:08",
    "language": "Telugu",
    "video_id": "Unknown",
    "url": "https://www.youtube.com/watch?v=Unknown",
    "description": "Masala Majjiga or Masala Chaas is a perfect summer drink to beat the heat. This spiced buttermilk recipe by Vismai Food uses fresh herbs like mint and coriander along with ginger and roasted cumin powder to create a refreshing and healthy beverage that aids digestion and cools the body.",
    "ingredients_detected": [
      "Coriander Leaves",
      "Mint Leaves",
      "Ginger",
      "Green Chilli",
      "Black Salt",
      "Roasted Cumin Powder",
      "Salt",
      "Lemon Juice",
      "Curd",
      "Water"
    ]
  },
  "transcription_telugu": [
    "[00:00] హలో ఫుడీస్, వెల్కమ్ టు విస్మై ఫుడ్. ఇవాల్టి స్పెషల్ మసాలా మజ్జిగ.",
    "[00:04] ఈ ఎండాకాలానికి పర్ఫెక్ట్ డ్రింక్.",
    "[00:06] రెండు మూడు లీటర్లు చేసుకుని ఫ్రిడ్జ్ లో పెట్టుకుని ఆరారా తాగుతుంటే శరీరం చల్లబడుతుంది, ఆరాటం లేకుండా హాయిగా ఉంటుంది ఎండాకాలం. లెట్స్ స్టార్ట్.",
    "[00:13] మిక్సీ జార్ లో పావు కప్పు కొత్తిమీర తరుగు.",
    "[00:16] పావు కప్పు పుదీనా తరుగు.",
    "[00:18] అర ఇంచ్ అల్లం తరుగు.",
    "[00:20] ఓ పచ్చిమిర్చి.",
    "[00:22] అర టీస్పూన్ బ్లాక్ సాల్ట్.",
    "[00:25] ముప్పావు చెంచా వేయించిన జీలకర్ర పొడి ఖచ్చితంగా వేయాలి.",
    "[00:28] సాల్ట్.",
    "[00:29] రెండు టీస్పూన్ల నిమ్మరసం వేసి ముందు ఫైన్ గా గ్రైండ్ చేసుకోండి.",
    "[00:34] ఆ తర్వాత అర లీటర్ కమ్మటి మీగడ లేని పెరుగును వేసుకోండి.",
    "[00:38] అందులో ఒకటింపావు లీటర్ల నీళ్లు పోసుకుని హై స్పీడ్ మీద బ్లెండ్ చేసుకోండి.",
    "[00:41] ఆయుర్వేద పరంగా పర్ఫెక్ట్ మజ్జిగ అంటే ఒకటికి నాలుగు నీళ్లు అని చెప్తుంది.",
    "[00:45] నేను ఒకటికి రెండున్నర తీసుకున్నాను.",
    "[00:47] మీకు నచ్చితే అలా కూడా చేసుకోవచ్చు ఇంగ్రిడియంట్స్ అవి అడ్జస్ట్ చేసుకుని.",
    "[00:50] ఇమ్మీడియట్ గా తాగితే ఆ ఫ్రెష్నెస్ భలేగా ఉంటుంది.",
    "[00:53] ఈ ఎండాకాలం బ్రేక్ఫాస్ట్, లంచ్, డిన్నర్ వేళల్లో గ్లాస్ చొప్పున తాగండి ఎంత హాయిగా ఉంటుందో మీరే చూస్తారు.",
    "[00:58] నచ్చిందా? మరైతే మీరు ట్రై చేసి మీకు ఎలా కుదిరిందో కచ్చితంగా ఆ పిక్ ని విస్మై ఫుడ్ ఇన్స్టాగ్రామ్ లో పోస్ట్ చేయండి.",
    "[01:03] మరిన్ని రెసిపీస్ కోసం vismaifood.com వెబ్సైట్ విజిట్ చేయడం మర్చిపోకండి."
  ],
  "transcription_english": [
    "[00:00] Hello Foodies, Welcome to Vismai Food. Today's special is Masala Majjiga (Spiced Buttermilk).",
    "[00:04] It is the perfect drink for this summer.",
    "[00:06] If you make two to three liters, keep it in the fridge, and drink it leisurely, your body cools down, and the summer feels comfortable without any restlessness. Let's start.",
    "[00:13] In a mixer jar, add a quarter cup of chopped coriander.",
    "[00:16] A quarter cup of chopped mint leaves.",
    "[00:18] Half an inch of chopped ginger.",
    "[00:20] One green chili.",
    "[00:22] Half a teaspoon of black salt.",
    "[00:25] Three-quarters of a teaspoon of roasted cumin powder, you must add this.",
    "[00:28] Salt.",
    "[00:29] Add two teaspoons of lemon juice and grind it finely first.",
    "[00:34] Then add half a liter of fresh, tasty curd without cream.",
    "[00:38] Add one and a quarter liters of water to it and blend on high speed.",
    "[00:41] According to Ayurveda, perfect buttermilk means one part curd to four parts water.",
    "[00:45] I took a ratio of one to two and a half.",
    "[00:47] If you like, you can do that too by adjusting the ingredients.",
    "[00:50] If you drink it immediately, the freshness is wonderful.",
    "[00:53] Drink a glass during breakfast, lunch, and dinner this summer, and you will see how pleasant it feels.",
    "[00:58] Did you like it? Then try it and definitely post the picture on Vismai Food Instagram sharing how it turned out for you.",
    "[01:03] Don't forget to visit the vismaifood.com website for more recipes."
  ]
}