{
  "metadata": {
    "title": "Raw Mango Raw Rasam| పచ్చి మామిడికాయ పచ్చి పులుసు|మా స్టైల్ లో మామిడికాయతో పచ్చిపులుసు సూపర్",
    "channel_name": "Vismai Food",
    "publish_date": "2019-05-31",
    "view_count": 234000,
    "like_count": 3200,
    "duration": "01:46",
    "language": "Telugu",
    "video_id": "vXFjH6MDit8",
    "url": "https://www.youtube.com/watch?v=vXFjH6MDit8",
    "description": "This Raw Mango Pachi Pulusu is a traditional summer special recipe from Telugu cuisine, specifically popular in Telangana and Rayalaseema. Unlike the regular tamarind-based raw stew, this version uses roasted raw mango pulp for a unique smoky and tangy flavor.",
    "ingredients_detected": [
      "Sour Raw Mango",
      "Water",
      "Onion",
      "Jaggery",
      "Salt",
      "Oil",
      "Dry Red Chillies",
      "Asafoetida",
      "Mustard Seeds",
      "Cumin Seeds",
      "Green Chillies",
      "Curry Leaves",
      "Coriander Leaves"
    ]
  },
  "transcription_telugu": [
    "[00:00] హలో ఫుడీస్, వెల్కమ్ టు విస్మై ఫుడ్. ఇవాల్టి స్పెషల్ పచ్చి మామిడికాయ పచ్చి పులుసు.",
    "[00:05] తెలుగు రాష్ట్రాల్లో పచ్చి పులుసు అంటే ప్రాణం పెట్టేస్తారు అందరూ. అందున తెలంగాణ, రాయలసీమ ప్రాంతాల్లో అయితే ఇంకాస్త ఎక్కువ.",
    "[00:11] ఇవాళ మీరు తెలుసుకోబోయే పచ్చి పులుసుకి, చింతపండుతో రెగ్యులర్ గా పెట్టేటువంటి పచ్చి పులుసుకి రుచిలో ఎక్కడా పోలిక ఉండదు.",
    "[00:17] ఇది చాలా చాలా బాగుంటుంది, చాలా డిఫరెంట్ గా ఉంటుంది. లెట్స్ స్టార్ట్.",
    "[00:20] ముందుగా ఓ పుల్లటి పచ్చి మామిడికాయ పొయ్యి మీద పెట్టి బాగా కాల్చండి.",
    "[00:24] కాయ పగిలి నీరు బయటకి కారుతూ, కాయ నల్లగా మారిపోయేంత వరకు నిదానంగా సిమ్ లో కాల్చుకోండి తిప్పుతూ.",
    "[00:30] ఇప్పుడు ఈ కాలిన కాయని చన్నీళ్లలో వేసి, పైన చెక్కుని తీసేయండి.",
    "[00:39] ఇప్పుడు 350 ml నీళ్లు పోసుకొని, ఈ చెక్కు తీసిన మామిడికాయని వేసి గట్టిగ పిండుతూ గుజ్జునంతా తీసేయండి.",
    "[00:51] ఎక్కడైనా మామిడికాయ గడ్డలుగా మిగిలిపోతే దాన్ని చేత్తో మెత్తగా మెదిపేసేయండి.",
    "[00:55] తర్వాత ఓ ఉల్లిపాయ తరుగు, పులుపుని బాలన్స్ చెయ్యడానికి ఓ టేబుల్ స్పూన్ బెల్లం గడ్డ, సాల్ట్ వేసి బాగా కలుపుకోండి.",
    "[01:07] ఇప్పుడు తాలింపు కోసం రెండు టీస్పూన్ల నూనెను వేడి చేసి, అందులో రెండు ఎండుమిర్చి, పావు చెంచా ఇంగువ, అర టీస్పూన్ ఆవాలు, అర టీస్పూన్ జీలకర్ర వేసి వేయించుకోండి.",
    "[01:17] ఆ తర్వాత రెండు పచ్చిమిర్చి చీలికలు, ఓ రెబ్బ కరివేపాకు, కాస్త కొత్తిమీర తరుగు వేసి తాలింపుని బాగా వేపుకోండి.",
    "[01:26] తాలింపుని వేపుకున్నాక పులుసులో వేసి కలిపేయండి.",
    "[01:30] ఇది స్మోకీ ఫ్లేవర్ తో భలే ఉంటుంది పుల్ల పుల్లగా.",
    "[01:33] గ్లాస్ లో పోసుకొని తాగుతారు అంటే కూడా ఆశ్చర్యం కాదు నిజంగా అంత బాగుంటుంది. అందరూ చాలా ఎంజాయ్ చేస్తారు.",
    "[01:38] సో మీరు ట్రై చేసి మీకు ఎలా కుదిరిందో చెప్పండి. ఇలాంటి మరిన్ని రెసిపీస్ కోసం vismaifood.com వెబ్సైట్ విజిట్ చేయడం అస్సలు మర్చిపోకండి."
  ],
  "transcription_english": [
    "[00:00] Hello Foodies, Welcome to Vismai Food. Today's special is Raw Mango Raw Stew (Pachi Pulusu).",
    "[00:05] People in Telugu states love Pachi Pulusu dearly. Especially in Telangana and Rayalaseema regions, it is loved even more.",
    "[00:11] The raw stew you are going to learn today has no comparison in taste with the regular tamarind Pachi Pulusu.",
    "[00:17] This is very very good and very different. Let's start.",
    "[00:20] First, place a sour raw mango on the stove and roast it well.",
    "[00:24] Roast it slowly on sim, turning it around, until the mango cracks, juices ooze out, and the skin turns black.",
    "[00:30] Now put this roasted mango in cold water and peel off the skin.",
    "[00:39] Now pour 350 ml of water, add this peeled mango, squeeze it hard and extract all the pulp.",
    "[00:51] If there are any mango lumps left, mash them softly with your hand.",
    "[00:55] Then add one chopped onion, a tablespoon of jaggery to balance the sourness, and salt, and mix well.",
    "[01:07] Now for tempering, heat two teaspoons of oil, add two dry red chilies, a quarter spoon of asafoetida, half a teaspoon of mustard seeds, and half a teaspoon of cumin seeds and fry.",
    "[01:17] After that, add two slit green chilies, a sprig of curry leaves, and some chopped coriander, and fry the tempering well.",
    "[01:26] Once the tempering is fried, add it to the stew and mix.",
    "[01:30] This tastes amazing with a smoky flavor and tanginess.",
    "[01:33] It wouldn't be a surprise if people drink it in a glass, it's truly that good. Everyone will enjoy it a lot.",
    "[01:38] So you try it and tell us how it turned out. Don't forget to visit vismaifood.com for more such recipes."
  ]
}