{
  "metadata": {
    "title": "Muslim Style Kuska Rice Recipe In Telugu | Plain Biryani | Bagara Rice | Vismai Food",
    "channel_name": "Vismai Food",
    "publish_date": "2019-06-04",
    "view_count": 2500000,
    "like_count": 65000,
    "duration": "03:08",
    "language": "Telugu",
    "video_id": "9K_g8qg_y9E",
    "url": "https://www.youtube.com/watch?v=9K_g8qg_y9E",
    "description": "Eid Special Kuska Rice recipe in Telugu. This Muslim-style plain biryani, also known as Kuska or Empty Biryani, is a famous dish in Tamil Nadu and at weddings. It is aromatic and flavorful, pairing perfectly with any non-veg curry or simple raita.",
    "ingredients_detected": [
      "Ghee",
      "Cinnamon",
      "Cardamom",
      "Cloves",
      "Star Anise",
      "Nutmeg",
      "Cumin Seeds",
      "Fennel Seeds",
      "Bay Leaf",
      "Onion",
      "Green Chillies",
      "Ginger Garlic Paste",
      "Turmeric",
      "Chilli Powder",
      "Tomatoes",
      "Garam Masala",
      "Salt",
      "Curd",
      "Coriander Leaves",
      "Mint Leaves",
      "Basmati Rice",
      "Water"
    ]
  },
  "transcription_telugu": [
    "[00:00] హలో ఫుడీస్, వెల్కమ్ టు విస్మై ఫుడ్. ఇవాల్టి స్పెషల్ కుస్కా.",
    "[00:05] కానీ నేను మీకు ఇది ఈద్ స్పెషల్ గా పోస్ట్ చేస్తున్నాను.",
    "[00:08] ఇది మీకు తమిళ్ నాడు లో చాలా చాలా ఫేమస్, లైక్ బగారా అన్నం లెక్క.",
    "[00:12] ఏ ఫంక్షన్ కైనా నాన్ వెజిటేరియన్ ఉంటే ఇది ఉండాల్సిందే.",
    "[00:15] అబ్బా గుమగుమలాడిపోతుంది అంతే దీని అరోమా.",
    "[00:17] ఇది ఏ నాన్ వెజ్ కర్రీ తో అయినా లేదంటే ఆనియన్ కుకుంబర్ రైతా తో పర్ఫెక్ట్ గా సూట్ అయిపోతుంది. చాలా చాలా బాగుంటుంది.",
    "[00:23] లెట్స్ స్టార్ట్ ది బెస్ట్ కుస్కా.",
    "[00:26] ముందుగా ప్రెషర్ కుక్కర్ లో మూడు టేబుల్ స్పూన్ల నెయ్యిని కరిగించుకోండి.",
    "[00:29] ఇందులో హోల్ స్పైసెస్ అంటే ఇంచు దాల్చిన చెక్క, మూడు యాలకులు, నాలుగు లవంగాలతో పాటు...",
    "[00:34] కచ్చితంగా అనాస పువ్వు, పావు ఇంచు కంటే చిన్న ముక్క జాజికాయ వేసి తీరాలి.",
    "[00:39] లేదంటే అది కుస్కా కానే కాదు, మీకు నేను చెప్పిన అరోమా రానే రాదు.",
    "[00:43] వీటిని చక్కగా వేపుకొని ఓ టీస్పూన్ జీలకర్ర, ఓ టీస్పూన్ సోంపు, ఓ బిర్యానీ ఆకు వేసి ఓ నిమిషం పాటు ఫ్రై చేసుకోండి.",
    "[00:53] ఆ తర్వాత ఉల్లిపాయ సన్నని తరుగు, మూడు పచ్చిమిర్చి చీలికలు వేసి ఆనియన్స్ గోల్డెన్ బ్రౌన్ కలర్ వచ్చేంతవరకు ఫ్రై చేసుకోవాలి.",
    "[01:03] ఆనియన్స్ లైట్ గోల్డెన్ బ్రౌన్ కలర్ రాగానే ఓ టీస్పూన్ ఫ్రెష్ గా రుబ్బుకున్నటువంటి అల్లం వెల్లుల్లి పేస్ట్ వేసి బాగా ఫ్రై చేసుకోండి.",
    "[01:13] ఇప్పుడు పావు చెంచా పసుపు, ఓ టీస్పూన్ కారం వేసి బాగా ఫ్రై చేసుకోండి.",
    "[01:17] ఇది ఎప్పుడైనా మీరు వీకెండ్స్ కి లేదంటే స్పెషల్ అకేషన్స్ అప్పుడు ట్రై చేసి చూడండి.",
    "[01:20] వీకెండ్ కి ఆ అకేషన్ కి న్యాయం చేసిన వాళ్ళు అవుతారు, అంత పర్ఫెక్ట్ గా వస్తుంది ఈ రెసిపీ.",
    "[01:27] ఇప్పుడు రెండు పండిన టమాటో ముక్కలు వేసి టమాటోస్ మెత్తగా పేస్ట్ అయిపోయేంత వరకు కుక్ చేసుకోండి.",
    "[01:35] ఇప్పుడు అర టీస్పూన్ విస్మై ఫుడ్ స్పెషల్ గరం మసాలా వేసుకోండి.",
    "[01:38] ఈ స్పెషల్ గరం మసాలా కోసం విస్మై ఫుడ్ ఛానల్ విజిట్ చేయండి లేదంటే డిస్క్రిప్షన్ బాక్స్ లో లింక్ చూడండి.",
    "[01:43] ఇప్పుడు సాల్ట్, అర కప్పు కమ్మటి పెరుగు వేసుకొని బాగా కలుపుకోండి.",
    "[01:47] పెరుగులోని నీరు ఇగిరిపోయి నూనె పైకి తేలాలి, అందాక కుక్ చేసుకోండి మీడియం ఫ్లేమ్ మీద.",
    "[01:56] ఇప్పుడు అరకట్ట కొత్తిమీర తరుగు కాడలతో సహా వేసుకోండి, చిన్న కట్ట పుదీనా తరుగు వేసి బాగా కలుపుకోండి.",
    "[02:03] ఆ తర్వాత ఓ కప్పు గంట సేపు నానబెట్టినటువంటి బాస్మతి బియ్యం వడకట్టుకొని వేసుకోండి.",
    "[02:08] బియ్యం వేసి రెండు నిమిషాల పాటు హై ఫ్లేమ్ మీద బియ్యం విరక్కుండా అట్లకాడతో కలుపుకోండి.",
    "[02:15] బియ్యం కాస్త పొడిపొడిగా అయ్యాక కప్పు నీళ్లు పోసుకోండి.",
    "[02:19] కేవలం హై ఫ్లేమ్ మీద మాత్రమే ఓ విజిల్ రానివ్వండి.",
    "[02:24] ఓ విజిల్ వచ్చాక స్టవ్ ఆఫ్ చేసేసి 20 నిమిషాల పాటు వదిలేయండి.",
    "[02:28] ఆ తర్వాత అడుగు నుండి అట్లకాడతో కలుపుకోండి.",
    "[02:31] వేడి మీద కాస్త చెమ్మగా అనిపిస్తుంది కానీ చల్లారాక బాగా పొడిపొడిగా వస్తుంది.",
    "[02:35] ఇదే మీరు నార్మల్ రైస్ తో చేస్తే ఒకటికి ఒకటి ముప్పావు నీళ్లు పోసుకోవాలి, గంట సేపు నానబెట్టాలి బియ్యాన్ని.",
    "[02:41] ఇది మీరు వండుతుంటే వీధి చివర వరకు దీని అరోమా రీచ్ అవ్వడం ఖాయం.",
    "[02:45] అంత బాగుంటుంది, కానీ నేను చెప్పినటువంటి మసాలాలు వేస్తేనే.",
    "[02:49] మీకు నచ్చిందా? మరైతే vismaifood.com వెబ్సైట్ విజిట్ చేసి రెసిపీని పూర్తిగా ఒకసారి జాగ్రత్తగా చదువుకొని చేయండి, పర్ఫెక్ట్ రెసిపీని ఎంజాయ్ చేయండి.",
    "[02:56] మీరు రెసిపీ తయారు చేసాక ఆ పిక్ ని విస్మై ఫుడ్ ఇన్స్టాగ్రామ్ లో పోస్ట్ చేయడం అస్సలు మర్చిపోకండి."
  ],
  "transcription_english": [
    "[00:00] Hello Foodies, Welcome to Vismai Food. Today's special is Kuska.",
    "[00:05] But I am posting this as an Eid Special.",
    "[00:08] This is very famous in Tamil Nadu, similar to Bagara Rice.",
    "[00:12] For any function, if there is non-vegetarian food, this dish has to be there.",
    "[00:15] Oh, the aroma is just intoxicating.",
    "[00:17] This suits perfectly with any non-veg curry or onion cucumber raita. It tastes very very good.",
    "[00:23] Let's start the best Kuska.",
    "[00:26] First, melt 3 tablespoons of ghee in a pressure cooker.",
    "[00:29] Add whole spices: 1 inch cinnamon stick, 3 cardamoms, 4 cloves...",
    "[00:34] Along with definitely star anise, and a piece smaller than a quarter inch of nutmeg. You must add these.",
    "[00:39] Otherwise, it won't be Kuska, and you won't get the aroma I mentioned.",
    "[00:43] Fry them nicely, then add 1 teaspoon cumin seeds, 1 teaspoon fennel seeds, 1 bay leaf and fry for a minute.",
    "[00:53] Then add finely chopped onion, 3 slit green chillies and fry until the onions turn golden brown.",
    "[01:03] Once the onions turn light golden brown, add 1 teaspoon of freshly ground ginger garlic paste and fry well.",
    "[01:13] Now add 1/4 teaspoon turmeric, 1 teaspoon chilli powder and fry well.",
    "[01:17] Try this on weekends or special occasions.",
    "[01:20] You will do justice to the weekend and the occasion, the recipe turns out that perfect.",
    "[01:27] Now add 2 chopped ripe tomatoes and cook until the tomatoes become a soft paste.",
    "[01:35] Now add 1/2 teaspoon Vismai Food Special Garam Masala.",
    "[01:38] For this special Garam Masala, visit the Vismai Food channel or check the link in the description box.",
    "[01:43] Now add salt, half a cup of fresh tasty curd and mix well.",
    "[01:47] Cook on medium flame until the water in the curd evaporates and oil floats on top.",
    "[01:56] Now add half a bunch of chopped coriander along with stalks, and a small bunch of chopped mint and mix well.",
    "[02:03] After that, add one cup of Basmati rice that has been soaked for an hour and drained.",
    "[02:08] Add the rice and mix gently with a flat ladle on high flame for two minutes without breaking the grains.",
    "[02:15] Once the rice becomes slightly dry, add one cup of water.",
    "[02:19] Let it whistle just once on high flame.",
    "[02:24] After one whistle, turn off the stove and leave it for 20 minutes.",
    "[02:28] Then mix from the bottom using a flat ladle.",
    "[02:31] It might feel slightly moist when hot, but it becomes very fluffy once cooled.",
    "[02:35] If you do this with normal rice, you need to add 1.75 cups of water for 1 cup of rice and soak the rice for an hour.",
    "[02:41] While you are cooking this, it is certain that its aroma will reach the end of the street.",
    "[02:45] It tastes that good, but only if you add the spices I mentioned.",
    "[02:49] Did you like it? Then visit the vismaifood.com website, read the recipe carefully once and make it, enjoy the perfect recipe.",
    "[02:56] Don't forget to post the pic on Vismai Food Instagram after making the recipe."
  ]
}