{
  "metadata": {
    "title": "Gongura Endu Royyalu Curry In Telugu | గోంగూర ఎండు రొయ్యలు | Andhra Style Dry Prawns With Gongura",
    "channel_name": "Vismai Food",
    "publish_date": "2019-06-05",
    "view_count": 1000000,
    "like_count": 20000,
    "duration": "02:41",
    "language": "Telugu",
    "video_id": "s5J2Q8y7X0Q",
    "url": "https://www.youtube.com/watch?v=s5J2Q8y7X0Q",
    "description": "Vismai Food brings you the authentic Andhra style Gongura Endu Royyalu (Dry Prawns with Sorrel Leaves) recipe. This spicy and tangy curry is a favorite among non-veg lovers in Telugu states. Follow our tips to get the perfect taste and texture.",
    "ingredients_detected": [
      "Dry Prawns",
      "Water",
      "Oil",
      "Mustard seeds",
      "Cumin seeds",
      "Chana dal",
      "Urad dal",
      "Onion",
      "Curry leaves",
      "Turmeric",
      "Ginger Garlic paste",
      "Gongura Leaves (Red Sorrel Leaves)",
      "Salt",
      "Chilli Powder",
      "Garam Masala"
    ]
  },
  "transcription_telugu": [
    "[00:00] హలో ఫుడీస్ వెల్కమ్ టు విస్మై ఫుడ్. ఇవాల్టి స్పెషల్ ఎండు రొయ్యల గోంగూర.",
    "[00:05] అసలు సిసలు ఆంధ్రా వంటకం. భలేగా ఉంటుంది కదా?",
    "[00:09] ఏంటో ఈ ఎండు రొయ్యల్ని ఏ కాయైనా కూరైనా వేసి అంత ఉప్పేసి వండినా చాలు లొట్టలేసుకుంటూ తినేయొచ్చు అంత బాగుంటుంది కదా.",
    "[00:15] కానీ నాకు మాత్రం గోంగూర రొయ్యలు అంటే మహా ఇష్టం.",
    "[00:18] మా స్టైల్ లో ఇవాళ గోంగూర ఎండు రొయ్యలు చూపిస్తాను. లెట్స్ స్టార్ట్ గోంగూర ఎండు రొయ్యల కర్రీ.",
    "[00:23] ముందుగా 200 గ్రాముల ఎండు రొయ్యలు తీసుకొని ప్రతి రొయ్యకి తలా తోక తీసేయండి. ఇలా అన్నీ శుభ్రం చేసుకోవాలి.",
    "[00:35] ఇప్పుడు అర లీటర్ నీళ్లు మరిగించుకొని, అందులో శుభ్రం చేసుకున్నటువంటి ఎండు రొయ్యలు వేసి ఓ పొంగు రానివ్వండి.",
    "[00:41] ఓ పొంగు వచ్చాక దింపేసి చన్నీళ్లలో వేసి ఒకటికి రెండు సార్లు బాగా కడిగి పక్కన ఉంచుకోండి.",
    "[00:48] ఇప్పుడు కడాయిలో అర కప్పు నూనె వేసుకోండి. నాన్ వెజ్ కు నూనె ఎక్కువ ఉంటేనే రుచి.",
    "[00:52] ఇప్పుడు ఓ టీస్పూన్ ఆవాలు, ఓ టీస్పూన్ జీలకర్ర, ఓ టీస్పూన్ శనగపప్పు, ఓ టీస్పూన్ మినప్పప్పు వేసి ఎర్రగా వేపుకోండి.",
    "[01:03] ఇప్పుడు ఓ ఉల్లిపాయ సన్నని తరుగు, రెండు రెబ్బల కరివేపాకు వేసి ఉల్లిపాయలు పింక్ కలర్ లోకి వచ్చేంత వరకు ఫ్రై చేసుకోండి.",
    "[01:14] ఇప్పుడు శుభ్రం చేసుకున్నటువంటి ఎండు రొయ్యలు వేసి మీడియం ఫ్లేమ్ మీద బాగా ఫ్రై చేసుకోవాలి.",
    "[01:20] ఇది చాలా ఇంపార్టెంట్. అప్పుడే కూర ఏ వాసనా లేకుండా చాలా బాగుంటుంది.",
    "[01:25] ఇప్పుడు అర టీస్పూన్ పసుపు వేసి బాగా కలుపుకోండి.",
    "[01:28] ఈ రొయ్యలు వేగడానికి కనీసం 12 నుంచి 15 నిమిషాల టైం పడుతుంది.",
    "[01:33] నిదానంగా ఎంత బాగా వేపుకుంటే కూర అంత రుచిగా ఉంటుందని గుర్తుంచుకోండి.",
    "[01:38] ఇప్పుడు ఓ టేబుల్ స్పూన్ అల్లం వెల్లుల్లి పేస్ట్ వేసి నూనె పైకి తేలేంత వరకు వేపుకోండి.",
    "[01:46] నూనె పైకి తేలాక రెండు కట్టల ఎర్ర గోంగూర ఆకులు వేసి బాగా కలుపుకోండి. ఎర్ర గోంగూర ఆకులు అయితేనే బాగా పులుపు ఉంటుంది.",
    "[01:53] గోంగూర రొయ్యలతో బాగా మగ్గిపోవాలి. అందాక మగ్గించుకోండి. దీనికి కనీసం 12 నుంచి 15 నిమిషాల టైం పడుతుంది.",
    "[02:04] ఆకు మగ్గాక సాల్ట్, ఓ టేబుల్ స్పూన్ కారం వేసి బాగా కలుపుకొని నూనె పైకి తేలేదాకా మధ్య మధ్యలో కలుపుతూ వేపుకోండి.",
    "[02:18] నూనె పైకి తేలాక అర టీస్పూన్ గరం మసాలా వేసి బాగా కలుపుకొని దింపేసెయండి.",
    "[02:22] నూనె ఎక్కువ వేసి నిదానంగా రొయ్యల్ని వేపుకుంటే కచ్చితంగా ఎక్సలెంట్ టేస్టీ కర్రీ రెడీ అవుతుంది.",
    "[02:28] మీకు నచ్చిందా? మరైతే ఓ సారి vismaifood.com వెబ్సైట్ విజిట్ చేసి జాగ్రత్తగా రెసిపీని టిప్స్ తో సహా ఫాలో అవుతూ చదువుకొని చేయండి.",
    "[02:35] చేసిన తర్వాత ఆ పిక్ ని విస్మై ఫుడ్ ఇన్స్టాగ్రామ్ లో పోస్ట్ చేయడం అస్సలు మర్చిపోకండి."
  ],
  "transcription_english": [
    "[00:00] Hello Foodies, Welcome to Vismai Food. Today's special is Dry Prawns Gongura Curry.",
    "[00:05] An authentic Andhra dish. Tastes amazing, doesn't it?",
    "[00:09] Somehow, dry prawns taste delicious even if you just add salt and cook them with any vegetable. They are that good.",
    "[00:15] But for me, Gongura Prawns is my absolute favorite.",
    "[00:18] I will show you Gongura Dry Prawns in our style today. Let's start Gongura Dry Prawns Curry.",
    "[00:23] First, take 200 grams of dry prawns and remove the head and tail of each prawn. Clean all of them like this.",
    "[00:35] Now boil half a liter of water, add the cleaned dry prawns and let it come to a boil once.",
    "[00:41] Once it boils, remove from heat, put them in cold water, wash well once or twice and keep aside.",
    "[00:48] Now add half a cup of oil in a kadai. Non-veg tastes good only with more oil.",
    "[00:52] Now add a teaspoon of mustard seeds, a teaspoon of cumin seeds, a teaspoon of chana dal, and a teaspoon of urad dal and roast them until reddish.",
    "[01:03] Now add one finely chopped onion and two sprigs of curry leaves, and fry until onions turn pink.",
    "[01:14] Now add the cleaned dry prawns and fry well on medium flame.",
    "[01:20] This is very important. Only then the curry will taste good without any smell.",
    "[01:25] Now add half a teaspoon of turmeric and mix well.",
    "[01:28] It takes at least 12 to 15 minutes for the prawns to fry.",
    "[01:33] Remember, the more patiently you fry, the tastier the curry will be.",
    "[01:38] Now add a tablespoon of ginger garlic paste and fry until the oil floats on top.",
    "[01:46] Once the oil floats, add leaves from two bunches of Red Gongura and mix well. Red Gongura leaves give a good sour taste.",
    "[01:53] Gongura should cook well with the prawns. Cook until then. This takes at least 12 to 15 minutes.",
    "[02:04] Once the leaves are cooked, add salt and a tablespoon of chilli powder, mix well, and fry stirring occasionally until oil floats on top.",
    "[02:18] Once the oil floats, add half a teaspoon of garam masala, mix well and remove from heat.",
    "[02:22] If you add more oil and fry the prawns patiently, an excellent tasty curry will definitely be ready.",
    "[02:28] Did you like it? Then visit vismaifood.com website once, read the recipe carefully following the tips and make it.",
    "[02:35] After making it, don't forget to post that pic on Vismai Food Instagram."
  ]
}