{
  "metadata": {
    "title": "TomatoCoconutKurma|టమాటో కొబ్బరి కుర్మా| చపాతీ, అట్టు, రైస్ లోకి ఎంతో రుచిగా ఉండే సింపుల్ కర్రీ",
    "channel_name": "Vismai Food",
    "publish_date": "2019-06-05",
    "view_count": 98000,
    "like_count": 1500,
    "duration": "02:40",
    "language": "Telugu",
    "video_id": "Unknown",
    "url": "https://www.youtube.com/watch?v=Unknown",
    "description": "Tomato Coconut Milk Curry is a rich and creamy vegetarian curry that goes perfectly with Chapati, Roti, Dosa, and Rice. Made with ripe desi tomatoes and thick coconut milk, this curry has a unique flavor profile that sets it apart from regular tomato curries.",
    "ingredients_detected": [
      "Oil",
      "Bay leaf",
      "Cinnamon",
      "Saunf (Fennel Seeds)",
      "Cardamom",
      "Onion",
      "Green Chillies",
      "Curry leaves",
      "Desi Tomatoes",
      "Turmeric",
      "Salt",
      "Chilli Powder",
      "Coriander Cumin powder",
      "Water",
      "Garam masala",
      "Thick Coconut Milk",
      "Coriander Leaves"
    ]
  },
  "transcription_telugu": [
    "[00:00] హలో ఫుడీస్ వెల్కమ్ టు విస్మై ఫుడ్.",
    "[00:02] ఇవాల్టి స్పెషల్ టమాటో కొబ్బరి పాల కూర.",
    "[00:05] టమాటో కూర రెగ్యులర్ గా చేసుకునేదే కదా, ఇందులో స్పెషల్ ఏముంది అనుకుంటున్నారా?",
    "[00:09] ఇది రెగ్యులర్ గా చేసుకునే టమాటో కూరలా కాకుండా, కొబ్బరి పాలతో చాలా రిచ్ గా, చాలా కమ్మగా, చాలా చాలా బాగుంటుంది.",
    "[00:15] ఇది చపాతీ, రోటి, పూరీ, రైస్, అట్టు.. దేనిలోకైనా సరే అదిరిపోతుంది.",
    "[00:20] మరి ఆలస్యం చేయకుండా స్టార్ట్ చేసేద్దామా? లెట్స్ స్టార్ట్.",
    "[00:23] ముందుగా కడాయిలో మూడు టేబుల్ స్పూన్ల ఆయిల్ హీట్ చేసుకోండి.",
    "[00:27] అందులో ఒక బిర్యానీ ఆకు, ఒక ఇంచ్ దాల్చిన చెక్క, ఒక టీస్పూన్ సోంపు, మూడు యాలకులు వేసి వేయించుకోండి.",
    "[00:36] ఆ తర్వాత ఒక ఉల్లిపాయ సన్నని తరుగు, రెండు పచ్చిమిర్చి చీలికలు, ఒక రెమ్మ కరివేపాకు వేసి, ఉల్లిపాయలు ట్రాన్స్పరెంట్ గా అయ్యేంతవరకు వేయించుకోండి.",
    "[00:48] ఉల్లిపాయలు వేగాక మూడు పండిన దేశవాళీ టమాటోల ప్యూరీని వేసుకోండి.",
    "[00:53] ఇప్పుడు నూనె పైకి తేలేంత వరకు ఈ ప్యూరీని కుక్ చేసుకోండి.",
    "[01:00] ఆ తర్వాత పావు కిలో అంటే ఒక మూడు టమాటోల ముక్కలను వేసుకోండి.",
    "[01:06] మూత పెట్టి టమాటో ముక్కలు మెత్తగా మగ్గిపోయేంత వరకు ఉడికించుకోండి.",
    "[01:15] ఆ తర్వాత మూత తీసి అర టీస్పూన్ పసుపు, రుచికి సరిపడా ఉప్పు, ఒక టేబుల్ స్పూన్ కారం, ఒక టీస్పూన్ ధనియాల జీలకర్ర పొడి వేసి...",
    "[01:25] మసాలాలన్నీ మాడిపోకుండా ఒక నిమిషం పాటు లో ఫ్లేమ్ లో వేయించుకోండి.",
    "[01:30] ఇప్పుడు 200 ఎం.ఎల్ (ml) నీళ్లు పోసుకొని, మూత పెట్టి మీడియం ఫ్లేమ్ మీద 10 నుండి 12 నిమిషాల పాటు ఉడికించుకోండి.",
    "[01:43] మధ్య మధ్యలో కలుపుతూ ఉండాలి.",
    "[01:53] కూర దగ్గర పడ్డాక అర టీస్పూన్ గరం మసాలా వేసి కలుపుకోండి.",
    "[02:00] ఇప్పుడు ముప్పావు కప్పు చిక్కటి కొబ్బరి పాలు పోసుకోండి.",
    "[02:05] ఇప్పుడు బాగా కలుపుకొని, మూత పెట్టి మీడియం ఫ్లేమ్ మీద 12 నిమిషాల పాటు ఉడికించుకోండి.",
    "[02:15] ఆయిల్ పైకి తేలాక, రెండు టేబుల్ స్పూన్ల కొత్తిమీర తరుగు చల్లి దించేసుకోండి.",
    "[02:20] అంతే! ఎంతో రుచిగా ఉండే టమాటో కొబ్బరి పాల కూర రెడీ.",
    "[02:24] మీరు కూడా ట్రై చేసి మీకెలా కుదిరిందో కామెంట్ చేసి చెప్పండి. మరిన్ని రెసిపీస్ కోసం విస్మై ఫుడ్ ని సబ్స్క్రైబ్ చేసుకోండి."
  ],
  "transcription_english": [
    "[00:00] Hello Foodies, Welcome to Vismai Food.",
    "[00:02] Today's special is Tomato Coconut Milk Curry.",
    "[00:05] Are you thinking what's special in this regular tomato curry?",
    "[00:09] Unlike the regular tomato curry, this one is made with coconut milk, making it very rich, tasty, and very very good.",
    "[00:15] It tastes amazing with Chapati, Roti, Puri, Rice, Dosa.. anything.",
    "[00:20] Shall we start without delay? Let's start.",
    "[00:23] First, heat 3 tablespoons of oil in a kadai.",
    "[00:27] Add one bay leaf, one inch cinnamon stick, one teaspoon fennel seeds (saunf), and three cardamoms and fry them.",
    "[00:36] Then add one finely chopped onion, two slit green chillies, one sprig of curry leaves, and fry until the onions turn translucent.",
    "[00:48] After onions are fried, add the puree of three ripe Desi tomatoes.",
    "[00:53] Now cook this puree until the oil separates.",
    "[01:00] Then add quarter kilo, that is about three chopped tomato pieces.",
    "[01:06] Cover and cook until the tomato pieces become soft and mushy.",
    "[01:15] Then remove the lid and add half a teaspoon turmeric, salt to taste, one tablespoon chilli powder, one teaspoon coriander-cumin powder...",
    "[01:25] Fry on low flame for a minute so the spices don't burn.",
    "[01:30] Now pour 200 ml water, cover and cook on medium flame for 10 to 12 minutes.",
    "[01:43] Keep stirring in between.",
    "[01:53] Once the curry thickens, add half a teaspoon of garam masala and mix.",
    "[02:00] Now add three-quarter cup of thick coconut milk.",
    "[02:05] Mix well, cover and cook on medium flame for 12 minutes.",
    "[02:15] Once the oil floats on top, sprinkle two tablespoons of chopped coriander and remove from heat.",
    "[02:20] That's it! The delicious Tomato Coconut Milk Curry is ready.",
    "[02:24] You also try it and tell us in comments how it turned out. For more recipes, subscribe to Vismai Food."
  ]
}