{
  "metadata": {
    "title": "Perfect Upma Recipe | ఉప్మా ఇలా చేస్తే ఎవ్వరైనా ఇష్టంగా తింటారు | Rava Upma In Telugu | Vismai Food",
    "channel_name": "Vismai Food",
    "publish_date": "2019-06-07",
    "view_count": 5200000,
    "like_count": 135000,
    "duration": "03:08",
    "language": "Telugu",
    "video_id": "Y-Xg_J_x8qM",
    "url": "https://www.youtube.com/watch?v=Y-Xg_J_x8qM",
    "description": "If you follow these tips and measurements, even Upma haters will love it. This Upma recipe includes a secret ingredient - Milk, which enhances the taste and texture, making it soft, fluffy, and delicious. No onions are used in this version.",
    "ingredients_detected": [
      "Bombay Rava (Semolina)",
      "Cumin Seeds",
      "Oil",
      "Mustard Seeds",
      "Chana Dal",
      "Urad Dal",
      "Cashews",
      "Curry Leaves",
      "Green Chillies",
      "Ginger",
      "Water",
      "Milk",
      "Salt",
      "Ghee"
    ]
  },
  "transcription_telugu": [
    "[00:00] హలో ఫుడీస్, వెల్కమ్ టు విస్మై ఫుడ్. ఇవాల్టి స్పెషల్ ఉప్మా. ఉప్మానా? నీకో దండం సామి అని అంటారని నాకు తెలుసు మీలో చాలామంది.",
    "[00:05] కానీ నేను చెప్పబోయే సీక్రెట్ రెసిపీ ఓ సారి రుచి చూసారంటే...",
    "[00:10] ఈడెవడండి బాబు ఉప్మా అంటే ఇంతలా ఆరాటపడిపోతున్నాడు అని చూసిన వారు అనుకోక మానరు. అంత ఎంజాయ్ చేస్తారు మీరు ఉప్మాని తినేటప్పుడు.",
    "[00:20] మీకు ఈ రెసిపీ యూట్యూబ్ లో ఎక్కడా కనిపించనే కనిపించదు. అంత పర్ఫెక్ట్ రెసిపీ ఇది. లెట్స్ స్టార్ట్.",
    "[00:27] ముందుగా కచ్చితంగా అడుగు మందంగా ఉన్నటువంటి మూకుట్లో ఓ కప్ అంటే పావు కిలో బొంబాయి రవ్వ వేసి కేవలం లో ఫ్లేమ్ మీదే మంచి సువాసన వచ్చేంతవరకు వేపుకోవాలి.",
    "[00:38] ఇప్పుడు సీక్రెట్. రవ్వలో ఓ టీస్పూన్ జీలకర్ర వేసి వేపుకోండి.",
    "[00:43] దీనివల్ల ఉప్మా రుచే మారిపోతుంది అంటే నమ్మండి. ఎంతో అరోమాటిక్ గా ఉంటుంది ఉప్మా.",
    "[00:47] యాక్చువల్ గా ఇప్పుడు చేసే ఉప్మాల్లో చాలా మంది క్యారెట్, బఠానీలను, క్యాప్సికమ్ అని ఇవన్నీ వేస్తున్నారు కానీ వెనకటికి ఇవేవీ లేవు.",
    "[00:54] మన ఉప్మా చాలా సింపుల్ గా ఉంటుంది. ఆ ఉప్మాలోనే బెస్ట్ వెరైటీ చూపిస్తున్నాను మీకు.",
    "[00:59] రవ్వ బాగా వేగాక తీసి పక్కన ఉంచుకోండి. ఇప్పుడు పావు కప్పు ఆయిల్ హీట్ చేసుకొని...",
    "[01:04] అందులో ఓ టీస్పూన్ ఆవాలు, రెండు టీస్పూన్ల శనగపప్పు, రెండు టీస్పూన్ల మినప్పప్పు వేసి ఎర్రగా వేపుకోండి.",
    "[01:10] యాక్చువల్ గా ఫ్లేవర్ బాగుంటుందని నేను పొట్టు పప్పు వాడాను. ఉప్మాలో తాలింపులు కాస్త ఎక్కువ ఉంటేనే రుచి అందుకే రెండు టీస్పూన్లు శనగపప్పు మినప్పప్పు వాడాను.",
    "[01:19] తాలింపులు గుమగుమలాడి పోతున్నప్పుడు 10-15 జీడిపప్పు, రెండు రెబ్బల కరివేపాకు, మూడు పచ్చిమిర్చి, ఓ టేబుల్ స్పూన్ అల్లం తరుగు వేసి వేయించుకోండి.",
    "[01:30] ఇక్కడ మీకో విషయం చెప్పాలి. యాక్చువల్ గా జీడిపప్పు ఎప్పుడు వేసినా అందరూ ఎర్రగా వేపుతారు.",
    "[01:35] కానీ ఈ ఉప్మాలో జీడిపప్పు ఎర్రగా వేగకుండా మగ్గిపోతే చాలా బాగుంటుంది. కాబట్టి జీడిపప్పు తెల్లగానే ఉంచండి.",
    "[01:40] ఉప్మాలో మెత్తగా మగ్గి భలే ఉంటుంది తినేటప్పుడు. ఇప్పుడు నీళ్లు పోసుకోవాలి.",
    "[01:43] కప్పు రవ్వకి మూడు కప్పుల నీళ్లు పోసుకోవాలి. ఏ కప్పుతో రవ్వ తీసుకుంటే ఆ కప్పుతోనే మూడు కప్పుల నీళ్లు పోసుకోండి.",
    "[01:52] ఇప్పుడు అదే కప్పుతో పాలు పోసుకోండి. నేను పచ్చివే వాడాను.",
    "[01:56] ఈ పాలు పోయడం వల్ల ఉప్మా రుచే మారిపోతుంది.",
    "[02:00] పాలు మరుగుతుండేలోగా ఉప్మా రవ్వలో రుచికి సరిపడా సాల్ట్ వేసి కలుపుకోవాలి.",
    "[02:04] ఉప్మా రవ్వలోనే వేసి కలపాలి. దీనివల్ల పాలు విరగవు రవ్వ వేయగానే.",
    "[02:08] పాలు పొంగు రాగానే రవ్వ వేస్తూ ఎక్కడా గడ్డలు లేకుండా కలుపుకోండి.",
    "[02:12] ఇలా జస్ట్ 2 మినిట్స్ హై ఫ్లేమ్ మీద కలుపుకోండి చాలు.",
    "[02:16] ఆ తర్వాత దింపేసి ఐదు నిమిషాల పాటు వదిలేయండి.",
    "[02:20] చక్కగా ఆ వేడికి రవ్వ మగ్గిపోతుంది చాలా టేస్టీగా ఉంటుంది.",
    "[02:23] ఇప్పుడు పావు కప్పు నెయ్యి వేసి బాగా కలుపుకోండి.",
    "[02:27] పాలల్లో ఉల్లిపాయ వేస్తే రుచిగా ఉండదని నేను వేయలేదు.",
    "[02:30] ట్రస్ట్ మీ ఇది మీకు మళ్ళీ మళ్ళీ చేసుకొని తినాలనిపించేంత బాగుంటుంది.",
    "[02:35] ఈ స్టైల్ లో మీరు ఉప్మా చేసి అందరిదగ్గర మార్కులు కొట్టేయొచ్చు అంటే నమ్మండి.",
    "[02:40] అంత బాగుంటుంది అంత పర్ఫెక్ట్ గా వస్తుంది ఈ ఉప్మా ఈ సీక్రెట్స్ అన్నీ ఫాలో అయితే.",
    "[02:44] మీకు నచ్చిందా? మరైతే మీరు ఓసారి vismaifood.com వెబ్సైట్ విజిట్ చేసి రెసిపీని జాగ్రత్తగా ఓసారి చదువుకొని చేయండి, పర్ఫెక్ట్ రెసిపీని ఎంజాయ్ చేయండి.",
    "[02:51] రెసిపీ తయారు చేసాక ఆ పిక్ ని విస్మై ఫుడ్ ఇన్స్టాగ్రామ్ లో పోస్ట్ చేయడం అస్సలు మర్చిపోకండి."
  ],
  "transcription_english": [
    "[00:00] Hello Foodies, Welcome to Vismai Food. Today's special is Upma. Upma? 'Oh god please no', I know many of you would say that.",
    "[00:05] But if you taste this secret recipe once...",
    "[00:10] You will wonder 'Who is this guy getting so excited about Upma?'. You will enjoy eating Upma that much.",
    "[00:20] You won't find this recipe anywhere on YouTube. It is such a perfect recipe. Let's start.",
    "[00:27] First, in a heavy-bottomed pan, add 1 cup (250g) of Bombay Rava (Semolina) and roast it on low flame until it becomes aromatic.",
    "[00:38] Now the secret. Add 1 tsp Cumin seeds to the Rava and roast.",
    "[00:43] Believe me, this changes the taste of the Upma completely. It becomes very aromatic.",
    "[00:47] Actually, many people add carrots, peas, capsicum these days, but in the olden days, none of these were there.",
    "[00:54] Our Upma is very simple. I am showing you the best variety in that Upma itself.",
    "[00:59] Once Rava is roasted well, keep it aside. Now heat a quarter cup of oil...",
    "[01:04] Add 1 tsp Mustard seeds, 2 tsp Chana Dal, 2 tsp Urad Dal and fry until golden.",
    "[01:10] I used split black gram with skin for better flavor. Upma tastes good only if tempering ingredients are generous, that's why 2 teaspoons each.",
    "[01:19] When the tempering is aromatic, add 10-15 cashews, 2 sprigs curry leaves, 3 green chillies, 1 tbsp chopped ginger and fry.",
    "[01:30] I must tell you one thing here. Usually, everyone fries cashews until red.",
    "[01:35] But in this Upma, if cashews are not fried red but just softened, it tastes very good. So keep them white.",
    "[01:40] They soften in the Upma and taste great while eating. Now pour water.",
    "[01:43] For 1 cup Rava, pour 3 cups of water. Use the same cup you used for Rava.",
    "[01:52] Now add 1 cup of milk with the same cup. I used raw milk.",
    "[01:56] Adding milk changes the taste of the Upma completely.",
    "[02:00] While the milk is coming to a boil, mix salt into the Upma Rava itself.",
    "[02:04] You must add it to the Rava. This prevents the milk from curdling when you add the Rava.",
    "[02:08] Once the milk boils, add the Rava while stirring to prevent lumps.",
    "[02:12] Just mix like this on high flame for 2 minutes, that's enough.",
    "[02:16] Then remove from heat and leave it for 5 minutes.",
    "[02:20] The Rava cooks perfectly in that heat and becomes very tasty.",
    "[02:23] Now add a quarter cup of ghee and mix well.",
    "[02:27] I didn't add onions because they don't taste good with milk.",
    "[02:30] Trust me, it tastes so good that you will want to make it again and again.",
    "[02:35] Believe me, you can score marks from everyone if you make Upma in this style.",
    "[02:40] It tastes that good and comes out that perfect if you follow these secrets.",
    "[02:44] Did you like it? Then visit the vismaifood.com website once, read the recipe carefully and make it to enjoy a perfect recipe.",
    "[02:51] Don't forget to post the pic on Vismai Food Instagram after making the recipe."
  ]
}