{
  "metadata": {
    "title": "Turai Subzi| బీరకాయ కొబ్బరి కూర| కమ్మటి బీరకాయ కొబ్బరి కూర| చపాతీ, రోటీ, అన్నం లోకి చాలా బాగుంటుంది",
    "channel_name": "Vismai Food",
    "publish_date": "2019-06-11",
    "view_count": 465000,
    "like_count": 5300,
    "duration": "02:42",
    "language": "Telugu",
    "video_id": "L_7X_q_J_8g",
    "url": "https://www.youtube.com/watch?v=L_7X_q_J_8g",
    "description": "This Beerakaya Kobbari Kura (Ridge Gourd Coconut Curry) is a simple, healthy, and tasty everyday curry recipe. Made with tender ridge gourd, fresh coconut, and milk, it's mild, easy on the stomach, and pairs perfectly with rice, chapati, roti, or pulka.",
    "ingredients_detected": [
      "Oil",
      "Dry Red Chillies",
      "Mustard Seeds",
      "Curry Leaves",
      "Ridge Gourd",
      "Turmeric",
      "Chilli Powder",
      "Salt",
      "Fresh Coconut",
      "Water",
      "Milk",
      "Coriander Leaves"
    ]
  },
  "transcription_telugu": [
    "[00:00] హలో ఫుడీస్ వెల్కమ్ టు విస్మై ఫుడ్. ఇవాల్టి స్పెషల్ బీరకాయ కొబ్బరి కూర.",
    "[00:05] చాలా కమ్మగా ఉంటుంది. ఎప్పుడూ రెస్టారెంట్ స్టైల్, నార్త్ ఇండియన్ అని అవి ఇవి అని చెప్తారు కానీ రోజు చేసుకునే కూరలు కూడా కాస్త చెప్పచ్చు కదా అని చాలామంది కామెంట్ సెక్షన్ లో అడుగుతున్నారు.",
    "[00:15] వాళ్ళ కోసమే ఈ సింపుల్ కర్రీ చెప్తున్నాను.",
    "[00:17] ఇది అందరికీ తెలిసిందే కానీ చిన్న చిన్న మార్పులు ఉంటాయి రుచి చాలా బాగుంటుంది.",
    "[00:21] ఓ సారి మీరు చూసి మీకు ఎలా నచ్చిందో కామెంట్ సెక్షన్ లో తెలియజేయండి.",
    "[00:24] ముందుగా పాన్ లో రెండు టేబుల్ స్పూన్ల ఆయిల్ హీట్ చేసుకొని అందులో రెండు ఎండుమిర్చి, ఓ టీస్పూన్ ఆవాలు, ఓ రెబ్బ కరివేపాకు వేపుకోండి.",
    "[00:32] ఇందులో అర కిలో చెక్కు తీసినటువంటి లేత బీరకాయ ముక్కలు మాత్రమే వేసి రెండు నిమిషాల పాటు వేపుకోండి.",
    "[00:40] ఆ తర్వాత అర టీస్పూన్ పసుపు, అర టీస్పూన్ కారం వేసి బాగా కలుపుకోండి.",
    "[00:45] ఈ కూర కమ్మగా ఉండాలని కారం తగ్గించాం. నచ్చితే ఓ టీస్పూన్ వేసుకోండి.",
    "[00:50] ఇప్పుడు మూత పెట్టి ముక్కల్ని నాలుగైదు నిమిషాల పాటు మీడియం ఫ్లేమ్ మీద మగ్గించుకోండి.",
    "[00:54] ఇప్పుడు ఇందులో సాల్ట్ కూడా వేసుకోండి.",
    "[00:58] ఇప్పుడు అర చిప్ప పచ్చి కొబ్బరి తురుము వేసి బాగా ఉడికించుకోండి.",
    "[01:01] మీరు తీసుకున్న బీరకాయ ముదిరిపోయి ఉన్నట్లయితే గనక అర కప్పు నీళ్ళు పోసి మగ్గించుకోండి మూత పెట్టి.",
    "[01:08] ముక్క మగ్గాక అప్పుడు 100 ml కాచిన పాలు పోసి బాగా కలుపుకొని మీడియం ఫ్లేమ్ మీద కూర దగ్గర పడనివ్వండి.",
    "[01:15] ఈ కూర ఒట్టి రైస్ లోకే కాదు పూరి, చపాతీ, పుల్కాల్లోకి కూడా చాలా బాగుంటుంది.",
    "[01:19] రాత్రి డిన్నర్ టైమ్ లో ఓ సారి ఈ కూరని ట్రై చేసి చూడండి రోటి చపాతీల్లోకి ఎంత బాగుంటుందో చాలా హాయిగా అనిపిస్తుంది టమ్మీకి.",
    "[01:26] తిన్న తర్వాత పెద్ద భారంగా కూడా అనిపించదు.",
    "[01:28] దింపే ముందు కాస్త కొత్తిమీర చల్లుకొని దింపేసుకోండి.",
    "[01:31] మీకు నచ్చిందా? మరైతే మీరు ట్రై చేసి మీకు ఎలా కుదిరిందో కచ్చితంగా ఆ పిక్ ని విస్మై ఫుడ్ ఇన్స్టాగ్రామ్ లో పోస్ట్ చేయండి, కామెంట్ సెక్షన్ లోనూ తెలియజేయండి."
  ],
  "transcription_english": [
    "[00:00] Hello Foodies, Welcome to Vismai Food. Today's special is Ridge Gourd Coconut Curry.",
    "[00:05] It is very tasty. Many people ask in the comment section why I always share restaurant style or North Indian recipes and not daily curries.",
    "[00:15] I am sharing this simple curry for them.",
    "[00:17] Everyone knows this, but there are small changes, the taste is very good.",
    "[00:21] Watch it once and let me know in the comment section how you liked it.",
    "[00:24] First heat two tablespoons of oil in a pan, add two dry red chilies, a teaspoon of mustard seeds, and a sprig of curry leaves and fry.",
    "[00:32] In this, add half a kilo of peeled tender ridge gourd pieces only and fry for two minutes.",
    "[00:40] After that add half a teaspoon turmeric, half a teaspoon chili powder and mix well.",
    "[00:45] We reduced chili to keep the curry mild. Add a teaspoon if you like.",
    "[00:50] Now cover and cook the pieces for four to five minutes on medium flame.",
    "[00:54] Now add salt to this as well.",
    "[00:58] Now add half a coconut shell of fresh grated coconut and cook well.",
    "[01:01] If the ridge gourd you took is mature, add half a cup of water and cook covered.",
    "[01:08] Once the piece is cooked, pour 100 ml boiled milk, mix well and let the curry thicken on medium flame.",
    "[01:15] This curry is not just for plain rice, it is also very good with puri, chapati, and pulkas.",
    "[01:19] Try this curry once during dinner time with roti or chapatis, you will see how good it is, it feels very light on the tummy.",
    "[01:26] It doesn't feel heavy after eating.",
    "[01:28] Sprinkle some coriander before taking it off.",
    "[01:31] Did you like it? Then you try it and definitely post that pic on Vismai Food Instagram and let us know in the comment section."
  ]
}