{
  "metadata": {
    "title": "Madras Keema Masala | మద్రాస్ మటన్ కీమా మసాలా | Best Side Dish for Idli, Dosa, Poori & Rice",
    "channel_name": "Vismai Food",
    "publish_date": "2019-06-12",
    "view_count": 708000,
    "like_count": 12000,
    "duration": "03:32",
    "language": "Telugu",
    "video_id": "vXFjH6MDit8",
    "url": "https://www.youtube.com/watch?v=vXFjH6MDit8",
    "description": "Madras Keema Masala is a flavorful and spicy mutton mince curry popular in Chennai. It pairs exceptionally well with tiffin items like Idli, Dosa, Vada, and also with Rice, Chapati, and Poori. This recipe involves a special masala paste made with boiled red chilies and spices.",
    "ingredients_detected": [
      "Water",
      "Cinnamon",
      "Cloves",
      "Cardamom",
      "Star Anise",
      "Coriander Seeds",
      "Cumin Seeds",
      "Dry Red Chillies",
      "Oil",
      "Onion",
      "Fresh Coconut",
      "Cashews",
      "Ginger Garlic Paste",
      "Fennel Seeds (Saunf)",
      "Mutton Keema",
      "Turmeric",
      "Chilli Powder",
      "Salt",
      "Coriander Leaves"
    ]
  },
  "transcription_telugu": [
    "[00:00] హలో ఫుడీస్, వెల్కమ్ టు విస్మై ఫుడ్. ఇవాల్టి స్పెషల్ మద్రాస్ కీమా మసాలా.",
    "[00:05] నాన్ వెజ్ లవర్స్ కచ్చితంగా ఓ సారైనా మద్రాస్ కీమా మసాలా తినాల్సిందే, తిని తరించిపోవాల్సిందే.",
    "[00:12] నేను ఇది చెన్నై టి.నగర్ లో ఉండేటువంటి నా ఫ్రెండ్ వాళ్ళ రెస్టారెంట్ లో టేస్ట్ చేశాను ఫస్ట్ టైం. అబ్బా ఏం ఫ్లేవరు, ఏం టేస్టు.",
    "[00:19] ఇది అన్నంలోకి చాలా బాగుంటుంది. కానీ నాకు మాత్రం అట్టు, ఇడ్లీ, గారెలు వీటిల్లోకి చాలా ఇష్టం.",
    "[00:25] కచ్చితంగా అవి చేసిన రోజున ఇది చేసి తీరాల్సిందే మా ఇంట్లో. అంత బాగుంటుంది, మీకు నచ్చుతుంది. లెట్స్ స్టార్ట్.",
    "[00:30] ముందుగా 300 ml నీళ్ళు మరిగించుకోండి. అందులో 2 ఇంచుల దాల్చిన చెక్క, ఆరు లవంగాలు, ఐదు యాలకులు, రెండు అనాస పువ్వు... కచ్చితంగా వేసి తీరాలి అనాస పువ్వు.",
    "[00:41] ఓ టేబుల్ స్పూన్ ధనియాలు, ఓ టీస్పూన్ జీలకర్ర, 15 ఎండుమిర్చి వేసి నీళ్ళని నాలుగైదు నిమిషాల పాటు తెర్లకాగనివ్వండి.",
    "[00:50] అప్పుడు సారం అంతా నీళ్ళలోకి దిగుతుంది.",
    "[00:54] ఆ తర్వాత నీటిని వడకట్టి మసాలా దినుసుల్ని మిక్సీ జార్ లో వేసుకోండి. ఈ నీటిని జాగ్రత్తగా పక్కన ఉంచుకోండి.",
    "[01:01] ఇప్పుడు కాసిన్ని నీళ్ళేసి ఫైన్ గా పేస్ట్ చేసుకోండి మసాలా దినుసుల్ని.",
    "[01:05] ఇప్పుడు రెండు టేబుల్ స్పూన్ల ఆయిల్ హీట్ చేసుకొని, అందులో రెండు పెద్ద ఉల్లిపాయల తరుగు వేసుకోండి.",
    "[01:11] ఆ తర్వాత అరకప్పు పచ్చి కొబ్బరి ముక్కలు, పావు కప్పు జీడిపప్పు వేసి ఆనియన్స్ పచ్చి వాసన పోయేంత వరకు మగ్గించుకోండి.",
    "[01:21] ఇప్పుడు వేయించుకున్నటువంటి ఈ ఆనియన్స్ ని మిక్సీ జార్ లో వేసి, ఓ టేబుల్ స్పూన్ అల్లం వెల్లుల్లి పేస్ట్ వేసి...",
    "[01:27] గ్రైండ్ చేసుకున్నటువంటి ఎండుమిర్చి మసాలా పేస్ట్ కూడా కలిపి మెత్తగా గ్రైండ్ చేసుకొని పక్కన ఉంచుకోండి.",
    "[01:33] ఇప్పుడు కచ్చితంగా అడుగు మందంగా ఉన్నటువంటి పాన్ లో అరకప్పు ఆయిల్ హీట్ చేసుకోండి.",
    "[01:53] ఇప్పుడు ఇందులో ఓ టీస్పూన్ జీలకర్ర, ఓ టీస్పూన్ సోంపు వేసి వేయించుకోండి.",
    "[01:59] ఇందులో 500 గ్రాముల మటన్ కీమా వేసి కేవలం లో ఫ్లేమ్ మీద మాత్రమే బాగా ఫ్రై చేసుకోండి.",
    "[02:04] హై ఫ్లేమ్ మీద ఫ్రై చేస్తే గడ్డలు గడ్డలుగా మిగిలిపోతుంది. కీమా లోనుంచి నీరు బయటకి వదిలి సగం పైన నీరు ఇగిరిపోవాలి.",
    "[02:11] ఈ స్టేజ్ రావడానికి కనీసం 10 నుంచి 12 నిమిషాల టైం పడుతుంది.",
    "[02:18] అప్పుడు అర టీస్పూన్ పసుపు, ఓ టీస్పూన్ కారం వేసి బాగా కలుపుకోండి.",
    "[02:25] ఇప్పుడు ఉల్లిపాయ మసాలా పేస్ట్ కలిపి గ్రైండ్ చేసుకున్నటువంటి పేస్ట్ వేసి బాగా కలుపుకొని...",
    "[02:34] మసాలాల్ని ఉడికించుకున్న నీరు పక్కన ఉంచుకున్నాం కదా, ఆ నీరు పోసి, సాల్ట్ వేసుకొని బాగా కలుపుకొని...",
    "[02:42] మూత పెట్టి కేవలం లో ఫ్లేమ్ మీద మాత్రమే 20 నుంచి 25 నిమిషాల పాటు ఉడకనివ్వండి.",
    "[02:47] ప్రతి ఐదు నిమిషాలకు ఓ సారి మూత తీసి కలుపుతూ ఉండండి.",
    "[02:56] కూర ఉడికి నూనె పైకి తేలాలి. ఇదిగో ఇలా నూనె పైకి తేలాక అప్పుడు అరకట్ట కొత్తిమీర తరుగు చల్లి బాగా కలుపుకొని దింపేసుకోండి.",
    "[03:04] ఈ కూర బగారా అన్నంలోకి కూడా చాలా చాలా బాగుంటుంది.",
    "[03:07] అసలు ఈ కూర వండుతుంటే ఇల్లు ఇల్లంతా ఘుమఘుమలాడిపోతుంది అంతే, అంత బాగుంటుంది.",
    "[03:13] నచ్చిందా? మరైతే మీరు ఓ సారి vismaifood.com వెబ్సైట్ విజిట్ చేసి రెసిపీని జాగ్రత్తగా చదువుకొని తయారు చేయండి.",
    "[03:18] తయారు చేసిన తర్వాత ఆ పిక్ ని విస్మై ఫుడ్ ఇన్స్టాగ్రామ్ లో పోస్ట్ చేయడం అస్సలు మర్చిపోకండి.",
    "[03:22] బై ది వే సబ్స్క్రయిబ్ చేయాలని గుర్తుంచుకోండే."
  ],
  "transcription_english": [
    "[00:00] Hello Foodies, Welcome to Vismai Food. Today's special is Madras Keema Masala.",
    "[00:05] Non-veg lovers must try Madras Keema Masala at least once, and they will be delighted.",
    "[00:12] I first tasted this at my friend's restaurant in T. Nagar, Chennai. Oh, what a flavor, what a taste!",
    "[00:19] This is very good with rice. But I personally love it with Dosa (Attu), Idli, and Garelu (Vada).",
    "[00:25] On the days we make those tiffins, this curry is a must in our house. It is that good, you will like it. Let's start.",
    "[00:30] First, boil 300 ml of water. Add 2 inches of cinnamon, 6 cloves, 5 cardamoms, 2 star anise... you must add star anise.",
    "[00:41] Add 1 tablespoon coriander seeds, 1 teaspoon cumin seeds, 15 dry red chilies and let the water boil for 4-5 minutes.",
    "[00:50] Then the essence of spices will descend into the water.",
    "[00:54] After that, strain the water and put the spices into a mixer jar. Keep this water aside carefully.",
    "[01:01] Now add a little water and grind the spices into a fine paste.",
    "[01:05] Now heat 2 tablespoons of oil and add 2 large chopped onions.",
    "[01:11] Then add half a cup of fresh coconut pieces, quarter cup of cashews and saute until the raw smell of onions goes away.",
    "[01:21] Now put these fried onions into a mixer jar, add 1 tablespoon ginger-garlic paste...",
    "[01:27] Add the ground dry chili masala paste as well, grind everything into a smooth paste and keep aside.",
    "[01:33] Now heat half a cup of oil in a pan that definitely has a thick bottom.",
    "[01:53] Now add 1 teaspoon cumin seeds, 1 teaspoon fennel seeds (saunf) and fry.",
    "[01:59] Add 500 grams of mutton keema and fry well only on low flame.",
    "[02:04] If you fry on high flame, it will remain lumpy. The water should release from the keema and more than half of it should evaporate.",
    "[02:11] It takes at least 10 to 12 minutes to reach this stage.",
    "[02:18] Then add half a teaspoon turmeric, 1 teaspoon chili powder and mix well.",
    "[02:25] Now add the paste made from onions and masala, mix well...",
    "[02:34] Pour the reserved water in which spices were boiled, add salt, mix well...",
    "[02:42] Cover and cook for 20 to 25 minutes only on low flame.",
    "[02:47] Keep stirring by removing the lid every five minutes.",
    "[02:56] The curry should cook and oil should float on top. Look, once the oil floats like this, sprinkle half a bunch of chopped coriander, mix well and remove from heat.",
    "[03:04] This curry tastes very very good with Bagara Rice as well.",
    "[03:07] While cooking this curry, the whole house will be filled with aroma, it is that good.",
    "[03:13] Did you like it? Then visit vismaifood.com website once, read the recipe carefully and make it.",
    "[03:18] After making it, don't forget to post that pic on Vismai Food Instagram.",
    "[03:22] By the way, remember to subscribe."
  ]
}