{
  "metadata": {
    "title": "Kara Boondi|కారా బూంది| స్వీట్ షాప్స్ వాళ్ళ సీక్రెట్ రెసిపీ|ఈ టిప్స్ ఫాలో అయితే పర్ఫెక్ట్ బూంది రెడీ",
    "channel_name": "Vismai Food",
    "publish_date": "2019-06-15",
    "view_count": 378000,
    "like_count": 10000,
    "duration": "03:12",
    "language": "Telugu",
    "video_id": "Unknown",
    "url": "https://www.youtube.com/watch?v=Unknown",
    "description": "Learn how to make perfect Kara Boondi at home with sweet shop style taste. This easy snack recipe takes just 5 minutes and stays fresh for 15 days if stored properly. Follow these tips for crispy and round boondi.",
    "ingredients_detected": [
      "Besan (Chickpea Flour)",
      "Rice Flour",
      "Water",
      "Oil",
      "Peanuts",
      "Curry Leaves",
      "Salt",
      "Coriander Powder",
      "Roasted Cumin Powder",
      "Red Chilli Powder"
    ]
  },
  "transcription_telugu": [
    "[00:00] హలో ఫుడీస్, వెల్కమ్ టు విస్మై ఫుడ్. ఇవాల్టి స్పెషల్ పర్ఫెక్ట్ కారా బూందీ.",
    "[00:03] నేను మీకు బోల్డని టిప్స్ తో చెప్పబోతున్నాను. యాజ్ ఇట్ ఈజ్ స్వీట్ షాప్ స్టైల్ టేస్ట్ వస్తుంది.",
    "[00:06] మీరు నా టిప్స్ ఫాలో అవుతూ చేస్తే మళ్ళీ స్వీట్ షాప్ నుండి తెచ్చుకొనే తెచ్చుకోరు.",
    "[00:11] ఎందుకంటే జస్ట్ ఇన్ 5 మినిట్స్ మీరే బెస్ట్ బూందీ చేసేస్తారు.",
    "[00:15] అసలు వంట రాని వారు కూడా సక్సెస్ ఫుల్ గా చేసేస్తారంటే నమ్మొచ్చు. అంత పర్ఫెక్ట్ రెసిపీ చెప్పబోతున్నాను. లెట్స్ స్టార్ట్.",
    "[00:22] ముందుగా బౌల్ లో 200 గ్రాముల శనగపిండి తీసుకోండి.",
    "[00:26] అందులో రెండు టేబుల్ స్పూన్ల బియ్యం పిండి కలిపి...",
    "[00:29] తగినన్ని నీళ్లు పోసుకుంటూ గరిట జారుగా కలుపుకోవాలి.",
    "[00:32] మరీ జారుగానూ ఉండకూడదు, గట్టిగానూ ఉండకూడదు.",
    "[00:39] ఇదిగో, ఇలా ఉండాలి.",
    "[00:44] ఇప్పుడు బూందీని దూసుకోవడానికి ఇలాంటి గరిట కావాలి. ఇది బజార్లో దొరుకుతుంది.",
    "[00:49] దీంతో అయితే ఎక్కువ బూందీ దూసుకోవచ్చు. ఇది లేనట్లయితే ఇది కూడా వాడుకోవచ్చు.",
    "[00:53] కానీ టైం పడుతుంది అంతే.",
    "[00:56] ఇప్పుడు ఖచ్చితంగా అడుగు లోతుగా ఉన్నటువంటి మూకుడులో నూనె పోసి మరగ కాచండి నూనెని.",
    "[01:02] నూనె సల సల మరుగుతూ ఉండాలి. అప్పుడు బూందీ గరిట మీద పిండిని తీసుకొని నెమ్మదిగా పోయండి.",
    "[01:07] పోసి చాలా నెమ్మదిగా అట్లు పోసినట్లు తిప్పుకోండి.",
    "[01:11] అప్పుడు మీకు బూందీలు ముత్యాల్లా వస్తాయి పర్ఫెక్ట్ రౌండ్ షేప్ లో స్వీట్ షాప్ లో లాగా.",
    "[01:16] చాలా మంది బూందీ గరిటని తడతారు. అలా చేసినా బూందీ వస్తుంది, కానీ చిత్రమైన షేప్ లో వస్తుంది బూందీ అంతే.",
    "[01:23] బూందీ నూనెలో పడిన వెంటనే సల సల కాగే నూనెలో అడుక్కు వెళ్ళి ఆ వేడికి పైకి తేల్తాయి.",
    "[01:28] లోతు మూకుడు ఉంటేనే పర్ఫెక్ట్ షేప్ వచ్చేందుకు ఎక్కువ అవకాశం ఉంది.",
    "[01:32] బూందీ ఎప్పుడు కూడా హై ఫ్లేమ్ మీదే వేపి తీరాలి.",
    "[01:35] అప్పుడే క్రిస్పీగా వేగుతాయి. కాసేపు ఆగాక గరిటతో ఇలా తడుతూ ఉంటే గల్ గల్ అని శబ్దం వస్తూ ఉంటుంది.",
    "[01:42] అప్పుడు బూందీ బాగా వేగింది అని అర్థం. ఆ స్టేజ్ లో ఉన్నప్పుడు తీసి పక్కన ఉంచుకోండి.",
    "[01:46] మరీ ఎర్రగా వేపకండి నల్లబడిపోతాయి చల్లారేపాటికీ.",
    "[01:49] బూందీ ఓ వాయి అవ్వగానే చిన్న చిన్న పూసలుగా బూందీ ఉండిపోతుంది గరిటకి అందకుండా.",
    "[01:54] దీన్ని టీ స్ట్రైనర్ తో తీసేసేయండి.",
    "[01:57] బూందీ ఓ వాయి అవ్వగానే నూనె వేడి తగ్గిపోతుంది. అందుకని ఓ నిమిషం పాటు మళ్ళీ బాగా వేడి చేసుకోండి.",
    "[02:03] ఆ తర్వాత బూందీ దూసుకోండి పర్ఫెక్ట్ గా వస్తుంది బూందీ.",
    "[02:06] నూనె మంచి కాక మీద లేకపోతే బూందీ క్రిస్పీగా రాదు.",
    "[02:09] గరిటని తడితే మంచి షేప్ లోనూ బూందీ రాదు. ఇలా బూందీ అంతా వేపి తీసి పక్కన ఉంచుకోండి.",
    "[02:14] ఇప్పుడు అదే నూనెలో అర కప్పు వేరుశనగపప్పు ఫ్రై చేసుకోండి. నచ్చితే మీరు జీడిపప్పు కూడా వేపుకోవచ్చు.",
    "[02:21] ఆ తర్వాత రెండు రెబ్బల కరివేపాకు కూడా వేపుకోండి.",
    "[02:27] వేపుకున్నాక తీసి బూందీలో కలుపుకోండి.",
    "[02:29] ఇప్పుడు వేయించుకున్నటువంటి వేరుశనగపప్పు, సాల్ట్...",
    "[02:32] ఓ టీస్పూన్ ధనియాల పొడి, అర టీస్పూన్ వేయించిన జీలకర్ర పొడి.",
    "[02:37] ఇప్పుడు అర టీస్పూన్ కారం వేసి కలుపుకోండి.",
    "[02:40] ఫ్లేవర్ కోసం ధనియాల పొడి, జీలకర్ర పొడి ఖచ్చితంగా స్వీట్ షాప్ ల వాళ్ళు వేస్తారు. మీకు నచ్చితే వేసుకోవచ్చు లేదంటే హ్యాపీగా స్కిప్ చేయచ్చు.",
    "[02:46] వేడి మీద కలిపితేనే బూందీకి బాగా పడతాయి ఉప్పు కారం.",
    "[02:50] ఇవి పూర్తిగా చల్లారాక డబ్బాలో పెట్టుకోండి కనీసం 15 రోజుల పాటు క్రిస్పీగా ఉంటాయి.",
    "[02:55] పప్పు, పప్పుచారు, పెరుగన్నంలో భలేగా ఉంటాయి ఈ బూందీ. మీకు నచ్చిందా?",
    "[03:00] మరైతే మీరు ఓ సారి ట్రై చేసే ముందు vismaifood.com వెబ్సైట్ విజిట్ చేసి...",
    "[03:04] రెసిపీ అంతా జాగ్రత్తగా చదువుకొని చేయండి, పర్ఫెక్ట్ రెసిపీని ఎంజాయ్ చేయండి.",
    "[03:07] తయారు చేసాక ఆ పిక్ ని విస్మై ఫుడ్ ఇన్స్టాగ్రామ్ లో పోస్ట్ చేయడం అస్సలు మర్చిపోకండి."
  ],
  "transcription_english": [
    "[00:00] Hello Foodies, Welcome to Vismai Food. Today's special is Perfect Kara Boondi.",
    "[00:03] I'm going to tell you with lots of tips. You'll get the exact sweet shop style taste.",
    "[00:06] If you follow my tips, you won't buy from sweet shops again.",
    "[00:11] Because just in 5 minutes, you can make the best boondi yourself.",
    "[00:15] Even those who don't know cooking can make it successfully, believe me. I'm going to tell you such a perfect recipe. Let's start.",
    "[00:22] First, take 200 grams of besan (chickpea flour) in a bowl.",
    "[00:26] In that, mix 2 tablespoons of rice flour...",
    "[00:29] And add enough water to mix it into a ladle-pouring consistency.",
    "[00:32] It shouldn't be too runny or too thick.",
    "[00:39] See, it should be like this.",
    "[00:44] Now, to drop boondi, you need a ladle like this. This is available in the market.",
    "[00:49] With this, you can drop more boondi. If you don't have this, you can use this skimmer too.",
    "[00:53] But it takes time, that's all.",
    "[00:56] Now, pour oil in a deep-bottomed kadai and heat it well.",
    "[01:02] The oil should be boiling hot. Then take batter on the boondi ladle and pour slowly.",
    "[01:07] Pour and spread it very slowly like you spread dosa.",
    "[01:11] Then you will get boondi like pearls, in a perfect round shape like in sweet shops.",
    "[01:16] Many people tap the boondi ladle. If you do that, boondi will come, but in a weird shape.",
    "[01:23] As soon as boondi drops in oil, it should go to the bottom and float up due to heat.",
    "[01:28] Only a deep kadai gives a better chance for perfect shape.",
    "[01:32] Boondi must always be fried on high flame only.",
    "[01:35] Only then they become crunchy. After a while, if you tap with ladle, you'll hear 'gal gal' sound.",
    "[01:42] That means boondi is fried well. At that stage, remove and keep aside.",
    "[01:46] Don't fry too red, they will darken after cooling.",
    "[01:49] After one batch, small boondi beads remain in oil which don't come in the ladle.",
    "[01:54] Remove them with a tea strainer.",
    "[01:57] After one batch, oil temperature drops. So heat well again for a minute.",
    "[02:03] Then drop boondi, you'll get perfect boondi.",
    "[02:06] If oil isn't hot enough, boondi won't be crispy.",
    "[02:09] If you tap the ladle, you won't get a good shape either. Fry all boondi like this and keep aside.",
    "[02:14] Now in the same oil, fry half cup peanuts. You can fry cashews if you like.",
    "[02:21] Then fry two sprigs of curry leaves too.",
    "[02:27] After frying, remove and add to the boondi.",
    "[02:29] Now add fried peanuts, salt...",
    "[02:32] One teaspoon coriander powder, half teaspoon roasted cumin powder.",
    "[02:37] Now add half teaspoon chilli powder and mix.",
    "[02:40] Sweet shops definitely add coriander and cumin powder for flavor. Add if you like or you can happily skip it.",
    "[02:46] Mix while hot so salt and spice stick well to boondi.",
    "[02:50] After cooling completely, store in a box, it stays crispy for at least 15 days.",
    "[02:55] This boondi tastes great in dal, sambar, and curd rice. Did you like it?",
    "[03:00] Then visit vismaifood.com website before trying...",
    "[03:04] Read the recipe carefully and make it, enjoy the perfect recipe.",
    "[03:07] After making, don't forget to post that pic on Vismai Food Instagram."
  ]
}