{
  "metadata": {
    "title": "Onion Pulusu | ఉల్లిపాయ పులుసు ఇలా చేశారంటే అన్నం, చపాతీ, అట్టు లోకి వదలకుండా తింటారు",
    "channel_name": "Vismai Food",
    "publish_date": "2019-06-18",
    "view_count": 872000,
    "like_count": 13000,
    "duration": "03:32",
    "language": "Telugu",
    "video_id": "Unknown",
    "url": "https://www.youtube.com/watch?v=Unknown",
    "description": "Onion Pulusu is a tangy and spicy South Indian gravy made with onions, tamarind, and a blend of spices. It pairs perfectly with rice, chapati, and dosa. This recipe by Vismai Food uses a mix of regular and sambar onions for a unique taste.",
    "ingredients_detected": [
      "Tamarind",
      "Oil",
      "Onions",
      "Sambar Onions",
      "Salt",
      "Chilli Powder",
      "Water",
      "Turmeric",
      "Jaggery",
      "Green Chillies",
      "Rice Flour",
      "Coriander Leaves",
      "Fenugreek Seeds",
      "Mustard Seeds",
      "Cumin Seeds",
      "Dry Red Chillies",
      "Curry Leaves",
      "Asafoetida"
    ]
  },
  "transcription_telugu": [
    "[00:00] హలో ఫుడీస్, వెల్కమ్ టు విస్మై ఫుడ్. ఇవాల్టి స్పెషల్ ది బెస్ట్ ఉల్లిపాయ పులుసు.",
    "[00:05] ఎంత బాగుంటుందో, ఇది నాకు చాలా చాలా ఇష్టం.",
    "[00:08] ఇది మీరు ఓ సారి చేశారంటే నెక్స్ట్ టైం మీ ఇంట్లో ఖచ్చితంగా నేను చెప్పిన దానికంటే డబల్ క్వాంటిటీ చేసి తీరతారు.",
    "[00:15] అంత బాగుంటుంది ఇది నిజంగా నిజం. లెట్స్ స్టార్ట్.",
    "[00:19] ముందుగా 50 గ్రాముల చింతపండులో కాసిన్ని వేడి నీళ్ళు వేసి నానబెట్టుకొని రసం తీసి పక్కన ఉంచుకోండి.",
    "[00:24] ఇప్పుడు పాన్ లో మూడు టేబుల్ స్పూన్ల ఆయిల్ హీట్ చేసి, అందులో రెండు మామూలు ఉల్లిపాయ చీలికలు...",
    "[00:29] 10 నుంచి 12 సాంబార్ ఉల్లిపాయలు వేసుకోండి. సాంబార్ ఉల్లిపాయలు లేకపోతే గనక మామూలు ఉల్లిపాయలే వాడుకోండి.",
    "[00:35] ఇవి కాస్త మగ్గించుకోండి. కాస్త మగ్గాక సాల్ట్, ఓ టీస్పూన్ కారం వేసి బాగా కలుపుకొని...",
    "[00:43] ఉల్లిపాయల్ని మగ్గించుకోండి మూతపెట్టి. మీడియం ఫ్లేమ్ మీద మాత్రమే మధ్య మధ్యలో కలుపుతూ ఉండాలని గుర్తుంచుకోండి.",
    "[00:52] ఉల్లిపాయలు బాగా మగ్గాక 300 ml చింతపండు రసం పోసుకోండి.",
    "[00:56] ఇందులో మరో 300 ml నీళ్ళు పోసి, అర టీస్పూన్ పసుపు, 50 గ్రాముల బెల్లం... దీనికి బెల్లం ఎక్కువగా పడుతుంది.",
    "[01:03] మూడు పచ్చిమిర్చి చీలికలు వేసి బాగా కలుపుకొని, లో ఫ్లేమ్ మీద 15 నిమిషాల పాటు మరగనివ్వండి.",
    "[01:09] ఇదే పులుసు రాచప్పలో కాస్తే ఇంకా ఎంత బాగుంటుందో.",
    "[01:13] ఈ పులుసు కచ్చితంగా నిదానంగా మరిగి తీరాలి.",
    "[01:17] 15 నిమిషాల తర్వాత, ఓ టీస్పూన్ బియ్యప్పిండిలో 50 ml నీళ్ళు పోసి ఉండల్లేకుండా బాగా కలుపుకోండి.",
    "[01:26] కలుపుకున్నాక నిదానంగా మరుగుతున్నటువంటి పులుసులో పోసి బాగా కలుపుకొని...",
    "[01:31] మూతపెట్టి మరో మూడు నాలుగు నిమిషాల పాటు మరగనివ్వండి.",
    "[01:37] ఇప్పుడు రెండు టేబుల్ స్పూన్ల కొత్తిమీర తరుగు చల్లి బాగా కలుపుకొని తీసి పక్కన ఉంచుకోండి.",
    "[01:43] ఇప్పుడు రెండు టేబుల్ స్పూన్ల ఆయిల్ హీట్ చేసి, అందులో ఓ టీస్పూన్ మెంతులు వేసి మెంతుల్ని సగం పైన వేగనివ్వండి.",
    "[01:49] వేగిన తర్వాత ఓ టీస్పూన్ ఆవాలు వేసి చిటపటమనిపించండి.",
    "[01:52] చిటపటమన్నాక ఓ టీస్పూన్ జీలకర్ర, రెండు ఎండుమిర్చి, ఓ రెబ్బ కరివేపాకు వేసి బాగా వేయించుకొని...",
    "[01:59] ఓ చిటికెడు ఇంగువ కూడా వేసి తాలింపును తీసి పులుసులో కలుపుకోండి.",
    "[02:05] అంతే యు ఆర్ డన్. చెయ్యడం చాలా తేలికే, కానీ పులుసు ఎంత నిదానంగా మరిగితే అంత రుచి.",
    "[02:12] నేను చెప్పిన కొలతల్లో యాజ్ ఇట్ ఈజ్ మీరు పులుసు పెడితే, మీ చేతి పులుసు తినడం కోసమైనా మీ ఇంటికి ఏదో ఒక సాకుతో వచ్చి తీరతారు మీ బంధువులు.",
    "[02:21] అంత బాగుంటుంది, కచ్చితంగా ట్రై చెయ్యవలసిన రెసిపీ.",
    "[02:24] ఏంటి మీకు నచ్చిందా? మరైతే మీరు ఓ సారి vismaifood.com వెబ్సైట్ విజిట్ చేసి జాగ్రత్తగా రెసిపీని చదువుకొని చెయ్యండి.",
    "[02:29] పర్ఫెక్ట్ రెసిపీని ఎంజాయ్ చెయ్యండి. రెసిపీ తయారు చేసాక ఆ పిక్ ని విస్మై ఫుడ్ ఇన్స్టాగ్రామ్ లో పోస్ట్ చెయ్యడం అస్సలు మర్చిపోకండి."
  ],
  "transcription_english": [
    "[00:00] Hello Foodies, Welcome to Vismai Food. Today's special is the best Onion Pulusu (Stew).",
    "[00:05] It tastes so good, I like this very very much.",
    "[00:08] If you make this once, next time you will definitely make double the quantity than what I said.",
    "[00:15] It is that good, truly true. Let's start.",
    "[00:19] First, soak 50 grams of tamarind in some hot water, extract the juice and keep it aside.",
    "[00:24] Now heat 3 tablespoons of oil in a pan, add sliced pieces of 2 regular onions...",
    "[00:29] Add 10 to 12 sambar onions (shallots). If you don't have sambar onions, use regular onions.",
    "[00:35] Saute them a little. After they soften a bit, add salt, one teaspoon chilli powder and mix well...",
    "[00:43] Cover and cook the onions. Remember to cook on medium flame only and stir in between.",
    "[00:52] After onions are cooked well, pour 300 ml tamarind juice.",
    "[00:56] Add another 300 ml water to this, half teaspoon turmeric, 50 grams jaggery... this requires more jaggery.",
    "[01:03] Add three slit green chillies, mix well, and let it boil on low flame for 15 minutes.",
    "[01:09] If this stew is made in a clay pot, it tastes even better.",
    "[01:13] This stew must boil slowly for sure.",
    "[01:17] After 15 minutes, mix one teaspoon rice flour in 50 ml water without lumps.",
    "[01:26] After mixing, pour it slowly into the boiling stew, mix well...",
    "[01:31] Cover and let it boil for another three to four minutes.",
    "[01:37] Now sprinkle two tablespoons of chopped coriander, mix well and keep it aside.",
    "[01:43] Now heat two tablespoons of oil, add one teaspoon fenugreek seeds and let them fry more than half.",
    "[01:49] After frying, add one teaspoon mustard seeds and let them splutter.",
    "[01:52] After spluttering, add one teaspoon cumin seeds, two dry red chillies, a sprig of curry leaves and fry well...",
    "[01:59] Add a pinch of asafoetida also, take the tempering and mix it into the stew.",
    "[02:05] That's it, you are done. Making it is very easy, but the slower the stew boils, the tastier it gets.",
    "[02:12] If you make the stew exactly with the measurements I said, your relatives will definitely come to your house with some excuse just to eat the stew made by you.",
    "[02:21] It is that good, definitely a must-try recipe.",
    "[02:24] What, did you like it? Then visit vismaifood.com website once, read the recipe carefully and make it.",
    "[02:29] Enjoy the perfect recipe. After making the recipe, don't forget to post that pic on Vismai Food Instagram."
  ]
}