{
  "metadata": {
    "title": "#LaukiSubzi | సొరకాయ పల్లీల కారం పులుసు | 150 Years Old Recipe | Spicy Bottle Gourd Peanut Curry",
    "channel_name": "Vismai Food",
    "publish_date": "2018-10-29",
    "view_count": 269435,
    "like_count": 2511,
    "duration": "02:33",
    "language": "Telugu",
    "video_id": "fPOlbKq-id8",
    "url": "https://www.youtube.com/watch?v=fPOlbKq-id8",
    "description": "150-year-old traditional recipe for Lauki Subzi (Bottle Gourd Peanut Curry) by Vismai Food.",
    "ingredients_detected": [
      "1/2 Cup (60gms) Peanuts (soaked for 1 hour)",
      "3-4 tbsps Oil",
      "2 Sprigs Curry leaves",
      "1 Medium Onion (chopped)",
      "4-5 Green chillies (slit)",
      "1 Large ripe Tomato (chopped)",
      "1/2 tsp Turmeric",
      "300gms Tender Bottle Gourd (Lauki) cubes",
      "1/4 tsp Fenugreek (Methi) seeds",
      "1 tbsp Coriander powder",
      "1 tbsp Red chilli powder",
      "1 pinch Asafoetida (Hing)",
      "100ml Tamarind juice",
      "250ml Water",
      "Salt (to taste)",
      "2 tbsps Coriander leaves (chopped)"
    ]
  },
  "transcription_telugu": [
    "[00:00:00.000] హలో ఫుడీస్, వెల్కమ్ టు విస్మయ్ ఫుడ్. ఇవాల్టి స్పెషల్ 150 ఏళ్ల క్రితం నాటి సొరకాయ పల్లీల పులుసు.",
    "[00:00:15.000] ఇది చాలా సింపుల్ రెసిపీ కానీ దీని రుచి చాలా బాగుంటుంది. ఒక్కసారి తింటే మళ్ళీ మళ్ళీ కావాలంటారు.",
    "[00:00:27.000] ముందుగా అర కప్పు (60 గ్రాముల) పల్లీలను ఒక గంట పాటు నీళ్లలో నానబెట్టి పెట్టుకోండి.",
    "[00:00:36.000] వీటిని కొద్దిగా ఉప్పు వేసి కాస్త పలుకుగా ఉండేలా ఉడికించి పక్కన ఉంచుకోండి. మరీ మెత్తగా ఉడికించకండి.",
    "[00:00:51.000] ఒక కడాయిలో 3-4 చెంచాల ఆయిల్ హీట్ చేసి కరివేపాకు, ఉల్లిపాయ తరుగు వేసి 30% వరకు వేయించండి.",
    "[00:01:03.000] ఇందులో పచ్చిమిర్చి చీలికలు వేసి పచ్చి వాసన పోయేదాకా వేపుకోవాలి.",
    "[00:01:12.000] ఇప్పుడు ఒక పెద్ద టమాటో తరుగు, అర చెంచా పసుపు వేసి టమాటోలు మెత్తగా అయ్యేదాకా మగ్గనివ్వండి.",
    "[00:01:21.000] 300 గ్రాముల లేత సొరకాయ ముక్కలు వేసి బాగా కలిపి మూత పెట్టి మీడియం ఫ్లేమ్ లో మగ్గనివ్వండి.",
    "[00:01:32.000] ముక్కలు మగ్గాక పావు చెంచా మెంతులు, ఒక టేబుల్ స్పూన్ ధనియాల పొడి, ఒక టేబుల్ స్పూన్ కారం, చిటికెడు ఇంగువ వేయండి.",
    "[00:01:50.000] ఇప్పుడు ఉడికించిన పల్లీలు, 100ml చింతపండు పులుసు, పావు లీటరు నీళ్లు పోసి కలపండి.",
    "[00:02:08.000] మూత పెట్టి నూనె పైకి తేలేంత వరకు లో ఫ్లేమ్ లో ఉడికించాలి. చివరగా కొత్తిమీర తరుగు వేయండి.",
    "[00:02:19.000] ఎంతో రుచికరమైన సొరకాయ పల్లీల పులుసు రెడీ. వేడి వేడి అన్నంతో ఇది చాలా బాగుంటుంది."
  ],
  "transcription_english": [
    "[00:00:00.000] Hello Foodies, welcome to Vismai Food. Today's special is a 150-year-old traditional Bottle Gourd Peanut Curry.",
    "[00:00:15.000] It's a simple recipe but tastes amazing. Once you try it, you'll want it again and again.",
    "[00:00:27.000] First, soak 1/2 cup (60gms) of peanuts in water for about an hour.",
    "[00:00:36.000] Boil them with a little salt until they are slightly firm, not too soft; then set them aside.",
    "[00:00:51.000] Heat 3-4 tbsps of oil in a pan, add curry leaves and chopped onion; sauté until 30% done.",
    "[00:01:03.000] Add slit green chillies and fry until the raw smell disappears.",
    "[00:01:12.000] Add one large chopped tomato and 1/2 tsp turmeric; cook until the tomatoes are soft.",
    "[00:01:21.000] Add 300gms of tender bottle gourd cubes, mix well, cover, and cook on medium flame until soft.",
    "[00:01:32.000] Once the pieces are tender, add 1/4 tsp fenugreek seeds, 1 tbsp coriander powder, 1 tbsp red chilli powder, and a pinch of asafoetida.",
    "[00:01:50.000] Add the boiled peanuts, 100ml tamarind juice, and 250ml water; mix well.",
    "[00:02:08.000] Cover and cook on low flame until the oil floats to the top. Finally, garnish with chopped coriander.",
    "[00:02:19.000] The delicious Bottle Gourd Peanut Curry is ready. It pairs perfectly with hot rice."
  ]
}