{
  "metadata": {
    "title": "Chittoor Special Natukodi Vepudu | నాటుకోడి వేపుడు | ఇలా చేస్తే ముక్క ఉడికి జ్యూసీగా ఉంటుంది",
    "channel_name": "Vismai Food",
    "publish_date": "2019-06-25",
    "view_count": 878000,
    "like_count": 16000,
    "duration": "04:17",
    "language": "Telugu",
    "video_id": "Unknown",
    "url": "https://www.youtube.com/watch?v=Unknown",
    "description": "This is a Chittoor special Natukodi Vepudu (Country Chicken Fry) recipe by Vismai Food. It's a spicy and flavorful dry chicken dish made with a special homemade masala powder. The chicken is cooked slowly to ensure it's tender and juicy.",
    "ingredients_detected": [
      "Country Chicken",
      "Coriander Seeds",
      "Dry Red Chillies",
      "Black Peppercorns",
      "Black Cardamom",
      "Star Anise",
      "Bay Leaf",
      "Cinnamon Stick",
      "Green Cardamom",
      "Cloves",
      "Nutmeg Powder",
      "Garlic Pods",
      "Oil",
      "Curry Leaves",
      "Green Chillies",
      "Ginger Garlic Paste",
      "Salt",
      "Turmeric Powder",
      "Coriander Powder",
      "Red Chilli Powder",
      "Water",
      "Coriander Leaves"
    ]
  },
  "transcription_telugu": [
    "[00:00] హలో ఫుడీస్, వెల్కమ్ టు విస్మై ఫుడ్. ఇవాల్టి స్పెషల్ నాటుకోడి వేపుడు.",
    "[00:04] వేడి వేడి అన్నంలో నాటుకోడి వేపుడు, ఇంత మిరియాల చారు పెట్టుకుని తింటుంటే ఆహా నా రాజా అని అనిపించక మానదు, అంత బాగుంటుంది.",
    "[00:14] శ్వేత మీకు నిజంగా ది బెస్ట్ నాటుకోడి వేపుడు రెసిపీ చెప్పబోతుంది. ఎప్పుడు చేసినా పర్ఫెక్ట్ గా కుదిరి తీరుతుంది అంతే.",
    "[00:22] తృప్తిగా ఆ పూట భోజనం చేసి తీరతారు మీరు, ఇది నిజంగా నిజం. దీని వెనక చాలా స్టోరీ ఉంది, అదంతా నేను వీడియోలో చెప్తాను. లెట్స్ స్టార్ట్.",
    "[00:30] ముందుగా పాన్ లో ఓ టేబుల్ స్పూన్ ధనియాలు, మూడు ఎండుమిర్చి, ఓ టీస్పూన్ తోక మిరియాలు, ఓ నల్ల యాలక...",
    "[00:38] ఓ అనాస పువ్వు, ఓ బిర్యానీ ఆకు, రెండు ఇంచుల దాల్చిన చెక్క, నాలుగు యాలకులు, ఐదు లవంగాలు...",
    "[00:47] జస్ట్ ఓ రెండు చిటికెడుల జాజికాయ పొడి ఇవన్నీ వేసి లో ఫ్లేమ్ మీద మాత్రమే రోస్ట్ చేసుకోండి.",
    "[00:52] అప్పుడే అరోమాస్ అన్ని రిలీజ్ అవుతాయి. ఈ మసాలా పొడి మీరు వేపుతుంటే గుమగుమలాడిపోతుంది అంతే.",
    "[00:57] యాక్చువల్ గా మీరు గరం మసాలా కూడా వాడుకోవచ్చు. కానీ అప్పటికప్పుడు చేసుకుని వేసిన పొడికి స్టోర్ చేసి ఉంచుకున్నటువంటి మసాలా పొడి వేసిన దానికి రుచిలో ఎక్కడా పొంతనే ఉండదు, అంత వేరియేషన్ ఉంటుంది.",
    "[01:09] ఈ పొడి వేస్తేనే మీకు రెసిపీ చాలా చాలా బాగుంటుంది.",
    "[01:12] దింపడానికి ఓ రెండు నిమిషాల ముందు ఏడు ఎనిమిది వెల్లుల్లి వేసి రెండు నిమిషాల పాటు రోస్ట్ చేసుకుని దింపి చల్లార్చుకుని పొడి చేసి పక్కన ఉంచుకోండి.",
    "[01:25] ఇప్పుడు కచ్చితంగా అడుగు మందంగా ఉన్నటువంటి మూకుడులో మాత్రమే 100 ml నూనె వేడి చేసుకోండి.",
    "[01:30] ఇందులో రెండు రెబ్బల కరివేపాకు, రెండు పచ్చిమిర్చి చీలికలు, రెండు ఎండుమిర్చి ముక్కలు వేసి వేపుకోండి.",
    "[01:36] ఆ తర్వాత ఓ టేబుల్ స్పూన్ ఫ్రెష్ గా గ్రైండ్ చేసుకున్నటువంటి అల్లం వెల్లుల్లి పేస్ట్ వేసి వేపుకోండి.",
    "[01:42] ఫ్రెష్ గా గ్రైండ్ చేసుకుంటేనే చాలా బాగుంటుంది ఈ పేస్ట్. యాక్చువల్ గా ఈ రెసిపీ చిత్తూరులో 40 ఏళ్ల పైన హోటల్ నడిపినటువంటి నాయుడు గారి రెసిపీ.",
    "[01:50] ఆయన చేతితో నాన్ వెజ్ ఏం చేసినా సరే ఆహా అని అనిపించక మానదు, అంత బెస్ట్ గా చేస్తారు ఆయన. ప్రస్తుతం ఆయన బెంగళూరులో సెటిల్ అయిపోయారు హోటల్ అది ఆపేసి.",
    "[02:00] ఆయన దగ్గర జాగ్రత్తగా శ్వేత నేర్చుకుంది ఈ రెసిపీ చాలా ఏళ్ల క్రితం.",
    "[02:03] ఇప్పుడు ఇందులో సాల్ట్, అర టీస్పూన్ పసుపు వేసి వేయించుకుని నూనె పైకి తేలేంత వరకు ఫ్రై చేసుకోండి.",
    "[02:12] ఆ తర్వాత రెండు టీస్పూన్ల ధనియాల పొడి, రెండు టేబుల్ స్పూన్ల కారం వేసి నూనెలో బాగా వేగనివ్వండి.",
    "[02:18] కారం, ధనియాల పొడి నూనెలో వేగడం మస్ట్. అప్పుడే ఫ్లేవర్స్ అన్ని బాగా రిలీజ్ అవుతాయి.",
    "[02:22] ఇది చాలా స్పైసీగా ఉంటుంది, మీరు కావాలంటే కారాలు తగ్గించుకోండి.",
    "[02:27] ఇప్పుడు ఇందులో అర కిలో నాటుకోడి ముక్కలు ఓ గంట పాటు ఉప్పు నీటిలో నానబెట్టుకున్నవి వేసుకోండి.",
    "[02:33] ఉప్పు నీటిలో నానబెట్టడం వల్ల ముక్క త్వరగా ఉడుకుతుంది, జ్యూసీగాను ఉంటుంది.",
    "[02:37] యాక్చువల్ గా ముక్కలు ఉప్పు నీటిలో నానబెట్టడం వల్ల ఉప్పు ఎక్కువగా పట్టదు, కాబట్టి ఉప్పు చూసుకుని వేసుకోండి.",
    "[02:42] ఈ ముక్కలు వేసి హై ఫ్లేమ్ మీద మూడు నాలుగు నిమిషాల పాటు ఫ్రై చేయండి.",
    "[02:46] ఆ తర్వాత 750 ml నీళ్లు పోసి కలుపుకుని ముక్క ఉడికి నీరు ఇగిరిపోయేంత వరకు కుక్ చేసుకోవాలి.",
    "[02:52] ఇది కేవలం మీడియం టు లో ఫ్లేమ్ మీద మాత్రమే జరిగి తీరాలి.",
    "[02:56] నాటుకోడి ముక్క త్వరగా ఉడకదు, కాబట్టి లో ఫ్లేమ్ మీద ఉడికితే చక్కగా ఉడుకుతుంది ముక్క. మధ్య మధ్యలో కలుపుతూ ఉండాలి.",
    "[03:04] ఇది సరిగ్గా వేగడానికి కనీసం 30 నుంచి 40 నిమిషాల టైం పడుతుంది.",
    "[03:09] 40 నిమిషాల తర్వాత ఇదిగో ఇలా ఉంటుంది, ఇంకాస్త చెమ్మ చెమ్మగా.",
    "[03:12] ఇదే కూర మీరు కాస్ట్ ఐరన్ మూకుడులో చేస్తే ఎంత బాగుంటుందో ముక్కలు చాలా బాగా వేగుతాయి.",
    "[03:17] ఇలా కాస్త చెమ్మగా ఉన్నప్పుడే ఇందాక మనం గ్రైండ్ చేసుకున్నటువంటి గరం మసాలా పొడి రెండు టీస్పూన్లు వేసి బాగా కలుపుకోండి.",
    "[03:24] తర్వాత మరో ఐదు నిమిషాల పాటు హై ఫ్లేమ్ మీద ముక్కలోని నీరు ఇగిరిపోయి క్రిస్పీగా అయ్యేంత వరకు ఫ్రై చేసుకోవాలి.",
    "[03:34] దింపడానికి ముందు రెండు టేబుల్ స్పూన్ల కొత్తిమీర తరుగు, రెండు రెబ్బల కరివేపాకు వేసి దింపుకోండి.",
    "[03:39] కరివేపాకు నూనెలో వేసి వేపితే ఒక రుచి, ఆఖరున వేసి దింపితే మరో రుచి ఉంటుంది. ఆఖరున వేస్తే చాలా బాగుంటుంది కరివేపాకు.",
    "[03:46] అంతే యు ఆర్ డన్. నాయుడు గారు చెప్పినటువంటి ఈ టిప్స్ ఫాలో అవుతూ మీరు చేస్తే కచ్చితంగా మీకు ది బెస్ట్ నాటుకోడి వేపుడు వచ్చి తీరుతుంది అంతే.",
    "[03:55] మీరు మనసారా ఆ పూట భోజనం చేసి తీరతారు, అంత బాగుంటుంది ట్రస్ట్ మీ.",
    "[03:59] మీకు నచ్చిందా? మరైతే మీరు తప్పకుండా ఈ రెసిపీని...",
    "[04:03] మీకు నచ్చిందా? మరైతే తప్పకుండా ఓ సారి vismaifood.com వెబ్సైట్ విజిట్ చేసి జాగ్రత్తగా ఈ రెసిపీని ఒకటికి రెండు సార్లు చదువుకుని చేయండి, పర్ఫెక్ట్ రెసిపీని ఎంజాయ్ చేయండి.",
    "[04:11] రెసిపీ తయారు చేసాక ఆ పిక్ ని విస్మై ఫుడ్ ఇన్స్టాగ్రామ్ లో పోస్ట్ చేయడం అస్సలు మర్చిపోకండి."
  ],
  "transcription_english": [
    "[00:00] Hello Foodies, Welcome to Vismai Food. Today's special is Natukodi Vepudu (Country Chicken Fry).",
    "[00:04] Having hot rice with Natukodi Vepudu and some pepper rasam, you can't help but say 'Aha, Naa Raja', it tastes that good.",
    "[00:14] Swetha is going to tell you truly the best Natukodi Vepudu recipe. It will turn out perfect every time you make it.",
    "[00:22] You will definitely have a satisfying meal, this is really true. There is a big story behind this, I will tell you all that in the video. Let's start.",
    "[00:30] First, in a pan, add 1 tablespoon coriander seeds, 3 dry red chillies, 1 teaspoon tail peppers (cubeb), 1 black cardamom...",
    "[00:38] 1 star anise, 1 bay leaf, 2 inches cinnamon stick, 4 green cardamoms, 5 cloves...",
    "[00:47] Just add two pinches of nutmeg powder and roast all these only on low flame.",
    "[00:52] Only then all the aromas will be released. This masala powder will smell amazing while you roast it.",
    "[00:57] Actually, you can use garam masala too. But there is no comparison in taste between freshly made powder and stored masala powder, there will be that much variation.",
    "[01:09] Only if you add this powder, your recipe will be very very good.",
    "[01:12] Two minutes before taking off the heat, add 7-8 garlic pods, roast for two minutes, take off, cool down, grind to a powder and keep aside.",
    "[01:25] Now heat 100 ml oil only in a pan with a definitely thick bottom.",
    "[01:30] Add two sprigs of curry leaves, two slit green chillies, two pieces of dry red chilli and fry.",
    "[01:36] After that, add 1 tablespoon of freshly ground ginger garlic paste and fry.",
    "[01:42] This paste tastes very good only if freshly ground. Actually, this recipe is from Naidu garu who ran a hotel in Chittoor for over 40 years.",
    "[01:50] Whatever non-veg dish he made with his hands, one couldn't help but say 'Aha', he makes it that best. Currently, he has settled in Bangalore after closing the hotel.",
    "[02:00] Swetha learnt this recipe carefully from him many years ago.",
    "[02:03] Now add salt, half teaspoon turmeric and fry until oil floats on top.",
    "[02:12] After that, add 2 teaspoons of coriander powder, 2 tablespoons of chilli powder and let it fry well in oil.",
    "[02:18] Chilli powder and coriander powder must fry in oil. Only then flavors will release well.",
    "[02:22] This will be very spicy, reduce chillies if you want.",
    "[02:27] Now add half a kilo of country chicken pieces that have been soaked in salt water for an hour.",
    "[02:33] Soaking in salt water makes the pieces cook faster and stay juicy.",
    "[02:37] Actually, since the pieces are soaked in salt water, they won't need much salt, so add salt carefully.",
    "[02:42] Add these pieces and fry for three to four minutes on high flame.",
    "[02:46] After that, pour 750 ml water, mix well and cook until the chicken is cooked and water evaporates.",
    "[02:52] This must happen only on medium to low flame.",
    "[02:56] Country chicken pieces don't cook fast, so if cooked on low flame, the pieces cook nicely. Keep stirring in between.",
    "[03:04] It takes at least 30 to 40 minutes for this to fry properly.",
    "[03:09] After 40 minutes, it looks like this, still a bit moist.",
    "[03:12] If you make this same curry in a cast iron pan, it tastes so good, the pieces fry very well.",
    "[03:17] When it is slightly moist like this, add 2 teaspoons of the garam masala powder we ground earlier and mix well.",
    "[03:24] Then fry for another five minutes on high flame until water in the pieces evaporates and they become crispy.",
    "[03:34] Before taking off, add 2 tablespoons of chopped coriander, two sprigs of curry leaves and remove from heat.",
    "[03:39] Curry leaves taste one way if fried in oil, and another way if added at the end. Curry leaves taste very good if added at the end.",
    "[03:46] That's it, you are done. If you follow these tips given by Naidu garu, you will definitely get the best Natukodi Vepudu.",
    "[03:55] You will definitely have a hearty meal that time, it tastes that good, trust me.",
    "[03:59] Did you like it? Then you must definitely try this recipe...",
    "[04:03] Did you like it? Then definitely visit vismaifood.com website once, read this recipe carefully once or twice and make it, enjoy the perfect recipe.",
    "[04:11] After making the recipe, don't forget to post that pic on Vismai Food Instagram."
  ]
}