{
  "metadata": {
    "title": "Dosakaya Kalchina Pachadi | దోసకాయ కాల్చిన పచ్చడి | Traditional Dosakaya Roti Pachadi |VismaiFood",
    "channel_name": "Vismai Food",
    "publish_date": "2019-06-26",
    "view_count": 431000,
    "like_count": 4400,
    "duration": "02:11",
    "language": "Telugu",
    "video_id": "L3aP_tP9u1g",
    "url": "https://www.youtube.com/watch?v=L3aP_tP9u1g",
    "description": "Making of Dosakaya Kalchina Pachadi / Cucumber Burnt Chutney in Telugu. This is a traditional chutney where the cucumber is roasted on a direct flame to give a smoky flavor. Best served with hot rice and ghee.",
    "ingredients_detected": [
      "Cucumber",
      "Oil",
      "Fenugreek Seeds",
      "Mustard Seeds",
      "Urad Dal",
      "Curry Leaves",
      "Green Chillies",
      "Cumin Seeds",
      "Asafoetida",
      "Coriander Leaves",
      "Salt",
      "Tamarind"
    ]
  },
  "transcription_telugu": [
    "[00:00] హలో ఫుడీస్ వెల్కమ్ టు విస్మై ఫుడ్. ఇవాల్టి స్పెషల్ సంప్రదాయ పద్ధతిలో చేసేటువంటి దోసకాయ కాల్చిన పచ్చడి.",
    "[00:05] సింపుల్ ట్రెడిషనల్ రెసిపీ ఇది. వేడి వేడి అన్నంలో నెయ్యి వేసుకొని తింటే ఎంత బాగుంటుందో.",
    "[00:10] చాలా ఎంజాయ్ చేస్తారు ఇది. మీరు ఎప్పుడు చేసినా చాలా పర్ఫెక్ట్ గా పక్కా రెసిపీ వస్తుంది. లెట్స్ స్టార్ట్.",
    "[00:19] ముందుగా ఓ పెద్ద దోసకాయకి నూనె రాసి, స్టవ్ మీద స్టాండ్ పెట్టి దాన్ని అన్ని వైపులా తిప్పుకుంటూ కాల్చుకోండి హై ఫ్లేమ్ మీద.",
    "[00:27] దోసకాయ పైన స్కిన్ పూర్తిగా నల్లగా మాడిపోవాలి. అందాక తిప్పుకుంటూ కాల్చుకోండి.",
    "[00:33] దీనికి కనీసం 15 నిమిషాల టైం పడుతుంది. బాగా కాలాక తీసి చల్లార్చుకోండి.",
    "[00:38] ఇప్పుడు మూకుడులో ఓ టేబుల్ స్పూన్ నూనె వేడి చేసి, అందులో ఓ టీస్పూన్ మెంతులు, ఓ టీస్పూన్ ఆవాలు వేసి ఓ నిమిషం పాటు ఫ్రై చేసుకోండి.",
    "[00:46] మెంతులు సరిగ్గా ఫ్రై అవ్వకపోతే పచ్చడిలో చేదుగా మిగిలిపోతుందని గుర్తుంచుకోండి.",
    "[00:50] ఇప్పుడు ఓ టేబుల్ స్పూన్ మినప్పప్పు వేసి మంచి అరోమా వచ్చేంత వరకు ఫ్రై చేసుకోండి.",
    "[00:57] ఆ తర్వాత రెండు రెబ్బల కరివేపాకు, 15 పచ్చిమిర్చి వేసి జస్ట్ ఓ నిమిషం పాటు పచ్చిమిర్చిని ఫ్రై చేసుకోండి అంతే.",
    "[01:04] పచ్చిమిర్చి అస్సలు వేగకూడదు. మరీ పచ్చి వాసన రాకూడదని ఏదో ఓ నిమిషం పాటు అలా ఫ్రై చేయడం అంతే.",
    "[01:09] ఇప్పుడు ఓ టీస్పూన్ జీలకర్ర, రెండు చిటికెళ్ళ ఇంగువ వేసుకోండి.",
    "[01:13] ఇక్కడ మీకు నచ్చకపోతే ఇంగువ ప్లేస్ లో నాలుగైదు వెల్లుల్లి రెబ్బలు కూడా వేసుకోవచ్చు.",
    "[01:17] ఇవన్నీ వేసి ఓ నిమిషం పాటు ఫ్రై చేసుకొని, దింపేసుకొని చల్లార్చుకోండి.",
    "[01:19] ఇప్పుడు దోసకాయ పైన చెక్కు తీసేయండి. దోసకాయ పైన కాస్త చెక్కు ఉన్నా బాగుంటుంది, మంచి స్మోకీ ఫ్లేవర్ తో పచ్చడి.",
    "[01:27] ఇప్పుడు దోసకాయని చిన్న చిన్న ముక్కలుగా కట్ చేసుకోండి.",
    "[01:32] దోసకాయ పచ్చడి చేసే ముందు ఓ సారి చేదు ఉందో లేదో కూడా చూసుకోవడం మర్చిపోకండి.",
    "[01:38] ఇప్పుడు మిక్సీ జార్ లో ముందు వేయించుకున్నటువంటి తాలింపు, ఆ తర్వాత అరకట్ట కొత్తిమీర తరుగు, సాల్ట్, గోలీ సైజు చింతపండు, దోసకాయ ముక్కలు వేసి ఫైన్ గా పేస్ట్ చేసుకోండి.",
    "[01:49] సహజంగా ఈ పచ్చడి సంప్రదాయ పద్ధతిలో ఫైన్ గానే పేస్ట్ చేస్తారు. మీకు నచ్చకపోతే గనక కొంచెం కోర్స్ గా కూడా గ్రైండ్ చేసుకోవచ్చు. దట్స్ ఆల్ అప్ టు యు.",
    "[01:57] ఇది అట్లలోకి కూడా చాలా చాలా బాగుంటుంది. మీకు నచ్చిందా? కచ్చితంగా ట్రై చేయండి, చాలా బాగా నచ్చుతుంది, చాలా ఎంజాయ్ చేస్తారు.",
    "[02:05] మీరు ట్రై చేసి మీకు ఎలా కుదిరిందో కచ్చితంగా ఆ పిక్ ని విస్మై ఫుడ్ ఇన్స్టాగ్రామ్ లో పోస్ట్ చేయండి. అలాగే vismaifood.com వెబ్సైట్ విజిట్ చేయడం మర్చిపోకండి."
  ],
  "transcription_english": [
    "[00:00] Hello Foodies, Welcome to Vismai Food. Today's special is the traditional roasted cucumber chutney.",
    "[00:05] This is a simple traditional recipe. It tastes amazing when eaten with hot rice and ghee.",
    "[00:10] You will enjoy this a lot. Whenever you make it, you will get a perfect and sure-shot recipe. Let's start.",
    "[00:19] First, apply oil to a large cucumber, place a stand on the stove, and roast it on high flame while turning it on all sides.",
    "[00:27] The skin of the cucumber should turn completely black and charred. Roast it while turning until then.",
    "[00:33] This takes at least 15 minutes. Once roasted well, remove and let it cool.",
    "[00:38] Now heat a tablespoon of oil in a pan, add a teaspoon of fenugreek seeds, a teaspoon of mustard seeds, and fry for a minute.",
    "[00:46] Remember, if fenugreek seeds are not fried properly, the chutney will taste bitter.",
    "[00:50] Now add a tablespoon of urad dal and fry until a nice aroma comes.",
    "[00:57] Then add two sprigs of curry leaves, 15 green chillies, and just fry the green chillies for a minute, that's it.",
    "[01:04] The green chillies should not be fully fried. Just frying for a minute to remove the raw smell.",
    "[01:09] Now add a teaspoon of cumin seeds and two pinches of asafoetida.",
    "[01:13] If you don't like asafoetida, you can add four to five garlic pods instead.",
    "[01:17] Fry all these for a minute, remove from heat, and let it cool.",
    "[01:19] Now peel the skin off the cucumber. It's okay if some skin remains, it gives a nice smoky flavor to the chutney.",
    "[01:27] Now cut the cucumber into small pieces.",
    "[01:32] Before making the cucumber chutney, don't forget to check if it's bitter.",
    "[01:38] Now in a mixer jar, add the fried tempering first, then half a bunch of chopped coriander, salt, marble-sized tamarind, and cucumber pieces, and grind into a fine paste.",
    "[01:49] Usually, this chutney is ground into a fine paste in the traditional method. If you don't like it, you can grind it coarsely. That's all up to you.",
    "[01:57] This tastes very very good with dosas as well. Did you like it? Definitely try it, you will like it very much and enjoy it.",
    "[02:05] Try it and definitely post the picture of how it turned out on Vismai Food Instagram. Also, don't forget to visit the vismaifood.com website."
  ]
}