{
  "metadata": {
    "title": "Tomato Kothimeera pachadi| టమాటో కొత్తిమీర పచ్చడి| అన్నం, టిఫిన్స్ లోకి అదిరిపోయే టమాటో చట్నీ",
    "channel_name": "Vismai Food",
    "publish_date": "2019-06-27",
    "view_count": 526000,
    "like_count": 6500,
    "duration": "02:24",
    "language": "Telugu",
    "video_id": "Unknown",
    "url": "https://www.youtube.com/watch?v=Unknown",
    "description": "Tomato Kothimeera Pachadi or Tomato Coriander Chutney is a versatile and aromatic chutney that goes perfectly with rice, idli, dosa, and other tiffins. This recipe is a Type 2 version, showcasing a different style of making this popular chutney.",
    "ingredients_detected": [
      "Tomato",
      "Coriander Leaves",
      "Oil",
      "Mustard Seeds",
      "Fenugreek Seeds",
      "Chana Dal",
      "Urad Dal",
      "Coriander Seeds",
      "Dry Red Chillies",
      "Garlic Pods",
      "Green Chillies",
      "Ginger",
      "Cumin Seeds",
      "Asafoetida",
      "Salt",
      "Turmeric",
      "Tamarind Pulp"
    ]
  },
  "transcription_telugu": [
    "[00:00] హలో ఫుడీస్, వెల్కమ్ టు విస్మై ఫుడ్. ఇవాల్టి స్పెషల్ టమాటో కొత్తిమీర పచ్చడి.",
    "[00:04] టమాటో పచ్చడి అంటే అందరికీ ఇష్టమే. వేడి వేడి నెయ్యన్నంలో అయితే ఇక మాటల్లేవ్.",
    "[00:09] ఇంకా అట్టు, ఇడ్లీ ఇలాంటి వాటిలో కూడా చాలా చాలా బాగుంటుంది.",
    "[00:13] ఈ టమాటో కొత్తిమీర పచ్చడిలో ఇంటికి, ఊరికి, ప్రాంతానికి ఒక్కొక్కరు ఒక్కొక్క టైపులో చేస్తూ ఉంటారు.",
    "[00:17] మేమే కొన్ని నెలల క్రితం ఓ టైపు ఆఫ్ కొత్తిమీర చట్నీ చేసాం ఛానల్ లో.",
    "[00:21] ఇది టైపు 2. ఇంకా తెలంగాణ వాళ్ళు మరో స్టైల్ లో చేస్తారు. అది టైపు 3. అది ఇంకోసారి చూపిస్తాను.",
    "[00:26] లెట్స్ స్టార్ట్ టమాటో కొత్తిమీర పచ్చడి టైపు 2.",
    "[00:29] ముందుగా కడాయిలో ఓ టీస్పూన్ ఆయిల్ హీట్ చేసుకొని, అందులో ఓ టీస్పూన్ ఆవాలు, ఓ టీస్పూన్ మెంతులు వేసి ఆవాలు చిటపటమనేంత వరకు ఫ్రై చేసుకోండి.",
    "[00:39] ఆ తర్వాత ఓ టేబుల్ స్పూన్ శనగపప్పు, ఓ టేబుల్ స్పూన్ మినప్పప్పు, ఓ టేబుల్ స్పూన్ ధనియాలు, పది ఎండుమిర్చి వేసి రెండు మూడు నిమిషాల పాటు రోస్ట్ చేసుకోండి.",
    "[00:54] ఆ తర్వాత ఏడు ఎనిమిది వెల్లుల్లి, పది పచ్చిమిర్చి, ఓ ఇంచు అల్లం తరుగు వేసి మూడు నాలుగు నిమిషాల పాటు ఫ్రై చేసుకోండి.",
    "[01:01] తాలింపు మంచి సువాసన రావాలి, పచ్చిమిర్చి బాగా మగ్గాలి. అందాక ఫ్రై చేసుకోండి.",
    "[01:08] ఆ తర్వాత మిక్సీ జార్ లో వేసి ఫైన్ గా పేస్ట్ చేసుకోండి నీళ్లు వేయకుండా.",
    "[01:15] ఇప్పుడు అదే మూకుట్లో ఓ టేబుల్ స్పూన్ ఆయిల్ హీట్ చేసి, ఇందులో అరకిలో బాగా పండినటువంటి నాటు టమాటో ముక్కలు వేసి, అందులో సాల్ట్ కూడా వేసి బాగా కలుపుకొని, మూత పెట్టి టమాటోలు మెత్తగా మగ్గించుకోండి.",
    "[01:31] మధ్య మధ్యలో కలుపుతూ ఉండండి. ఈ పచ్చడికి కేవలం నాటు టమాటోలు అయితేనే రుచి.",
    "[01:38] టమాటోలు బాగా మగ్గాక ఓ పెద్ద కొత్తిమీర కట్ట కాడలతో సహా వేసుకోండి. తర్వాత రెండు టేబుల్ స్పూన్ల చింతపండు పేస్ట్.",
    "[01:44] ఈ చింతపండు పేస్ట్ అన్నది మీరు వాడిన టమాటోల పులుపును బట్టి అడ్జస్ట్ చేసుకోవాల్సి ఉంటుంది.",
    "[01:49] ఇది వేసి జస్ట్ ఓ నిమిషం పాటు మగ్గించుకోండి చాలు ఎక్కువ సేపు మగ్గించకండి. కొత్తిమీర అరోమా మిస్ అయిపోతుంది.",
    "[01:55] ఇప్పుడు ఇది ఇందాక గ్రైండ్ చేసుకున్నటువంటి తాలింపులో వేసి, పావు చెంచా పసుపు వేసి నీళ్లు లేకుండా మెత్తని పేస్ట్ గా చేసుకోండి.",
    "[02:04] నీళ్లు లేకుండా గాని మీరు పచ్చడి గ్రైండ్ చేసుకుంటే కనీసం రెండు మూడు రోజుల పాటు నిల్వ ఉంటుంది.",
    "[02:08] అంతే యు ఆర్ డన్. చాలా చాలా బాగుంటుంది, చాలా అరోమాటిక్ గా ఉంటుంది. కచ్చితంగా అందరికీ నచ్చి తీరుతుంది.",
    "[02:15] నచ్చిందా మీకు? మరైతే మీరు ట్రై చేసి మీకు ఎలా కుదిరిందో కచ్చితంగా ఆ పిక్ ని విస్మై ఫుడ్ ఇన్స్టాగ్రామ్ లో పోస్ట్ చేయండి.",
    "[02:20] బై ది వే vismaifood.com వెబ్సైట్ విజిట్ చేయడం అస్సలు మర్చిపోకండి."
  ],
  "transcription_english": [
    "[00:00] Hello Foodies, Welcome to Vismai Food. Today's special is Tomato Coriander Chutney.",
    "[00:04] Everyone likes Tomato Chutney. With hot ghee rice, there are no words to describe it.",
    "[00:09] It also tastes very very good with Dosa, Idli and such tiffins.",
    "[00:13] For this Tomato Coriander Chutney, different households, villages and regions make it in different types.",
    "[00:17] We made one type of coriander chutney a few months ago on our channel.",
    "[00:21] This is type 2. Telangana people make it in another style, that is type 3. I will show that another time.",
    "[00:26] Let's start Tomato Coriander Chutney Type 2.",
    "[00:29] First, heat a teaspoon of oil in a kadai, add a teaspoon of mustard seeds, a teaspoon of fenugreek seeds and fry until mustard seeds splutter.",
    "[00:39] Then add a tablespoon of chana dal, a tablespoon of urad dal, a tablespoon of coriander seeds, ten dry red chillies and roast for two to three minutes.",
    "[00:54] Then add seven to eight garlic pods, ten green chillies, an inch of chopped ginger and fry for three to four minutes.",
    "[01:01] The tempering should give a nice aroma, and green chillies should soften well. Fry until then.",
    "[01:08] Then put it in a mixer jar and make a fine paste without adding water.",
    "[01:15] Now heat a tablespoon of oil in the same kadai, add half a kilo of well-ripened country tomato pieces, add salt too, mix well, cover and cook until tomatoes become soft and mushy.",
    "[01:31] Keep stirring in between. This chutney tastes good only with country tomatoes.",
    "[01:38] Once tomatoes are cooked well, add a big bunch of coriander leaves along with stalks. Then two tablespoons of tamarind paste.",
    "[01:44] You need to adjust this tamarind paste based on the sourness of the tomatoes you used.",
    "[01:49] Add this and cook for just a minute, that's enough, don't cook for too long. Coriander aroma will be lost.",
    "[01:55] Now add this to the tempering ground earlier, add a quarter spoon of turmeric and grind to a smooth paste without water.",
    "[02:04] If you grind the chutney without water, it stays fresh for at least two to three days.",
    "[02:08] That's it, you are done. It tastes very very good, very aromatic. Everyone will definitely like it.",
    "[02:15] Did you like it? Then you try it and definitely post the picture on Vismai Food Instagram sharing how it turned out for you.",
    "[02:20] By the way, don't forget to visit vismaifood.com website."
  ]
}