{
  "metadata": {
    "title": "CARROT PEANUT FRY|కెరట్ పల్లీల ఫ్రై|కేరట్ ఫ్రై ఇవి వేసి చేస్తే గొప్ప రుచి ఆరోగ్యం",
    "channel_name": "Vismai Food",
    "publish_date": "2019-07-17",
    "view_count": 2500000,
    "like_count": 28000,
    "duration": "02:35",
    "language": "Telugu",
    "video_id": "Unknown",
    "url": "https://www.youtube.com/watch?v=Unknown",
    "description": "Carrot Peanut Fry is a tasty and healthy recipe by Vismai Food. This unique style of carrot fry, made with a special peanut and spice powder, changes the perception of carrot curry. It's so delicious that you'll want to make it multiple times a week. The recipe involves boiling carrots and then sautéing them with a freshly ground masala powder made from peanuts, sesame seeds, dry coconut, and spices.",
    "ingredients_detected": [
      "Carrot",
      "Water",
      "Peanuts",
      "Coriander Seeds",
      "Chana Dal",
      "Cumin Seeds",
      "Sesame Seeds",
      "Dry Coconut",
      "Garlic",
      "Salt",
      "Chilli Powder",
      "Oil",
      "Mustard Seeds",
      "Curry Leaves",
      "Turmeric",
      "Coriander Leaves"
    ]
  },
  "transcription_telugu": [
    "[00:00] హలో ఫుడీస్, వెల్కమ్ టు విస్మై ఫుడ్. ఇవాల్టి స్పెషల్ టేస్టీ క్యారెట్ ఫ్రై.",
    "[00:05] క్యారెట్ అనగానే ఎక్కువగా ఏదో ఓ కూరలో కొద్దిగా వేసుకుంటారు క్యారెట్ ని.",
    "[00:10] కానీ క్యారెట్ నే కూరగా చేసుకోవడానికి ఎక్కువ మంది ఇష్టపడరు.",
    "[00:13] కానీ ఈ స్టైల్ లో మీరు కూర చేస్తే వారానికి కచ్చితంగా కనీసం రెండు సార్లయినా చేసి తీరుతారు, అంత బాగుంటుంది ఈ కూర.",
    "[00:19] శ్వేత చాలా బాగా చేస్తుంది ఈ కూర. లెట్స్ స్టార్ట్.",
    "[00:22] ముందుగా ఓ బౌల్ లో 200ml నీళ్లు పోసి అందులో అర కిలో క్యారెట్ ముక్కలు వేసి మూత పెట్టి మీడియం ఫ్లేమ్ మీద ముక్కలు మెత్తగా ఉడికించుకోండి.",
    "[00:30] మరీ ఎక్కువగా నీళ్లు మాత్రం పోయకండి.",
    "[00:34] ఇప్పుడు పాన్ లో పావు కప్పు పల్లీలు వేసి రెండు మూడు నిమిషాల పాటు వేపుకోండి లో ఫ్లేమ్ మీద.",
    "[00:41] ఆ తర్వాత ఓ టేబుల్ స్పూన్ ధనియాలు, ఓ టీస్పూన్ పచ్చి శనగపప్పు, ఓ టీస్పూన్ జీలకర్ర వేసి మంచి సువాసన వచ్చేంత వరకు లో ఫ్లేమ్ మీద వేపుకోండి.",
    "[00:49] చాలా బాగా వేగుతాయి, అప్పుడే చాలా బాగుంటుంది పొడి.",
    "[00:54] ఇప్పుడు పావు కప్పు నువ్వులు వేసి, నువ్వులు చిటపటమనేంత వరకు ఫ్రై చేసుకోండి.",
    "[01:00] ఆ తర్వాత పావు కప్పు ఎండు కొబ్బరి పొడి వేసి జస్ట్ ఓ రెండు నిమిషాల పాటు వేపుకుంటే చాలు.",
    "[01:05] కొబ్బరి రంగు మారగానే దింపేసి చల్లార్చి మిక్సీ లో వేసి ఫైన్ గా పౌడర్ చేసుకోండి.",
    "[01:17] ఫైన్ గా పౌడర్ అయ్యాక 7-8 వెల్లుల్లి, ఉప్పు, ఓ టేబుల్ స్పూన్ కారం వేసి గ్రైండ్ చేసుకోండి.",
    "[01:24] వెల్లుల్లి ముందుగా వేస్తే పేస్ట్ అవుతుంది అందుకని పౌడర్ అయ్యాక జస్ట్ రెండు సార్లు పల్స్ చేస్తే చాలు.",
    "[01:30] ఇప్పుడు కడాయి లో మూడు టేబుల్ స్పూన్ల ఆయిల్ హీట్ చేసి, అందులో ఓ టీస్పూన్ ఆవాలు, ఓ రెబ్బ కరివేపాకు వేసి ఆవాలు చిటపటమనిపించి...",
    "[01:39] అర టీస్పూన్ పసుపు కూడా వేసి వేపుకోండి.",
    "[01:42] ఇప్పుడు ఉడికించుకున్న క్యారెట్ ముక్కలు వేసుకోండి. యాక్చువల్ గా అర కిలో క్యారెట్ కి మనం పోసిన నీళ్లు సరిగ్గా సరిపోతాయి.",
    "[01:49] ఒకవేళ మీరు ఎక్కువ నీళ్లు గాని పోసినట్లయితే నీళ్లు ఒంపేసి క్యారెట్ ముక్కలు వేసుకోండి.",
    "[01:53] క్యారెట్ ముక్కలు వేసి మీడియం ఫ్లేమ్ మీద 7 నుంచి 8 నిమిషాల పాటు ఫ్రై చేసుకోండి.",
    "[01:57] మధ్య మధ్యలో కలుపుతూ ఉండండి.",
    "[01:58] ఆ తర్వాత గ్రైండ్ చేసుకున్న పల్లీల పొడి అర కప్పు వేసి బాగా కలుపుకోండి.",
    "[02:03] ఇంకా కొద్దిగా పొడి మిగులుతుంది, ఈ పొడిని మరోసారి వాడుకోవడానికి ట్రై చేయండి.",
    "[02:09] దింపే ముందు కొత్తిమీర తరుగు చల్లి దింపుకోండి. అంతే యు ఆర్ డన్.",
    "[02:13] నచ్చిందా? ఇదే విధంగా మీరు క్యారెట్ బీట్రూట్ కలిపి కలగూర గా కూడా చేసుకోవచ్చు.",
    "[02:17] ఒట్టి ఆలూ తో కూడా ఈ పొడి చల్లుకొని కూర గా చేసుకోవచ్చు, చాలా చాలా బాగుంటుంది.",
    "[02:22] మీరు ఎప్పుడు చేసుకున్నా చాలా తృప్తిగా భోజనం చేస్తారు, అంత బాగుంటుంది.",
    "[02:26] మీరు ట్రై చేసి మీకు ఎలా కుదిరిందో కచ్చితంగా ఆ పిక్ ని విస్మై ఫుడ్ ఇన్స్టాగ్రామ్ లో పోస్ట్ చేయండి.",
    "[02:30] బై ది వే, vismaifood.com వెబ్సైట్ విజిట్ చేయడం మర్చిపోకండి, అలాగే మా ఫేస్బుక్ పేజీ ని లైక్ చేయండి."
  ],
  "transcription_english": [
    "[00:00] Hello Foodies, Welcome to Vismai Food. Today's special is Tasty Carrot Fry.",
    "[00:05] When we say carrot, usually people just add a little bit of carrot into some other curry.",
    "[00:10] But not many people like to make a curry just with carrots.",
    "[00:13] But if you make curry in this style, you will definitely make it at least twice a week, it is that good.",
    "[00:19] Swetha makes this curry very well. Let's start.",
    "[00:22] First, pour 200ml water in a bowl, add half a kilo of carrot pieces, cover and cook on medium flame until soft.",
    "[00:30] Do not pour too much water though.",
    "[00:34] Now add a quarter cup of peanuts in a pan and fry for 2-3 minutes on low flame.",
    "[00:41] Then add 1 tbsp coriander seeds, 1 tsp chana dal, 1 tsp cumin seeds and fry on low flame until aromatic.",
    "[00:49] They fry very well, only then the powder tastes good.",
    "[00:54] Now add a quarter cup of sesame seeds and fry until they splutter.",
    "[01:00] After that, add a quarter cup of dry coconut powder and fry for just 2 minutes.",
    "[01:05] Once the coconut changes color, remove, cool, and grind into a fine powder.",
    "[01:17] After it becomes fine powder, add 7-8 garlic cloves, salt, 1 tbsp chili powder and grind.",
    "[01:24] If you add garlic first, it becomes a paste, so just pulse twice after it becomes powder.",
    "[01:30] Now heat 3 tbsp oil in a pan, add 1 tsp mustard seeds, 1 sprig curry leaves, let the mustard splutter...",
    "[01:39] Add half a teaspoon of turmeric and fry.",
    "[01:42] Now add the boiled carrot pieces. Actually, for half a kilo of carrots, the water we poured is sufficient.",
    "[01:49] If you poured more water, drain the water and add the carrot pieces.",
    "[01:53] Add carrot pieces and fry on medium flame for 7 to 8 minutes.",
    "[01:57] Keep stirring in between.",
    "[01:58] Then add half a cup of the ground peanut powder and mix well.",
    "[02:03] Some powder will be left over, try to use this powder another time.",
    "[02:09] Sprinkle chopped coriander before taking off. That's it, you are done.",
    "[02:13] Did you like it? In the same way, you can mix carrot and beetroot and make a mixed curry.",
    "[02:17] You can also make plain potato curry by sprinkling this powder, it tastes very very good.",
    "[02:22] Whenever you make it, you will have a satisfying meal, it is that good.",
    "[02:26] You try it and definitely post the picture of how it turned out on Vismai Food Instagram.",
    "[02:30] By the way, don't forget to visit vismaifood.com website, and also like our facebook page."
  ]
}