{
  "metadata": {
    "title": "Perfect Rasam Powder | రసం పొడి ఈ కొలతలతో చేసి చూడండి అద్భుతమైన రుచి గ్యారంటీ | Vismai Food",
    "channel_name": "Vismai Food",
    "publish_date": "2019-07-20",
    "view_count": 800000,
    "like_count": 18000,
    "duration": "01:42",
    "language": "Telugu",
    "video_id": "sJ0eG5e5v_g",
    "url": "https://www.youtube.com/watch?v=sJ0eG5e5v_g",
    "description": "Learn how to make the perfect Rasam Powder at home with exact measurements. This aromatic powder lets you prepare delicious Rasam in just 5-10 minutes. The recipe includes roasting spices like coriander seeds, cumin, pepper, and toor dal in specific ratios to ensure a flavorful outcome that can be stored for up to 6 months.",
    "ingredients_detected": [
      "Coriander Seeds",
      "Cumin Seeds",
      "Black Pepper",
      "Toor Dal",
      "Dry Red Chillies",
      "Curry Leaves",
      "Turmeric",
      "Asafoetida"
    ]
  },
  "transcription_telugu": [
    "[00:00] హలో ఫుడీస్, వెల్కమ్ టు విస్మై ఫుడ్. ఇవాల్టి స్పెషల్ పర్ఫెక్ట్ కొలతలతో రసం పొడి.",
    "[00:06] ఎప్పుడైనా సరే ఇన్స్టంట్ గా రసం పెట్టుకోవాలని అనుకున్నారనుకోండి, ఈ పొడి ఒకటి ఉంచుకుంటే చాలు జస్ట్ 5 నుంచి 10 నిమిషాల లోపు మీ రసం తయార్.",
    "[00:14] లెట్స్ స్టార్ట్ పర్ఫెక్ట్ రసం పొడి రెసిపీ.",
    "[00:16] ముందుగా ఒక కప్పు ధనియాలు వేసి కేవలం లో ఫ్లేమ్ మీద మాత్రమే మంచి సువాసన వచ్చేంత వరకు రోస్ట్ చేసుకోండి.",
    "[00:23] ఆ తర్వాత దింపి చల్లార్చుకోండి.",
    "[00:25] ఇప్పుడు పావు కప్పు జీలకర్ర వేసి కేవలం లో ఫ్లేమ్ మీద మాత్రమే మంచి సువాసన వచ్చేంత వరకు వేపుకోండి.",
    "[00:31] వేపుకునేటప్పుడు నాన్ స్టిక్ పాన్ లలో కాకుండా కాస్ట్ ఐరన్, ఐరన్ మూకుళ్లలో వేపండి గింజ లోపలి వరకు వేగి చాలా బాగుంటుంది పొడి.",
    "[00:38] ఇప్పుడు పావు కప్పు మిరియాలు వేసి లో ఫ్లేమ్ మీద మంచి సువాసన వచ్చేంత వరకు వేపుకోండి.",
    "[00:43] మిరియాలు చక్కగా వేగి మంచి సువాసన వస్తున్నప్పుడు దింపి చల్లార్చుకోండి.",
    "[00:47] ఇప్పుడు పావు కప్పు కందిపప్పు కూడా వేసి లో ఫ్లేమ్ మీదే మంచి సువాసన వచ్చేంత వరకు వేపుకోండి, దింపుకొని చల్లార్చుకోండి.",
    "[00:54] ఇప్పుడు పావు కప్పు ఎండుమిర్చి వేసి, ఎండుమిర్చి కాస్త క్రిస్ప్ అయ్యి మంచి సువాసన వచ్చేంత వరకు వేపుకోండి తర్వాత దింపి చల్లార్చుకోండి.",
    "[01:01] ఇప్పుడు పావు కప్పు కరివేపాకు వేసి కాస్త చెమ్మ పోయి డ్రై అయ్యేంత వరకు ఆకుని వేపుకోండి. తర్వాత దింపి చల్లార్చుకోండి.",
    "[01:09] ఇప్పుడు చల్లారిన వీటన్నిటిని కాస్త బరకగా గ్రైండ్ చేసుకోండి మరీ మెత్తగా ఫైన్ పౌడర్ చేయకండి.",
    "[01:14] చాలా మంది ఈ పొడిలో ఒక టేబుల్ స్పూన్ పసుపు, ఒక టీస్పూన్ ఇంగువ కూడా వేస్తారు. నచ్చిన వారు వేసుకోండి.",
    "[01:17] కానీ శ్వేత మాత్రం చారు కాచేటప్పుడే పసుపు, ఇంగువ వేస్తే బాగుంటుందని వేయలేదు. నచ్చిన వారు పొడిలోనే కలిపేసుకోవచ్చు.",
    "[01:23] మీరు ఎంత క్వాంటిటీ అన్నా చేసుకోండి. కప్పుకి పావు కప్పు మిగిలిన అన్ని సామగ్రి. గుర్తుంది కదా?",
    "[01:28] ఇలా ఈ పొడి చేసి మీరు ఎయిర్ టైట్ డబ్బాలో పెట్టి ఫ్రిడ్జ్ లో పెట్టుకుంటే కనీసం 5-6 నెలలు ఫ్రెష్నెస్ గ్యారెంటీ.",
    "[01:34] నచ్చిందా? మరైతే మీరు ట్రై చేసి మీకు ఎలా కుదిరిందో కచ్చితంగా ఆ పిక్ ని విస్మై ఫుడ్ ఇన్స్టాగ్రామ్ లో పోస్ట్ చేయండి.",
    "[01:39] బై ది వే vismaifood.com వెబ్సైట్ విజిట్ చేయడం మర్చిపోకండి."
  ],
  "transcription_english": [
    "[00:00] Hello Foodies, Welcome to Vismai Food. Today's special is Rasam Powder with perfect measurements.",
    "[00:06] Whenever you want to make Rasam instantly, just having this powder is enough, your Rasam will be ready in just 5 to 10 minutes.",
    "[00:14] Let's start the perfect Rasam Powder recipe.",
    "[00:16] First, add 1 cup of coriander seeds and roast them only on low flame until they become aromatic.",
    "[00:23] After that, remove and let them cool.",
    "[00:25] Now add a quarter cup of cumin seeds and roast them only on low flame until aromatic.",
    "[00:31] While roasting, instead of non-stick pans, use cast iron or iron pans, so the seeds roast evenly inside out and the powder tastes great.",
    "[00:38] Now add a quarter cup of black pepper and roast on low flame until aromatic.",
    "[00:43] When the pepper is roasted well and smells good, remove and cool it down.",
    "[00:47] Now add a quarter cup of toor dal and roast on low flame until aromatic, remove and cool.",
    "[00:54] Now add a quarter cup of dry red chillies, roast until they become crisp and aromatic, then remove and cool.",
    "[01:01] Now add a quarter cup of curry leaves and roast until the moisture is gone and the leaves become dry. Then remove and cool.",
    "[01:09] Now grind all these cooled ingredients into a slightly coarse powder, do not make it too fine.",
    "[01:14] Many people add a tablespoon of turmeric and a teaspoon of asafoetida to this powder. Add if you like.",
    "[01:17] But Swetha didn't add them as she feels adding turmeric and asafoetida while making Rasam tastes better. Those who like can mix it in the powder itself.",
    "[01:23] You can make any quantity. For one cup (of coriander), use a quarter cup of all other ingredients. Remember that?",
    "[01:28] If you make this powder and store it in an airtight container in the fridge, freshness is guaranteed for at least 5-6 months.",
    "[01:34] Did you like it? Then try it out and definitely post the picture of how it turned out on Vismai Food Instagram.",
    "[01:39] By the way, don't forget to visit the vismaifood.com website."
  ]
}