{
  "metadata": {
    "title": "Vangi Bath|వాంగీ బాత్| కర్ణాటక స్పెషల్ వాంగీ బాత్ ఇలా చేస్తే వదలకుండా తింటారు| Brinjal Rice",
    "channel_name": "Vismai Food",
    "publish_date": "2019-07-28",
    "view_count": 686000,
    "like_count": 9100,
    "duration": "02:56",
    "language": "Telugu",
    "video_id": "Unknown",
    "url": "https://www.youtube.com/watch?v=Unknown",
    "description": "Learn how to make authentic Karnataka style Vangi Bath. This flavorful brinjal rice is perfect for lunch boxes, special occasions, or using up leftover rice. The recipe includes a special Vangi Bath masala powder made from scratch.",
    "ingredients_detected": [
      "Brinjal",
      "Cooked Rice",
      "Oil",
      "Dry red Chillies",
      "Coriander Seeds",
      "Chana Dal",
      "Sesame Seeds",
      "Urad dal",
      "Dry Coconut Powder",
      "Turmeric",
      "Mustard Seeds",
      "Cumin Seeds",
      "Ginger",
      "Garlic",
      "Green Chillies",
      "Onion",
      "Cashews",
      "Tomatoes",
      "Salt",
      "Tamarind Juice",
      "Jaggery",
      "Asafoetida",
      "Coriander Leaves"
    ]
  },
  "transcription_telugu": [
    "[00:00] హలో ఫుడీస్, వెల్కమ్ టు విస్మై ఫుడ్. ఇవాల్టి స్పెషల్ కర్ణాటక స్పెషల్ వాంగీ బాత్.",
    "[00:06] లంచ్ బాక్సులకి లేదా అన్నం మిగిలిపోయినా లేదా ఏదైనా స్పెషల్ అకేషన్ కి ఓ స్పెషల్ టేస్టీ రెసిపీ కావాలనుకుంటున్నారా?",
    "[00:13] అయితే వాంగీ బాత్ ఇస్ ది పర్ఫెక్ట్ రెసిపీ. పిల్లలు పెద్దలు అందరికీ నచ్చేస్తుంది. చేయడం కూడా చాలా తేలిక.",
    "[00:20] చాలా చాలా బాగుంటుంది, చాలా పర్ఫెక్ట్ రెసిపీ ఇది. ఈ వాంగీ బాత్ ఇంటింటికి ఓ రకంగా చేస్తూ ఉంటారు కర్ణాటకలో.",
    "[00:27] లెట్స్ స్టార్ట్ వాంగీ బాత్.",
    "[00:29] ముందుగా పాన్ లో ఓ టీస్పూన్ ఆయిల్ హీట్ చేసి, అందులో పది ఎండుమిర్చి వేసి ఓ నిమిషం పాటు రోస్ట్ చేసుకోండి.",
    "[00:35] ఆ తర్వాత ఓ టేబుల్ స్పూన్ ధనియాలు, ఓ టీస్పూన్ శనగపప్పు, ఓ టీస్పూన్ నువ్వులు, ఓ టీస్పూన్ మినప్పప్పు...",
    "[00:41] ఇవన్నీ వేసి కేవలం లో ఫ్లేమ్ మీదే మంచి రంగు వచ్చి సువాసన రావాలి, అందాక రోస్ట్ చేసుకోండి.",
    "[00:48] ఆ తర్వాత దింపే ముందు ఓ టీస్పూన్ ఎండు కొబ్బరి పొడి వేసి, జస్ట్ ఓ పదిహేను సెకన్లు వేపి, చల్లార్చి ఆ తర్వాత పొడి చేసుకోండి.",
    "[00:57] ఇప్పుడు వంకాయ ముక్కలు వేసుకోవడానికి నీళ్ళలో పసుపు వేసి పక్కన ఉంచుకోండి.",
    "[01:00] వాంగీ బాత్ కి యాక్చువల్ గా తెల్లవి పొడవు వంకాయలు మాత్రమే వాడాలి, వాడతారు. బ్లూవి అస్సలు పనికి రావు.",
    "[01:07] నేను షూట్ చేసే రోజున హైదరాబాద్ లో నాకు తెల్ల వంకాయలు అవైలబుల్ గా లేవు. సో నేను తెల్ల గుత్తి వంకాయలు వాడాను.",
    "[01:13] నిజంగా చెప్పాలంటే నేను కొంచెం కాంప్రమైజ్ అయ్యాను.",
    "[01:17] ఇప్పుడు వీటిని చిన్న చిన్న ముక్కలుగా కట్ చేసి పక్కన ఉంచుకోండి.",
    "[01:21] ఇప్పుడు మూడు టేబుల్ స్పూన్ల ఆయిల్ హీట్ చేసి, అందులో రెండు రెబ్బల కరివేపాకు, ఓ టీస్పూన్ ఆవాలు, ఓ టీస్పూన్ జీలకర్ర...",
    "[01:28] ఓ టీస్పూన్ అల్లం తరుగు, నాలుగు వెల్లుల్లి తరుగు, రెండు పచ్చిమిర్చి చీలికలు...",
    "[01:33] ఓ చిన్న ఉల్లిపాయ తరుగు వేసి రెండు నిమిషాల పాటు వేపుకోండి.",
    "[01:36] ఉల్లిపాయలు పచ్చి వాసన పోయాక అప్పుడు ఓ పదిహేను జీడిపప్పు వేసి, అర టీస్పూన్ పసుపు...",
    "[01:41] ఓ చిన్న టొమాటో ముక్కలు కూడా వేసి, టొమాటోస్ మెత్తగా మగ్గేంత వరకు ఫ్రై చేసుకోండి. ఉల్లిపాయలు ఎర్రగా వేపకండి.",
    "[01:53] ఇప్పుడు వంకాయ ముక్కలు, సాల్ట్ కూడా వేసి వంకాయల్ని నాలుగైదు నిమిషాల పాటు మూత పెట్టి మగ్గించుకోండి.",
    "[02:01] ఇప్పుడు ఓ పెద్ద నిమ్మకాయ సైజు అంత చింతపండు నుంచి తీసినటువంటి చింతపండు గుజ్జు, ఓ టేబుల్ స్పూన్ బెల్లం...",
    "[02:07] పావు చెంచా ఇంగువ వేసి వంకాయ ముక్కలు మెత్తగా మగ్గేంత వరకు మగ్గించుకోండి.",
    "[02:16] ఆ తర్వాత ఓ కప్పు ఉడికించుకున్నటువంటి అన్నం, మూడు టేబుల్ స్పూన్లు గ్రైండ్ చేసుకున్నటువంటి పొడి వేసి అన్నానికి బాగా పట్టించండి.",
    "[02:25] ఇంకా ఓ టీస్పూన్ పొడి మిగులుతుంది దాన్ని దాచుకోండి.",
    "[02:30] దింపే ముందు ఓ టేబుల్ స్పూన్ కొత్తిమీర తరుగు చల్లుకొని దింపేసుకోండి.",
    "[02:33] అంతే! ఘుమఘుమలాడేటువంటి వాంగీ బాత్ రెడీ.",
    "[02:37] మీకు కావాలనుకుంటే ఇందులో ఉల్లిపాయ, వెల్లుల్లి, అల్లాన్ని హ్యాపీగా స్కిప్ చేయచ్చు, నాట్ ఎన్ ఇష్యూ.",
    "[02:41] ఇది చాలా చాలా బాగుంటుంది. మీ అందరికీ నచ్చి తీరుతుంది, చాలా క్విక్ గా అయిపోయేటువంటి రెసిపీ, పైగా హెల్తీ కూడా.",
    "[02:47] నచ్చిందా? మరైతే మీరు ట్రై చేసి మీకెలా కుదిరిందో కచ్చితంగా ఆ పిక్ ని విస్మై ఫుడ్ ఇన్స్టాగ్రామ్ లో పోస్ట్ చేయండి.",
    "[02:52] బై ది వే vismaifood.com వెబ్సైట్ విజిట్ చేయడం మర్చిపోకండి."
  ],
  "transcription_english": [
    "[00:00] Hello Foodies, Welcome to Vismai Food. Today's special is Karnataka Special Vangi Bath.",
    "[00:06] Do you want a special tasty recipe for lunch boxes, or leftover rice, or any special occasion?",
    "[00:13] Then Vangi Bath is the perfect recipe. Kids and adults will love it. It's also very easy to make.",
    "[00:20] It tastes very very good, it's a very perfect recipe. This Vangi Bath is made differently in each household in Karnataka.",
    "[00:27] Let's start Vangi Bath.",
    "[00:29] First heat a teaspoon of oil in a pan, add ten dry red chillies and roast for a minute.",
    "[00:35] After that, add a tablespoon of coriander seeds, a teaspoon of chana dal, a teaspoon of sesame seeds, a teaspoon of urad dal...",
    "[00:41] Roast all these only on low flame until they get good color and aroma.",
    "[00:48] Before taking off, add a teaspoon of dry coconut powder, roast for just fifteen seconds, cool down and then powder it.",
    "[00:57] Now keep water mixed with turmeric aside to put brinjal pieces.",
    "[01:00] For Vangi Bath, actually long white brinjals should be used. Blue ones are not suitable at all.",
    "[01:07] On the day I shot this, white brinjals were not available for me in Hyderabad. So I used round white brinjals.",
    "[01:13] To be honest, I compromised a little bit.",
    "[01:17] Now cut these into small pieces and keep aside.",
    "[01:21] Now heat three tablespoons of oil, add two sprigs of curry leaves, a teaspoon of mustard seeds, a teaspoon of cumin seeds...",
    "[01:28] A teaspoon of chopped ginger, four chopped garlic cloves, two slit green chillies...",
    "[01:33] Add a small chopped onion and fry for two minutes.",
    "[01:36] After raw smell of onions goes away, add fifteen cashews, half teaspoon turmeric...",
    "[01:41] Add chopped small tomato also, fry until tomatoes become soft. Do not fry onions till red.",
    "[01:53] Now add brinjal pieces, salt and cook brinjals covered for four to five minutes.",
    "[02:01] Now add tamarind pulp extracted from big lemon sized tamarind, a tablespoon of jaggery...",
    "[02:07] Add quarter spoon asafoetida and cook until brinjal pieces become soft.",
    "[02:16] After that add a cup of cooked rice, three tablespoons of ground powder and mix well with rice.",
    "[02:25] Still a teaspoon of powder will be left, save it.",
    "[02:30] Before taking off, sprinkle a tablespoon of chopped coriander and remove.",
    "[02:33] That's it! Aromatic Vangi Bath is ready.",
    "[02:37] If you want, you can happily skip onion, garlic and ginger in this, not an issue.",
    "[02:41] This tastes very very good. Everyone will definitely like it, very quick recipe, moreover healthy too.",
    "[02:47] Did you like it? Then try it and definitely post the picture on Vismai Food Instagram sharing how it turned out for you.",
    "[02:52] By the way, don't forget to visit vismaifood.com website."
  ]
}