{
  "metadata": {
    "title": "Pudina Semiya | పుదీనా సేమియా బ్రేక్ ఫాస్ట్ ఇలా చేసి చూడండి అస్సలు వదలరు | Mint Vermicelli Pulao",
    "channel_name": "Vismai Food",
    "publish_date": "2019-07-29",
    "view_count": 313000,
    "like_count": 4800,
    "duration": "02:18",
    "language": "Telugu",
    "video_id": "Unknown",
    "url": "https://www.youtube.com/watch?v=Unknown",
    "description": "Mint Vermicelli Pulao, also known as Pudina Semiya Upma, is a refreshing and aromatic breakfast recipe. This dish is made with vermicelli, fresh mint leaves, coriander, and a blend of spices. It's a quick and easy recipe that's perfect for a satisfying meal. The video demonstrates the step-by-step process of preparing this flavorful dish, including tips for cooking vermicelli perfectly and making a fresh masala paste.",
    "ingredients_detected": [
      "Vermicelli (Semiya)",
      "Water",
      "Oil",
      "Garlic",
      "Cumin Seeds",
      "Ginger",
      "Green Chillies",
      "Onion",
      "Mint Leaves (Pudina)",
      "Coriander Leaves",
      "Roasted Cumin Powder",
      "Salt",
      "Black Salt",
      "Lemon Juice",
      "Curd",
      "Peanuts",
      "Urad Dal",
      "Curry Leaves"
    ]
  },
  "transcription_telugu": [
    "[00:00] హలో ఫుడీస్, వెల్కమ్ టు విస్మై ఫుడ్. ఇవాల్టి స్పెషల్ పుదీనా సేమియా.",
    "[00:05] రెగ్యులర్ గా సేమియా ఉప్మా తిని విసిగిపోయారా?",
    "[00:07] అయితే ఈ సారి బ్రేక్ ఫాస్ట్ గా ఇది ట్రై చేసి చూడండి. చాలా ఎంజాయ్ చేస్తారు, చాలా తృప్తిగా బ్రేక్ ఫాస్ట్ ముగిస్తారు.",
    "[00:13] ఇన్ఫాక్ట్ పిల్లలు కూడా ఏ వంకలు పెట్టరు ఇది తింటున్నప్పుడు అంత బాగుంటుంది. లెట్స్ స్టార్ట్ అరోమాటిక్ పుదీనా సేమియా.",
    "[00:20] ముందుగా ఓ లీటర్ నీళ్లు పోసి కచ్చితంగా తెర్లకాగనివ్వండి.",
    "[00:24] నీళ్లు తెర్లుతున్నప్పుడు మాత్రమే ఓ కప్పు సేమియా వేసి కేవలం హై ఫ్లేమ్ మీదే బాయిల్ చేసుకోండి.",
    "[00:29] మీరు నీళ్లు తెర్లకుండా సేమియా వేస్తే సేమియా ముద్ద అవుతుందని గుర్తుంచుకోండి.",
    "[00:33] సరిగ్గా రెండున్నర నిమిషాల నుంచి మూడు నిమిషాల మధ్య సేమియా 75% కుక్ అవుతుంది.",
    "[00:38] అంటే పట్టుకుంటే ఇంకాస్త పలుకు ఉంటుంది. ఆ స్టేజిలో దింపి వడకట్టేసేయండి.",
    "[00:43] తర్వాత పైన చన్నీళ్లు పోసేయండి. దీనివల్ల సేమియా మెత్తబడదు. తర్వాత గాలికి ఆరనివ్వండి పూర్తిగా.",
    "[00:50] ఇప్పుడు ఓ టీస్పూన్ ఆయిల్ హీట్ చేసి అందులో నాలుగు వెల్లుల్లి, ఓ టీస్పూన్ జీలకర్ర వేసి ఓ నిమిషం పాటు వేపుకోండి.",
    "[00:58] ఆ తర్వాత ఓ టీస్పూన్ అల్లం తరుగు, రెండు పచ్చిమిర్చి, ఓ చిన్న ఉల్లిపాయ వేసి పచ్చివాసన పోయేంత వరకు ఫ్రై చేసుకోండి.",
    "[01:08] ఆ తర్వాత ఓ పెద్ద కట్ట పుదీనా ఆకులు, పావు కట్ట కొత్తిమీర తరుగు వేసి జస్ట్ ఓ 30 సెకండ్స్ బాగా కలుపుకొని దింపేసుకోండి.",
    "[01:21] ఇప్పుడు మిక్సీ జార్ లో వేసి ఫైన్ గా పేస్ట్ చేసేయండి.",
    "[01:24] ఇప్పుడు ఇందులో రెండు టీస్పూన్ల ఆయిల్ హీట్ చేసి, అందులో రెండు టేబుల్ స్పూన్ల వేరుశనగపప్పు వేసి వేయించుకొని పక్కన ఉంచుకోండి.",
    "[01:35] ఇప్పుడు ఓ టీస్పూన్ మినప్పప్పు వేసి, ఓ రెబ్బ కరివేపాకు వేసి వేపుకోండి.",
    "[01:42] తర్వాత పుదీనా పేస్ట్, సాల్ట్ వేసి పుదీనా పేస్ట్ ఓ నిమిషం పాటు వేపుకోండి.",
    "[01:54] తర్వాత ఆరబెట్టుకున్నటువంటి సేమియా వేసి నిదానంగా పుదీనా పేస్ట్ పట్టించండి.",
    "[01:58] అలాగే వేయించిన పల్లీలు కూడా వేసుకోండి.",
    "[02:02] పల్లీలు వేపి లాస్ట్ లో వేయడం వల్ల పల్లీలకు ఉండేటువంటి క్రంచ్ అలాగే ఉంటుందని అలా చేసాం.",
    "[02:07] భలే ఉంది కదా. నిజంగా చాలా బాగుంటుంది. మీరు తప్పక ట్రై చేసి మీకెలా కుదిరిందో కచ్చితంగా ఆ పిక్ ని విస్మై ఫుడ్ ఇన్స్టాగ్రామ్ లో పోస్ట్ చేయండి.",
    "[02:14] బై ది వే, vismaifood.com వెబ్సైట్ విజిట్ చేయడం అస్సలు మర్చిపోకండి."
  ],
  "transcription_english": [
    "[00:00] Hello Foodies, Welcome to Vismai Food. Today's special is Pudina Semiya (Mint Vermicelli).",
    "[00:05] Are you tired of eating regular Semiya Upma?",
    "[00:07] Then try this for breakfast this time. You will enjoy it a lot and finish your breakfast very satisfactorily.",
    "[00:13] In fact, kids won't even complain while eating this, it's that good. Let's start aromatic Pudina Semiya.",
    "[00:20] First, pour a liter of water and let it come to a rolling boil.",
    "[00:24] Only when the water is boiling, add a cup of semiya (vermicelli) and boil it on high flame only.",
    "[00:29] Remember that if you add semiya before the water boils, it will become lumpy.",
    "[00:33] Between exactly two and a half to three minutes, the semiya will be 75% cooked.",
    "[00:38] That means if you touch it, it will still be slightly firm. At that stage, remove from heat and strain it.",
    "[00:43] Then pour cold water over it. This prevents the semiya from becoming mushy. Then let it air dry completely.",
    "[00:50] Now heat a teaspoon of oil, add four garlic cloves, a teaspoon of cumin seeds and fry for a minute.",
    "[00:58] After that, add a teaspoon of chopped ginger, two green chillies, a small onion and fry until the raw smell goes away.",
    "[01:08] Then add a large bunch of mint leaves, a quarter bunch of chopped coriander, mix well for just 30 seconds and remove from heat.",
    "[01:21] Now put it in a mixer jar and make a fine paste.",
    "[01:24] Now heat two teaspoons of oil in a pan, add two tablespoons of peanuts, fry them and keep aside.",
    "[01:35] Now add a teaspoon of urad dal, a sprig of curry leaves and fry.",
    "[01:42] Then add the mint paste, salt and fry the mint paste for a minute.",
    "[01:54] Then add the dried semiya and slowly mix in the mint paste.",
    "[01:58] Also add the fried peanuts.",
    "[02:02] We added fried peanuts at the last so that the crunch of the peanuts remains.",
    "[02:07] Isn't it great? It tastes really good. You must try it and definitely post the picture on Vismai Food Instagram showing how it turned out for you.",
    "[02:14] By the way, don't forget to visit vismaifood.com website."
  ]
}