{
  "metadata": {
    "title": "Sweet Boondi | స్వీట్ బూంది | ఇలా చేస్తే బూంది వారం రోజులైనా క్రిస్పీగా ఉంటుంది",
    "channel_name": "Vismai Food",
    "publish_date": "2019-07-31",
    "view_count": 435000,
    "like_count": 1300,
    "duration": "03:29",
    "language": "Telugu",
    "video_id": "o8b6_v23k6o",
    "url": "https://www.youtube.com/watch?v=o8b6_v23k6o",
    "description": "Learn how to make perfect Sweet Boondi (Meethi Boondi) at home, a popular prasadam and festive sweet. This recipe ensures the boondi stays crispy for at least a week. Follow the tips for the perfect round shape and texture.",
    "ingredients_detected": [
      "Sugar",
      "Water",
      "Besan/Gram Flour",
      "Rice Flour",
      "Oil",
      "Cashews",
      "Raisins",
      "Edible Camphor",
      "Cardamom Powder",
      "Red Food Colour"
    ]
  },
  "transcription_telugu": [
    "[00:00] హలో ఫుడీస్, వెల్కమ్ టు విస్మై ఫుడ్. ఇవాల్టి స్పెషల్ ప్రసాదంగా ఇచ్చేటువంటి స్వీట్ బూంది.",
    "[00:05] సాధారణంగా గుళ్ళలో లేదంటే ఏదైనా వ్రతంలో ముఖ్యంగా వెంకటేశ్వర స్వామి గుడిలో, సాయిబాబా గుడిలో చాలా ఎక్కువగా ఈ ప్రసాదం ఇస్తుంటారు.",
    "[00:13] రానున్న సీజన్ అంతా పండగల సీజన్ కదా, తప్పక ఈ ప్రసాదం చేయండి చాలా పర్ఫెక్ట్ గా వస్తుంది.",
    "[00:18] దానికి బోల్డన్ని టిప్స్ ఉన్నాయి జాగ్రత్తగా వీడియో చివరి వరకు చూడండి.",
    "[00:22] ఇంకా ఇది మీరు ప్రసాదంగానే కాదు, మీరు మామూలుగా చేసుకొని ఓ వారం పాటు నిల్వ కూడా ఉంచుకోవచ్చు చాలా బాగుంటుంది.",
    "[00:27] ముందుగా పాన్ లో 400 గ్రాముల షుగర్ వేసి 200 ml వాటర్ పోసి కరిగించుకోండి.",
    "[00:43] ఈ పాకం ఓ తీగ పాకం రావాలి, రాగానే దింపేసుకోండి.",
    "[00:51] ఇప్పుడు పంచదార పాకానికి సగం 200 గ్రాముల శనగపిండి తీసుకోవాలి.",
    "[00:55] ఇందులో నీళ్లు పోసుకుంటూ దోసెల పిండి కంటే కాస్త పల్చగా పిండి కలుపుకోండి.",
    "[01:08] ఇప్పుడు బూందీ దూసుకోవడానికి ఇలాంటి గరిటె వాడుకోండి. ఇది లేకపోతే మామూలు చిల్లుల గరిటె వాడుకోండి.",
    "[01:15] ఇప్పుడు శనగపిండి గరిటె మీద అట్లు పోసినట్లు నిదానంగా పోస్తూ తిప్పుతూ ఉండండి.",
    "[01:21] గరిటెని అస్సలు తట్టకండి, తడితే బూందీకి తోకలు వచ్చేస్తాయి, షేప్ అంతా అవుట్ అయిపోతుంది.",
    "[01:28] బూందీ నూనెలో పడిన వెంటనే సలసల కాగే నూనెలో అడుక్కు వెళ్ళి ఆ వేడికి పైకి తేల్తాయి.",
    "[01:34] బూందీ ఎర్రగా క్రంచీగా వేపుకోవాలి, మెత్తగా అస్సలు వేపకండి.",
    "[01:49] ఎర్రగా వేగాక తీసి వేడి వేడి పాకంలో వేసుకోండి. పాకంలో వేసి జస్ట్ 30 సెకండ్లు ఉంచి తీసేయండి.",
    "[01:58] పాకం, బూందీ రెండు వేడిగా ఉండాలి అని గుర్తుంచుకోండి. మీరు వేడి మీద బూందీ వేస్తేనే పర్ఫెక్ట్ గా అబ్సార్బ్ చేసుకుంటుంది.",
    "[02:11] ఇప్పుడు బూందీలో మరో కలర్ కోసం అర టీస్పూన్ రెడ్ కలర్ వేసి బాగా కలుపుకోండి. ఇది ఆప్షనల్.",
    "[02:22] యాజ్ ఇట్ ఈజ్ ఇందాకట్లాగే సలసల కాగే నూనెలో హై ఫ్లేమ్ మీద బూందీ దూసుకోండి.",
    "[02:26] ఎర్రగా క్రంచీగా వేపుకొని తీరాలి బూందీని.",
    "[02:29] ఈ బూందీ క్రిస్పీగా వేగాక అప్పుడు తీసి పాకంలో వేసి జస్ట్ 30 సెకండ్స్ ఉంచి తీసేయండి.",
    "[02:37] ఈ బూందీ తినేందుకు క్రిస్పీగా ఉండాలి.",
    "[02:42] ఇప్పుడు ఇదే నూనెలో పావు కప్పు జీడిపప్పు పలుకులు వేసి ఎర్రగా వేపి బూందీలో వేసుకోండి.",
    "[02:48] అలాగే పావు కప్పు ఎండు ద్రాక్ష వేసి వేపుకోండి. వేగిన తర్వాత బూందీలో కలుపుకోండి.",
    "[02:53] ఇప్పుడు ఓ చిటికెడు పచ్చ కర్పూరం వేసుకోండి. చాలా మంచి ఫ్లేవర్ ఇస్తుంది.",
    "[02:59] అలాగే అర టీస్పూన్ యాలకుల పొడి వేసి బాగా కలుపుకోండి.",
    "[03:03] అంతే స్వీట్ బూందీ రెడీ. మీరు ఎప్పుడు చేసినా చాలా పర్ఫెక్ట్ గా వస్తుంది.",
    "[03:08] మీరు గుర్తుంచుకోవాల్సిందల్లా బూందీని కరకరలాడేటట్టు వేపుకోవాలి.",
    "[03:12] మీరు హై ఫ్లేమ్ మీద సలసల కాగుతున్నటువంటి నూనెలో వేపితేనే బూందీ చాలా పర్ఫెక్ట్ గా వస్తుంది.",
    "[03:16] అంతే పర్ఫెక్ట్ స్వీట్ బూందీ రెడీ. మీకు నచ్చిందా?",
    "[03:19] మరైతే రాబోతున్న పండగ సీజన్స్ అప్పుడు మీరు ట్రై చేసి మీకు ఎలా కుదిరిందో కచ్చితంగా ఆ పిక్ ని విస్మై ఫుడ్ ఇన్స్టాగ్రామ్ లో పోస్ట్ చేయండి."
  ],
  "transcription_english": [
    "[00:00] Hello Foodies, Welcome to Vismai Food. Today's special is Sweet Boondi which is often given as Prasadam.",
    "[00:05] Usually in temples, especially in Venkateswara Swamy temple or Sai Baba temple, this prasadam is distributed widely.",
    "[00:13] The upcoming season is full of festivals, right? So definitely make this prasadam, it turns out perfectly.",
    "[00:18] There are many tips for it, so watch the video carefully till the end.",
    "[00:22] Also, not just as prasadam, you can make it normally and store it for a week, it tastes very good.",
    "[00:27] First, add 400 grams of sugar and 200 ml of water in a pan and dissolve it.",
    "[00:43] This syrup should reach a one-string consistency. Once it does, remove it from heat.",
    "[00:51] Now, for the batter, take 200 grams of besan (gram flour), which is half the quantity of sugar.",
    "[00:55] Add water gradually and mix the batter to a consistency slightly thinner than dosa batter.",
    "[01:08] Now use a ladle like this to make boondi. If you don't have this, use a regular perforated ladle.",
    "[01:15] Now pour the batter slowly on the ladle and spread it in a circular motion like making a dosa.",
    "[01:21] Do not tap the ladle at all. If you tap, the boondi will get tails and the shape will be ruined.",
    "[01:28] As soon as the boondi falls into the hot oil, it should sink to the bottom and float up due to the heat.",
    "[01:34] The boondi must be fried until red and crunchy. Do not fry it soft.",
    "[01:49] Once fried red, remove and drop it into the hot sugar syrup. Leave it in the syrup for just 30 seconds and remove.",
    "[01:58] Remember that both the syrup and boondi should be hot. Only when you add hot boondi, it absorbs the syrup perfectly.",
    "[02:11] Now, for another color in the boondi, add half a teaspoon of red color to the remaining batter and mix well. This is optional.",
    "[02:22] As before, drop the boondi into the piping hot oil on high flame.",
    "[02:26] You must fry the boondi until it is red and crunchy.",
    "[02:29] Once this boondi is fried crispy, remove it and drop it into the syrup, leave for just 30 seconds and remove.",
    "[02:37] This boondi should be crispy to eat.",
    "[02:42] Now in the same oil, fry a quarter cup of cashew nuts until red and add to the boondi.",
    "[02:48] Similarly, fry a quarter cup of raisins. Once fried, mix them into the boondi.",
    "[02:53] Now add a pinch of edible camphor (pacha karpooram). It gives a very good flavor.",
    "[02:59] Also add half a teaspoon of cardamom powder and mix well.",
    "[03:03] That's it, Sweet Boondi is ready. It will turn out perfectly whenever you make it.",
    "[03:08] All you need to remember is to fry the boondi until it is crunchy.",
    "[03:12] Only if you fry it in piping hot oil on high flame, the boondi will turn out perfectly.",
    "[03:16] That's it, perfect Sweet Boondi is ready. Did you like it?",
    "[03:19] Then do try it during the upcoming festival season and definitely post the picture on Vismai Food Instagram sharing how it turned out for you."
  ]
}