{
  "metadata": {
    "title": "Nellore PuliBongaralu|నెల్లూరు బొండా|Bonda Recipe|నెల్లూరు పులిబొంగరాలు ఎప్పుడైనా రుచి చూసారా",
    "channel_name": "Vismai Food",
    "publish_date": "2019-08-01",
    "view_count": 1800000,
    "like_count": 16000,
    "duration": "03:30",
    "language": "Telugu",
    "video_id": "S2k7M9a4WwM",
    "url": "https://www.youtube.com/watch?v=S2k7M9a4WwM",
    "description": "Learn how to make authentic Nellore Puli Bongaralu (Puli Bondas) at home. These crispy and fluffy fritters made from fermented dosa batter are a famous street food in Nellore and Prakasam districts of Andhra Pradesh.",
    "ingredients_detected": [
      "Onion",
      "Green Chillies",
      "Cumin Seeds",
      "Salt",
      "Curry Leaves",
      "Dosa Batter (Sour)",
      "Oil"
    ]
  },
  "transcription_telugu": [
    "[00:00] హలో ఫుడీస్ వెల్కమ్ టు విస్మై ఫుడ్. ఇవాల్టి స్పెషల్ నెల్లూరు స్పెషల్ పులిబొంగరాలు.",
    "[00:04] అదేనండి పునుకులు. పునుకులే కదా, దానికి ఆ పేరేంటి ఆ వెరైటీ ఏంటి అంటే, ఉంది.",
    "[00:10] కాబట్టి ఈ రెసిపీ, నెల్లూరు ప్రకాశం జిల్లాల్లో చేసేటువంటి పునుకుల్ని పులిబొంగరాలు అంటారు, దానికి కొంచెం వేరియేషన్ ఉంది.",
    "[00:16] లెట్స్ స్టార్ట్ నెల్లూరు ప్రకాశం జిల్లాల స్పెషల్ పులిబొంగరాలు.",
    "[00:20] ముందుగా ఓ ఉల్లిపాయ తరుగు, రెండు పచ్చిమిర్చి తరుగు, ఓ టీస్పూన్ జీలకర్ర, సాల్ట్, ఓ రెబ్బ కరివేపాకు తరుగు వేసి బాగా కలుపుకోండి.",
    "[00:32] ఆ తర్వాత పుల్లటి దోసె పిండి వేసుకోండి.",
    "[00:35] ఈ పిండి కాస్త గట్టిగా ఉండాలి. పులిసినదైతే పులిబొంగరాలు ఇంకా రుచిగా ఉంటాయి.",
    "[00:39] సహజంగా పునుకులు అనగానే ఇడ్లీ పిండితో వేస్తుంటారు. కానీ ప్రకాశం నెల్లూరు జిల్లాలో మాత్రం ఖచ్చితంగా అందరూ అట్ల పిండితోనే వేస్తారు.",
    "[00:46] ఈవెన్ బండ్ల మీద కూడా అంతే.",
    "[00:48] దీన్ని బాగా వేడెక్కిన నూనెలో వేసి, మీడియం ఫ్లేమ్ మీద లైట్ గోల్డెన్ బ్రౌన్ కలర్ వచ్చేదాకా ఫ్రై చేసుకోండి.",
    "[00:57] ఆ తర్వాత హై ఫ్లేమ్ మీద గోల్డెన్ కలర్ రానివ్వండి.",
    "[01:03] చాలా చాలా రుచిగా ఉంటాయి. ఓ సారి ఇలా ట్రై చేసి చూడండి మీ అందరికీ నచ్చుతుంది.",
    "[01:07] మీకు ఎలా కుదిరిందో ఆ విషయాన్ని కామెంట్ బాక్స్ లో తెలియచేయండి. విస్మై ఫుడ్ ఇన్స్టాగ్రామ్ లోనూ పోస్ట్ చేయండి."
  ],
  "transcription_english": [
    "[00:00] Hello Foodies, Welcome to Vismai Food. Today's special is Nellore Special Puli Bongaralu.",
    "[00:04] That is nothing but Punukulu. You might ask, it's just Punukulu right, why that name and what is the variety in it? Well, there is.",
    "[00:10] So, this recipe, the Punukulu made in Nellore and Prakasam districts are called Puli Bongaralu, and there is a slight variation to it.",
    "[00:16] Let's start Nellore and Prakasam districts' special Puli Bongaralu.",
    "[00:20] First, add one chopped onion, two chopped green chillies, one teaspoon cumin seeds, salt, and one sprig of chopped curry leaves and mix well.",
    "[00:32] After that, add sour dosa batter.",
    "[00:35] This batter should be slightly thick. If it is sour/fermented, Puli Bongaralu will taste even better.",
    "[00:39] Usually, when we say Punukulu, people make it with Idli batter. But in Prakasam and Nellore districts, everyone definitely makes it with Dosa batter only.",
    "[00:46] Even on street carts, it's the same.",
    "[00:48] Drop this into well-heated oil and fry on medium flame until it gets a light golden brown color.",
    "[00:57] After that, let it get a golden color on high flame.",
    "[01:03] They taste very very good. Try it like this once, you all will like it.",
    "[01:07] Let me know how it turned out for you in the comment box. Also post it on Vismai Food Instagram."
  ]
}