{
  "metadata": {
    "title": "Prasadam Pulihora | Temple Style Pulihora | గుడిలో పెట్టె ప్రసాదం పులిహోర కమ్మగా రావాలంటే ఇలా చేయండి",
    "channel_name": "Vismai Food",
    "publish_date": "2019-08-02",
    "view_count": 2500000,
    "like_count": 65000,
    "duration": "03:29",
    "language": "Telugu",
    "video_id": "j3Asnsd_2LE",
    "url": "https://www.youtube.com/watch?v=j3Asnsd_2LE",
    "description": "Learn how to make authentic Temple Style Prasadam Pulihora at home. This tamarind rice recipe includes a special mustard paste and double tempering process that gives it the unique taste found in temples. Perfect for festivals like Varalakshmi Vratam, Vinayaka Chavithi, and Dussehra.",
    "ingredients_detected": [
      "Tamarind",
      "Rice",
      "Water",
      "Turmeric",
      "Salt",
      "Curry Leaves",
      "Green Chillies",
      "Peanut Oil",
      "Mustard Seeds",
      "Ginger",
      "Dry Red Chillies",
      "Fenugreek Seeds",
      "Asafoetida",
      "Jaggery",
      "Peanuts",
      "Urad Dal",
      "Chana Dal"
    ]
  },
  "transcription_telugu": [
    "[00:00] హలో ఫుడీస్, వెల్కమ్ టు విస్మై ఫుడ్. ఇవాల్టి స్పెషల్ ప్రసాదం పులిహోర.",
    "[00:05] పులిహోరల్లో ఎన్నో రకాలు ఉన్నాయి. ఇంటికి, చేతికి, ప్రాంతానికి ఎన్ని రుచులో.",
    "[00:10] వీటన్నిటికీ మించి ఆలయాల్లో తయారయ్యేటువంటి పులిహోరకి ప్రత్యేకమైన రుచి.",
    "[00:14] పెట్టేది పిడికెడు ప్రసాదమే అయినా అమృతంలా అనిపిస్తుంది ఆ ప్రసాదం.",
    "[00:18] అలాంటి అమృతాన్ని కచ్చితంగా ఇల్లేల్లి పాది ఆస్వాదించే టిప్స్ తో చెప్పబోతున్నాం.",
    "[00:22] ఈ రెసిపీ మీకు ఇంటర్నెట్ లో ఎక్కడ వెతికినా దొరకదు. ఎందుకంటే ఇది స్వయంగా శాస్త్రీయంగా చేసే వారి దగ్గర తెలుసుకుని చేస్తున్నటువంటి రెసిపీ.",
    "[00:30] ముందుగా 50 గ్రాముల చింతపండులో వేడి నీళ్లు పోసి నానబెట్టుకోండి.",
    "[00:36] ఇప్పుడు ఒక కప్పు బియ్యం కడిగినవి వేసి, రెండు కప్పుల నీళ్లు పోసి మూడు విజిల్స్ రానివ్వండి.",
    "[00:41] బియ్యం మరీ పాతవి అయితే గనుక మరో పావు కప్పు నీళ్లు పోసుకోండి, అప్పుడు పలుకుగా అనిపించదు.",
    "[00:49] ఇప్పుడు ఉడికిన అన్నంలో వేడి మీదే ఒక టీస్పూన్ పసుపు, రుచికి సరిపడా సాల్ట్.. కాస్త ఉప్పు తగ్గించి వేసుకోండి.",
    "[00:56] రెండు రెబ్బల కరివేపాకు, మూడు పచ్చిమిర్చి చీలికలు..",
    "[01:00] 50 గ్రాముల వేరుశనగ నూనె, పచ్చిదే వేసుకోండి. దొరికితే నువ్వుల నూనె వాడుకోండి. సాధ్యమైనంత వరకు రిఫైన్డ్ నూనె వాడకండి, గానుగ నూనె వాడితే చాలా రుచిగా ఉంటుంది.",
    "[01:09] ఇది వేడి మీదే పైపైన కలుపుకోండి. వేడి మీద ఎక్కువగా కలిపితే అన్నం చిదురవుతుందని గుర్తుంచుకోండి. దీన్ని పూర్తిగా చల్లారనివ్వండి.",
    "[01:16] ఇప్పుడు రెండు టేబుల్ స్పూన్ల ఆవాలు, ఒక ఇంచ్ అల్లం తరుగు, రెండు ఎండుమిర్చి, కొద్దిగా ఉప్పు.. ఆవాలు వగరు రాకుండా ఉప్పు హెల్ప్ చేస్తుంది. వీటిని మెత్తటి పేస్ట్ గా చేసుకుని పక్కన ఉంచుకోండి.",
    "[01:28] ఇప్పుడు రెండు టేబుల్ స్పూన్ల ఆయిల్ హీట్ చేసి, అందులో ఒక టీస్పూన్ ఆవాలు, ఒక టీస్పూన్ మెంతులు వేసి మెంతులు ఎర్రగా వేగి తీరాలి.. అందాక మెంతుల్ని వేపండి.",
    "[01:38] మెంతులు వేగితేనే పులిహోరకి చాలా మంచి రుచి.",
    "[01:41] ఇప్పుడు ఇందులో ఒక రెబ్బ కరివేపాకు వేసి వేపుకోండి.",
    "[01:44] ఇప్పుడు ఇందులో పావు చెంచా ఇంగువ వేసి వేపుకుని..",
    "[01:48] పావు లీటర్ చింతపండు పులుసు పోసి, పులుసు గుజ్జుగా అయ్యేంత వరకు మరిగించుకోండి హై ఫ్లేమ్ మీద.",
    "[01:54] ఇందులోనే ఒక టేబుల్ స్పూన్ బెల్లం వేసుకొని మరిగించుకోండి. బెల్లం వేయడం వల్ల పులుపుని బాలన్స్ చేస్తుంది.",
    "[02:07] పులుసు చిక్కబడ్డాక అప్పుడు ఆవాల పేస్ట్ వేసి ఒక ఉడుకు వచ్చేంత వరకు కుక్ చేసుకోండి.",
    "[02:14] ఒక ఉడుకు వచ్చిన తర్వాత స్టవ్ ఆఫ్ చేసి..",
    "[02:16] అప్పుడు పసుపు కలిపి ఉంచుకున్నటువంటి చల్లారిపోయి ఉన్నటువంటి అన్నాన్ని బాగా కలుపుకోండి.",
    "[02:20] అన్నాన్ని వేడి మీద కలిపితే ముద్దవుతుంది అని మాత్రం గుర్తుంచుకోండి.",
    "[02:27] ఇప్పుడు రెండవ తాలింపు.. ఇక్కడే ఉంది తారకమంత్రం అంతా.",
    "[02:30] దీని కోసం పావు కప్పు ఆయిల్ హీట్ చేసి, అందులో ఒక టీస్పూన్ ఆవాలు వేసుకోండి.",
    "[02:35] ఆవాలు చిటపటమన్నాక అప్పుడు పావు కప్పు వేరుశనగ పప్పు వేసి ఎర్రగా వేపుకోండి.",
    "[02:40] ఆ తర్వాత ఒక టేబుల్ స్పూన్ మినప్పప్పు, ఒక టేబుల్ స్పూన్ శనగపప్పు వేసి ఎర్రగా వేపుకోండి.",
    "[02:48] ఐదు ఎండుమిర్చి వేసి ఎర్రగా వేపి, ఒక రెబ్బ కరివేపాకు వేసి బాగా వేపుకోండి.",
    "[02:56] ఆ తర్వాత పులిహోరలో కలుపుకోండి.",
    "[02:58] అంతే! పులిహోర తయారు. ఇలా రెండు సార్లు తాలింపు పెట్టడంలో చాలా రుచి వస్తుంది పులిహోరకి.",
    "[03:04] ఈ ప్రసాదం పులిహోర ప్రతి ఒక్కరికి నచ్చుతుంది. పండగ వేళల్లో అమృతం లాంటి పులిహోర తయారు చేసుకోవచ్చు.",
    "[03:09] ఇలా చేస్తే కచ్చితంగా మీకు దేవాలయాల్లో ఇచ్చేటువంటి పులిహోర రుచి వచ్చి తీరుతుంది.",
    "[03:13] ఈ కొలతల్లో గాని మీరు పులిహోర చేసి పెట్టండి.. అందరికీ నచ్చి తీరుతుంది అంత పక్కా కొలతలు ఇవి.",
    "[03:18] ఈ రెసిపీ గురించి మీరు మరింత డీటైల్డ్ గా తెలుసుకోవాలనుకుంటే vismaifood.com వెబ్సైట్ విజిట్ చేయండి.",
    "[03:23] బై ది వే, మీరు తయారు చేసినటువంటి పులిహోరని విస్మై ఫుడ్ ఇన్స్టాగ్రామ్ లో పోస్ట్ చేయడం అస్సలు మర్చిపోకండి."
  ],
  "transcription_english": [
    "[00:00] Hello Foodies, Welcome to Vismai Food. Today's special is Prasadam Pulihora.",
    "[00:05] There are many types of Pulihora. So many tastes depending on the home, hand, and region.",
    "[00:10] Above all these, the Pulihora made in temples has a special taste.",
    "[00:14] Even if it's just a fistful of prasadam, it feels like nectar (Amrutham).",
    "[00:18] I am going to tell you the tips so that the whole family can definitely enjoy such nectar.",
    "[00:22] You won't find this recipe anywhere on the internet. Because this is a recipe learned from those who make it traditionally and scientifically.",
    "[00:30] First, soak 50 grams of tamarind in hot water.",
    "[00:36] Now add one cup of washed rice, pour two cups of water and let it cook for three whistles.",
    "[00:41] If the rice is very old, add another quarter cup of water, so it won't feel too grainy.",
    "[00:49] Now, while the cooked rice is still hot, add one teaspoon of turmeric and salt to taste.. add slightly less salt.",
    "[00:56] Add two sprigs of curry leaves, three slit green chilies..",
    "[01:00] Add 50 grams of raw peanut oil. If available, use sesame oil. As much as possible, do not use refined oil, using cold-pressed oil tastes very good.",
    "[01:09] Mix it gently on the surface while it's hot. Remember that mixing too much while hot will mash the rice. Let it cool completely.",
    "[01:16] Now take two tablespoons of mustard seeds, one inch of chopped ginger, two dry red chilies, a little salt.. salt helps to prevent the bitterness of mustard. Grind them into a smooth paste and keep aside.",
    "[01:28] Now heat two tablespoons of oil, add one teaspoon of mustard seeds, one teaspoon of fenugreek seeds, and let the fenugreek seeds fry until red.. fry them until then.",
    "[01:38] Only when fenugreek seeds are fried well, Pulihora tastes very good.",
    "[01:41] Now add a sprig of curry leaves and fry.",
    "[01:44] Now add a quarter teaspoon of asafoetida and fry..",
    "[01:48] Pour a quarter liter of tamarind juice and boil it on high flame until the juice becomes thick.",
    "[01:54] Add one tablespoon of jaggery to this and boil. Adding jaggery balances the sourness.",
    "[02:07] Once the pulp thickens, add the mustard paste and cook until it boils once.",
    "[02:14] After it boils once, turn off the stove..",
    "[02:16] Then mix it well with the cooled rice that has turmeric mixed in it.",
    "[02:20] Remember that if you mix with rice while it's hot, it will become lumpy.",
    "[02:27] Now the second tempering.. the whole secret lies here.",
    "[02:30] For this, heat a quarter cup of oil and add one teaspoon of mustard seeds.",
    "[02:35] Once the mustard splutters, add a quarter cup of peanuts and fry until red.",
    "[02:40] After that, add one tablespoon of urad dal, one tablespoon of chana dal and fry until red.",
    "[02:48] Add five dry red chilies and fry until red, add a sprig of curry leaves and fry well.",
    "[02:56] After that, mix it into the Pulihora.",
    "[02:58] That's it! Pulihora is ready. Tempering twice like this gives a lot of taste to the Pulihora.",
    "[03:04] Everyone will like this Prasadam Pulihora. You can make nectar-like Pulihora during festival times.",
    "[03:09] If you do it like this, you will definitely get the taste of Pulihora given in temples.",
    "[03:13] If you make Pulihora with these measurements.. everyone will like it, these are such perfect measurements.",
    "[03:18] If you want to know more details about this recipe, visit vismaifood.com website.",
    "[03:23] By the way, don't forget to post the Pulihora you made on Vismai Food Instagram."
  ]
}