{
  "metadata": {
    "title": "పులిహోర పేస్టు| ఆరు నెలలునిలవుండే Instant \"PULIHORA PASTE\"| Instant Puliyogare Paste",
    "channel_name": "Vismai Food",
    "publish_date": "2018-11-05",
    "view_count": 2176694,
    "like_count": 27849,
    "duration": "02:49",
    "language": "Telugu",
    "video_id": "NSJ084nGf8U",
    "url": "https://www.youtube.com/watch?v=NSJ084nGf8U",
    "description": "Instant Puliyogare Paste recipe that lasts for six months by Vismai Food.",
    "ingredients_detected": [
      "250gms Tamarind (Soaked for 1 hour)",
      "1/2 Liter Water",
      "20-25 Green chillies",
      "3 tbsps Jaggery",
      "3 tbsps (50gms) Salt",
      "3 Sprigs Curry Leaves",
      "2 tbsps Oil (for paste)",
      "3 tbsps Oil (for rice)",
      "1 tsp Mustard",
      "1 tsp Urad dal",
      "1 tsp Chana dal",
      "3 Dry Red Chillies",
      "7-8 Cashews",
      "1 tsp Cumin",
      "1/4 tsp Asafoetida",
      "1 tsp Turmeric",
      "1/2 Cup Instant Pulihora Paste",
      "1 Cup (110gms) Cooked rice",
      "3 tbsps Chopped Coriander (with stems)"
    ]
  },
  "transcription_telugu": [
    "[00:00:00.000] హలో ఫుడీస్, వెల్కమ్ టు విస్మయ్ ఫుడ్. ఇవాల్టి స్పెషల్ పర్ఫెక్ట్ ట్రెడిషనల్ పులిహోర పేస్ట్.",
    "[00:00:07.000] ఇది తయారు చేసుకుంటే ఎప్పుడు కావాలంటే అప్పుడు పులిహోర చేసుకోవచ్చు. ఆరు నెలల పైగా నిల్వ ఉంటుంది.",
    "[00:00:23.000] పావు కిలో చింతపండులో అర లీటర్ నీళ్లు పోసి గంట పాటు నానబెట్టుకోవాలి.",
    "[00:00:30.000] దీనిని సిమ్ లో 20 నిమిషాల పాటు మరిగించాలి. ఇలా చేయడం వల్ల పులుసు ఎక్కువగా వస్తుంది.",
    "[00:00:40.000] చల్లారాక జల్లెడలో వేసి పులుసును తీసుకోవాలి. అవసరమైతే మరికొన్ని వేడి నీళ్లు పోసి మొత్తం పిండుకోవాలి.",
    "[00:01:03.000] పులుసులో 20-25 పచ్చిమిర్చి, మూడు స్పూన్ల బెల్లం, 50 గ్రాముల ఉప్పు, కరివేపాకు, రెండు స్పూన్ల నూనె వేయండి.",
    "[00:01:18.000] పులుసు చిక్కబడేంత వరకు సిమ్ లో ఉడికించుకోవాలి. పూర్తిగా చల్లారాక ఎయిర్ టైట్ జార్ లో పెట్టి ఫ్రిజ్ లో ఉంచితే ఆరు నెలలు ఉంటుంది.",
    "[00:01:42.000] పులిహోర కోసం మూడు స్పూన్ల నూనె వేడి చేసి ఆవాలు, మినప్పప్పు, శనగపప్పు, ఎండుమిర్చి, జీడిపప్పు, జీలకర్ర వేసి వేయించండి.",
    "[00:01:58.000] అర చెంచా ఇంగువ, కరివేపాకు, ఒక టీస్పూన్ పసుపు వేయండి.",
    "[00:02:05.000] ఇప్పుడు అర కప్పు పులిహోర పేస్ట్ వేసి నూనె పైకి తేలేంత వరకు వేయించాలి.",
    "[00:02:14.000] ఇందులో ఒక కప్పు ఉడికించిన అన్నం వేసి స్టవ్ ఆఫ్ చేసి బాగా కలుపుకోవాలి.",
    "[00:02:26.000] రుచికి సరిపడా ఉప్పు అడ్జస్ట్ చేసుకుని, కొత్తిమీర చల్లుకుంటే ప్రసాదం రుచి గల పులిహోర రెడీ."
  ],
  "transcription_english": [
    "[00:00:00.000] Hello Foodies, welcome to Vismai Food. Today's special is perfect traditional Pulihora paste.",
    "[00:00:07.000] If you prepare this, you can make Pulihora anytime. It stays fresh for more than six months.",
    "[00:00:23.000] Soak 250gms of tamarind in half a liter of water for one hour.",
    "[00:00:30.000] Boil it on low flame for 20 minutes. This helps extract more juice.",
    "[00:00:40.000] After cooling, strain the pulp through a sieve. Use hot water if needed to extract completely.",
    "[00:01:03.000] To the juice, add 20-25 green chillies, 3 spoons of jaggery, 50gms salt, curry leaves, and 2 spoons of oil.",
    "[00:01:18.000] Cook on low flame until thick. Once cooled, store in an airtight jar in the fridge for six months.",
    "[00:01:42.000] For Pulihora, heat 3 spoons of oil and fry mustard, urad dal, chana dal, dry chillies, cashews, and cumin.",
    "[00:01:58.000] Add 1/4 tsp asafoetida, curry leaves, and 1 tsp turmeric.",
    "[00:02:05.000] Add half a cup of Pulihora paste and sauté until oil floats to the top.",
    "[00:02:14.000] Add one cup of cooked rice, turn off the heat, and mix thoroughly.",
    "[00:02:26.000] Adjust salt and garnish with coriander for authentic temple-style Pulihora."
  ]
}