{
  "metadata": {
    "title": "Sajja Rotte|Bajra Roti|సజ్జ రొట్టె| ఇలా చేస్తే సజ్జ రొట్టెలు గానతల తరువాత కుడా దూది లా ఉంటాయి",
    "channel_name": "Vismai Food",
    "publish_date": "2019-08-03",
    "view_count": 135000,
    "like_count": 1700,
    "duration": "02:56",
    "language": "Telugu",
    "video_id": "Unknown",
    "url": "https://www.youtube.com/watch?v=Unknown",
    "description": "Learn how to make soft and healthy Sajja Rottelu (Pearl Millet Roti/Bajra Roti) that stay soft for hours. This recipe includes a special tip of adding bottle gourd for extra softness and taste. Perfect for lunch or dinner with any veg or non-veg curry.",
    "ingredients_detected": [
      "Water",
      "Salt",
      "Grated Bottle Gourd (Sorakaya Turumu)",
      "Bajra Flour (Sajja Pindi)",
      "Flour for dusting"
    ]
  },
  "transcription_telugu": [
    "[00:00] హలో ఫుడీస్, వెల్కమ్ టు విస్మై ఫుడ్. ఇవాల్టి స్పెషల్ సజ్జ రొట్టె. ఎంత రుచిగా ఉంటుందో కదా?",
    "[00:05] కొన్ని వారాల క్రితం జొన్న రొట్టె పోస్ట్ చేశాను, చాలా బాగుంది అని ఎంతో మంది పాజిటివ్ ఫీడ్ బ్యాక్ ఇచ్చారు.",
    "[00:10] అందరు సజ్జ రొట్టె అడిగారు, సో సజ్జ రొట్టె ఇవాళ చూపిస్తున్నాను.",
    "[00:13] వెజ్, నాన్ వెజ్ ఏ కర్రీతో అయినా సూపర్భ్ గా ఉంటుంది. గంటల తర్వాత కూడా మెత్తగా ఉండి తీరతాయి, అంత బాగుంటాయి ఈ సజ్జ రొట్టెలు. లెట్స్ స్టార్ట్.",
    "[00:22] ముందుగా ఓ కప్పు నీళ్లు మరిగించుకోండి.",
    "[00:27] నీళ్లు మరిగాక రుచికి సరిపడా సాల్ట్, పావు కప్పు సొరకాయ తురుము. ఇది ఆప్షనల్, వేస్తే భలేగా ఉంటుంది.",
    "[00:33] సొరకాయ తురుముని ఓ పొంగు రానివ్వండి.",
    "[00:36] ఓ పొంగు వచ్చాక కప్పు సజ్జ పిండి వేసుకోండి.",
    "[00:39] అసలు కొలత అంటే కప్పు నీళ్ళకి కప్పు పిండి. కానీ ఎప్పుడు ఓ పిడికెడు పిండి దగ్గర ఉంచుకోవడం మంచిది.",
    "[00:46] ఈ పిండి వేసి బాగా కలిపి ఓ నిమిషం పాటు కుక్ చేసి, మూత పెట్టి ఓ 15 నిమిషాల పాటు వదిలేయండి.",
    "[00:51] లేడీస్ మీ అందరికో గుడ్ న్యూస్. లో ప్రైస్ లో బెస్ట్ క్వాలిటీ సారీస్, రైట్ ఫ్రమ్ కాటన్ నుంచి కంచి పట్టు వరకు, లో రేంజ్ నుంచి హై రేంజ్ వరకు కావాలా?",
    "[01:00] అయితే మీరు meghams.com వెబ్సైట్ విజిట్ చెయ్యాల్సిందే.",
    "[01:04] వీళ్ళు షోరూం కంటే కూడా చాలా తక్కువ ప్రైస్ లో డైరెక్ట్ గా చేనేత కార్మికుల దగ్గర నుంచి నేయించి కొనుగోలు చేసి అమ్ముతారు.",
    "[01:10] పైగా చిన్న చిన్న గ్రామాల్లో ఉండేటువంటి చేనేత కార్మికులకి చేయూతను అందిస్తున్నారు.",
    "[01:14] వీళ్ళకి అన్ని దేశాలకి షిప్పింగ్ కూడా ఉంది.",
    "[01:17] వీళ్ళ సర్వీస్ మెచ్చి ఈటీవీ యువ లాంటి ప్రోగ్రాం కూడా వచ్చి వీళ్ళని ఇంటర్వ్యూ చేశాయి అంటే అర్థం చేసుకోండి వీళ్ళ క్వాలిటీ ఏంటో, వీళ్ళ సర్వీస్ ఏంటో.",
    "[01:25] మా క్వాలిటీ చూసి, మా రివ్యూస్ చదివి, మా ప్రైసెస్ కంపేర్ చేసి మాత్రమే కొనండి అనే చెప్తారు వీళ్ళు. ఎందుకంటే వీళ్ళు చాలా బెస్ట్ క్వాలిటీ ఇస్తున్నారు కొన్నేళ్లుగా.",
    "[01:33] సో, శ్రావణ మాసంలో కొత్త చీర కట్టి లక్ష్మీ కళ ఉట్టి పడాలంటే, దానికోసం meghams.com వెబ్సైట్ లింక్ డిస్క్రిప్షన్ బాక్స్ లో ఉంచాను, దాన్ని క్లిక్ చేయండి.",
    "[01:41] 15 నిమిషాల తర్వాత వేడిగానే ఉంటుంది. కానీ వేడి మీదే బాగా ఒత్తుకోండి.",
    "[01:46] మీరు ఒకవేళ వేడి పట్టలేనట్లయితే ఓ తడి గుడ్డ కప్పి ఒత్తుకోండి.",
    "[01:49] ఇందులో పీచు పదార్థం ఎక్కువగా ఉండటం వల్ల జిగురు తక్కువగా ఉంటుంది.",
    "[01:52] కాబట్టి ఎంత ఎక్కువ సేపు పిండిని ఒత్తుకుంటే రొట్టె అంత తక్కువగా విరుగుతుందని గుర్తుంచుకోండి.",
    "[01:57] ఇలా 5 నిమిషాలకు పైగా ఒత్తుకోవాలి. ఒత్తుకున్నాక బాల్స్ గా డివైడ్ చేసుకోండి.",
    "[02:02] తర్వాత పైన కొద్దిగా పిండి చల్లుకుని నిదానంగా ప్రెషర్ ఇవ్వకుండా ఒత్తుకోండి.",
    "[02:07] యాక్చువల్ గా చేత్తో తడుతూ చేస్తారు ఎక్స్పీరియన్స్ ఉన్న వాళ్ళు. కానీ అందరికీ అది సాధ్యం కాదు కాబట్టి ఇలా సింప్లిఫై చేసి చెప్తున్నాను.",
    "[02:13] నిదానంగా అప్పడాల కర్రతో పెద్దగా ప్రెషర్ ఇవ్వకుండా ఒత్తుకోండి, షేప్ గురించి మర్చిపోండి.",
    "[02:17] ఇప్పుడు వేడి వేడి పెనం మీద రొట్టె వేసి ఓ పక్క ఓ నిమిషం పాటు కాలనిచ్చి, తిప్పి, అప్పుడు నీళ్లు చిలకరించుకోండి.",
    "[02:24] ఓ రెండు నిమిషాల పాటు కాల్చుకోండి. రొట్టెలు కాలడానికి కాస్త ఎక్కువ టైం పడుతుంది, ఇది చపాతీలు మాములు రోటీల్లా త్వర త్వరగా కాలిపోదు.",
    "[02:32] మీరు త్వర త్వరగా కాల్చేస్తే గనక రొట్టె లోపల పిండి పిండిగా మిగిలిపోతుందని అర్ధం చేసుకోండి.",
    "[02:37] ఇందులో సొరకాయ వెయ్యడం వల్ల రుచితో పాటు చాలా సాఫ్ట్ గా ఉంటాయి రొట్టెలు.",
    "[02:41] ఈ రొట్టెలు మీరు మధ్యాహ్నం తర్వాత తిన్నా కూడా మెత్తగా దూదిలా ఉండి తీరతాయి, ఇది నిజంగా నిజం.",
    "[02:47] మీరు జాగ్రత్తగా టిప్స్ ఫాలో అవ్వండి, పక్కా రెసిపీని ఎంజాయ్ చేయండి.",
    "[02:50] నచ్చిందా? మరైతే మీరు తప్పక ట్రై చేసి మీకు ఎలా కుదిరిందో కచ్చితంగా ఆ పిక్ ని విస్మై ఫుడ్ ఇన్స్టాగ్రామ్ లో పోస్ట్ చేయండి."
  ],
  "transcription_english": [
    "[00:00] Hello Foodies, Welcome to Vismai Food. Today's special is Sajja Rotte (Pearl Millet Roti). Isn't it delicious?",
    "[00:05] A few weeks ago, I posted Jonna Rotte (Sorghum Roti), and many people gave positive feedback saying it was very good.",
    "[00:10] Everyone asked for Sajja Rotte, so I am showing Sajja Rotte today.",
    "[00:13] It tastes superb with any Veg or Non-Veg curry. They will remain soft even after hours, these Sajja Rottelu are that good. Let's start.",
    "[00:22] First, boil a cup of water.",
    "[00:27] Once the water boils, add salt to taste and a quarter cup of grated bottle gourd. This is optional, but it tastes great if added.",
    "[00:33] Let the grated bottle gourd come to a boil.",
    "[00:36] Once it boils, add a cup of Bajra flour (Sajja Pindi).",
    "[00:39] The actual measurement is one cup of flour for one cup of water. But it's always good to keep a handful of flour aside.",
    "[00:46] Add this flour, mix well, cook for a minute, cover, and leave it for 15 minutes.",
    "[00:51] Ladies, good news for all of you. Do you want best quality sarees at low prices, right from cotton to Kanchi pattu, from low range to high range?",
    "[01:00] Then you must visit meghams.com website.",
    "[01:04] They sell by getting them woven directly from weavers at a much lower price than showrooms.",
    "[01:10] Moreover, they are extending a helping hand to weavers in small villages.",
    "[01:14] They also have shipping to all countries.",
    "[01:17] Their service was appreciated and programs like ETV Yuva even interviewed them, so understand their quality and service.",
    "[01:25] They say, buy only after seeing our quality, reading our reviews, and comparing our prices. Because they have been giving the best quality for years.",
    "[01:33] So, if you want to look radiant like Goddess Lakshmi by wearing a new saree in Shravana Masam, I have put the meghams.com website link in the description box, click on it.",
    "[01:41] After 15 minutes, it will still be hot. But knead it well while it is hot.",
    "[01:46] If you can't handle the heat, cover it with a wet cloth and knead.",
    "[01:49] Since it has high fiber content, the gluten (stickiness) is less.",
    "[01:52] So remember that the longer you knead the dough, the less likely the roti will break.",
    "[01:57] Knead like this for more than 5 minutes. After kneading, divide into balls.",
    "[02:02] Then sprinkle some flour on top and roll it gently without applying pressure.",
    "[02:07] Actually, experienced people do it by tapping with hand. But since it's not possible for everyone, I am simplifying it like this.",
    "[02:13] Roll gently with a rolling pin without applying much pressure, forget about the shape.",
    "[02:17] Now place the roti on a hot tawa, let it roast for a minute on one side, flip, and then sprinkle water.",
    "[02:24] Roast for two minutes. Rotis take a bit more time to roast, it won't roast as quickly as chapatis or normal rotis.",
    "[02:32] Understand that if you roast it quickly, the roti will remain doughy inside.",
    "[02:37] Adding bottle gourd makes the rotis very soft along with taste.",
    "[02:41] These rotis will definitely remain soft like cotton even if you eat them in the afternoon, this is truly true.",
    "[02:47] Follow the tips carefully, enjoy the perfect recipe.",
    "[02:50] Did you like it? Then you must try it and definitely post the pic on Vismai Food Instagram sharing how it turned out for you."
  ]
}