{
  "metadata": {
    "title": "Set Dosa Recipe | సెట్ దోశ ఇలా చేస్తే స్పాంజ్ లా మెత్తగా వస్తుంది | Sponge Dosa | Vismai Food",
    "channel_name": "Vismai Food",
    "publish_date": "2019-08-04",
    "view_count": 800000,
    "like_count": 14000,
    "duration": "02:01",
    "language": "Telugu",
    "video_id": "Unknown",
    "url": "https://www.youtube.com/watch?v=Unknown",
    "description": "Learn how to make soft and spongy Set Dosa at home. This recipe uses simple ingredients like Urad Dal, Rice, Fenugreek seeds, and Poha to create a perfect breakfast or lunch box option. Follow the tips for the perfect texture.",
    "ingredients_detected": [
      "Urad Dal",
      "Rice",
      "Fenugreek Seeds",
      "Poha",
      "Water",
      "Salt",
      "Oil",
      "Onion"
    ]
  },
  "transcription_telugu": [
    "[00:00] హలో ఫుడీస్, వెల్కమ్ టు విస్మై ఫుడ్. ఇవాల్టి స్పెషల్ సెట్ దోశ.",
    "[00:04] భలేగా ఉంటాయి. అంచుల వెంట క్రిస్పీగా, లోపల స్పాంజీగా.. ఆహా ఎంత బాగుంటాయో.",
    "[00:10] ఇంకా ఇవి లంచ్ బాక్సులకు కూడా తీసుకెళ్లచ్చు. చల్లారాక కూడా చాలా రుచిగా ఉంటాయి.",
    "[00:13] కానీ మంచి కొబ్బరి చట్నీ లేదంటే సాంబార్ ఉండాలి.",
    "[00:17] అసలు ఇవి వడ కర్రీతో తింటే.. ఇహ మాటల్లేవ్.. అంతే! ఎంజాయ్ చేస్తూనే ఉంటారు. ఎన్ని తింటారో లెక్క ఉండదు. అంత బాగుంటాయి. లెట్స్ స్టార్ట్.",
    "[00:24] ముందుగా ఓ బౌల్ లో అర కప్పు మినప్పప్పు, ఒకటిన్నర కప్పుల బియ్యం, ఓ టేబుల్ స్పూన్ మెంతులు, అర కప్పు అటుకులు వేసి..",
    "[00:33] నీళ్లు పోసి నాలుగు గంటల పైన నాననివ్వండి.",
    "[00:35] మీరు ఎంత కొలతకైనా చేసుకోండి. అటుకులు, మినప్పప్పు సమానం. మినప్పప్పుకు మూడు ఇంతలు బియ్యం.. అంతే.",
    "[00:40] దీన్ని మెత్తగా వెన్నలా గ్రైండ్ చేసుకోవాలి. మిక్సీలో కంటే గ్రైండర్ లో గ్రైండ్ చేస్తే చాలా ఫ్లఫీగా వస్తాయి సెట్ దోశలు అని గుర్తుంచుకోండి.",
    "[00:48] దీన్ని మెత్తగా గ్రైండ్ చేశాక 12 గంటల పాటు వదిలేయండి. ఓవర్ నైట్ వదిలేస్తే ఇంకా మంచిది.",
    "[00:53] ఇప్పుడు నెక్స్ట్ డే కి ఇలా పర్ఫెక్ట్ గా పులుస్తుంది.",
    "[00:56] ఇప్పుడు కాస్త ఉప్పు, తగినన్ని నీళ్లు పోసి దోశ పిండి కంటే కాస్త చిక్కగా ఉంచుకోండి పిండిని చాలు.",
    "[01:01] సెట్ దోశలు ఒక్కొక్కరు ఒక్కొక్క తీరులో చేస్తారు. కానీ ఈ స్టైల్ లో సెట్ దోశ చేస్తేనే మీకు చాలా స్పాంజీగా వస్తాయి సెట్ దోశలు.",
    "[01:09] ఇప్పుడు పెనాన్ని వేడి చేసి కాస్త నూనె వేసి ఉల్లిపాయతో రుద్ది, ఓ పెద్ద గరిటెడు పిండి వేసి అలా వదిలేయండి, స్ప్రెడ్ చేయకండి.",
    "[01:15] తర్వాత అంచుల వెంట నూనె వేసి, కేవలం కేవలం మీడియం ఫ్లేమ్ మీద మాత్రమే కాల్చాలి ఈ సెట్ దోశల్ని. లేదంటే లోపల పిండి పిండిగా మిగిలిపోతుంది.",
    "[01:24] వెంటనే మూత పెట్టేయండి. మూత పెట్టేసి స్టీమ్ మీద దోశని మగ్గనివ్వండి.",
    "[01:29] ఇది కాలడానికి కనీసం మూడు నిమిషాల టైం పడుతుంది. ఈ దోశలు తిరగతిప్పి కాల్చనే కూడదు. ఓ వైపే కాలాలి, మరో వైపు తెల్లగా స్టీమ్ మీద కుక్ అవ్వాలి.",
    "[01:38] అంతే! స్పాంజీగా ఉండేటువంటి సెట్ దోశ రెడీ.",
    "[01:41] పిండి మిగిలిపోతే దీంతో మీరు గుంట పునుగులు వేసి చూడండి.. ఎంత బాగుంటాయో!",
    "[01:44] ఇంకా ఇవి మార్నింగ్ బ్రేక్ ఫాస్ట్ గా, ఈవినింగ్ డిన్నర్ స్కిప్ చేసి కూడా తీసుకోవచ్చు.",
    "[01:48] ఇది మీరు ఒక్కసారి ట్రై చేసి చూడండి. ఇంటిల్లిపాది ఆహా.. ఎంత బాగున్నాయి.. అని అంటూ చాలా ఎంజాయ్ చేస్తారు.",
    "[01:54] నచ్చిందా? మరైతే మీరు ట్రై చేసి మీకెలా కుదిరిందో కచ్చితంగా ఆ పిక్ ని విస్మై ఫుడ్ ఇన్స్టాగ్రామ్ లో పోస్ట్ చేయండి.",
    "[01:59] బై ది వే, vismaifood.com వెబ్సైట్ విజిట్ చేయడం అస్సలు మర్చిపోకండి."
  ],
  "transcription_english": [
    "[00:00] Hello Foodies, Welcome to Vismai Food. Today's special is Set Dosa.",
    "[00:04] They taste great. Crispy on the edges, spongy inside.. ah, so good!",
    "[00:10] You can also take them for lunch boxes. They taste very good even after cooling down.",
    "[00:13] But you need a good coconut chutney or sambar.",
    "[00:17] If you eat these with Vada Curry.. no words.. that's it! You will keep enjoying. You won't count how many you eat. They are that good. Let's start.",
    "[00:24] First, in a bowl, add half a cup of urad dal, one and a half cups of rice, one tablespoon of fenugreek seeds, half a cup of poha (flattened rice).",
    "[00:33] Pour water and let it soak for over four hours.",
    "[00:35] You can make it in any quantity. Poha and urad dal should be equal. Rice should be three times the urad dal.. that's it.",
    "[00:40] Grind this into a smooth butter-like batter. Remember that if you grind in a wet grinder instead of a mixer, the set dosas will turn out very fluffy.",
    "[00:48] After grinding smoothly, leave it for 12 hours. Leaving it overnight is even better.",
    "[00:53] By the next day, it will ferment perfectly like this.",
    "[00:56] Now add some salt, enough water, and keep the batter slightly thicker than regular dosa batter, that's enough.",
    "[01:01] Everyone makes set dosas in their own way. But only if you make set dosa in this style, you will get very spongy set dosas.",
    "[01:09] Now heat the tawa, add some oil, rub with an onion, pour a big ladle full of batter and just leave it, don't spread it.",
    "[01:15] Then add oil along the edges, and roast these set dosas only, only on medium flame. Otherwise, the inside will remain raw and doughy.",
    "[01:24] Immediately cover with a lid. Cover and let the dosa cook on steam.",
    "[01:29] It takes at least three minutes to cook. These dosas should not be flipped and roasted. It should roast on one side, and the other side should cook white on steam.",
    "[01:38] That's it! Spongy set dosa is ready.",
    "[01:41] If batter is left over, try making gunta punugulu (paddu) with it.. they taste so good!",
    "[01:44] Also, you can have these for morning breakfast, or even skip evening dinner and have this.",
    "[01:48] Try this once. The whole family will say 'Aha.. how good they are..' and enjoy a lot.",
    "[01:54] Did you like it? Then try it and definitely post the picture on Vismai Food Instagram sharing how it turned out for you.",
    "[01:59] By the way, don't forget to visit vismaifood.com website."
  ]
}