{
  "metadata": {
    "title": "TOMATO BATH|టమాటో బాత్|Perfect Tomato Bath Recipe|పక్కా కొలతలతో టమాటో బాత్ చేస్తే అందరు ఇష్టపడతారు",
    "channel_name": "Vismai Food",
    "publish_date": "2019-08-04",
    "view_count": 3400000,
    "like_count": 6500,
    "duration": "02:57",
    "language": "Telugu",
    "video_id": "Unknown",
    "url": "https://www.youtube.com/watch?v=Unknown",
    "description": "Learn how to make the perfect Tomato Bath (Karnataka Style Rava Bath) with exact measurements. This breakfast recipe is simple, quick, and tastes delicious. It's a great way to make a flavorful upma that everyone will love.",
    "ingredients_detected": [
      "Bombay Rava (Semolina)",
      "Ghee",
      "Oil",
      "Mustard Seeds",
      "Chana Dal",
      "Urad Dal",
      "Cumin Seeds",
      "Onion",
      "Green Chillies",
      "Ginger",
      "Tomatoes",
      "Carrot",
      "Frozen Peas",
      "Turmeric",
      "Curry Leaves",
      "Salt",
      "Water",
      "Coriander Leaves",
      "Cashews"
    ]
  },
  "transcription_telugu": [
    "[00:00] హలో ఫుడీస్, వెల్కమ్ టు విస్మై ఫుడ్. ఇవాల్టి స్పెషల్ పర్ఫెక్ట్ టమాటో బాత్.",
    "[00:04] భలేగా ఉంటుంది వేడి వేడిగా.",
    "[00:06] ఓ చాల్లే బాబు, ఉప్మాలో రెండు టమాటోలు వేసి చేసేస్తారు, దానికో రెసిపీనా అని మీకు అనిపిస్తుంది.",
    "[00:11] కానీ వండే తీరు, సరైన కొలతలతో చేస్తేనే కదా అసలు రుచి.",
    "[00:15] అదిగో అలాంటిదే ఇదీను. చాలా పర్ఫెక్ట్ గా వస్తుంది.",
    "[00:18] అప్రిషియేషన్ గ్యారంటీడ్ రెసిపీ ఇది ట్రస్ట్ మీ. లెట్స్ స్టార్ట్ టమాటో బాత్.",
    "[00:22] ముందుగా మూకుడులో ఓ కప్పు బొంబాయి రవ్వ వేసి, కేవలం లో ఫ్లేమ్ మీదే మంచి సువాసన వచ్చేంత వరకు వేపుకోండి.",
    "[00:28] ఇది లో ఫ్లేమ్ మీదే వేగాలి. పర్ఫెక్ట్ గా వేగడానికి కనీసం ఎనిమిది నుంచి తొమ్మిది నిమిషాల టైం పడుతుందని గుర్తుంచుకోండి.",
    "[00:35] ఆ తర్వాత దింపి చల్లార్చుకోండి.",
    "[00:37] ఇప్పుడు అదే మూకుడులో ఓ టేబుల్ స్పూన్ నెయ్యి, రెండు టేబుల్ స్పూన్ల నూనె వేడి చేసి...",
    "[00:42] పిడికెడు జీడిపప్పు వేసి ఎర్రగా వేపుకోండి. ఎర్రగా వేగిన తర్వాత తీసి పక్కన ఉంచుకోండి.",
    "[00:53] ఇప్పుడు ఓ టీస్పూన్ ఆవాలు, ఓ టీస్పూన్ శనగపప్పు, మినప్పప్పు, జీలకర్ర వేసి ఎర్రగా వేపుకోండి.",
    "[01:00] ఇవి మంచి సువాసన వచ్చి బాగా వేగిన తర్వాత, అప్పుడు ఓ ఉల్లిపాయ సన్నని తరుగు వేసి రెండు నిమిషాల పాటు ఫ్రై చేసుకోండి.",
    "[01:07] ఆ తర్వాత రెండు పచ్చిమిర్చి తరుగు, ఓ టీస్పూన్ అల్లం తరుగు వేసి ఫ్రై చేసుకోండి.",
    "[01:14] ఉల్లిపాయలు పచ్చి వాసన పోగానే, అప్పుడు రెండు పండినటువంటి టమాటోస్ తరుగు వేసి, టమాటోస్ ని మెత్తగా మగ్గించుకోవాలి.",
    "[01:23] టమాటోలు సగం పైన మగ్గాక, అప్పుడు ఓ చిన్న క్యారెట్ తరుగు...",
    "[01:30] పావు కప్పు తాజా బఠానీ వేసి కూరలని మగ్గనివ్వండి. మేము ఫ్రోజెన్ బఠానీ వాడాం.",
    "[01:35] మీరు ఫ్రెష్ బఠానీ వాడుతున్నట్లయితే ఓ 30 నిమిషాల పాటు వేడి నీళ్ళలో నానబెట్టి వేసుకోండి, ప్రాపర్ గా కుక్ అవుతాయి.",
    "[01:41] వెజిటేబుల్స్ సగం పైన కుక్ అయ్యాక ఓ టీస్పూన్ పసుపు, ఓ రెబ్బ కరివేపాకు కూడా వేసి వెజీస్ ని 80% వరకు కుక్ చేసుకోవాలి, పూర్తిగా మెత్తగా కుక్ చేయకండి.",
    "[01:50] ఇప్పుడు ఇందులో మూడు కప్పుల నీళ్లు పోసుకోండి. కప్పు రవ్వకి మూడు కప్పుల నీళ్లు.",
    "[01:56] ఇందులో సాల్ట్ వేసి హై ఫ్లేమ్ మీద ఎసర్ని తెర్లకాగనివ్వండి.",
    "[02:04] ఎసరు తెర్లుతున్నప్పుడు రవ్వని పోస్తూ బాగా కలుపుతూ దగ్గర పడనివ్వండి.",
    "[02:09] ఆ తర్వాత మూత పెట్టి లో ఫ్లేమ్ మీద మరో మూడు నిమిషాల పాటు కుక్ చేసుకోండి.",
    "[02:18] మూడు నిమిషాల తర్వాత తరిగినటువంటి కొత్తిమీర చల్లుకుని బాగా కలుపుకొని, వేయించిన జీడిపప్పు కూడా వేసుకోండి.",
    "[02:24] జీడిపప్పు లాస్ట్ లో వేస్తే తినేటప్పుడు ఆ క్రంచ్ ఉంటుంది, లేకపోతే ఎసరులో మగ్గిపోయి మెత్తగా ఉంటాయి జీడిపప్పు.",
    "[02:30] ఇప్పుడు ఇందులో రెండు టేబుల్ స్పూన్ల నెయ్యి వేసి బాగా కలుపుకొని దింపేసుకోండి.",
    "[02:34] అంతే! చాలా పర్ఫెక్ట్ గా వస్తుంది ఈ టమాటో బాత్.",
    "[02:37] నీళ్ళ కొలత విషయంలో ఎక్కువ అని కంగారు పడకండి. రవ్వ చల్లారుతున్న కొద్దీ నీళ్ళని పీల్చి డ్రై అయిపోతుంది. అందుకే ఒకటికి మూడు వేసాం.",
    "[02:45] మీరు కావాలంటే మరో అర కప్పు కూడా వేసుకోవచ్చు, ఇంకా సాఫ్ట్ గా ఉంటుంది టైం గడిచే కొద్దీ.",
    "[02:49] మీకు నచ్చిందా? మరైతే మీరు ట్రై చేసి మీకు ఎలా కుదిరిందో కచ్చితంగా ఆ పిక్ ని విస్మై ఫుడ్ ఇన్స్టాగ్రామ్ లో పోస్ట్ చేయండి.",
    "[02:54] బై ది వే, vismaifood.com వెబ్సైట్ విజిట్ చేయడం అస్సలు మర్చిపోకండి."
  ],
  "transcription_english": [
    "[00:00] Hello Foodies, Welcome to Vismai Food. Today's special is Perfect Tomato Bath.",
    "[00:04] It tastes amazing when hot.",
    "[00:06] You might think, 'Oh come on, they just add two tomatoes to Upma, why a recipe for that?'.",
    "[00:11] But the real taste comes from the cooking method and correct measurements.",
    "[00:15] This is exactly that. It turns out very perfect.",
    "[00:18] This is an appreciation guaranteed recipe, trust me. Let's start Tomato Bath.",
    "[00:22] First, add a cup of Bombay Rava (Semolina) in a pan and roast it on low flame until it gives a nice aroma.",
    "[00:28] This must be roasted on low flame. Remember it takes at least 8 to 9 minutes to roast perfectly.",
    "[00:35] After that, remove and let it cool.",
    "[00:37] Now in the same pan, heat 1 tablespoon of ghee and 2 tablespoons of oil...",
    "[00:42] Add a fistful of cashews and fry until golden red. Once fried, keep them aside.",
    "[00:53] Now add 1 teaspoon mustard seeds, 1 teaspoon chana dal, urad dal, and cumin seeds and fry until reddish.",
    "[01:00] After they are fried well and aromatic, add one finely chopped onion and fry for two minutes.",
    "[01:07] Then add two chopped green chillies and 1 teaspoon chopped ginger and fry.",
    "[01:14] Once the raw smell of onions is gone, add two chopped ripe tomatoes and cook them until soft.",
    "[01:23] Once tomatoes are more than half cooked, add a small chopped carrot...",
    "[01:30] And a quarter cup of fresh green peas and let the veggies cook. We used frozen peas.",
    "[01:35] If you are using fresh peas, soak them in hot water for 30 minutes so they cook properly.",
    "[01:41] Once vegetables are more than half cooked, add 1 teaspoon turmeric and a sprig of curry leaves, and cook veggies up to 80%, don't make them too soft.",
    "[01:50] Now pour 3 cups of water. 3 cups of water for 1 cup of rava.",
    "[01:56] Add salt to this and bring the water to a rolling boil on high flame.",
    "[02:04] When the water is boiling, pour the rava while stirring well and let it thicken.",
    "[02:09] Then cover and cook on low flame for another 3 minutes.",
    "[02:18] After 3 minutes, sprinkle chopped coriander, mix well, and add the fried cashews.",
    "[02:24] If you add cashews at the end, they retain their crunch while eating, otherwise they get soggy in the water.",
    "[02:30] Now add 2 tablespoons of ghee, mix well and remove from heat.",
    "[02:34] That's it! This Tomato Bath turns out very perfect.",
    "[02:37] Don't worry about the water quantity being too much. As the rava cools down, it absorbs water and becomes dry. That's why we added 1:3 ratio.",
    "[02:45] You can add another half cup if you want, it will stay softer as time passes.",
    "[02:49] Did you like it? Then try it and definitely post the picture on Vismai Food Instagram sharing how it turned out for you.",
    "[02:54] By the way, don't forget to visit vismaifood.com website."
  ]
}