{
  "metadata": {
    "title": "JaggeryAppalu|బెల్లం అప్పాలు|వరలక్ష్మి వ్రతం స్పెషల్ ప్రసాదం బెల్లం అప్పాలు|PrasadaluInTelugu",
    "channel_name": "Vismai Food",
    "publish_date": "2019-08-07",
    "view_count": 1600000,
    "like_count": 40000,
    "duration": "02:20",
    "language": "Telugu",
    "video_id": "a8e_R-1k-t0",
    "url": "https://www.youtube.com/watch?v=a8e_R-1k-t0",
    "description": "Bellam Appalu is a traditional sweet recipe often made as prasadam for festivals like Varalakshmi Vratam and Hanuman Jayanthi. Made with wheat flour, rice flour, and jaggery, these sweet fritters are crispy on the outside and soft on the inside. This easy recipe takes only 10 minutes to prepare.",
    "ingredients_detected": [
      "Wheat Flour",
      "Rice Flour",
      "Cardamom Powder",
      "Water",
      "Jaggery",
      "Ghee",
      "Oil"
    ]
  },
  "transcription_telugu": [
    "[00:00] హలో ఫుడీస్, వెల్కమ్ టు విస్మై ఫుడ్. ఇవాల్టి స్పెషల్ బెల్లం అప్పాలు.",
    "[00:04] వరలక్ష్మి వ్రతం, వినాయక చవితి, దసరా.. ఇలా ఏ పండగకైనా నిమిషాల్లో చేసుకోగలిగే ప్రసాదం ఇది.",
    "[00:10] చాలా తక్కువ టైమ్ లో అయిపోతుంది, పిల్లలకు స్నాక్ గా కూడా చాలా బాగుంటుంది.",
    "[00:14] చాలా సింపుల్ గా ఉంటుంది, రుచి మాత్రం అద్భుతం. లెట్స్ స్టార్ట్.",
    "[00:18] ముందుగా ఒక బౌల్ లో అర కప్పు గోధుమ పిండి, అర కప్పు బియ్యం పిండి తీసుకోండి.",
    "[00:23] ఇందులో ఒక టీస్పూన్ యాలకుల పొడి వేసి బాగా కలుపుకుని పక్కన ఉంచుకోండి.",
    "[00:27] ఇప్పుడు ఒక పాన్ లో ఒక కప్పు నీళ్లు, ఒక కప్పు తురిమిన బెల్లం వేసుకోండి.",
    "[00:32] బెల్లం తీపి తక్కువగా ఉంటే ఇంకాస్త వేసుకోవచ్చు.",
    "[00:35] బెల్లం కరిగేంత వరకు మరిగించుకోండి, పాకం రావాల్సిన అవసరం లేదు.",
    "[00:40] నీళ్లు ఇలా తెర్లుతున్నప్పుడు స్టవ్ ఆఫ్ చేసేసి, మనం కలిపి ఉంచుకున్న పిండిని వేస్తూ ఉండలు లేకుండా కలుపుకోండి.",
    "[00:48] పిండి వేడి నీళ్లలో బాగా కలిసి ముద్దలా అవుతుంది.",
    "[00:52] ఇప్పుడు దీనిని పూర్తిగా చల్లారనివ్వండి.",
    "[00:55] చల్లారిన పిండిలో ఒక టీస్పూన్ నెయ్యి వేసి, చపాతీ పిండిలా మెత్తగా ఒత్తుకోండి.",
    "[01:02] పిండి మరీ గట్టిగా ఉంటే కాసిన్ని నీళ్లు చల్లుకోవచ్చు, మరీ మెత్తగా ఉంటే కాస్త పొడి పిండి వేసుకోవచ్చు.",
    "[01:08] ఇప్పుడు చేతికి నెయ్యి రాసుకుని, చిన్న చిన్న ఉండలుగా తీసుకుని, అరిచేతిలో పెట్టి అప్పాల్లా వత్తుకోండి.",
    "[01:15] మరీ పల్చగా కాకుండా, మరీ మందంగా కాకుండా ఇలా మీడియం గా చేసుకోండి.",
    "[01:20] ఇప్పుడు డీప్ ఫ్రై కి సరిపడా నూనె కాగబెట్టుకుని, నూనె కాగాక మాత్రమే అప్పాలను వేసుకోండి.",
    "[01:25] మంటని మీడియం ఫ్లేమ్ లో ఉంచి వేయించుకోండి.",
    "[01:30] హై ఫ్లేమ్ లో వేస్తే పైన రంగు వచ్చేస్తుంది కానీ లోపల పిండి ఉడకదు.",
    "[01:35] రెండు వైపులా మంచి గోల్డెన్ కలర్ వచ్చేంత వరకు వేయించుకుని తీసుకుంటే, కమ్మటి బెల్లం అప్పాలు రెడీ.",
    "[01:42] ఇవి కనీసం వారం రోజుల పాటు నిల్వ ఉంటాయి.",
    "[01:45] మీకు నచ్చిందా? అయితే మీరు ట్రై చేసి, ఆ పిక్ ని విస్మై ఫుడ్ ఇన్స్టాగ్రామ్ లో పోస్ట్ చేయడం మర్చిపోకండి."
  ],
  "transcription_english": [
    "[00:00] Hello Foodies, Welcome to Vismai Food. Today's special is Bellam Appalu (Jaggery Fritters).",
    "[00:04] Be it Varalakshmi Vratam, Vinayaka Chavithi, or Dussehra... this is a prasadam recipe that can be made in minutes for any festival.",
    "[00:10] It gets done in very less time, and is also great as a snack for kids.",
    "[00:14] It is very simple, but the taste is wonderful. Let's start.",
    "[00:18] First, take half a cup of wheat flour and half a cup of rice flour in a bowl.",
    "[00:23] Add a teaspoon of cardamom powder to this, mix well and keep aside.",
    "[00:27] Now in a pan, add one cup of water and one cup of grated jaggery.",
    "[00:32] If the jaggery is less sweet, you can add a little more.",
    "[00:35] Boil until the jaggery melts; no string consistency is needed.",
    "[00:40] When the water is boiling like this, turn off the stove and add the flour mixture we prepared, mixing without lumps.",
    "[00:48] The flour will mix well with the hot water and become a dough.",
    "[00:52] Now let this cool down completely.",
    "[00:55] Add a teaspoon of ghee to the cooled dough and knead it softly like chapati dough.",
    "[01:02] If the dough is too hard, you can sprinkle some water; if too soft, add some dry flour.",
    "[01:08] Now grease your hands with ghee, take small balls of dough, place them on your palm and flatten them into appalu (discs).",
    "[01:15] Make them neither too thin nor too thick, keep them medium like this.",
    "[01:20] Now heat oil for deep frying, and drop the appalu only after the oil is hot.",
    "[01:25] Keep the flame on medium and fry.",
    "[01:30] If fried on high flame, they will get color on the outside but the dough inside won't cook.",
    "[01:35] Fry until they get a nice golden color on both sides and remove them. Delicious Bellam Appalu are ready.",
    "[01:42] These stay fresh for at least a week.",
    "[01:45] Did you like it? Then try it and don't forget to post that picture on Vismai Food Instagram."
  ]
}