{
  "metadata": {
    "title": "Tomato Chicken Curry In Telugu | టమాటో చికెన్ కర్రీ | ఈజీ & టేస్టీ బ్యాచలర్స్ రెసిపీ |VismaiFood",
    "channel_name": "Vismai Food",
    "publish_date": "2019-08-08",
    "view_count": 923000,
    "like_count": 14000,
    "duration": "02:39",
    "language": "Telugu",
    "video_id": "9g5qZ8a3e7s",
    "url": "https://www.youtube.com/watch?v=9g5qZ8a3e7s",
    "description": "This is a spicy and tasty Tomato Chicken Curry recipe in Telugu. This easy and tasty bachelor's recipe is perfect for rice, roti, chapati, and bagara rice. Follow these simple steps to make a delicious chicken curry.",
    "ingredients_detected": [
      "Chicken",
      "Tomatoes",
      "Onion",
      "Ginger Garlic Paste",
      "Green Chillies",
      "Curry Leaves",
      "Cumin Seeds",
      "Mustard Seeds",
      "Dry Red Chillies",
      "Coriander Powder",
      "Cumin Powder",
      "Garam Masala",
      "Turmeric Powder",
      "Red Chilli Powder",
      "Salt",
      "Oil",
      "Coriander Leaves",
      "Water"
    ]
  },
  "transcription_telugu": [
    "[00:00] హలో ఫుడీస్, వెల్కమ్ టు విస్మై ఫుడ్. ఇవాల్టి స్పెషల్ టేస్టీ స్పైసీ టమాటో చికెన్.",
    "[00:06] యమా యమ్మీగా ఉంటుంది ఇది. రోటి కానీ, చపాతీ కానీ, బటర్ నాన్ కానీ లేదా వేడి వేడి అన్నం లేదంటే బగారా అన్నం ఏమన్నా ఉంటదిలే.",
    "[00:13] ఒక్కొక్కడు అరకేజీ కూర లేపాలి మస్తుంటది, అందరికీ చాలా నచ్చేస్తుంది.",
    "[00:19] లెట్స్ స్టార్ట్ టమాటో చికెన్.",
    "[00:20] పాన్ లో వన్ థర్డ్ కప్ ఆయిల్ హీట్ చేసుకోండి. ఈ కూరకి కాస్త నూనె ఎక్కువగా ఉంటేనే రుచి.",
    "[00:25] ఇందులో ఓ టీస్పూన్ జీలకర్ర, రెండు ఎండుమిర్చి, ఓ టీస్పూన్ ఆవాలు వేసి చిటపటమనిపించండి.",
    "[00:30] ఆ తర్వాత రెండు పండినటువంటి పెద్ద పెద్ద ముక్కల టమాటోలు వేసి మూడు నిమిషాల పాటు ఫ్రై చేసుకొని తీసుకోండి.",
    "[00:37] మూడు నిమిషాల పాటు ఎంత ఫ్రై అవుతుందో అంత వేగితే చాలు, తీసేసుకొని పక్కన ఉంచుకోండి.",
    "[00:41] ఆ తర్వాత ఓ పెద్ద ఉల్లిపాయ సన్నని తరుగు వేసి గోల్డెన్ బ్రౌన్ కలర్ వచ్చేంత వరకు వేపి తీరాలి.",
    "[00:48] అప్పుడే ఈ కూరకి రుచి చిక్కదనం వస్తుంది.",
    "[00:51] లైట్ గోల్డెన్ బ్రౌన్ కలర్ రాగానే ఓ టేబుల్ స్పూన్ అల్లం వెల్లుల్లిపాయ పేస్ట్ వేసి ఓ నిమిషం పాటు ఫ్రై చేసుకోండి.",
    "[00:58] ఆ తర్వాత కొద్దిగా సాల్ట్, ఓ టీస్పూన్ ధనియాల పొడి, పావు చెంచా పసుపు, ఓ టేబుల్ స్పూన్ కారం, ఓ టీస్పూన్ జీలకర్ర పొడి, అర టీస్పూన్ గరం మసాలా వేసి మసాలాలన్నిటిని బాగా ఫ్రై చేయండి.",
    "[01:13] మసాలాలు వేగి ఆయిల్ పైకి తేలాక రెండు నాటు టమాటోల పేస్ట్ వేసి టమాటోల్లోని పచ్చి వాసన పోయి నూనె పైకి తేలాలి, అందాక ఫ్రై చేసుకోండి.",
    "[01:21] ఇది మస్ట్, దీనికి కనీసం 12 నుంచి 15 నిమిషాల పైనే టైం పడుతుందని గుర్తుంచుకోండి.",
    "[01:27] టమాటోలు సగం పైన మగ్గాక మూడు పచ్చిమిర్చి చీలికలు, ఓ రెబ్బ కరివేపాకు వేసి ఫ్రై చేసుకోండి.",
    "[01:32] పచ్చిమిర్చి చీలికలు ఈ స్టేజ్ లో వేసినందువల్ల భలేగా ఉంటాయి తినేటప్పుడు కారం కారంగా పంటికింద తగులుతూ.",
    "[01:38] చూసారా టమాటోస్ పూర్తిగా మగ్గి ఇలా ముద్దగా అవుతుంది, అందాక వేగాలి.",
    "[01:42] ఇప్పుడు అర కిలో చికెన్ గంట పాటు ఉప్పు నీటిలో నానబెట్టినది వేసి నాలుగు నిమిషాల పాటు హై ఫ్లేమ్ మీద ఫ్రై చేయండి.",
    "[01:48] చికెన్ ఉప్పు నీటిలో నానబెట్టడం వల్ల సాఫ్ట్ అవుతుంది. చికెన్ కి కూడా ఉప్పు పట్టుంటుంది కాబట్టి ఉప్పు చూసుకొని వేసుకోండి.",
    "[01:53] ఇప్పుడు 250 ml నీళ్ళు పోసి మూత పెట్టి కూరని నిదానంగా లో ఫ్లేమ్ మీద మరో 15 నిమిషాల పాటు ఉడకనివ్వండి.",
    "[02:00] మధ్య మధ్యలో కలుపుతూ ఉండండి.",
    "[02:05] 15 నిమిషాల తర్వాత కూర ఇలా దగ్గర పడుతుంది.",
    "[02:08] అప్పుడు ఫ్రై చేసి పక్కన ఉంచుకున్నటువంటి టమాటోస్ వేసి మరో ఏడు ఎనిమిది నిమిషాల పాటు లో ఫ్లేమ్ మీద మాత్రమే కుక్ చేసుకోండి.",
    "[02:15] టమాటోస్ చక్కగా మగ్గిపోతాయి.",
    "[02:18] దింపే ముందు రెండు టేబుల్ స్పూన్ల కొత్తిమీర తరుగు చల్లుకొని దింపుకోండి.",
    "[02:21] అంతే! పుల్ల పుల్లగా కారం కారంగా ఆహా ఏమన్నా ఉంటుంది చాలా చాలా బాగుంటుంది.",
    "[02:27] ట్రస్ట్ మీ మీరు తప్పక ట్రై చేయండి, అందరూ ఎంజాయ్ చేస్తారు.",
    "[02:30] మీకు నచ్చిందా? మరైతే మీరు ట్రై చేసి మీకు ఎలా కుదిరిందో కచ్చితంగా ఆ పిక్ ని విస్మై ఫుడ్ ఇన్స్టాగ్రామ్ లో పోస్ట్ చేయండి.",
    "[02:36] బై ది వే, vismaifood.com వెబ్సైట్ విజిట్ చేయడం అస్సలు మర్చిపోకండి."
  ],
  "transcription_english": [
    "[00:00] Hello Foodies, Welcome to Vismai Food. Today's special is tasty and spicy Tomato Chicken.",
    "[00:06] It tastes yummy yummy. Be it roti, chapati, butter naan, or hot rice or bagara rice, it goes well with anything.",
    "[00:13] Each person will finish half a kg of curry, it is that good, everyone will like it a lot.",
    "[00:19] Let's start Tomato Chicken.",
    "[00:20] Heat one-third cup of oil in a pan. This curry tastes good only if the oil is slightly more.",
    "[00:25] Add a teaspoon of cumin seeds, two dry red chilies, a teaspoon of mustard seeds and let them splutter.",
    "[00:30] After that, add two ripe tomatoes cut into large pieces and fry for three minutes and remove.",
    "[00:37] Frying for three minutes is enough, whatever fries in that time, remove and keep aside.",
    "[00:41] After that, add a large finely chopped onion and you must fry until it turns golden brown color.",
    "[00:48] Only then this curry gets taste and thickness.",
    "[00:51] As soon as it turns light golden brown, add a tablespoon of ginger garlic paste and fry for a minute.",
    "[00:58] After that, add a little salt, a teaspoon of coriander powder, a quarter spoon of turmeric powder, a tablespoon of red chili powder, a teaspoon of cumin powder, half a teaspoon of garam masala and fry all the spices well.",
    "[01:13] After the spices are fried and oil floats up, add the paste of two country tomatoes and fry until the raw smell of tomatoes goes away and oil floats up.",
    "[01:21] This is a must, remember it takes at least 12 to 15 minutes or more.",
    "[01:27] After tomatoes are half cooked, add three slit green chilies, a sprig of curry leaves and fry.",
    "[01:32] Adding green chili slits at this stage tastes great while eating, spicy and crunchy under the teeth.",
    "[01:38] See, the tomatoes are fully cooked and become a lump like this, fry until then.",
    "[01:42] Now add half a kg of chicken soaked in salt water for an hour and fry on high flame for four minutes.",
    "[01:48] Soaking chicken in salt water makes it soft. Also chicken absorbs salt, so check and add salt accordingly.",
    "[01:53] Now pour 250 ml water, cover with lid and let the curry cook slowly on low flame for another 15 minutes.",
    "[02:00] Keep stirring in between.",
    "[02:05] After 15 minutes, the curry thickens like this.",
    "[02:08] Then add the tomatoes that were fried and kept aside, and cook for another seven to eight minutes on low flame only.",
    "[02:15] Tomatoes will cook nicely.",
    "[02:18] Before taking off the stove, sprinkle two tablespoons of chopped coriander and remove.",
    "[02:21] That's it! Tangy and spicy, aha it tastes amazing, very very good.",
    "[02:27] Trust me, you must try it, everyone will enjoy.",
    "[02:30] Did you like it? Then try it and definitely post the pic on Vismai Food Instagram sharing how it turned out for you.",
    "[02:36] By the way, don't forget to visit vismaifood.com website."
  ]
}