{
  "metadata": {
    "title": "Perugu Vada|పెరుగు వడ|చాలా సాఫ్ట్ అండ్ జ్యూసీ పెరుగువడలు ఇలా చేయండి |Dahi vada in Telugu",
    "channel_name": "Vismai Food",
    "publish_date": "2019-08-08",
    "view_count": 313000,
    "like_count": 5200,
    "duration": "05:35",
    "language": "Telugu",
    "video_id": "Unknown",
    "url": "https://www.youtube.com/watch?v=Unknown",
    "description": "Learn how to make soft, juicy, and delicious Perugu Vada (Dahi Vada) at home. This recipe ensures perfect texture and taste, ideal for festivals and special occasions. The video provides step-by-step instructions from soaking the dal to the final tempering.",
    "ingredients_detected": [
      "Urad Dal",
      "Salt",
      "Water",
      "Oil",
      "Mustard Seeds",
      "Cumin Seeds",
      "Chana Dal",
      "Dry Red Chillies",
      "Curry Leaves",
      "Green Chilli",
      "Ginger",
      "Curd"
    ]
  },
  "transcription_telugu": [
    "[00:00] హలో ఫుడీస్, వెల్కమ్ టు విస్మై ఫుడ్.",
    "[00:01] ఇవాల్టి స్పెషల్ పెరుగు వడ. ఇది ఇష్టపడని వారు ఎవరుంటారు?",
    "[00:04] చాలా చాలా బాగుంటుంది. పండగలకైతే ఇంకా బాగుంటుంది. చాలా సింపులే కానీ కొందరికి గట్టిగా వస్తాయి.",
    "[00:10] కాసేపటికి పెరుగులోని నీరంతా పీల్చేసి వడల పైన క్రీమ్ గా మిగిలిపోతుంది. లోపల దాకా జ్యూసీగా ఉండనే ఉండవు.",
    "[00:15] కానీ మా స్టెప్స్ ఫాలో అయితే మాత్రం మీరు ఎప్పుడు చేయండి పర్ఫెక్ట్ సూపర్ సాఫ్ట్ పెరుగు వడలు వచ్చేస్తాయి. అవి ఎలాగో చూద్దాం లెట్స్ స్టార్ట్.",
    "[00:23] ముందుగా నాలుగు గంటల పైన నానబెట్టుకున్నటువంటి ఓ కప్పు అంటే పావు కిలో మినప్పప్పుని కాస్త ఉప్పు వేసి ఫైన్ గా పేస్ట్ చేసుకోండి.",
    "[00:31] ఇది ఇడ్లీ పిండి ఎంత గట్టిగా ఉంటుందో ఆ థిక్ నెస్ కి అడ్జస్ట్ చేసుకోండి.",
    "[00:34] ఇప్పుడు ఓ టేబుల్ స్పూన్ ఆయిల్ హీట్ చేసుకొని అందులో ఓ టీస్పూన్ ఆవాలు, ఓ టీస్పూన్ జీలకర్ర, ఓ టీస్పూన్ శనగపప్పు, ఓ టీస్పూన్ మినప్పప్పు వేసి జస్ట్ 80% ఫ్రై చేసుకోండి.",
    "[00:46] అప్పుడు రెండు ఎండుమిర్చి తరుగు, రెండు రెబ్బల కరివేపాకు, ఓ పచ్చిమిర్చి తరుగు, ఓ చిన్న అల్లం తరుగు వేసి కలుపుకొని...",
    "[00:54] ఓ లీటర్ చిలికిన పెరుగులో వేసి ఉప్పు కూడా వేసి బాగా కలుపుకోండి.",
    "[01:00] పెరుగు గరిట జారుగా ఉండాలి.",
    "[01:03] ఇప్పుడు ఓ లీటర్ పైన నీళ్లు పోసుకొని అందులో కాస్త సాల్ట్, రెండు టేబుల్ స్పూన్ల పెరుగు మిక్స్చర్ వేసి బాగా కలుపుకొని పక్కన ఉంచుకోండి.",
    "[01:13] ఇప్పుడు మెత్తగా రుబ్బుకున్నటువంటి పిండి, ఇదిగో ఇలా ఇడ్లీ పిండి ఎంత జారుగా ఉంటుంది ఆ జారుగా ఉంటే మీకు వడలు సాఫ్ట్ గా వస్తాయి.",
    "[01:19] పిండి ఏ మాత్రం గట్టిగా ఉన్నా వడలు మీకు గట్టిగా వస్తాయి.",
    "[01:22] ఇప్పుడు అరచేతిని మొత్తం తడి చేసుకొని చిన్న ఉండను తీసుకొని సెంటర్ లో హోల్ చేసి వేడి వేడి నూనెలో హై ఫ్లేమ్ మీద వేసి ఫ్రై చేసుకోండి.",
    "[01:34] ఈ వడలని మరీ ఎర్రగా ఫ్రై చేసుకోనక్కర్లేదు. కాస్త లైట్ గోల్డెన్ బ్రౌన్ కలర్ రాగానే తీసేయొచ్చు.",
    "[01:41] ఇప్పుడు వేడి వేడిగా ఫ్రై చేసుకున్న ఈ వడలని తీసి ఇందాక సిద్ధంగా ఉంచుకున్న నీళ్లలో వేసి నాలుగైదు నిమిషాలు అలాగే వదిలేయండి.",
    "[01:48] నీళ్లు అస్సలు పిండకూడదు. ఆ వేడి మీదే చక్కగా నీరంతా పీల్చుకుంటుంది.",
    "[01:52] వడలు కొంచెం సాఫ్ట్ గా ఉంటాయి కాబట్టి జాగ్రత్తగా ఓ బౌల్ లో సర్దండి నాలుగైదు నిమిషాల తర్వాత.",
    "[01:57] ఆ తర్వాత పెరుగు మిక్స్చర్ పోసి ఓ 30 నిమిషాలు వదిలేయండి.",
    "[02:01] అంతే మీ పెరుగు వడలు రెడీ. మీరు ఈ పద్ధతిలో పెరుగు వడలు చేస్తే నిజంగా చాలా సాఫ్ట్ గా వస్తాయి.",
    "[02:07] చక్కగా పెరుగునంతా పీల్చుకొని చాలా జ్యూసీగా ఉంటాయి.",
    "[02:10] ఈవెన్ మీరు ఫ్రిడ్జ్ లో పెట్టినా కూడా ఎక్కడ పెరుగు వడలు గట్టిపడవు, చాలా సాఫ్ట్ గా జ్యూసీగా ఉంటాయి.",
    "[02:15] ఓ సారి ఈ పద్ధతిలో ట్రై చేసి చూడండి మీరు ఎంతగా ఎంజాయ్ చేస్తారో మీరే. మరైతే మీరు కూడా ఈ పద్ధతిలో ట్రై చేసి ఆ పిక్ ని విస్మై ఫుడ్ ఇన్స్టాగ్రామ్ లో పోస్ట్ చేయండి.",
    "[02:24] మా ఫేస్బుక్ పేజ్ ని లైక్ చేయండి కామెంట్ సెక్షన్ లో కూడా తెలియజేయండి.",
    "[02:27] బై ది వే విస్మై ఫుడ్ పింటరెస్ట్ లో కూడా ఉంది అక్కడ కూడా ఫాలో అవ్వండి."
  ],
  "transcription_english": [
    "[00:00] Hello Foodies, welcome to Vismai Food.",
    "[00:01] Today's special is Perugu Vada (Dahi Vada). Who doesn't like this?",
    "[00:04] It tastes very very good. Especially for festivals, it's even better. It's very simple but for some, they turn out hard.",
    "[00:10] After a while, they absorb all the water from the curd and remain creamy on top, but not juicy inside.",
    "[00:15] But if you follow our steps, whenever you make them, you will get perfect super soft Perugu Vadas. Let's see how, let's start.",
    "[00:23] First, take one cup, which is a quarter kilo of Urad dal soaked for over four hours, add a little salt and grind it into a fine paste.",
    "[00:31] Adjust the thickness to be as thick as idli batter.",
    "[00:34] Now heat a tablespoon of oil, add a teaspoon of mustard seeds, a teaspoon of cumin seeds, a teaspoon of chana dal, a teaspoon of urad dal and fry just 80%.",
    "[00:46] Then add two chopped dry red chillies, two sprigs of curry leaves, a chopped green chilli, a small piece of chopped ginger, mix well...",
    "[00:54] Add this to a liter of whisked curd, add salt and mix well.",
    "[01:00] The curd should be of flowing consistency.",
    "[01:03] Now pour over a liter of water, add a little salt, two tablespoons of the curd mixture, mix well and keep aside.",
    "[01:13] Now the finely ground batter, look, it should be as loose as idli batter, then you will get soft vadas.",
    "[01:19] Even if the batter is slightly hard, the vadas will turn out hard.",
    "[01:22] Now wet your entire palm, take a small ball of batter, make a hole in the center and fry in hot oil on high flame.",
    "[01:34] These vadas don't need to be fried too red. You can remove them as soon as they turn light golden brown color.",
    "[01:41] Now take these hot fried vadas and drop them into the water prepared earlier and leave them for four to five minutes.",
    "[01:48] Do not squeeze the water at all. They will absorb the water nicely due to the heat.",
    "[01:52] Since the vadas will be a bit soft, arrange them carefully in a bowl after four to five minutes.",
    "[01:57] Then pour the curd mixture and leave it for 30 minutes.",
    "[02:01] That's it, your Perugu Vadas are ready. If you make Perugu Vadas in this method, they will truly turn out very soft.",
    "[02:07] They will absorb the curd nicely and will be very juicy.",
    "[02:10] Even if you keep them in the fridge, the Perugu Vadas won't harden anywhere, they will remain very soft and juicy.",
    "[02:15] Try this method once and see how much you will enjoy. So you also try this method and post that pic on Vismai Food Instagram.",
    "[02:24] Like our Facebook page and let us know in the comment section as well.",
    "[02:27] By the way, Vismai Food is also on Pinterest, follow there too."
  ]
}