{
  "metadata": {
    "title": "Nizami Gosht | Mutton Curry In Telugu | Restaurant Style Hyderabadi Nizami Mutton Curry",
    "channel_name": "Vismai Food",
    "publish_date": "2019-08-10",
    "view_count": 279000,
    "like_count": 5200,
    "duration": "03:00",
    "language": "Telugu",
    "video_id": "Unknown",
    "url": "https://www.youtube.com/watch?v=Unknown",
    "description": "Hyderabadi Nizami Mutton Curry is a traditional recipe from the Nizam era. This rich and thick gravy curry is perfect for Bakrid or any special occasion. It pairs wonderfully with Bagara Rice, White Rice, Naan, or Roti.",
    "ingredients_detected": [
      "Mutton",
      "Ghee",
      "Onions",
      "Ginger Garlic Paste",
      "Salt",
      "Turmeric",
      "Roasted Cumin Powder",
      "Coriander Powder",
      "Garam Masala",
      "Cashews",
      "Melon Seeds",
      "Cinnamon",
      "Star Anise",
      "Cloves",
      "Cardamom",
      "Bay Leaf",
      "Black Pepper",
      "Sesame Seeds",
      "Poppy Seeds",
      "Green Chillies",
      "Curd",
      "Water",
      "Fresh Cream"
    ]
  },
  "transcription_telugu": [
    "[00:00] హలో ఫుడీస్ వెల్కమ్ టు విస్మై ఫుడ్. ఇవాల్టి స్పెషల్ బక్రీద్ స్పెషల్ నిజామీ ఘోస్ట్.",
    "[00:06] వందల ఏళ్ల నాటి నిజాంల రెసిపీ ఇది. ఇది మీకు యూజువల్ గా రెస్టారెంట్ లో అంత ఈజీగా దొరకదు. టిపికల్ హైదరాబాదీ ముస్లిమ్స్ చేస్తుంటారు ఇది.",
    "[00:13] ఘుమఘుమలాడిపోతూ థిక్ గ్రేవీతో ఆహా ఎంతని పొగడాలి అంత రుచిగా ఉంటుంది ఈ కర్రీ.",
    "[00:19] ఈ బక్రీద్ కి ఈ రెసిపీ తో పండగని మరింత రంజుగా చేసుకోండి.",
    "[00:23] ముందుగా కుక్కర్ లో పావు కప్పు నెయ్యి వేడి చేసి, అందులో రెండు పెద్ద ఉల్లిపాయల సన్నని తరుగు వేసి గోల్డెన్ బ్రౌన్ కలర్ వచ్చేంత వరకు ఫ్రై చేసుకొని తీరాలి ఇది మస్ట్.",
    "[00:32] ఆనియన్స్ గోల్డెన్ బ్రౌన్ కలర్ వచ్చేంత వరకు వేగితేనే అసలు రుచి.",
    "[00:36] ఇప్పుడు ఓ టేబుల్ స్పూన్ అల్లం వెల్లుల్లి పేస్ట్ వేసి వేయించుకోండి.",
    "[00:41] ఆ తర్వాత గంట పాటు ఉప్పు నీటిలో నానబెట్టినటువంటి లేత మటన్ వేసి నాలుగైదు నిమిషాల పాటు బాగా ఫ్రై చేసుకోండి.",
    "[00:49] ముక్క బాగా ఫ్రై చేసి తీరాలి లేదంటే పచ్చి వాసన వస్తుంది.",
    "[00:53] ఇప్పుడు కొద్దిగా సాల్ట్, పావు చెంచా పసుపు, ఓ టీస్పూన్ వేయించిన జీలకర్ర పొడి, ఓ టీస్పూన్ ధనియాల పొడి, ఓ టీస్పూన్ విస్మై ఫుడ్ స్పెషల్ గరం మసాలా వేసి...",
    "[01:02] ముక్కల్లో నుంచి ఆయిల్ సెపరేట్ అయ్యేంత వరకు ఫ్రై చేసుకోండి.",
    "[01:07] ఇందులో ఉప్పు చూసుకొని వేసుకోండి. ఉప్పు నీళ్లలో నానబెట్టడం వల్ల మటన్ కి ఉప్పు పట్టి ఉంటుంది.",
    "[01:12] ఇప్పుడు 700ml నీళ్లు పోసుకోండి. ఇది బాగా కలిపి మూత పెట్టి నాలుగు విజిల్స్ రానివ్వండి మీడియం ఫ్లేమ్ మీద మాత్రమే.",
    "[01:24] ఇప్పుడు పావు కప్పు జీడిపప్పు, రెండు టీస్పూన్ల కర్బూజా గింజలు వేసి లో ఫ్లేమ్ మీద వేపుకోండి.",
    "[01:29] ఇప్పుడు ఓ ఇంచ్ దాల్చిన చెక్క, ఓ అనాస పువ్వు, ఐదు లవంగాలు, ఐదు యాలకులు, ఓ బిర్యానీ ఆకు, ఓ టీస్పూన్ మిరియాలు, ఓ టేబుల్ స్పూన్ నువ్వులు, ఓ టేబుల్ స్పూన్ గసగసాలు వేసి లో ఫ్లేమ్ మీద వేపుకోండి.",
    "[01:42] ఇవి సగం పైన వేగాక నాలుగైదు పచ్చిమిర్చి వేసి వేయించుకోండి.",
    "[01:46] ఈ కూరకి మిరపపొడి వాడరు, వాడకూడదు. కారం అంతా కూడా మీకు మిరపకాయల నుండే రావాలి కాబట్టి దానికి తగ్గట్టుగా మిరపకాయల్ని అడ్జస్ట్ చేసుకోండి.",
    "[01:54] ఇప్పుడు వీటిని చల్లార్చి జార్ లో వేసి, అరకప్పు కమ్మటి మీగడతో ఉన్నటువంటి పెరుగు, కాసిని నీళ్లు పోసి, ఓ చిన్న కట్ట పుదీనా ఆకులు వేసి మెత్తని పేస్ట్ గా చేసుకోండి.",
    "[02:10] ఇప్పుడు మటన్ ముక్క ఉడికిందో లేదో చూసుకొని, గ్రైండ్ చేసుకున్నటువంటి పేస్ట్ వేసి బాగా కలుపుకోండి.",
    "[02:17] ఆ తర్వాత 100ml నీళ్లు పోసుకొని లో ఫ్లేమ్ మీద 15 నిమిషాల పైన ఉడకనివ్వండి.",
    "[02:23] మీకు ముక్క ఉడకనట్లయితే ఇంకొంచెం నీళ్లు ఎక్కువగా పోసుకోండి.",
    "[02:26] 15 నిమిషాలకి కూర చిక్కబడుతుంది. అప్పుడు ఓ పెద్ద చెంచాడు నెయ్యి, పావు కప్పు కమ్మటి పాల మీగడ అదేనండి ఫ్రెష్ క్రీం వేసుకోండి.",
    "[02:34] ఇది వేసి మరో రెండు నిమిషాలు ఉడికించి దింపేసుకోండి. అంతే.",
    "[02:37] బగారా అన్నం లేదా వైట్ రైస్, రోటీ, నాన్ లోకి పెట్టుకొని తింటుంటే ఆ అనుభవం మాటల్లో చెప్పలేనంత గొప్పగా ఉంటుంది మరి.",
    "[02:45] నిజంగా చాలా చాలా బాగుంటుంది. కానీ మంచి మటన్ ఉండాలి, మటన్ పర్ఫెక్ట్ గా ఆయిల్ లో ఫ్రై అవ్వాలి.",
    "[02:52] నచ్చిందా? మరైతే మీరు ట్రై చేసి మీకు ఎలా కుదిరిందో కచ్చితంగా ఆ పిక్ ని విస్మై ఫుడ్ ఇన్స్టాగ్రామ్ లో పోస్ట్ చేయండి.",
    "[02:57] బై ది వే విస్మై ఫుడ్ డాట్ కామ్ వెబ్సైట్ విజిట్ చేయడం అస్సలు మర్చిపోకండి."
  ],
  "transcription_english": [
    "[00:00] Hello Foodies, Welcome to Vismai Food. Today's special is Bakrid Special Nizami Gosht.",
    "[00:06] This is a recipe from the Nizam era, hundreds of years old. You usually won't find this easily in restaurants. Typical Hyderabadi Muslims make this.",
    "[00:13] With its aromatic thick gravy, how much ever I praise it, this curry tastes that good.",
    "[00:19] Make your festival even more grand with this recipe for this Bakrid.",
    "[00:23] First, heat a quarter cup of ghee in a cooker, add finely chopped two large onions and fry until golden brown. This is a must.",
    "[00:32] The real taste comes only if onions are fried until golden brown.",
    "[00:36] Now add a tablespoon of ginger garlic paste and fry.",
    "[00:41] Then add tender mutton soaked in salt water for an hour and fry well for four to five minutes.",
    "[00:49] The meat must be fried well, otherwise it will smell raw.",
    "[00:53] Now add a little salt, a quarter spoon turmeric, a teaspoon roasted cumin powder, a teaspoon coriander powder, a teaspoon Vismai Food special garam masala...",
    "[01:02] Fry until oil separates from the pieces.",
    "[01:07] Add salt carefully. Since the mutton was soaked in salt water, it would have absorbed salt.",
    "[01:12] Now pour 700ml water. Mix well, cover with lid and let it whistle 4 times on medium flame only.",
    "[01:24] Now add a quarter cup of cashews, two teaspoons of melon seeds and roast on low flame.",
    "[01:29] Now add one inch cinnamon, one star anise, five cloves, five cardamoms, one bay leaf, one teaspoon black pepper, one tablespoon sesame seeds, one tablespoon poppy seeds and roast on low flame.",
    "[01:42] After they are half roasted, add four to five green chillies and roast.",
    "[01:46] Chilli powder is not used for this curry, it should not be used. All the spiciness should come from chillies, so adjust chillies accordingly.",
    "[01:54] Now cool them, put in a jar, add half a cup of fresh creamy curd, some water, a small bunch of mint leaves and make a smooth paste.",
    "[02:10] Now check if the mutton is cooked, add the ground paste and mix well.",
    "[02:17] Then add 100ml water and let it cook on low flame for over 15 minutes.",
    "[02:23] If the meat is not cooked, add a little more water.",
    "[02:26] The curry thickens in 15 minutes. Then add a big spoonful of ghee, a quarter cup of fresh milk cream.",
    "[02:34] Add this, cook for another two minutes and remove from heat. That's it.",
    "[02:37] Eating it with Bagara rice or white rice, roti, naan, that experience is beyond words.",
    "[02:45] It is really very very good. But you need good quality mutton, and mutton should be fried perfectly in oil.",
    "[02:52] Did you like it? Then do try it and definitely post the picture on Vismai Food Instagram sharing how it turned out for you.",
    "[02:57] By the way, don't forget to visit vismaifood.com website."
  ]
}