{
  "metadata": {
    "title": "Sorakaya Ulli Karam | సొరకాయ ఉల్లి కారం | అస్సలు వదలకుండా తినేస్తారు | Bottle Gourd Recipe",
    "channel_name": "Vismai Food",
    "publish_date": "2019-08-14",
    "view_count": 273000,
    "like_count": 5500,
    "duration": "03:10",
    "language": "Telugu",
    "video_id": "Unknown",
    "url": "https://www.youtube.com/watch?v=Unknown",
    "description": "Learn how to make Sorakaya Ulli Karam, a spicy and tasty bottle gourd curry. This traditional Telugu recipe is perfect with hot rice and ghee. The video guides you through making a special spice powder and an onion-tamarind paste that gives this curry its unique flavor.",
    "ingredients_detected": [
      "Bottle Gourd",
      "Salt",
      "Turmeric",
      "Oil",
      "Chana Dal",
      "Urad Dal",
      "Coriander Seeds",
      "Dry Red Chillies",
      "Onions",
      "Tomatoes",
      "Jaggery",
      "Tamarind",
      "Water",
      "Mustard Seeds",
      "Cumin Seeds",
      "Curry Leaves",
      "Chilli Powder",
      "Coriander Leaves"
    ]
  },
  "transcription_telugu": [
    "[00:00] హలో ఫుడీస్, వెల్కమ్ టు విస్మై ఫుడ్. ఇవాల్టి స్పెషల్ స్పైసీ సొరకాయ ఉల్లి కారం.",
    "[00:05] అసలు సిసలు తెలుగు వారి వంటకం. వేడి వేడి అన్నంలో నెయ్యేసుకుని తింటుంటే ఓ నాలుగు ముద్దలు ఎక్కువగానే తింటారు కచ్చితంగా ఆ పూట.",
    "[00:13] రోజు చేసుకునే కూరలకి చాలా పర్ఫెక్ట్ ఈ కూర. ఛానల్ లో ఆల్రెడీ వంకాయ ఉల్లి కారం ఉంది. త్వరలో నేను కాకరకాయ ఉల్లి కారం చూపించబోతున్నాను. ప్రస్తుతానికి ఈ సొరకాయ ఉల్లి కారం చూడండి.",
    "[00:23] కారాన్ని ఇష్టపడే వారు ఎవరైనా సరే ఈ కూరకి ప్రాణం పెట్టేస్తారు అంత బాగుంటుంది. లెట్స్ స్టార్ట్.",
    "[00:28] ముందుగా నాలుగు కప్పుల లేత సొరకాయ చెక్కు తీసి ముక్కలుగా చేసుకున్నవి తీసుకోండి.",
    "[00:33] ఇందులో కొద్దిగా సాల్ట్, అర టీస్పూన్ పసుపు వేసి కలిపి పక్కన ఉంచుకోండి.",
    "[00:41] ఇప్పుడు పాన్ లో అర టీస్పూన్ ఆయిల్ హీట్ చేసి, అందులో మూడు టేబుల్ స్పూన్ల శనగపప్పు వేసి ఓ నిమిషం పాటు వేయించుకోండి.",
    "[00:49] ఆ తర్వాత రెండు టీస్పూన్ల మినప్పప్పు, ఓ టేబుల్ స్పూన్ ధనియాలు, పది ఎండుమిర్చి వేసి కేవలం లో ఫ్లేమ్ మీద మాత్రమే వేపుకోండి.",
    "[00:57] అప్పుడే గింజ లోపలి వరకు వేగుతుంది, మంచి సువాసన వస్తుంది పొడికి. త్వరత్వరగా వేపిస్తే కూరకంత రుచి రాదు.",
    "[01:03] ఇప్పుడు వీటిని చల్లార్చి పొడి చేసుకోండి.",
    "[01:06] ఇప్పుడు రెండు టీస్పూన్ల ఆయిల్ హీట్ చేసి, అందులో రెండు పెద్ద ఉల్లిపాయల తరుగు వేసి ఉల్లిపాయలు పచ్చి వాసన పోయేంత వరకు ఫ్రై చేసుకోండి చాలు.",
    "[01:15] ఉల్లిపాయలు పచ్చి వాసన పోయాక అప్పుడు మూడు టొమాటోస్ తరుగు వేసి మెత్తగా గుజ్జుగా అయ్యి మగ్గేంత వరకు మూత పెట్టి మగ్గించుకోండి.",
    "[01:26] టొమాటోస్ మగ్గాక దింపి చల్లార్చుకోండి.",
    "[01:31] ఇప్పుడు ఉల్లిపాయ మిక్చర్ మిక్సీ జార్ లో వేసుకోండి. తర్వాత ఓ టేబుల్ స్పూన్ బెల్లం తరుగు, నిమ్మకాయంత సైజ్ నానబెట్టినటువంటి చింతపండు నీళ్ళతో సహా వేసి పేస్ట్ చేసుకోండి.",
    "[01:42] ఇప్పుడు సొరకాయల్లోని నీరు పిండి ముక్కలు పక్కన ఉంచుకోండి. ఈ స్టెప్ ఆప్షనల్.",
    "[01:46] కానీ వెనుకటికి ఇలాగే నీరు పిండి చేసేవారు. వెనుకటి వంటకం కదండీ, వాళ్ళు ఏమనేవారంటే ఇది ముద్దకూర కదా నీరు వదులుతూ ఉంటుంది, కాబట్టి నీరు పిండాలి అనేవారు.",
    "[01:55] ఇప్పుడు మూడు టేబుల్ స్పూన్ల ఆయిల్ హీట్ చేసి, అందులో ఓ టీస్పూన్ ఆవాలు, ఓ టీస్పూన్ జీలకర్ర, అర టీస్పూన్ పసుపు, ఓ రెబ్బ కరివేపాకు వేసి తాలింపు వేయండి.",
    "[02:07] తాలింపు వేగాక సొరకాయ ముక్కలు వేసి బాగా మగ్గనివ్వండి. దీనికి కొంచెం టైం పడుతుంది.",
    "[02:15] సొరకాయ ముక్క మగ్గాక అప్పుడు రుచికి సరిపడా సాల్ట్ వేసి, సిద్ధంగా ఉంచుకున్నటువంటి పొడి, ఉల్లిపాయ చింతపండు గుజ్జు వేసి బాగా కలుపుకోండి.",
    "[02:28] ఇప్పుడు ఓ టీస్పూన్ కారం, ఓ కప్పు నీళ్లు పోసి కలుపుకోండి.",
    "[02:33] నీళ్ళన్నది మీకు నచ్చిన కన్సిస్టెన్సీకి అడ్జస్ట్ చేసుకోండి. మనం వేసిన పొడి కారణంగా కూర దగ్గర పడిపోతూ ఉంటుంది చల్లారే కొద్ది.",
    "[02:40] అందుకని కాసిని నీళ్లు ఎక్కువగానే పోసుకుంటే చల్లారే పాటికి అన్నంలోకి కలుపుకుని తినేలా ఉంటుంది.",
    "[02:45] నీళ్లు తక్కువ పోస్తే గనక మరీ చట్నీలా గట్టిగా ఉంటుందని గుర్తుంచుకోండి.",
    "[02:49] దింపే ముందు ఓ టేబుల్ స్పూన్ కొత్తిమీర తరుగు చల్లుకుని దింపుకోండి.",
    "[02:52] అంతే! అన్నంలోకి యమ్మీ యమ్మీగా స్పైసీగా ఉండేటువంటి సొరకాయ ఉల్లి కారం రెడీ.",
    "[02:57] నేను మీకు త్వరలో బోల్డని ఉల్లి కారాలు చెప్పబోతున్నాను, అవన్నీ కూడా చాలా చాలా బాగుంటాయి.",
    "[03:02] మీకు నచ్చిందా? మరైతే మీరు ట్రై చేసి మీకు ఎలా కుదిరిందో కచ్చితంగా ఆ పిక్ ని విస్మై ఫుడ్ ఇన్స్టాగ్రామ్ లో పోస్ట్ చేయండి. బై ది వే విస్మై ఫుడ్ డాట్ కామ్ వెబ్సైట్ విజిట్ చేయడం అస్సలు మర్చిపోకండి."
  ],
  "transcription_english": [
    "[00:00] Hello Foodies, Welcome to Vismai Food. Today's special is Spicy Sorakaya Ulli Karam (Spicy Bottle Gourd Curry).",
    "[00:05] An authentic Telugu dish. Eating this with hot rice and ghee, you will definitely eat four more mouthfuls for that meal.",
    "[00:13] This is perfect for daily curries. There is already Vankaya Ulli Karam on the channel. Soon I will show Kakarakaya Ulli Karam. For now, watch this Sorakaya Ulli Karam.",
    "[00:23] Anyone who loves spice will love this curry, it's that good. Let's start.",
    "[00:28] First, take four cups of peeled and cubed tender bottle gourd.",
    "[00:33] Add a little salt and half a teaspoon of turmeric to it, mix and keep aside.",
    "[00:41] Now heat half a teaspoon of oil in a pan, add three tablespoons of chana dal and fry for a minute.",
    "[00:49] Then add two teaspoons of urad dal, a tablespoon of coriander seeds, ten dry red chilies and fry only on low flame.",
    "[00:57] Only then the seeds will roast inside out and the powder will smell good. If fried quickly, the curry won't taste as good.",
    "[01:03] Now let them cool and grind into powder.",
    "[01:06] Now heat two teaspoons of oil, add two large chopped onions and fry until the raw smell of onions goes away, that's enough.",
    "[01:15] Once the raw smell of onions is gone, add three chopped tomatoes, cover and cook until they become soft and mushy.",
    "[01:26] Once tomatoes are cooked, remove and let cool.",
    "[01:31] Now add the onion mixture to a mixer jar. Then add a tablespoon of grated jaggery, lemon-sized soaked tamarind along with water and make a paste.",
    "[01:42] Now squeeze the water from the bottle gourd pieces and keep aside. This step is optional.",
    "[01:46] But in olden days, they used to squeeze the water. It's an old recipe, right? They used to say since it's a thick curry, it releases water, so water should be squeezed.",
    "[01:55] Now heat three tablespoons of oil, add a teaspoon of mustard seeds, a teaspoon of cumin seeds, half a teaspoon of turmeric, a sprig of curry leaves and temper.",
    "[02:07] Once tempered, add bottle gourd pieces and let them cook well. This takes some time.",
    "[02:15] Once the bottle gourd piece is cooked, add salt to taste, the prepared powder, onion tamarind paste and mix well.",
    "[02:28] Now add a teaspoon of chili powder and a cup of water and mix.",
    "[02:33] Adjust water to your desired consistency. Due to the powder we added, the curry will thicken as it cools.",
    "[02:40] So if you add a little more water, it will be suitable to mix with rice by the time it cools.",
    "[02:45] Remember, if you add less water, it will be hard like chutney.",
    "[02:49] Before taking off, sprinkle a tablespoon of chopped coriander and remove.",
    "[02:52] That's it! Yummy yummy spicy Sorakaya Ulli Karam for rice is ready.",
    "[02:57] I am going to show you many Ulli Karam recipes soon, all of them are very very good.",
    "[03:02] Did you like it? Then try it and definitely post that pic on Vismai Food Instagram. By the way, don't forget to visit vismaifood.com website."
  ]
}