{
  "metadata": {
    "title": "Guntur Vankaya Bajji | Stuffed Brinjal Bajji | గుంటూరు వంకాయ బజ్జి | Street Style Brinjal Bajji",
    "channel_name": "Vismai Food",
    "publish_date": "2019-08-15",
    "view_count": 514000,
    "like_count": 6500,
    "duration": "02:15",
    "language": "Telugu",
    "video_id": "Not Available",
    "url": "https://www.youtube.com/channel/UC... (Video specific URL not found)",
    "description": "Learn how to make the famous Guntur Vankaya Bajji (Stuffed Brinjal Bajji) at home. This street-style recipe from Guntur is known for its unique stuffing and taste. Vismai Food shares perfect tips to get that authentic commercial taste at home.",
    "ingredients_detected": [
      "Onion",
      "Green Chillies",
      "Cumin Seeds",
      "Tamarind",
      "Salt",
      "Turmeric",
      "Coriander Leaves",
      "Tender Brinjals",
      "Hot Water",
      "Besan (Gram Flour)",
      "Rice Flour",
      "Oil"
    ]
  },
  "transcription": [
    "[00:00] Hello Foodies, Welcome to Vismai Food. ఇవాల్టి స్పెషల్ గుంటూరు వంకాయ బజ్జి.",
    "[00:02] వంకాయ బజ్జీలు అందరూ చేస్తారు, అన్ని ప్రాంతాల్లోనూ దొరుకుతాయి. కానీ గుంటూరు RTO ఆఫీస్ దగ్గర దొరికేటువంటి వంకాయల బజ్జి రుచే వేరబ్బా.",
    "[00:14] ఈ వంకాయ బజ్జినే వాళ్ళు కమర్షియల్ గా చేస్తారు కాబట్టి వాళ్ళు వాళ్ళ స్టైల్ లో చేసారు. కానీ నేను మీకు పర్ఫెక్ట్ టిప్స్ తో చెప్పబోతున్నాను. లెట్స్ స్టార్ట్.",
    "[00:21] ముందుగా జార్ లో ఓ పెద్ద ఉల్లిపాయ తరుగు, ఆరు పచ్చిమిర్చి, ఓ టీస్పూన్ జీలకర్ర, ఓ టీస్పూన్ చింతపండు, కొద్దిగా సాల్ట్, పావు చెంచా పసుపు, పిడికెడు కొత్తిమీర తరుగు వేసి నీళ్లు లేకుండా ఫైన్ పేస్ట్ చేసుకోండి.",
    "[00:35] పేస్ట్ ఎంత గట్టిగా ఉంటే స్టఫింగ్ చేస్తే అంత బాగా కుదురుగా ఉంటుంది వంకాయలో.",
    "[00:40] ఇప్పుడు లేలేత వంకాయలని మాత్రమే చీరి వేడి వేడి నీళ్ళలో వేసి 30 నిమిషాలు వదిలేయండి. ఈ స్టెప్ చాలా ఇంపార్టెంట్.",
    "[00:47] మీకు లేలేత వంకాయలు గాని దొరకనట్లయితే గనక వంకాయల్ని చీరి రెండు మూడు నిమిషాల పాటు నూనెలో డీప్ ఫ్రై చేసి తీసి అప్పుడు ఆనియన్ పేస్ట్ స్టఫ్ చేసుకోవాలని గుర్తుంచుకోండి. ఏదో ఒకటి చేయాలి వేడి నీళ్ళలో అన్నా వేయాలి లేదంటే డీప్ ఫ్రై అన్నా చేయాలి.",
    "[00:53] 30 నిమిషాల తర్వాత వేడి నీళ్ళలో నుంచి తీసి ఆనియన్ పేస్ట్ స్టఫ్ చేసుకోండి.",
    "[00:59] లేత వంకాయలని నూనెలో గాని ఫ్రై చేస్తే మరీ మెత్తగా అయిపోతాయని చెప్పి నేను వేడి నీళ్ళలో వేసాను.",
    "[01:09] ఇప్పుడు ఓ కప్ శనగపిండి, పావు కప్పు బియ్యం పిండి, ఓ టీస్పూన్ జీలకర్ర, సాల్ట్, పావు చెంచా పసుపు, నీళ్లు పోసుకుంటూ దోస పిండి అంత థిక్ గా కలుపుకోండి.",
    "[01:21] వంకాయలు సహజంగా గింజ పడినవే దొరుకుతూ ఉంటాయి కాబట్టి డీప్ ఫ్రై చేసుకోవడమే బెస్ట్. నాకు లేలేత వంకాయలు దొరికాయి కాబట్టి నేను ఇలా చేస్తున్నాను.",
    "[01:28] ఇప్పుడు వంకాయలని పిండిలో డిప్ చేసి సలసల మరుగుతున్నటువంటి నూనెలో మాత్రమే వేసి హై ఫ్లేమ్ మీద క్రిస్పీగా వేపుకోవాలి.",
    "[01:38] గుర్తు ఉంది కదా మళ్ళీ చెప్తున్నాను వంకాయలు గాని లేలేతవి దొరికితే వేడి నీళ్ళలో వేసుకోండి. లేనట్లయితే వంకాయలు చీరి రెండు నిమిషాల పాటు నూనెలో డీప్ ఫ్రై చేసుకోండి అప్పుడు ఆనియన్ పేస్ట్ స్టఫ్ చేయండి అప్పుడే పర్ఫెక్ట్ గా వస్తాయి.",
    "[01:47] లేదంటే మీరు ఆనియన్ పేస్ట్ స్టఫ్ చేసి బజ్జీలు వేస్తే గనక వంకాయలు లోపల మగ్గవు పచ్చిగానే ఉండిపోతాయని మాత్రం గుర్తుంచుకోండి.",
    "[01:54] ఇదే ఆనియన్ పేస్ట్ స్టఫ్ చేసి గుత్తి వంకాయలతో కూడా చేసుకోవచ్చు చాలా బాగుంటాయి.",
    "[01:58] ఇవి ప్రత్యేకించి వాతావరణం చల్లగా ఉన్నప్పుడు తింటుంటే ఆ మజానే వేరు.",
    "[02:02] చాలా చాలా రుచిగా ఉంటాయి. ఒకటి కి నాలుగు తింటారు అంత బాగుంటాయి.",
    "[02:07] మీకు నచ్చిందా గుంటూరు వంకాయ బజ్జి? మరైతే మీరు ట్రై చేసి మీకు ఎలా కుదిరిందో కచ్చితంగా ఆ పిక్ ని విస్మై ఫుడ్ ఇన్స్టాగ్రామ్ లో పోస్ట్ చేయండి.",
    "[02:13] బై ది వే విస్మై ఫుడ్ డాట్ కామ్ వెబ్సైట్ విజిట్ చేయడం అస్సలు మర్చిపోకండి."
  ]
}