{
  "metadata": {
    "title": "Pepper Idli Fry|స్పైసి పెప్పర్ ఇడ్లి ఫ్రై| ఇలా ఇడ్లి చేసివ్వండి మీ పిల్లలు అడిగి మరీ తింటారు",
    "channel_name": "Vismai Food",
    "publish_date": "2019-08-15",
    "view_count": 128000,
    "like_count": 2200,
    "duration": "02:18",
    "language": "Telugu",
    "video_id": "Unknown",
    "url": "https://www.youtube.com/watch?v=Unknown",
    "description": "Learn how to make Spicy Pepper Idli Fry, a perfect breakfast or snack recipe for kids. This dish transforms regular or leftover idlis into a crispy, flavorful treat using ghee, pepper, and fresh herbs.",
    "ingredients_detected": [
      "Ghee",
      "Mustard Seeds",
      "Cumin Seeds",
      "Garlic",
      "Ginger",
      "Button Idli",
      "Salt",
      "Pepper Powder",
      "Coriander Leaves",
      "Lemon Juice"
    ]
  },
  "transcription_telugu": [
    "[00:00] హలో ఫుడీస్, వెల్కమ్ టు విస్మై ఫుడ్. ఇవాల్టి స్పెషల్ పెప్పర్ రోస్ట్ ఇడ్లీ.",
    "[00:06] రోజు తినే ఇడ్లీనే, కానీ ఇలాంటి ట్విస్ట్ ఇచ్చి చూడండి. ఇడ్లీనా అనేవారు కూడా హేయ్ ఇడ్లీ అనేస్తారు అంత బాగుంటాయి ఇవి.",
    "[00:13] దీనికి ఏ చట్నీలు అవసరమే లేదు. 99 దోశలు 100 ఇడ్లీలు అని వచ్చాయి కదా, అలాంటి కాన్సెప్టే ఇది కూడాను.",
    "[00:20] చాలా చాలా బాగుంటుంది తప్పక ట్రై చేయండి.",
    "[00:51] ముందుగా పాన్ లో రెండు టేబుల్ స్పూన్ల నెయ్యి కరిగించుకోండి.",
    "[00:55] ఇందులో అర టీస్పూన్ ఆవాలు, అర టీస్పూన్ జీలకర్ర వేసి ఆవాలు చిటపటమనిపించండి.",
    "[01:02] ఆ తర్వాత మూడు వెల్లుల్లి తరుగు, అర చెంచా అల్లం తరుగు వేసి వెల్లుల్లిని బాగా వేగనివ్వండి.",
    "[01:11] ఇప్పుడు 20 బటన్ ఇడ్లీ వేసి మూడు నుంచి నాలుగు నిమిషాల పాటు బాగా టాస్ చేసుకోండి.",
    "[01:21] ఇప్పుడు ఇందులో కొద్దిగా సాల్ట్, అర చెంచా అప్పటికప్పుడే దంచినటువంటి మిరియాల పొడి వేసి బాగా కలిపి ఇడ్లీలని క్రిస్పీగా అయ్యేంత వరకు రోస్ట్ చేసుకోండి.",
    "[01:36] దింపే ముందు కొత్తిమీర తరుగు చల్లుకొని 30 సెకండ్లు ఉంచేయండి.",
    "[01:41] ఆ తర్వాత స్టవ్ ఆఫ్ చేసి, అప్పుడు ఓ టీస్పూన్ నిమ్మరసం వేసి బాగా టాస్ చేసుకొని దింపేసుకోండి.",
    "[01:46] అంతే! యమ్మీ క్రిస్పీ పెప్పర్ ఘీ ఇడ్లీ రెడీ.",
    "[01:50] పిల్లలకి ఇది ఇచ్చి చూడండి పేచీలే ఉండవు.",
    "[01:57] నచ్చిందా? మరైతే మీరు ట్రై చేసి మీకు ఎలా కుదిరిందో కచ్చితంగా ఆ పిక్ ని విస్మై ఫుడ్ ఇన్స్టాగ్రామ్ లో పోస్ట్ చేయండి."
  ],
  "transcription_english": [
    "[00:00] Hello Foodies, Welcome to Vismai Food. Today's special is Pepper Roast Idli.",
    "[00:06] It's the regular idli we eat daily, but try giving it a twist like this. Even those who say 'Idli?' will say 'Hey Idli!', they are that good.",
    "[00:13] You don't need any chutneys for this. Just like the 99 dosas and 100 idlis concepts, this is also a similar concept.",
    "[00:20] It tastes very very good, definitely try it.",
    "[00:51] First, melt two tablespoons of ghee in a pan.",
    "[00:55] Add half a teaspoon of mustard seeds and half a teaspoon of cumin seeds, and let the mustard seeds splutter.",
    "[01:02] After that, add three chopped garlic cloves and half a spoon of chopped ginger, and let the garlic fry well.",
    "[01:11] Now add 20 button idlis and toss them well for three to four minutes.",
    "[01:21] Now add a little salt and half a spoon of freshly crushed pepper powder, mix well, and roast until the idlis become crispy.",
    "[01:36] Before taking it off the stove, sprinkle chopped coriander and keep it for 30 seconds.",
    "[01:41] After that, switch off the stove, then add a teaspoon of lemon juice, toss well, and take it off.",
    "[01:46] That's it! Yummy crispy Pepper Ghee Idli is ready.",
    "[01:50] Try giving this to kids, there won't be any fuss.",
    "[01:57] Did you like it? Then do try it and definitely post that picture on Vismai Food Instagram sharing how it turned out for you."
  ]
}