{
  "metadata": {
    "title": "Hyderabadi Paneer Dum Biryani | హైదరాబాది పనీర్ ధం బిర్యానీ | The Best HYDERABADI PANEER DUM BIRYANI",
    "channel_name": "Vismai Food",
    "publish_date": "2018-11-09",
    "view_count": 4040761,
    "like_count": 42508,
    "duration": "03:25",
    "language": "Telugu",
    "video_id": "e7I0qDKA2Ak",
    "url": "https://www.youtube.com/watch?v=e7I0qDKA2Ak",
    "description": "Authentic Hyderabadi Paneer Dum Biryani recipe from Vismai Food.",
    "ingredients_detected": [
      "300gms Paneer Cubes",
      "2 tbsps Chopped Coriander",
      "2 tbsps Chopped Mint",
      "1/2 Cup Fried Onion",
      "4 Cloves",
      "4 Cardamom",
      "1 Inch Cinnamon",
      "1 tsp Shah Jeera",
      "1 Bay Leaf",
      "1 tbsp Ghee",
      "2 tbsps Oil",
      "1 tsp Garam Masala",
      "Salt (to taste)",
      "1 tsp Coriander Powder",
      "1 tsp Roasted Cumin Powder",
      "1 tbsp Red Chilli Powder",
      "1 Lemon Juice",
      "250gms Curd",
      "2.5 Liters Water",
      "1 tbsp Ginger Garlic Paste",
      "1 Cup (110gms) Basmati Rice (Soaked for 1 hour)",
      "1 tbsp Saffron Milk",
      "1 tsp Rose Water (optional)"
    ]
  },
  "transcription_telugu": [
    "[00:00:00.000] హలో ఫుడీస్, వెల్కమ్ టు విస్మయ్ ఫుడ్. ఇవాల్టి స్పెషల్ ద బెస్ట్ హైదరాబాది పనీర్ ధం బిర్యానీ.",
    "[00:00:10.000] సరిగ్గా వండాలే కానీ ఈ బిర్యానీ ముందు నాన్-వెజ్ బిర్యానీ కూడా పనికిరాదు. ఏ అకేషన్ కైనా ఇది పర్ఫెక్ట్.",
    "[00:00:23.000] ఒక మందపాటి గిన్నెలో 300 గ్రాముల పనీర్ ముక్కలు, కొత్తిమీర, పుదీనా, అర కప్పు వేయించిన ఉల్లిపాయలు వేయండి.",
    "[00:00:35.000] లవంగాలు, యాలకులు, దాల్చిన చెక్క, షాజీరా, బిర్యానీ ఆకు, నెయ్యి, నూనె వేసి కలపండి.",
    "[00:00:50.000] గరం మసాలా, ఉప్పు, ధనియాల పొడి, జీలకర్ర పొడి, కారం, నిమ్మరసం వేసి మసాలాలన్నీ పనీర్ కు పట్టించండి.",
    "[00:01:06.000] ఇందులో 250 గ్రాముల పెరుగు వేసి కలిపి గంట సేపు ఫ్రిజ్ లో ఉంచితే పనీర్ కు మసాలా బాగా పడుతుంది.",
    "[00:01:18.000] 2.5 లీటర్ల మరిగే నీళ్లలో అల్లం వెల్లుల్లి పేస్ట్, ఉప్పు, లవంగాలు, చెక్క, యాలకులు, షాజీరా, బిర్యానీ ఆకు, అనస పువ్వు వేయండి.",
    "[00:01:38.000] రెండు టేబుల్ స్పూన్ల ఎండు గులాబీ రేకులు, నానబెట్టిన బాస్మతి బియ్యం వేసి ఉడికించండి. అన్నం తెల్లగా ఉండటానికి నిమ్మరసం వేయండి.",
    "[00:02:05.000] అన్నం 60% ఉడికాక ఒక లేయర్ వేసి, 70% ఉడికాక మరో లేయర్, 80% ఉడికాక చివరి లేయర్ గా పనీర్ మిశ్రమంపై వేయండి.",
    "[00:02:29.000] అన్నం పైన గరం మసాలా, వేయించిన ఉల్లిపాయలు, నెయ్యి, కుంకుమపువ్వు పాలు చల్లండి.",
    "[00:02:52.000] టిష్యూ పేపర్లతో మూసి ఎనిమిది నిమిషాలు మీడియం ఫ్లేమ్ లో, నాలుగు నిమిషాలు లో ఫ్లేమ్ లో ధం చేయండి.",
    "[00:03:02.000] 15 నిమిషాల తర్వాత సర్వ్ చేసుకోండి. దీనికి మిర్చి కా సాలన్ పర్ఫెక్ట్ కాంబినేషన్."
  ],
  "transcription_english": [
    "[00:00:00.000] Hello Foodies, welcome to Vismai Food. Today's special is the best Hyderabadi Paneer Dum Biryani.",
    "[00:00:10.000] If cooked correctly, this biryani beats even non-veg biryani. Perfect for any special occasion.",
    "[00:00:23.000] In a heavy-bottomed pan, add 300gms paneer cubes, coriander, mint, and half a cup of fried onions.",
    "[00:00:35.000] Add cloves, cardamom, cinnamon, shah jeera, bay leaf, ghee, and oil.",
    "[00:00:50.000] Add garam masala, salt, coriander powder, cumin powder, red chilli powder, and lemon juice; coat the paneer well.",
    "[00:01:06.000] Add 250gms curd, mix well, and refrigerate for one hour to marinate the paneer.",
    "[00:01:18.000] In 2.5 liters of boiling water, add ginger-garlic paste, salt, cloves, cinnamon, cardamom, shah jeera, and star anise.",
    "[00:01:38.000] Add 2 tbsps dry rose petals and soaked Basmati rice. Use lemon juice to keep the rice white.",
    "[00:02:05.000] Layer the rice over the paneer: first layer at 60% cooked, second at 70%, and the final layer at 80% cooked.",
    "[00:02:29.000] Garnish with garam masala, fried onions, ghee, and saffron milk on top of the rice.",
    "[00:02:52.000] Cover with tissue papers and cook on 'dum': 8 mins on medium flame and 4 mins on low flame.",
    "[00:03:02.000] Let it rest for 15 mins before serving. Mirchi ka Salan is the perfect combination for this."
  ]
}