{
  "metadata": {
    "title": "ATUKULA PAYASAM|అటుకుల బెల్లం పాయసం|Poha kheer Recipe|Atukula payasam recipe in telugu|Vismaifood",
    "channel_name": "Vismai Food",
    "publish_date": "2019-08-16",
    "view_count": 875000,
    "like_count": 14000,
    "duration": "02:30",
    "language": "Telugu",
    "video_id": "a5r8u0M9d14",
    "url": "https://www.youtube.com/watch?v=a5r8u0M9d14",
    "description": "Atukula Payasam with jaggery is a healthy and quick sweet recipe, also known as Aval Payasam or Poha Kheer. This traditional dessert is made using flattened rice (Poha) and moong dal, sweetened with jaggery. It's a perfect prasadam for festivals and a delicious sweet treat for any occasion. The combination of poha and moong dal gives it a unique texture and flavor.",
    "ingredients_detected": [
      "Moong Dal",
      "Water",
      "Ghee",
      "Cashews",
      "Raisins",
      "Flattened Rice (Poha)",
      "Full Fat Milk",
      "Jaggery",
      "Green Cardamom",
      "Nutmeg Powder"
    ]
  },
  "transcription_telugu": [
    "[00:00] హలో ఫుడీస్, వెల్కమ్ టు విస్మై ఫుడ్. ఈ రోజు స్పెషల్ ఫెస్టివల్ స్పెషల్ రెసిపీ అటుకుల పెసరపప్పు పాయసం.",
    "[00:06] ఎప్పుడూ రెగ్యులర్ గా చేసుకునే పాయసానికి బదులుగా ఈ పాయసం ఒకసారి చేసి చూడండి.",
    "[00:10] చాలా డిఫరెంట్ గా ఉంటుంది, చాలా టేస్టీగా ఉంటుంది, చాలా సింపుల్ కూడా.",
    "[00:14] ఎప్పుడైనా పండగకి గాని, ఏదైనా స్పెషల్ అకేషన్ కి కానీ ఈ సారి ఈ పాయసం తయారు చేసి చూడండి చాలా ఎంజాయ్ చేస్తారు. ఇంకెందుకు ఆలస్యం? లెట్స్ స్టార్ట్.",
    "[00:20] ముందుగా బాగా కడిగినటువంటి అర కప్పు అంటే 60 గ్రాముల పెసరపప్పు వేసి తగినన్ని నీళ్ళు పోసి, రెండు విజిల్స్ రాగానే దింపేసుకోండి.",
    "[00:29] మరీ మెత్తగా కాకుండా కాస్త పలుకుగా ఉంటే తినేటప్పుడు చాలా బాగుంటుంది.",
    "[00:33] ఇప్పుడు కడాయిలో మూడు టేబుల్ స్పూన్ల నెయ్యి కరిగించి, అందులో మూడు టేబుల్ స్పూన్ల జీడిపప్పు వేసి 70% వేయించుకోండి లో ఫ్లేమ్ లో.",
    "[00:41] 70% వేగాక మూడు టేబుల్ స్పూన్ల ఎండు ద్రాక్ష వేసి గోల్డెన్ బ్రౌన్ కలర్ లోకి రాగానే ఫ్లేమ్ ని సిమ్ లో పెట్టేసి ఓ బౌల్ లోకి తీసేసుకోండి.",
    "[00:54] ఇప్పుడు అదే ఘీలో అర కప్పు లావు అటుకులు వేసి లో ఫ్లేమ్ లో లైట్ గోల్డెన్ బ్రౌన్ కలర్ వచ్చేదాకా వేపుకోండి.",
    "[01:03] అటుకులు గోల్డెన్ బ్రౌన్ కలర్ లోకి రాగానే కాస్త పలుకుగా ఉడికించుకున్నటువంటి పెసరపప్పు వేసి లో ఫ్లేమ్ లో బాగా కలుపుకోండి ఒక రెండు నిమిషాల పాటు.",
    "[01:13] ఆ తర్వాత అర లీటర్ పాలు పోసుకొని ఉండలు లేకుండా బాగా కలుపుకోండి.",
    "[01:26] పాలు పొంగు వచ్చేంత వరకు మీడియం ఫ్లేమ్ లో కుక్ చేసుకోండి.",
    "[01:30] ఓ సారి పొంగు రాగానే స్టవ్ సిమ్ లో పెట్టి కప్పు బెల్లం తురుము వేసి సిమ్ లోనే మూడు నాలుగు నిమిషాల పాటు ఉడికించుకోండి.",
    "[01:46] బెల్లం కరిగి పాలు కాస్త దగ్గరపడ్డాక నాలుగు దంచిన యాలకులు, రెండు చిటికెళ్ళ జాజికాయ పొడి వేయండి.",
    "[01:54] ఇది వేస్తే పాయసం చాలా అరోమాటిక్ గా ఉంటుంది ఇది అస్సలు మిస్ కాకండి.",
    "[01:58] ఇప్పుడు ఫ్రైడ్ కాజు, కిస్మిస్ వేసి దింపేసుకోండి.",
    "[02:02] దింపేసుకున్నాక వెంటనే సర్వ్ చేసుకోడమే కాకుండా ఓ పదిహేను ఇరవై నిమిషాల తర్వాత సర్వ్ చేసుకోండి.",
    "[02:07] పాలు మరీ చిక్కబడేంత వరకు ఉడికించుకోకండి. చల్లారాక బాగా గట్టిపడిపోతుంది.",
    "[02:11] చాలా సింపుల్ కదా? మీరు ట్రై చేసి మీకు ఎలా నచ్చిందో కామెంట్ చేసి చెప్తారా?",
    "[02:16] మా ఇన్స్టాగ్రామ్ లో మీరు తయారు చేసిన పిక్ ని కూడా పోస్ట్ చేయండి."
  ],
  "transcription_english": [
    "[00:00] Hello Foodies, Welcome to Vismai Food. Today's special festival special recipe is Atukula Pesarapappu Payasam (Poha Moong Dal Kheer).",
    "[00:06] Instead of the regular payasam you always make, try this payasam once.",
    "[00:10] It tastes very different, very tasty, and is also very simple.",
    "[00:14] Try making this payasam for any festival or special occasion this time, you will enjoy it a lot. Why delay? Let's start.",
    "[00:20] First, add half a cup, i.e., 60 grams of washed moong dal, add sufficient water, and cook until two whistles.",
    "[00:29] If it's not too mushy and slightly grainy, it tastes very good while eating.",
    "[00:33] Now melt three tablespoons of ghee in a kadai, add three tablespoons of cashew nuts and fry up to 70% on low flame.",
    "[00:41] Once fried to 70%, add three tablespoons of raisins, and once they turn golden brown, turn the flame to sim and remove into a bowl.",
    "[00:54] Now in the same ghee, add half a cup of thick poha and roast on low flame until it turns light golden brown.",
    "[01:03] Once the poha turns golden brown, add the semi-cooked moong dal and mix well on low flame for two minutes.",
    "[01:13] Then add half a liter of milk and mix well without lumps.",
    "[01:26] Cook on medium flame until the milk comes to a boil.",
    "[01:30] Once it boils, turn the stove to sim, add a cup of grated jaggery, and cook on sim for three to four minutes.",
    "[01:46] After the jaggery melts and the milk thickens slightly, add four crushed cardamoms and two pinches of nutmeg powder.",
    "[01:54] Adding this makes the payasam very aromatic, don't miss this at all.",
    "[01:58] Now add the fried cashews and raisins and remove from heat.",
    "[02:02] Instead of serving immediately after removing, serve after fifteen to twenty minutes.",
    "[02:07] Don't cook until the milk becomes too thick. It will harden a lot after cooling.",
    "[02:11] Very simple, right? Will you try it and tell me in the comments how you liked it?",
    "[02:16] Also post the pic of what you made on our Instagram."
  ]
}