{
  "metadata": {
    "title": "Minapappu Pachadi | Urad Dal Chutney Recipe In Telugu | How To Make Minapappu Pachadi | Vismai Food",
    "channel_name": "Vismai Food",
    "publish_date": "2019-08-24",
    "view_count": 250000,
    "like_count": 3400,
    "duration": "01:58",
    "language": "Telugu",
    "video_id": "F_S6y0q_q9k",
    "url": "https://www.youtube.com/watch?v=F_S6y0q_q9k",
    "description": "How to make Minapappu Pachadi at Home. Minapappu Pachadi is a classic Andhra style chutney recipe made with urad dal, spices and tamarind. It goes very well with rice, idli, dosa and vada. In this video I showed how to make perfect minapappu pachadi in Telugu.",
    "ingredients_detected": [
      "Oil",
      "Husked Urad Dal (Minapappu)",
      "Cumin Seeds (Jeelakarra)",
      "Dry Chillies",
      "Fenugreek Seeds (Menthulu)",
      "Tamarind",
      "Jaggery",
      "Salt",
      "Garlic Pods",
      "Mustard Seeds",
      "Curry Leaves"
    ]
  },
  "transcription": {
    "transcription_telugu": [
      "[00:00] హే ఫుడీస్, వెల్కమ్ టు విస్మయ్ ఫుడ్",
      "[00:02] ఇవాల్టి స్పెషల్ మినప్పప్పు పచ్చడి. వడలు, గారెలు, అన్నం, అట్టు, ఇడ్లి ఎందులోకైనా సరే భలేగా రుచిగా ఉంటుంది గుమగుమలాడిపోతూ",
      "[00:10] ఈ పచ్చడి నేను గుంటూరు జిల్లా నుండి నెల్లూరు జిల్లా వరకు చేయడం చూసాను. కానీ నెల్లూరు జిల్లా వారి స్టైలే వేరు అది మరోసారి చూపిస్తాను",
      "[00:18] మీరు ఈ పచ్చడి ఒక్కసారి చేసి ఫ్రిడ్జ్ లో పెట్టుకున్నారంటే కనీసం వారం పైన నిల్వ ఉంటుంది. ఎంతో ఎంతో బాగుంటుంది తప్పక చేయమని రికమండ్ చేస్తాను ఈ పచ్చడి నేను",
      "[00:26] లెట్స్ స్టార్ట్. ముందుగా పాన్ లో ఒక టీ స్పూన్ ఆయిల్ హీట్ చేసి అందులో అర కప్పు పొట్టు మినుములు వేసి కేవలం లో ఫ్లేమ్ మీద మాత్రమే మంచి సువాసన రావాలి",
      "[00:36] అందాక వేపుకోవాలి. ఇది సరిగ్గా వేగడానికి కనీసం పదిహేను నిమిషాల టైం పడుతుంది. ఓపికగా వేపుకోవాలి రుచంతా ఇలా వేపడంలోనే ఉంది",
      "[00:44] ఇవి వేపిన తరవాత తీసి చల్లార్చుకుని మిక్సీ జార్ లో వేసుకుని ఉంచుకోండి",
      "[00:48] ఇప్పుడు అదే పాన్ లో ఓ టీ స్పూన్ ఆయిల్ హీట్ చేసి అందులో ఓ టీ స్పూన్ జీలకర్ర, ఎనిమిది నుంచి పది ఎండుమిర్చి వేసి రెండు నిమిషాల పాటు వేపుకొని తీసి పక్కన ఉంచుకోండి",
      "[00:57] ఇప్పుడు అర టీ స్పూన్ మెంతులు కూడా వేసి మెంతులు మంచి సువాసన వచ్చేంత వరకు రోస్ట్ చేసుకోవాలి",
      "[01:03] మెంతులు వేగితే చాలా మంచి రుచి వస్తుంది పచ్చడికి వేగకపోతే చేదుగా మిగిలిపోతుందని గుర్తుంచుకోండి",
      "[01:08] మెంతులు మంచి సువాసన వచ్చాక నిమ్మకాయంత సైజు చింతపండు వేసి జస్ట్ ఓ నిమిషం పాటు వేపుకొని తీసి మిక్సీ జార్ లో వేసుకోండి",
      "[01:16] ఇప్పుడు మిక్సీ జార్ లో ఓ టేబుల్ స్పూన్ బెల్లం, సాల్ట్, ఐదు వెల్లుల్లి వేసి వేడి నీళ్ళతో మెత్తని పేస్ట్ గా చేసుకోండి",
      "[01:25] ఇప్పుడు ఓ టేబుల్ స్పూన్ నూనె వేడి చేసి అందులో ఓ టీ స్పూన్ ఆవాలు వేసి చిటపటమనిపించండి",
      "[01:30] ఆ తరవాత ఓ రెబ్బ కరివేపాకు వేసి వేపుకొని పచ్చడిలో కలిపేసుకోండి",
      "[01:34] అంతే గుమగుమలాడిపోయేటువంటి రుచికరమైనటువంటి మినప్పప్పు చట్నీ రెడీ. ఇది మీరు ఫ్రిడ్జ్ లో పెట్టుకుంటే కనీసం వారం పైన నిల్వ ఉంటుంది",
      "[01:42] కానీ కాస్త ఎక్కువ నూనెతో తాలింపు వేసుకోవాలని గుర్తుంచుకోండి చాలు పర్ఫెక్ట్ గా వస్తుంది",
      "[01:47] చాలా ఎంజాయ్ చేస్తారు ఈ పచ్చడిని. నేను నెల్లూరు స్టైల్ మరోసారి చూపిస్తాను. నచ్చిందా? మరైతే మీరు ట్రై చేసి మీకు ఎలా కుదిరిందో ఖచ్చితంగా ఆ పిక్ ని విస్మయ్ ఫుడ్ ఇన్స్టాగ్రామ్ లో పోస్ట్ చేయండి",
      "[01:56] బై ది వే vismaifood.com వెబ్సైట్ విజిట్ చేయడం అస్సలు మర్చిపోకండి"
    ],
    "transcription_english": [
      "[00:00] Hey Foodies, welcome to Vismai Food!",
      "[00:02] Today's special: Minapappu Pachadi (Urad Dal Chutney). Vada, Garelu, Rice, Attu (Dosa), Idli... it tastes great with anything, smelling absolutely delicious.",
      "[00:10] I have seen this chutney being made from Guntur district to Nellore district. But the Nellore district style is different, I will show that another time.",
      "[00:18] If you make this chutney once and keep it in the fridge, it stays fresh for at least a week. It is so, so good; I recommend you must make this chutney.",
      "[00:26] Let's Start. First, heat a teaspoon of oil in a pan, add half a cup of husked urad dal (black gram with skin) and roast it ONLY on low flame until a nice aroma comes out.",
      "[00:36] Roast until then. It takes at least 15 minutes to roast correctly. You must roast patiently; the taste lies in this roasting process.",
      "[00:44] After roasting, remove, cool it down, and put it in a mixer jar.",
      "[00:48] Now, heat a teaspoon of oil in the same pan, add a teaspoon of cumin seeds, 8 to 10 dry chilies, roast for two minutes, remove and keep aside.",
      "[00:57] Now add half a teaspoon of fenugreek seeds and roast until they release a nice aroma.",
      "[01:03] If fenugreek seeds roast well, the chutney gets a very good taste; remember, if not roasted, it will remain bitter.",
      "[01:08] Once the fenugreek smells good, add lemon-sized tamarind, roast for just a minute, remove, and add to the mixer jar.",
      "[01:16] Now, in the mixer jar, add a tablespoon of jaggery, salt, and five garlic pods, and grind into a fine paste using hot water.",
      "[01:25] Now heat a tablespoon of oil, add a teaspoon of mustard seeds and let them splutter.",
      "[01:30] After that, add a sprig of curry leaves, roast them, and mix it into the chutney.",
      "[01:34] That's it! The aromatic and tasty Minapappu Chutney is ready. If you keep this in the fridge, it lasts for at least over a week.",
      "[01:42] But remember to temper it with a little extra oil, that's enough, it turns out perfect.",
      "[01:47] You will enjoy this chutney a lot. I will show the Nellore style another time. Did you like it? Then you try it and definitely post the pic of how it turned out for you on Vismai Food Instagram.",
      "[01:56] By the way, don't forget to visit vismaifood.com website."
    ]
  }
}