{
  "metadata": {
    "title": "Dondakaya Menthi Karam Recipe In Telugu | Dondakaya Fry In Telugu | Ivy Gourd Fry | Vismai Food",
    "channel_name": "Vismai Food",
    "publish_date": "2019-09-07",
    "view_count": 1600000,
    "like_count": 35000,
    "duration": "02:15",
    "language": "Telugu",
    "video_id": "kQZ_2v4j3jU",
    "url": "https://www.youtube.com/watch?v=kQZ_2v4j3jU",
    "description": "Dondakaya Menthi Karam is a classic Andhra style ivy gourd fry recipe made with a special spice powder. This Dondakaya Fry is my all time favorite recipe and tastes amazing with hot rice. In this video, I shared the secret spice powder recipe which takes this dondakaya vepudu to next level.",
    "ingredients_detected": [
      "Peanuts (Verusenagapappu)",
      "Sesame Seeds (Nuvvulu)",
      "Chana Dal (Senagapappu)",
      "Urad Dal (Minapappu)",
      "Fenugreek Seeds (Menthulu)",
      "Coriander Seeds (Dhaniyalu)",
      "Cumin Seeds (Jeelakarra)",
      "Dry Red Chillies (Endumirchi)",
      "Tamarind (Chintapandu)",
      "Oil",
      "Ivy Gourd (Dondakaya)",
      "Salt",
      "Turmeric (Pasupu)",
      "Curry Leaves (Karivepaku)"
    ]
  },
  "transcription": {
    "transcription_telugu": [
      "[00:00] హే ఫుడీస్, వెల్కమ్ టు విస్మయ్ ఫుడ్. ఇవాల్టి స్పెషల్ నా ఆల్ టైమ్ ఫేవరెట్ రెసిపీ దొండకాయ మెంతి కారం.",
      "[00:07] మీరు ఒక్కసారి తిన్నారంటే ఈ కర్రీ మీ టాప్ లిస్ట్ లో చేరిపోతుంది అంతే అంత బాగుంటుంది. తృప్తిగా భోజనం చేస్తారు ఇది చేసిన రోజున.",
      "[00:15] అసలు వంట రాని వారు కూడా చాలా ఈజీగా చేసేయొచ్చు అందర్నీ మెప్పించేయొచ్చు అంత బాగుంటుంది.",
      "[00:20] ముందుగా పాన్ లో మూడు టేబుల్ స్పూన్ల వేరుశెనగ పప్పు వేసి లో ఫ్లేమ్ మీదే ఎర్రగా వేపుకోండి. ఈ పప్పులు ఎంత బాగా వేపుకుంటే ఓపికగా అంత రుచిగా ఉంటుంది కూర అని మాత్రం గుర్తుంచుకోండి.",
      "[00:32] ఇప్పుడు రెండు టేబుల్ స్పూన్ల నువ్వులు, రెండు టీ స్పూన్ల శెనగపప్పు, ఓ టేబుల్ స్పూన్ మినప్పప్పు, ఓ టీ స్పూన్ మెంతులు వేసి కేవలం లో ఫ్లేమ్ మీద మాత్రమే వేపుకొని తీరాలి.",
      "[00:42] హై ఫ్లేమ్ మీద వేపితే నువ్వులు త్వరగా వేగిపోతాయి, మెంతులు వేగవు చేదుగా మిగిలిపోతుంది కూరలో అని గుర్తుంచుకోండి.",
      "[00:49] ఇవి సగం పైన వేగాక రెండు టీ స్పూన్ల ధనియాలు, ఓ టీ స్పూన్ జీలకర్ర, ఆరేడు ఎండుమిర్చి వేసి ధనియాల్ని మిరపకాయల్ని ఎర్రగా రోస్ట్ చేసుకోండి.",
      "[00:58] ఈ కూరకి కారం వేయరు మీకు కారమంతా ఎండుమిర్చి నుండే రావాలి. కాబట్టి మీకు తగినట్లుగా మిరపకాయల్ని అడ్జస్ట్ చేసుకోండి.",
      "[01:05] ఇవి బాగా వేగాక దింపి చల్లార్చి పొడి చేసుకోండి. సగం పైన పొడయ్యాక గోలీ సైజు చింతపండు వేసి పొడి చేసుకుని పక్కన ఉంచుకోండి.",
      "[01:12] ఇప్పుడు పాన్ లో పావు కప్పు నూనె వేడి చేసుకోండి. అందులో అర కిలో లేత దొండకాయ చీలికలు వేసుకోండి.",
      "[01:18] ఇందులోనే సాల్ట్, అర టీ స్పూన్ పసుపు వేసి హై ఫ్లేమ్ మీద మూడు నాలుగు నిమిషాల పాటు వేపుకోండి.",
      "[01:23] నాలుగు నిమిషాల తర్వాత చెమ్మ తగ్గుతుంది. అప్పుడు మూత పెట్టి మీడియం ఫ్లేమ్ మీద దొండకాయలు మగ్గి ఫ్రై అయ్యేంత వరకు వేపుకోవాలి. మూత పెట్టాక మధ్య మధ్యలో కలుపుతూ ఉండండి.",
      "[01:35] దొండకాయలు బాగా వేగాక అప్పుడు పల్లీలు నువ్వుల పొడి వేసి బాగా కలిపి మరో మూడు నాలుగు నిమిషాల పాటు మీడియం ఫ్లేమ్ మీద ఫ్రై చేసుకోండి.",
      "[01:43] ఇలా ఫ్రై చేయడం వల్ల ముక్కకి ఈ పొడి బాగా పడుతుంది. ఈ పొడి వేసాక దొండకాయ కూర వేగుతుంటే ఇల్లు ఇల్లంతా గుమగుమలాడిపోతుంది.",
      "[01:50] దింపే ముందు ఓ రెబ్బ కరివేపాకు వేసి దింపుకోండి. ఈ పొడి మేము ముందే తయారు చేసి ఉంచుకొని ఈ కూర చేసుకోవచ్చా అనే డౌట్ మీకు రావచ్చు.",
      "[01:58] ఉంచుకోవచ్చు కానీ ఎప్పటికప్పుడు చేసుకుంటేనే అసలు రుచి అని మాత్రం గుర్తుంచుకోండి.",
      "[02:03] ట్రస్ట్ మీ ఇది మీకు ష్యూర్ గా నచ్చేస్తుంది. మరి నా మాట మీద మీరు నమ్మకం ఉంచి మీరు ట్రై చేసి మీకు ఎలా కుదిరిందో ఖచ్చితంగా ఆ పిక్ ని విస్మయ్ ఫుడ్ ఇన్స్టాగ్రామ్ లో పోస్ట్ చేయండి.",
      "[02:11] బై ది వే vismaifood.com వెబ్సైట్ విజిట్ చేయడం అస్సలు మర్చిపోకండి."
    ],
    "transcription_english": [
      "[00:00] Hey Foodies, welcome to Vismai Food. Today's special is my all-time favorite recipe: Dondakaya Menthi Karam (Ivy Gourd Fenugreek Fry).",
      "[00:07] If you eat this once, this curry will join your top list; it is that good. You will have a satisfying meal the day you make this.",
      "[00:15] Even those who don't know cooking can make this very easily and impress everyone; it is that good.",
      "[00:20] First, add 3 tablespoons of peanuts to a pan and roast them red ONLY on low flame. Remember, the more patiently you roast these lentils, the tastier the curry will be.",
      "[00:32] Now add 2 tablespoons of sesame seeds, 2 teaspoons of chana dal, 1 tablespoon of urad dal, and 1 teaspoon of fenugreek seeds, and roast them ONLY on low flame.",
      "[00:42] Remember, if roasted on high flame, sesame seeds roast quickly, but fenugreek won't roast properly and will remain bitter in the curry.",
      "[00:49] Once they are half roasted, add 2 teaspoons of coriander seeds, 1 teaspoon of cumin seeds, 6-7 dry red chilies, and roast the coriander and chilies until red.",
      "[00:58] Chili powder is not added to this curry; all the spiciness must come from the dry chilies. So, adjust the chilies according to your taste.",
      "[01:05] Once well roasted, remove, cool, and grind into a powder. Once it's more than half powdered, add a marble-sized tamarind piece, grind again, and set aside.",
      "[01:12] Now heat a quarter cup of oil in a pan. Add half a kilo of tender ivy gourd slits.",
      "[01:18] Add salt and half a teaspoon of turmeric to this and fry on high flame for 3-4 minutes.",
      "[01:23] After 4 minutes, the moisture reduces. Then cover and fry on medium flame until the ivy gourds are soft and fried. Keep stirring in between.",
      "[01:35] Once the ivy gourds are well fried, add the peanut-sesame powder, mix well, and fry for another 3-4 minutes on medium flame.",
      "[01:43] Frying this way helps the pieces absorb the powder well. Once this powder is added and the curry is frying, the whole house will be filled with a delicious aroma.",
      "[01:50] Before taking it off the stove, add a sprig of curry leaves. You might doubt if you can make this powder in advance and store it.",
      "[01:58] You can store it, but remember that the real taste comes only when made fresh.",
      "[02:03] Trust me, you will surely love this. Trusting my word, do try it and definitely post the picture of how it turned out for you on Vismai Food Instagram.",
      "[02:11] By the way, don't forget to visit vismaifood.com website."
    ]
  }
}