{
  "metadata": {
    "title": "శ్రీ కృష్ణ జన్మాష్టమి స్పెషల్ ఉడిపి స్టైల్ అటుకుల రవ్వ కేసరి || Atukula Ravva Kesari In Telugu",
    "channel_name": "Vismai Food",
    "publish_date": "2020-08-08",
    "view_count": 654000,
    "like_count": 22000,
    "duration": "01:58",
    "language": "Telugu",
    "video_id": "FjC55aJbVTo",
    "url": "https://www.youtube.com/watch?v=FjC55aJbVTo",
    "description": "Atukula Kesari or Poha Sheera is a very popular Naivedyam recipe in Udupi region. It is very tasty and easy to make. In this video, we are making Udupi style Atukula Ravva Kesari in Telugu.",
    "ingredients_detected": [
      "Thick Poha (Atukulu)",
      "Ghee",
      "Cashews",
      "Raisins",
      "Water",
      "Sugar",
      "Kesar Colour (Saffron Food Color)",
      "Cardamom Powder",
      "Edible Camphor (Pacha Karpooram)"
    ]
  },
  "transcription_telugu": [
    "[00:00] హలో ఫుడీస్, వెల్కమ్ టు విస్మయ్ ఫుడ్. ఇవాల్టి స్పెషల్ ఉడిపి స్టైల్ అటుకుల రవ్వ కేసరి.",
    "[00:05] ఉడిపి ప్రాంతంలో చాలా ఎక్కువగా ఈ రవ్వ కేసరి చేసి కృష్ణుడికి నివేదిస్తూ ఉంటారు.",
    "[00:10] ఇది మామూలు రవ్వ కేసరి కంటే కూడా చాలా బాగుంటుంది.",
    "[00:15] ఇది ఈ కృష్ణాష్టమికే కాదు, వినాయక చవితి లేదా మరింకేదైనా పండగలకు కూడా చేసుకోవచ్చు, చాలా రుచిగా ఉంటుంది.",
    "[00:19] బై ది వే కింద ఉన్నటువంటి సబ్స్క్రయిబ్ బటన్ నొక్కి పక్కనే ఉన్నటువంటి బెల్ ఐకాన్ ప్రెస్ చేయడం మర్చిపోకండి.",
    "[00:24] ముందుగా పాన్ లో ఓ కప్పు మందపాటి అటుకులు వేసి లో ఫ్లేమ్ మీద మాత్రమే అటుకులు క్రిస్పీగా అయ్యేంత వరకు రోస్ట్ చేసుకోండి.",
    "[00:30] దీని కోసం పల్చటి అటుకులు వాడకండి.",
    "[00:33] మందపాటి అటుకులు వాడితేనే రవ్వ రవ్వగా అవుతుంది. పల్చటి అటుకులు వాడితే పొడి అయిపోతుందని గుర్తుంచుకోండి.",
    "[00:38] ఆ తర్వాత మిక్సీ జార్ లో వేసి రవ్వలా చేసుకోండి.",
    "[00:41] ఇప్పుడు మూడు టేబుల్ స్పూన్ల నెయ్యి కరిగించి, అందులో మూడు టేబుల్ స్పూన్ల జీడిపప్పు వేసి ఎర్రగా వేపుకోవాలి.",
    "[00:49] జీడిపప్పు సగం పైన వేగాక, అప్పుడు రెండు టేబుల్ స్పూన్ల ఎండు ద్రాక్ష వేసి ఎర్రగా వేపి తీసి పక్కన ఉంచుకోండి.",
    "[01:00] ఇప్పుడు రెండు కప్పుల నీళ్లు పోసి, నీళ్ళని తెర్ల కాగనివ్వండి.",
    "[01:04] నీళ్లు తెర్లుతున్నప్పుడు అటుకుల రవ్వ వేసి మీడియం ఫ్లేమ్ మీద అటుకుల్ని మెత్తగా కుక్ చేసుకోండి.",
    "[01:16] అటుకులు మెత్తగా కుక్ అవ్వాలి.",
    "[01:18] అటుకులు మెత్తగా కుక్ అయ్యాక అప్పుడు ఓ కప్పు పంచదార వేసి కలుపుకోండి.",
    "[01:21] తీపి ఎక్కువగా వద్దనుకుంటే ముప్పావు కప్పు పంచదారే వేసుకోండి.",
    "[01:27] ఇప్పుడు ఇందులో ఓ చిటికెడు కేసర్ కలర్ వేసి బాగా కలుపుకొని, ఈ రవ్వ కేసరి బాగా దగ్గర పడేంత వరకు మీడియం ఫ్లేమ్ మీద కుక్ చేసుకోండి.",
    "[01:35] కేసరి దగ్గర పడుతున్నప్పుడు అర టీ స్పూన్ యాలకుల పొడి, ఫ్రై చేసి ఉంచుకున్న డ్రై ఫ్రూట్స్ వేసి బాగా కలుపుకోండి.",
    "[01:42] నచ్చితే చిటికెడు పచ్చ కర్పూరం కూడా వేసుకోండి. చాలా రుచిగా ఉంటుంది.",
    "[01:45] అంతే! క్విక్ గా అయిపోయేటటువంటి యమ్మీ స్వీట్ తయార్.",
    "[01:49] మీకు నచ్చిందా? మరి అయితే మీరు ట్రై చేసి మీకు ఎలా కుదిరిందో కచ్చితంగా ఆ పిక్ ని విస్మయ్ ఫుడ్ ఇన్స్టాగ్రామ్ లో పోస్ట్ చేయండి.",
    "[01:54] బై ది వే vismaifood.com వెబ్సైట్ విసిట్ చేయడం అస్సలు మర్చిపోకండి."
  ],
  "transcription_english": [
    "[00:00] Hello Foodies, Welcome to Vismai Food. Today's special is Udupi Style Poha Rava Kesari.",
    "[00:05] In the Udupi region, they make this Rava Kesari very often and offer it to Lord Krishna.",
    "[00:10] This tastes even better than the regular Rava Kesari.",
    "[00:15] You can make this not just for Krishnashtami, but also for Vinayaka Chavithi or any other festival; it is very tasty.",
    "[00:19] By the way, don't forget to press the subscribe button below and the bell icon next to it.",
    "[00:24] First, add a cup of thick poha to a pan and roast on low flame only until the poha becomes crispy.",
    "[00:30] Do not use thin poha for this.",
    "[00:33] Only if you use thick poha will it become like rava. Remember that if you use thin poha, it will turn into powder.",
    "[00:38] After that, put it in a mixer jar and grind it into rava (coarse powder).",
    "[00:41] Now melt three tablespoons of ghee, add three tablespoons of cashews and fry them until golden.",
    "[00:49] After the cashews are more than half fried, add two tablespoons of raisins, fry them until golden, remove and keep aside.",
    "[01:00] Now pour two cups of water and let the water come to a rolling boil.",
    "[01:04] When the water is boiling, add the poha rava and cook on medium flame until the poha becomes soft.",
    "[01:16] The poha must cook until soft.",
    "[01:18] After the poha is cooked soft, add a cup of sugar and mix.",
    "[01:21] If you don't want it too sweet, add only three-quarter cup of sugar.",
    "[01:27] Now add a pinch of kesar color, mix well, and cook on medium flame until this rava kesari thickens well.",
    "[01:35] When the kesari is thickening, add half a teaspoon of cardamom powder, the fried dry fruits, and mix well.",
    "[01:42] If you like, add a pinch of edible camphor too. It tastes very good.",
    "[01:45] That's it! A yummy sweet that can be made quickly is ready.",
    "[01:49] Did you like it? Then you try it and definitely post the pic of how it turned out for you on Vismai Food Instagram.",
    "[01:54] By the way, don't forget to visit the vismaifood.com website."
  ]
}