{
  "metadata": {
    "title": "Instant Crispy ButterMilk Vada| In just 10 mins| మజ్జిగ వడలు|చల్ల గారెలు|10 నిమిషాల్లో క్రిస్పీ గారెలు",
    "channel_name": "Vismai Food",
    "publish_date": "2019-08-22",
    "view_count": 1100000,
    "like_count": 25000,
    "duration": "01:58",
    "language": "Telugu",
    "video_id": "hXbN_XqjWQA",
    "url": "https://www.youtube.com/watch?v=hXbN_XqjWQA",
    "description": "Instant Crispy ButterMilk Vada | In just 10 mins | Quick and Easy Majjiga Garelu Recipe | How to make Wada. These Gaares are called Challa Gaare in Telugu. Challa is Buttermilk. There are many ways to make the Vadas. These are instant and can be made within just 10 minutes with Rice Flakes.",
    "ingredients_detected": [
      "Thick Poha (Atukulu)",
      "Water",
      "Green Chilli",
      "Salt",
      "Ginger",
      "Asafoetida (Hing)",
      "Rice Flour",
      "Coriander Leaves",
      "Sour Curd",
      "Cumin Seeds (Jeelakarra)",
      "Oil"
    ]
  },
  "transcription_telugu": [
    "[00:00] హలో ఫుడీస్, వెల్కమ్ టు విస్మయ్ ఫుడ్. ఇవాల్టి స్పెషల్ ఇన్స్టంట్ చల్ల గారెలు.",
    "[00:05] యస్, ఇవి మామూలు గారెల కంటే చాలా క్రిస్పీగా క్రంచీగా భలే బాగుంటాయి.",
    "[00:11] ఇవి మీరు నైవేద్యంగా కూడా సమర్పించుకోవచ్చు. చాలా క్విక్ గా అయిపోతాయి. ఎంతంటే జస్ట్ ఇన్ 10 మినిట్స్.",
    "[00:17] ఇది నిజంగా నిజం అంత ఫాస్ట్ గా అయిపోతాయి చాలా బాగుంటాయి. లెట్స్ స్టార్ట్.",
    "[00:21] ముందుగా రెండు కప్పుల మందపాటి అటుకులు మాత్రమే తీసుకోండి.",
    "[00:25] ఇందులో మూడు కప్పుల నీళ్లు పోసి ఓ ఐదు నిమిషాల పాటు నాననివ్వండి.",
    "[00:30] ఆ తర్వాత నీళ్ళని గట్టిగా పిండి మిక్సింగ్ బౌల్ లో వేసుకోండి.",
    "[00:38] ఇప్పుడు ఇందులో ఓ పచ్చిమిర్చి సన్నని తరుగు, సాల్ట్, ఓ టీస్పూన్ అల్లం తరుగు, పావు చెంచా ఇంగువ,",
    "[00:46] మూడు టీస్పూన్ల బియ్యం పిండి, రెండు టేబుల్ స్పూన్ల కొత్తిమీర తరుగు వేసి బాగా కలుపుకోండి.",
    "[00:51] అటుకుల్ని గట్టిగా పిండుతూ ఎంత బాగా కలిపితే గారెలు అంత బాగా వస్తాయి విరగకుండా.",
    "[00:57] ఇప్పుడు ఇందులో పుల్లటి పెరుగు కప్ వేసుకోండి.",
    "[01:00] ఇది వేసి పిండిని బాగా కలుపుకోండి.",
    "[01:03] ఈ పిండి మరీ గట్టిగా కలిపితే వడలు గట్టిగా వస్తాయి, జారుగా కలిపితే వడలు విరుగుతాయి, నూనె పీల్చేస్తాయి.",
    "[01:09] కాబట్టి సెమీ థిక్ గా ఉండాలి, అటుకుల్ని బాగా నలుపుతూ కలుపుకోవాలని మాత్రం గుర్తుంచుకోండి.",
    "[01:15] ఇప్పుడు ఇందులో ఓ టీస్పూన్ జీలకర్ర వేసి బాగా కలుపుకొని,",
    "[01:18] చేతుల్ని తడి చేసుకొని వడల మాదిరి ఒత్తుకొని సెంటర్ లో హోల్ చేసి,",
    "[01:23] వేడి వేడి నూనెలో వేసి కేవలం మీడియం ఫ్లేమ్ మీద మాత్రమే ఫ్రై చేసుకోండి.",
    "[01:27] ఇవి వేయగానే గరిట మాత్రం పెట్టకండి. ఓ నిమిషం తర్వాత గరిట పెట్టండి.",
    "[01:31] ఇవి వేగడానికి మామూలు గారెల కంటే కాస్త ఎక్కువ టైం పడుతుంది ఓపికగా వేపుకోవాలి.",
    "[01:37] అప్పుడే చాలా క్రంచీగా క్రిస్పీగా వస్తాయి. ఎక్కువ సేపు క్రిస్పీగా ఉండడం ఈ గారెల విశేషం.",
    "[01:42] దీనికి పుల్లని పెరుగు వాడితేనే అసలు మజా అని మాత్రం గుర్తుంచుకోండి.",
    "[01:47] ఇవి క్రిస్పీగా వేగిన తర్వాత తీసి ఓ బుట్టలో వేసి ఉంచండి ఎక్కువ సేపు క్రిస్పీగా ఉంటాయి మూత పెట్టకండి.",
    "[01:52] ఇవి మీరు చాలా ఈజీగా అప్పటికప్పుడే చేసేసుకోవచ్చు. చాలా చాలా బాగుంటాయి. అందరికీ నచ్చుతాయి.",
    "[01:58] మరి మీకు నచ్చిందా? అయితే మీరు ట్రై చేసి మీకు ఎలా కుదిరిందో కచ్చితంగా ఆ పిక్ ని విస్మయ్ ఫుడ్ ఇన్స్టాగ్రామ్ లో పోస్ట్ చేయండి.",
    "[02:04] బై ది వే vismaifood.com వెబ్సైట్ విసిట్ చేయడం అస్సలు మర్చిపోకండి."
  ],
  "transcription_english": [
    "[00:00] Hello Foodies, Welcome to Vismai Food. Today's special is Instant Challa Garelu (Buttermilk Vada).",
    "[00:05] Yes, these are much crispier and crunchier than regular Vadas and taste amazing.",
    "[00:11] You can also offer these as Naivedyam. They get done very quickly. How quick? Just in 10 minutes.",
    "[00:17] This is really true, they get done that fast and are very tasty. Let's start.",
    "[00:21] First, take only two cups of thick poha.",
    "[00:25] Pour three cups of water into it and let it soak for five minutes.",
    "[00:30] After that, squeeze the water out tightly and put them in a mixing bowl.",
    "[00:38] Now add one finely chopped green chili, salt, one teaspoon finely chopped ginger, quarter teaspoon asafoetida,",
    "[00:46] Add three teaspoons of rice flour, two tablespoons of chopped coriander and mix well.",
    "[00:51] The more you knead while squeezing the poha, the better the vadas will turn out without breaking.",
    "[00:57] Now add a cup of sour curd to this.",
    "[01:00] Add this and mix the dough well.",
    "[01:03] If you mix this dough too hard, vadas will be hard; if too loose, vadas will break and absorb oil.",
    "[01:09] So it should be semi-thick, remember to knead the poha well while mixing.",
    "[01:15] Now add a teaspoon of cumin seeds and mix well,",
    "[01:18] Wet your hands, shape them like vadas, make a hole in the center,",
    "[01:23] Drop them in hot oil and fry only on medium flame.",
    "[01:27] Do not use a ladle immediately after dropping them. Use the ladle after a minute.",
    "[01:31] These take a little longer to fry than regular vadas, so fry patiently.",
    "[01:37] Only then will they become crunchy and crispy. Staying crispy for a long time is the specialty of these vadas.",
    "[01:42] Remember, the real taste comes only if you use sour curd.",
    "[01:47] After they fry crispy, remove and keep them in a basket; they stay crispy longer, don't cover them.",
    "[01:52] You can make these very easily instantly. They are very very tasty. Everyone will like them.",
    "[01:58] So, did you like it? Then you try it and definitely post the pic of how it turned out for you on Vismai Food Instagram.",
    "[02:04] By the way, don't forget to visit the vismaifood.com website."
  ]
}