{
  "metadata": {
    "title": "పక్కా టిప్స్తో ఆలూ 65 | Perfect Restaurant Style Aloo 65 Recipe In telugu @VismaiFood",
    "channel_name": "Vismai Food",
    "publish_date": "2018-07-21",
    "view_count": 1700000,
    "like_count": 25000,
    "duration": "03:52",
    "language": "Telugu",
    "video_id": "FjC55aJbVTo",
    "url": "https://www.youtube.com/watch?v=FjC55aJbVTo",
    "description": "Perfect Restaurant Style Aloo 65 Recipe In telugu. Aloo 65 is a very popular starter recipe. It is very tasty and easy to make. In this video, we are making Aloo 65 in Restaurant Style with perfect tips.",
    "ingredients_detected": [
      "Potatoes (Bangaladumpalu)",
      "Water",
      "Corn Flour",
      "Maida (All Purpose Flour)",
      "Salt",
      "Oil",
      "Garlic",
      "Green Chilli",
      "Dry Red Chillies",
      "Onion",
      "Curry Leaves",
      "Roasted Cumin Powder (Jeera Powder)",
      "Garam Masala",
      "Coriander Powder (Dhaniyala Podi)",
      "Red Chilli Powder",
      "Curd (Yogurt)",
      "Lemon Juice",
      "Red Food Color",
      "Coriander Leaves"
    ]
  },
  "transcription_telugu": [
    "[00:00] హలో ఫుడీస్, వెల్కమ్ టు విస్మయ్ ఫుడ్. ఇవాళ మరో ఎక్సైటింగ్ డిష్ ఆలు 65.",
    "[00:05] ఇది పక్కా హైదరాబాదీ డిష్. ఈ ఆలు 65 అంటే అందరికీ ఇష్టమే. ప్రతి ఫంక్షన్ కి ఇది తప్పనిసరి అయిపోయింది ఇప్పుడు.",
    "[00:10] ఇది చాలా సింపుల్ డిష్. ఎప్పుడైనా తినాలనిపించినప్పుడు బయట నుంచి ఎందుకు ఆర్డర్ చేసి తెప్పించుకోవాలి?",
    "[00:15] పక్కా రెస్టారెంట్ స్టైల్ ఆలు 65 ఇంట్లోనే చేసుకోవచ్చు. ఇంకెందుకు ఆలస్యం మొదలుపెడదాం.",
    "[00:20] బై ది వే సబ్స్క్రయిబ్ చేయడం మాత్రం మర్చిపోకండి.",
    "[00:29] ఆలు 65 కోసం ముందు నీళ్ళని మరిగించుకోవాలి. అందులో 300 గ్రాములు పీల్ చేసిన బంగాళదుంపలు క్యూబ్స్ వేసుకోవాలి.",
    "[00:38] దీన్ని ఆల్మోస్ట్ 80% ఉడకనివ్వాలి. మరీ మెత్తగా ఉడకనివ్వకండి. తినడానికి అంత టేస్టీగా ఉండవు, చిదురు చిదురు అయిపోతాయి.",
    "[00:46] ఇప్పుడు ఉడికిన ఆలుని స్ట్రైనర్ లో వేసుకొని మరో ప్లేట్ లో తీసుకొని కాస్త చల్లారాక...",
    "[00:56] 3 టేబుల్ స్పూన్ల కార్న్ ఫ్లోర్, 2 టేబుల్ స్పూన్ల మైదా వేసి, రుచికి సరిపడా ఉప్పు కూడా వేసుకొని ఆలుకి కోట్ చేసుకోవాలి.",
    "[01:11] జస్ట్ రెండు టేబుల్ స్పూన్ల వాటర్ ఆలు మీద స్ప్రింకిల్ చేసుకొని మరోసారి ముక్కలు చిదిరిపోకుండా కోట్ చేసుకోవాలి.",
    "[01:25] ఇప్పుడు ఆలుని వేపుకోవడానికి నూనెని వేడి చేసుకోవాలి.",
    "[01:28] ఇందులో కోట్ చేసుకున్న ఆలుని వేసుకొని లైట్ గోల్డెన్ బ్రౌన్ వచ్చేదాకా మీడియం ఫ్లేమ్ లో ఫ్రై చేసుకొని ఓ ప్లేట్ లోకి తీసుకోండి.",
    "[01:58] ఇప్పుడు ఓ కడాయిలో 3 టేబుల్ స్పూన్స్ ఆయిల్ హీట్ చేసుకొని...",
    "[02:06] ఆరేడు వెల్లుల్లి తరుగు, ఓ పచ్చిమిర్చి తరుగు, రెండు ఎండు మిరపకాయలు వేసి కాస్త ఫ్రై చేసుకొని...",
    "[02:13] రెండు మూడు చెంచాల ఉల్లి తరుగు కూడా వేసి ఫ్రై చేసుకోవాలి. ఉల్లిపాయల్ని మరీ ఎర్రగా వేపుకోకండి.",
    "[02:19] ఇప్పుడు ఓ రెబ్బ కరివేపాకు వేసుకొని కాస్త వేపుకొని...",
    "[02:29] అర చెంచా జీలకర్ర పొడి, అర చెంచా గరం మసాలా పొడి, అర చెంచా ధనియాల పొడి, రుచికి సరిపడా ఉప్పు, ఓ టీస్పూన్ కారం వేసి బాగా కలుపుకొని...",
    "[02:42] స్టవ్ ఆఫ్ చేసేసి 200 గ్రాములు చిలికిన పెరుగు వేసుకొని బాగా కలుపుకోవాలి.",
    "[02:54] ఇందులో అర చెక్క నిమ్మరసం కూడా పిండి, అర చెంచా రెడ్ కలర్... ఇది ఆప్షనల్, వద్దనుకుంటే వదిలేయొచ్చు కానీ మీకు రెడ్ కలర్ మాత్రం రాదు.",
    "[03:07] ఇప్పుడు స్టవ్ ఆన్ చేసి, ఫ్రైడ్ ఆలు వేసి హై ఫ్లేమ్ మీద టాస్ చేసుకోవాలి.",
    "[03:14] పెరుగు మసాలా అంతా ఆలుకి పట్టాక కాస్త కొత్తిమీర చల్లుకొని దించేసుకోవాలి.",
    "[03:26] అంతే వేడి వేడి ఆలు 65 రెడీ! చూసారా పక్కా రెస్టారెంట్ స్టైల్ ఆలు 65 రెడీ.",
    "[03:33] మీరు ట్రై చేసి మీకు ఎలా కుదిరిందో కామెంట్ బాక్స్ లో తెలియజేయడం మాత్రం మర్చిపోకండి."
  ],
  "transcription_english": [
    "[00:00] Hello Foodies, Welcome to Vismai Food. Today another exciting dish Aloo 65.",
    "[00:05] This is a proper Hyderabadi dish. Everyone loves this Aloo 65. It has become mandatory for every function now.",
    "[00:10] This is a very simple dish. When you feel like eating it, why order from outside?",
    "[00:15] You can make proper Restaurant Style Aloo 65 at home. Why delay? Let's start.",
    "[00:20] By the way, don't forget to subscribe.",
    "[00:29] For Aloo 65, first boil water. Add 300 grams of peeled potato cubes into it.",
    "[00:38] Let it cook almost 80%. Do not overcook it until very soft. It won't taste good and will become mushy.",
    "[00:46] Now take the cooked potatoes into a strainer and then onto a plate. After cooling slightly...",
    "[00:56] Add 3 tablespoons Corn flour, 2 tablespoons Maida (All purpose flour), and salt to taste, and coat the potatoes.",
    "[01:11] Sprinkle just 2 tablespoons of water on the potatoes and coat them again without breaking the pieces.",
    "[01:25] Now heat oil to fry the potatoes.",
    "[01:28] Add the coated potatoes and fry on medium flame until light golden brown and take them onto a plate.",
    "[01:58] Now heat 3 tablespoons of oil in a kadai (pan)...",
    "[02:06] Add 6-7 chopped garlic cloves, one chopped green chilli, two dry red chillies and fry slightly...",
    "[02:13] Add two to three spoons of chopped onions and fry. Don't fry the onions too brown.",
    "[02:19] Now add a sprig of curry leaves and fry slightly...",
    "[02:29] Add half teaspoon cumin powder, half teaspoon garam masala powder, half teaspoon coriander powder, salt to taste, one teaspoon red chilli powder and mix well...",
    "[02:42] Switch off the stove and add 200 grams of whisked curd and mix well.",
    "[02:54] Squeeze half a lemon juice into this, add half teaspoon red color... this is optional, you can skip if you want but you won't get the red color.",
    "[03:07] Now switch on the stove, add the fried aloo and toss on high flame.",
    "[03:14] Once the curd masala coats the potatoes, sprinkle some coriander and take it off the heat.",
    "[03:26] That's it, hot hot Aloo 65 is ready! See, proper Restaurant Style Aloo 65 is ready.",
    "[03:33] Do try it and don't forget to let us know in the comment box how it turned out for you."
  ]
}