{
  "metadata": {
    "title": "#AlooFry| ఆలూ ఫ్రై | The Best Aloo MethI Fry | Best Every Crispy Potato Fry Recipe In Telugu",
    "channel_name": "Vismai Food",
    "publish_date": "2018-10-01",
    "view_count": 3100000,
    "like_count": 30000,
    "duration": "02:00",
    "language": "Telugu",
    "video_id": "z4hQf_3gB9I",
    "url": "https://www.youtube.com/watch?v=z4hQf_3gB9I",
    "description": "Crispy Potato Fry | Aloo Fry | The Best Aloo Methi Fry | Best Every Crispy Potato Fry Recipe | How to make Aloo Fry- Potato Fry is a dish that tempts you to eat one more spoonful even after a full meal.",
    "ingredients_detected": [
      "Oil",
      "Potato Cubes",
      "Salt",
      "Fenugreek Seeds",
      "Dry Chillies",
      "Methi Leaves",
      "Coriander Powder",
      "Chilli Powder",
      "Ghee"
    ]
  },
  "transcription_telugu": [
    "[00:00] Hey Foodies, Welcome to Vismai Food. ఇప్పుడు అందరికీ ఫేవరెట్ బంగాళదుంప వేపుడు చూపిస్తాను.",
    "[00:06] రెగ్యులర్ బంగాళదుంప వేపుడికి ఓ ట్విస్ట్ ఈ రెసిపీ, అదే బంగాళదుంప మేథీ ఫ్రై.",
    "[00:12] చిరు చేదుగా అబ్బా ఎంత బావుంటుందో.",
    "[00:15] నిజంగా తృప్తిగా భోజనం చేస్తారు.",
    "[00:17] అంత బావుంటుంది కర్రీ.",
    "[00:19] నాకు చాలా ఫేవరెట్ ఈ కర్రీ. So let's start.",
    "[00:23] ముందుగా కడాయిలో హాఫ్ కప్ ఆయిల్ హీట్ చేసుకోండి.",
    "[00:27] ఇందులో అర కేజీ బంగాళదుంప ముక్కలు వేసుకోండి.",
    "[00:30] ఇవి బాగా ఎక్కువ నీళ్ళతో కడిగి అర్ధ గంట సేపు ఉప్పు నీటిలో నానబెట్టినవి.",
    "[00:36] ఇవి వేసి మీడియం ఫ్లేమ్ మీద లైట్ గోల్డెన్ బ్రౌన్ కలర్ వచ్చే దాకా వేపుకోండి.",
    "[00:40] మరీ క్రిస్పీగా అప్పడాల్లా వేపుకోకండి.",
    "[00:44] దుంప మగ్గి రంగు మారితే చాలు. తీసి పక్కన ఉంచుకోండి.",
    "[00:48] ఇప్పుడు అదే కడాయిలో ఆయిల్ తగ్గించుకొని, అంటే రెండు మూడు టేబుల్ స్పూన్ల ఆయిల్ ఉంచుకొని, హాఫ్ టీస్పూన్ మెంతులు, మూడు ఎండుమిర్చి వేసుకోండి.",
    "[00:56] చేదు తక్కువగా తింటాం అనుకునేవారు మెంతులు తగ్గించుకోండి.",
    "[01:02] ఇప్పుడు రెండు చిన్న మెంతి ఆకు కట్టల తరుగు వేసి మీడియం ఫ్లేమ్ మీద పచ్చి వాసన పోయేదాకా వేపుకోండి.",
    "[01:09] బాగా వేగాక వేయించిన ఆలూ వేసి ఓ సారి కలుపుకోండి.",
    "[01:16] ఇప్పుడు ఓ టేబుల్ స్పూన్ ధనియాల పొడి, ఓ టేబుల్ స్పూన్ కారం, సాల్ట్ వేసి బాగా కలుపుకోండి.",
    "[01:29] దుంపలకి ఉప్పు కారం బాగా పట్టాక మూత పెట్టి సిమ్ లోనే ఐదు నుంచి ఆరు నిమిషాల పాటు మగ్గనివ్వండి.",
    "[01:39] ముక్క ఫ్రై అయ్యి నూనె పైకి తేలాక ఓ సారి కలుపుకొని దింపేసుకోవడమే.",
    "[01:44] వేడి వేడి అన్నంలో కాస్త నెయ్యి వేసుకొని కూర తినాలి...",
    "[01:47] ఎంత బావుంటుందో.",
    "[01:50] కూరను డిష్ అవుట్ చేసుకున్నాక మాత్రం మూత పెట్టేయకండి ముక్క బాగా మెత్తబడిపోతుంది.",
    "[01:53] ఏదైనా క్లాత్ తో లేదంటే స్ట్రైనర్ తో కప్పుకోండి.",
    "[01:57] మీకు నచ్చిందా ఈ రెసిపీ? అయితే కామెంట్ చేసి చెప్పండి."
  ],
  "transcription_english": [
    "[00:00] Hey Foodies, Welcome to Vismai Food. Now I will show everyone's favorite potato fry.",
    "[00:06] A twist to the regular potato fry is this recipe, that is Potato Methi Fry.",
    "[00:12] With a slight bitterness, oh my, how good it tastes.",
    "[00:15] Truly you will eat a satisfying meal.",
    "[00:17] That is how good the curry will be.",
    "[00:19] This curry is my favorite. So let's start.",
    "[00:23] First, heat half a cup of oil in a pan.",
    "[00:27] Add half a kg of potato pieces in this.",
    "[00:30] These were washed with lots of water and soaked in salt water for half an hour.",
    "[00:36] Add these and fry on medium flame until they turn light golden brown color.",
    "[00:40] Do not fry them too crispy like papads.",
    "[00:44] It is enough if the potato softens and changes color. Remove and keep aside.",
    "[00:48] Now in the same pan reduce the oil, meaning keep two to three tablespoons of oil, add half teaspoon fenugreek seeds, and three dry chillies.",
    "[00:56] Those who want to eat less bitterness, reduce the fenugreek seeds.",
    "[01:02] Now add chopped leaves of two small fenugreek bunches and fry on medium flame until the raw smell goes away.",
    "[01:09] After it fries well, add the fried potato and mix once.",
    "[01:16] Now add one tablespoon coriander powder, one tablespoon chilli powder, salt and mix well.",
    "[01:29] After the salt and spice coat the potatoes well, cover with a lid and let it cook on simmer for five to six minutes.",
    "[01:39] Once the piece is fried and oil floats up, mix once and take it off.",
    "[01:44] In hot rice, add some ghee and eat the curry...",
    "[01:47] how good it will be.",
    "[01:50] Don't put the lid on after dishing out the curry, the pieces will become very soft.",
    "[01:53] Cover it with any cloth or a strainer.",
    "[01:57] Did you like this recipe? Then comment and tell me."
  ]
}