{
  "metadata": {
    "title": "CHETTINAD SPICY CRISPY POTATO FRY|చెట్టినాడు ఆలూ ఫ్రై|కారం కారంగా కరకరలాడే ఆలూ ఫ్రై కోసం ఇలా చేయండి",
    "channel_name": "Vismai Food",
    "publish_date": "2019-07-24",
    "view_count": 392000,
    "like_count": 5000,
    "duration": "02:10",
    "language": "Telugu",
    "video_id": "_CRa81nX-z7",
    "url": "https://www.youtube.com/watch?v=_CRa81nX-z7",
    "description": "Chettinad Spicy Crispy Potato Fry Recipe | How to make Crispy Potato Fry Recipe- The moment we mention Chettinad, we remember the strong taste of the cuisine of that region. Whatever dish we make, a bit of spice has to be added to tickle our tongue with the famous Chettinad flavours.",
    "ingredients_detected": [
      "Coriander Seeds",
      "Saunf (Fennel Seeds)",
      "Cinnamon",
      "Cloves",
      "Star Anise",
      "Black Pepper",
      "Dry Chillies",
      "Marathi Mogga (Kapok Buds)",
      "Urad Dal",
      "Chana Dal",
      "Oil",
      "Mustard Seeds",
      "Cumin Seeds",
      "Curry Leaves",
      "Turmeric",
      "Boiled Potato Cubes",
      "Salt",
      "Masala Powder"
    ]
  },
  "transcription_telugu": [
    "[00:00] Hey Foodies, Welcome to Vismai Food. ఇవాల్టి స్పెషల్ చెట్టినాడు పొటాటో ఫ్రై.",
    "[00:05] ఇది స్పైసీగా, క్రిస్పీగా, క్రంచీగా, ఆరోమాటిక్ గా భలే బాగుంటుంది.",
    "[00:09] వేడి వేడి నెయ్యన్నంలో కానీ లేదా చారు, పప్పు చారు, సాంబార్ లోకి...",
    "[00:13] ఇక చెప్పేదేముంది? నంజుకుంటూ తింటుంటే ఆహా! వేరే చెప్పాలా?",
    "[00:17] ఎంతో బాగుంటుంది. Let's start Chettinadu Style Crispy Aloo Fry.",
    "[00:21] ముందుగా పాన్ లో రెండు టీస్పూన్ల ధనియాలు, ఓ టీస్పూన్ సోంపు, ఓ ఇంచ్ దాల్చిన చెక్క, ఐదు లవంగాలు, ఓ అనాస పువ్వు, ఓ టీస్పూన్ మిరియాలు, ఐదు ఎండుమిర్చి, సగం మరాఠీ మొగ్గ వేసి లో ఫ్లేమ్ మీద బాగా రోస్ట్ చేసుకోండి.",
    "[00:35] మసాలాలు లో ఫ్లేమ్ మీద వేపితేనే చాలా ఆరోమాటిక్ గా ఉంటుంది పౌడర్.",
    "[00:38] ఇప్పుడు ఇందులో ఓ టీస్పూన్ మినపప్పు, ఓ టేబుల్ స్పూన్ శనగపప్పు వేసి మరో మూడు నాలుగు నిమిషాల పాటు కలుపుతూ వేపుకోండి.",
    "[00:48] ఆ తర్వాత దింపి చల్లార్చి కాస్త బరకగా పొడి చేసుకోండి.",
    "[00:57] ఇప్పుడు పాన్ లో పావు కప్పు ఆయిల్ హీట్ చేసుకుని అందులో ఓ టీస్పూన్ ఆవాలు, ఓ టీస్పూన్ జీలకర్ర, ఓ రెబ్బ కరివేపాకు వేసి ఆవాలని చిటపటమనిపించండి.",
    "[01:09] ఆ తర్వాత అర టీస్పూన్ పసుపు వేసి కలుపుకోండి.",
    "[01:14] ఇప్పుడు అర కిలో ఉడికించుకున్నటువంటి బంగాళదుంప ముక్కలు వేసి, అలాగే సాల్ట్ కూడా వేసి నిదానంగా ముక్కల్ని ఎర్రగా క్రిస్పీగా వేగనివ్వండి.",
    "[01:23] బంగాళదుంపలు మరీ మెత్తగా ఉడికించుకున్నవి వేసుకుంటే చిదురు అవుతాయి కలుపుకునేటప్పుడు అని గుర్తుంచుకోండి.",
    "[01:29] ఇవి చక్కగా క్రిస్పీగా వేగడానికి కనీసం పద్దెనిమిది నుంచి ఇరవై నిమిషాల టైమ్ పడుతుంది.",
    "[01:34] ఇదే బంగాళదుంపలు నాన్-స్టిక్ లో కాకుండా కాస్ట్ ఐరన్ మూకుళ్ళలో వేపి చూడండి ఎంత క్రిస్పీగా వేగుతాయో, చాలా చాలా బాగుంటాయి.",
    "[01:39] ఇప్పుడు ఇందులో మూడు టేబుల్ స్పూన్ల మసాలా పౌడర్ వేసుకోండి.",
    "[01:44] ఈ మసాలా పౌడర్ కొద్దిగా స్ట్రాంగ్ గా ఉంటుంది, చూసి వేసుకోండి. నాకు మూడు టేబుల్ స్పూన్లు సరిపోయింది. మీకు కావాలంటే ఎక్కువ వేసుకోండి లేదా తగ్గించుకోండి.",
    "[01:52] ఈ మసాలా పౌడర్ వేసి బాగా పట్టించి, మరో మూడు నాలుగు నిమిషాల పాటు ఫ్రై చేసుకోండి. ఆ తర్వాత దింపేసుకోండి.",
    "[01:59] అంతే! You are done. చాలా చాలా బాగుంటుంది.",
    "[02:02] మీరు ట్రై చేసి మీకు ఎలా కుదిరిందో కచ్చితంగా ఆ పిక్ ని Vismai Food Instagram లో పోస్ట్ చేయండి.",
    "[02:06] By the way, vismaifood.com వెబ్సైట్ విసిట్ చేయడం అస్సలు మర్చిపోకండి."
  ],
  "transcription_english": [
    "[00:00] Hey Foodies, Welcome to Vismai Food. Today's special is Chettinad Potato Fry.",
    "[00:05] It is spicy, crispy, crunchy, aromatic and tastes great.",
    "[00:09] With piping hot ghee rice or with rasam, dal rasam, sambar...",
    "[00:13] What else is there to say? If you eat it as a side dish... Aha! Do I need to say more?",
    "[00:17] It will be very good. Let's start Chettinadu Style Crispy Aloo Fry.",
    "[00:21] First, add two teaspoons coriander seeds, one teaspoon fennel seeds, one inch cinnamon, five cloves, one star anise, one teaspoon pepper, five dry chillies, half Kapok bud (marathi mogga) in a pan and roast well on low flame.",
    "[00:35] The powder will be aromatic only if the spices are roasted on low flame.",
    "[00:38] Now add one teaspoon urad dal, one tablespoon chana dal and fry for another three to four minutes while mixing.",
    "[00:48] After that remove from heat, cool it down and grind into a coarse powder.",
    "[00:57] Now heat a quarter cup of oil in a pan, add one teaspoon mustard seeds, one teaspoon cumin seeds, one sprig curry leaves and let the mustard seeds splutter.",
    "[01:09] After that add half a teaspoon turmeric and mix.",
    "[01:14] Now add half a kilo of boiled potato pieces, and also add salt, and gently let the pieces fry until red and crispy.",
    "[01:23] Remember that if you add potatoes that are boiled too soft, they will get mashed while mixing.",
    "[01:29] It takes at least eighteen to twenty minutes for these to fry nicely and crispy.",
    "[01:34] Try frying these potatoes in cast iron pans instead of non-stick, see how crispy they get, they will be very very good.",
    "[01:39] Now add three tablespoons of masala powder to this.",
    "[01:44] This masala powder is a bit strong, add accordingly. Three tablespoons was enough for me. If you want, add more or reduce it.",
    "[01:52] Add this masala powder, coat well, and fry for another three to four minutes. After that, take it off.",
    "[01:59] That's it! You are done. It tastes very very good.",
    "[02:02] You try it and definitely post the pic of how it turned out for you on Vismai Food Instagram.",
    "[02:06] By the way, don't forget to visit vismaifood.com website."
  ]
}