{
  "metadata": {
    "title": "Aloo Kurkure | ఆలూ కుర్కురే | Perfect Crispy Aloo Kurkure With Tips | హాట్ చిప్స్ లా వస్తాయ్ ఇలా చేస్తే",
    "channel_name": "Vismai Food",
    "publish_date": "2019-06-17",
    "view_count": 2167853,
    "like_count": 48000,
    "duration": "02:51",
    "language": "Telugu",
    "video_id": "0UE6zidmlmA",
    "url": "https://www.youtube.com/watch?v=0UE6zidmlmA",
    "description": "Aloo Kurkure | Perfect Crispy Aloo Kurkure With Tips | Hot Chips Style Potato Fries. These are perfect crunchy aloo fries. Once you start eating, you won't stop. If stored in a box, they stay fresh for at least a week.",
    "ingredients_detected": [
      "Large Potatoes",
      "Salt",
      "Green Chilli",
      "Coriander Leaves",
      "Black Pepper Powder",
      "Garam Masala",
      "Chilli Powder",
      "Chat Masala",
      "Roasted Cumin Powder",
      "Rice Flour",
      "Corn Flour",
      "Oil"
    ]
  },
  "transcription_telugu": [
    "[00:00] Hello Foodies, Welcome to Vismai Food. ఇవాల్టి స్పెషల్ మసాలా ఆలూ కుర్కురే.",
    "[00:05] పర్ఫెక్ట్ క్రంచీ, క్రిస్పీ ఆలూ కుర్కురే చేయడానికి కొన్ని టిప్స్ ఉన్నాయి.",
    "[00:08] అవి ఫాలో అయితే పర్ఫెక్ట్ గా క్రిస్పీగా భలే వస్తాయి.",
    "[00:13] ఇవి పెద్దవాళ్ళు కూడా చిన్నపిల్లల్లా యమా ఎంజాయ్ చేస్తారు, అంత బావుంటాయి.",
    "[00:17] ఓ సారి వేయించుకుని డబ్బాలో పెట్టుకుంటే కనీసం వారం పైన నిల్వ ఉంటాయి.",
    "[00:21] కానీ మీరు ఉంచొద్దు (నవ్వుతూ)... అవును మరి అంత బావుంటాయి ఇవి. Let's start.",
    "[00:27] ముందుగా ఓ కిలో ఖచ్చితంగా గట్టిగ, పెద్దగా ఉండేటువంటి బంగాళదుంపల్ని మాత్రమే తీసుకొని దాని చెక్కు తీసి, ఓ పదిహేను నిమిషాల పాటు ఉప్పు నీటిలో నానబెట్టినవి తీసుకోండి. ఇదిగో ఇలా ఉంటాయి అవి.",
    "[00:37] ఆ తర్వాత ఇలా కాస్త మందంగా స్లైసెస్ గా కట్ చేసుకోండి.",
    "[00:41] ఈ స్లైసెస్ చిప్స్ కట్టర్ తో మాత్రం కట్ చేయకండి, మీకు సరైన షేప్ రావు, పల్చగా వస్తాయి.",
    "[00:46] తర్వాత కట్ చేసుకున్న వాటన్నిటినీ ఒకదాని మీద మరొకటి పెట్టి ఇలా పొడుగ్గా కట్ చేసుకోండి స్ట్రిప్స్ లాగ.",
    "[00:53] ఇలాగే బెంగాలీ వాళ్ళు మరో రెసిపీ చేస్తారు, అది ఇంకా బాగుంటుంది, అది నేను మరోసారి చెప్తాను.",
    "[00:57] ఇప్పుడు వీటిని ఓ బౌల్ లో తీసుకొని నీళ్లు పోసి కనీసం మూడు నాలుగు సార్లు వాష్ చేసేయండి.",
    "[01:03] దీనివల్ల బంగాళదుంపల్లో ఉండేటువంటి పిండి అంతా పోయి క్రిస్పీగా వస్తాయి కుర్కురే.",
    "[01:08] ఇప్పుడు వీటిని వడకట్టుకొని మరో బౌల్ లో తీసుకొని...",
    "[01:13] ఓ పచ్చిమిర్చి సన్నని తురుము, ఓ టేబుల్ స్పూన్ కొత్తిమీర తరుగు, అర టీస్పూన్ మిరియాల పొడి, అర టీస్పూన్ గరం మసాలా, ఓ టీస్పూన్ కారం, అర టీస్పూన్ చాట్ మసాలా, అర టీస్పూన్ వేయించిన జీలకర్ర పొడి, సాల్ట్, రెండు టీస్పూన్ల బియ్యం పిండి, రెండు టీస్పూన్ల కార్న్ ఫ్లోర్ వేసి నెమ్మదిగా అంతా కోట్ చేసుకోండి.",
    "[01:37] ఇప్పుడు నూనె గోరువెచ్చగా చేసుకోండి. నూనె అస్సలు వేడి వేడిగా ఉండనేకూడదు.",
    "[01:43] నూనె బాగా వేడిగా ఉంటే రంగు వస్తాయి కానీ క్రిస్పీగా రావు, మెత్త మెత్తగా ఉంటాయి కుర్కురే అని గుర్తుంచుకోండి. నూనె గోరువెచ్చగా ఉండాలి, అది గుర్తుంచుకోండి.",
    "[01:51] ఆలూని వేసి హై ఫ్లేమ్ మీద వేపుకోవాలి. హై ఫ్లేమ్ మీద వేపితేనే కరకరలాడుతూ వస్తాయి.",
    "[01:57] వీటిని రెండు మూడు నిమిషాలు అలా వదిలేయండి. ఆ తర్వాత కలుపుతూ వేయించుకోండి.",
    "[02:01] మీరు ఈ రెసిపీలో గుర్తుంచుకోవాల్సింది ఆలూని సరిగ్గా ఈవెన్ గా స్ట్రిప్స్ గా కట్ చేసుకోవాలి.",
    "[02:07] ఒకటి సన్నగా, ఒకటి లావుగా, ఒకటి మందంగా ఇలా గాని కట్ చేస్తే కొన్ని ఎక్కువగా వేగుతాయి, కొన్ని తక్కువగా వేగుతాయి.",
    "[02:12] కాబట్టి కుర్కురే అన్ఈవెన్ గా వేగకుండా ఉండాలి అనుకుంటే ఈవెన్ గా కట్ చేయాలి అని గుర్తుంచుకోండి.",
    "[02:18] ఇవి లైట్ గోల్డెన్ బ్రౌన్ కలర్ రాగానే తీసేయండి. మిగిలిన కలర్ చల్లారాక వచ్చేస్తుంది.",
    "[02:22] ఇప్పుడు వేడి వేడిగా ఉన్నప్పుడే కోటింగ్ చేసుకోవాలి.",
    "[02:24] ఇప్పుడు అర టీస్పూన్ కారం, అర టీస్పూన్ చాట్ మసాలా వేసి గాలికి ఆరనివ్వండి.",
    "[02:29] పూర్తిగా చల్లారాక డబ్బాలో పెట్టుకోండి.",
    "[02:32] ఈ టిప్స్ ఫాలో అయితే మీకు పక్కాగా క్రిస్పీ ఆలూ కుర్కురే వస్తాయి.",
    "[02:37] నేను మీకు త్వరలో ఆలూ చిప్స్ కూడా చెప్తాను.",
    "[02:40] మీకు నచ్చిందా? మరైతే ఒకసారి vismaifood.com వెబ్సైట్ విసిట్ చేసి జాగ్రత్తగా చదువుకొని చేయండి, పర్ఫెక్ట్ రెసిపీని ఎంజాయ్ చేయండి.",
    "[02:47] By the way Subscribe చేయడం అస్సలు మర్చిపోకండి."
  ],
  "transcription_english": [
    "[00:00] Hello Foodies, Welcome to Vismai Food. Today's special is Masala Aloo Kurkure.",
    "[00:05] There are a few tips to make perfect crunchy, crispy Aloo Kurkure.",
    "[00:08] If you follow them, they will turn out perfectly crispy.",
    "[00:13] Even adults will enjoy these like little kids, they are that good.",
    "[00:17] If you fry them once and store them in a box, they will last for at least a week.",
    "[00:21] But don't keep them (laughing)... Yes, they are that tasty. Let's start.",
    "[00:27] First, take one kilo of potatoes that are definitely hard and large, peel them, and soak them in salt water for fifteen minutes. Here, they look like this.",
    "[00:37] After that, cut them into slightly thick slices like this.",
    "[00:41] Do not cut these slices with a chips cutter, you won't get the right shape, they will be too thin.",
    "[00:46] Then place the cut slices one on top of the other and cut them lengthwise into strips like this.",
    "[00:53] Bengali people make another recipe like this, which is even better, I will tell you that another time.",
    "[00:57] Now take these in a bowl, add water and wash them at least three to four times.",
    "[01:03] Because of this, the starch in the potatoes goes away and the Kurkure will turn out crispy.",
    "[01:08] Now strain them and take them into another bowl...",
    "[01:13] Add finely chopped green chilli, one tablespoon chopped coriander, half teaspoon black pepper powder, half teaspoon garam masala, one teaspoon chilli powder, half teaspoon chat masala, half teaspoon roasted cumin powder, salt, two teaspoons rice flour, two teaspoons corn flour and coat everything gently.",
    "[01:37] Now make the oil lukewarm. The oil should not be very hot at all.",
    "[01:43] Remember, if the oil is very hot, they will get color but won't be crispy, the Kurkure will be soft. Remember that the oil should be lukewarm.",
    "[01:51] Add the aloo and fry on high flame. Only if you fry on high flame will they turn out crunchy.",
    "[01:57] Leave them for two to three minutes. After that, keep mixing and frying.",
    "[02:01] What you need to remember in this recipe is to cut the aloo into even strips properly.",
    "[02:07] If you cut one thin, one thick, one broad, some will fry more and some will fry less.",
    "[02:12] So remember, if you want the Kurkure to fry evenly without being uneven, you must cut them evenly.",
    "[02:18] Remove them as soon as they turn light golden brown color. The remaining color will appear after cooling down.",
    "[02:22] Now you must coat them while they are still hot.",
    "[02:24] Now add half a teaspoon chilli powder, half a teaspoon chat masala and let them air dry.",
    "[02:29] Store them in a box after they cool down completely.",
    "[02:32] If you follow these tips, you will definitely get crispy Aloo Kurkure.",
    "[02:37] I will tell you the Aloo chips recipe soon.",
    "[02:40] Did you like it? Then visit the vismaifood.com website once, read carefully and make it, enjoy the perfect recipe.",
    "[02:47] By the way, don't forget to Subscribe."
  ]
}