{
  "metadata": {
    "title": "Andhra Special Veg Khadi | ఆంధ్రా స్పెషల్ మజ్జిగ పులుసు | వందల ఏళ్ళ నాటి మజ్జిగ పులుసు",
    "channel_name": "Vismai Food",
    "publish_date": "2019-04-16",
    "view_count": 620000,
    "like_count": 18000,
    "duration": "03:00",
    "language": "Telugu",
    "video_id": "hXlQxZk1d_4",
    "url": "https://www.youtube.com/watch?v=hXlQxZk1d_4",
    "description": "Andhra Special Veg Khadi | Majjiga Pulusu Recipe in Telugu | Potato Buttermilk Stew. Today we are going to prepare a famous Andhra traditional recipe Majjiga Pulusu. It is simple and easy to prepare within no time and less ingredients.",
    "ingredients_detected": [
      "Poppy Seeds",
      "Fennel Seeds",
      "Coriander Seeds",
      "Cinnamon",
      "Cloves",
      "Cardamom",
      "Ginger Garlic Paste",
      "Dry Red Chillies",
      "Onions",
      "Turmeric",
      "Oil",
      "Boiled Potato",
      "Sour Buttermilk",
      "Salt",
      "Curry Leaves",
      "Gram Flour (Besan)"
    ]
  },
  "transcription_telugu": [
    "[00:06] Hello Foodies, Welcome to Vismai Food.",
    "[00:09] ఇప్పుడు మనం బంగాళదుంప మజ్జిగ పులుసు ఎలా తయారు చేయాలో తెలుసుకుందాం.",
    "[00:13] ఇది ఆంధ్రా కోనసీమ క్షత్రియ ఫ్యామిలీస్ ఇళ్ళల్లో చేసే స్పెషల్ సీక్రెట్ రెసిపీ.",
    "[00:19] ఈ రెసిపీకి వందల ఏళ్ళ హిస్టరీ ఉంది.",
    "[00:21] చాలా సింపుల్, చాలా టేస్టీ.",
    "[00:23] Let's go.",
    "[00:26] ముందుగా ఒక టేబుల్ స్పూన్ గసగసాలు,",
    "[00:29] ఓ టేబుల్ స్పూన్ సోంపు,",
    "[00:31] రెండు టేబుల్ స్పూన్ల ధనియాలు,",
    "[00:33] రెండు ఇంచుల దాల్చిన చెక్క,",
    "[00:35] నాలుగు లవంగాలు,",
    "[00:36] రెండు యాలకులు వేసి ఫైన్ గా పౌడర్ చేసుకోవాలి.",
    "[00:51] దీంట్లో ఓ టేబుల్ స్పూన్ జింజర్ గార్లిక్ పేస్ట్,",
    "[00:53] ఏడెనిమిది ఎండుమిర్చి,",
    "[00:56] నాలుగైదు తరిగిన ఉల్లిపాయలు,",
    "[00:58] ఓ పావు చెంచా పసుపు వేసి స్మూత్ పేస్ట్ గా చేసుకోవాలి.",
    "[01:08] ఈ పేస్ట్ గ్రైండింగ్ అప్పుడే మీ కిచెన్ అంతా ఘుమఘుమలాడిపోతూ ఉంటుంది.",
    "[01:14] చూసారా? ఇలా స్మూత్ పేస్ట్ గా తయారుచేసుకోవాలి.",
    "[01:21] ఇప్పుడు అరకప్పు నూనె వేడి చేసి, గ్రైండ్ చేసుకున్న మసాలా పేస్ట్ వేసి ఆయిల్ పైకి తేలేంత వరకు మసాలా పేస్ట్ ని ఫ్రై చేయాలి.",
    "[01:35] ఈ కూరకి కొంచెం ఆయిల్ ఎక్కువగానే పడుతుంది.",
    "[01:43] ఇప్పుడు ఐదారు మీడియం సైజు ఉడికించిన బంగాళదుంపలు ముక్కలుగా కోసి వేసుకోవాలి.",
    "[01:49] మంట మీడియం ఫ్లేమ్ లో ఉంచి బంగాళదుంపలు చిదిరిపోకుండా పేస్ట్ అంతా పట్టించాలి.",
    "[02:08] ఇప్పుడు మంట సిమ్ లో ఉంచి మూడు కప్పుల పుల్లటి మజ్జిగ పోసి బాగా కలపాలి.",
    "[02:21] ఇప్పుడు దీనిలో రుచికి సరిపడా ఉప్పు, కరివేపాకు వేసి నూనె పైకి తేలేంత వరకు ఉడికించుకోవాలి.",
    "[02:27] ఇప్పుడు మూడు చెంచాల శనగపిండి పావు కప్పు నీళ్ళల్లో కలిపి,",
    "[02:31] ఆ నీళ్ళు ఇందులో పోసి, నూనె పైకి తేలేంత వరకు ఉడికించుకోవాలి.",
    "[02:38] ఈ కూర సాధ్యమైనంత వరకు సిమ్ లో ఉడికించుకుంటే చాలా టేస్టీగా ఉంటుంది.",
    "[02:43] చూసారా? యమ్మీ యమ్మీ స్పైసీ ట్రెడిషనల్ ఆలూ మజ్జిగ పులుసు రెడీ.",
    "[02:48] ఇది రైస్, రోటీస్, బిర్యానీస్ లోకి చాలా పర్ఫెక్ట్ గా సూట్ అవుతుంది.",
    "[02:53] మీరు ట్రై చేసి, ఎలా వచ్చిందో కామెంట్ బాక్స్ లో రాయండి.",
    "[02:56] సబ్స్క్రయిబ్ చేయడం మాత్రం మర్చిపోకండి. ఓకే?"
  ],
  "transcription_english": [
    "[00:06] Hello Foodies, Welcome to Vismai Food.",
    "[00:09] Now let's learn how to make Potato Buttermilk Stew (Aloo Majjiga Pulusu).",
    "[00:13] This is a special secret recipe made in Andhra Konaseema Kshatriya families' homes.",
    "[00:19] This recipe has a history of hundreds of years.",
    "[00:21] Very simple, very tasty.",
    "[00:23] Let's go.",
    "[00:26] First, take one tablespoon poppy seeds,",
    "[00:29] One tablespoon fennel seeds,",
    "[00:31] Two tablespoons coriander seeds,",
    "[00:33] Two inches cinnamon stick,",
    "[00:35] Four cloves,",
    "[00:36] Add two cardamoms and make a fine powder.",
    "[00:51] In this, add one tablespoon ginger garlic paste,",
    "[00:53] Seven to eight dry red chillies,",
    "[00:56] Four to five chopped onions,",
    "[00:58] Add a quarter teaspoon turmeric and grind into a smooth paste.",
    "[01:08] While grinding this paste itself, your whole kitchen will be filled with aroma.",
    "[01:14] See? You have to make a smooth paste like this.",
    "[01:21] Now heat half a cup of oil, add the ground masala paste and fry until the oil floats to the top.",
    "[01:35] This curry requires a little more oil.",
    "[01:43] Now cut five to six medium-sized boiled potatoes into pieces and add them.",
    "[01:49] Keep the flame on medium and coat the paste well without mashing the potatoes.",
    "[02:08] Now keep the flame on sim, pour three cups of sour buttermilk and mix well.",
    "[02:21] Now add salt to taste, curry leaves and cook until oil floats on top.",
    "[02:27] Now mix three spoons of gram flour in a quarter cup of water,",
    "[02:31] Pour that water into this, and cook until oil floats on top.",
    "[02:38] This curry tastes very tasty if cooked on sim as much as possible.",
    "[02:43] See? Yummy yummy spicy traditional Aloo Majjiga Pulusu is ready.",
    "[02:48] This suits perfectly with rice, rotis, and biryanis.",
    "[02:53] You try it and write in the comment box how it turned out.",
    "[02:56] Don't forget to subscribe. Okay?"
  ]
}