{
  "metadata": {
    "title": "Capsicum Tomato Curry | క్యాప్సికం టమాటో ఖోర్మ| Tasty Capsicum Masala Curry",
    "channel_name": "Vismai Food",
    "publish_date": "2018-08-27",
    "view_count": 1300000,
    "like_count": 13000,
    "duration": "01:54",
    "language": "Telugu",
    "video_id": "r80k6b9b8b0",
    "url": "https://www.youtube.com/watch?v=r80k6b9b8b0",
    "description": "Capsicum Tomato Curry | Capsicum Tomato Masala | Capsicum Masala Curry In Telugu | Capsicum Recipes - This curry is a perfect combination for Rotis, Chapatis, Pooris and even Rice.",
    "ingredients_detected": [
      "Oil",
      "Red Chillies",
      "Cumin Seeds",
      "Onion",
      "Ginger Garlic Paste",
      "Turmeric",
      "Garam Masala",
      "Coriander Powder",
      "Salt",
      "Cumin Powder",
      "Tomato Puree",
      "Capsicum",
      "Curry Leaves",
      "Water",
      "Red Chilli Powder",
      "Coriander Leaves"
    ]
  },
  "transcription_telugu": [
    "[00:00] Hello Foodies, Welcome to Vismai Food. ఈరోజు స్పెషల్ క్యాప్సికం టమాటో మసాలా.",
    "[00:06] చాలా సింపుల్, చాలా టేస్టీ కూడా. చాలా క్విక్ గా అయిపోతుంది.",
    "[00:09] డిన్నర్ కి రోటీస్ లోకి కానీ చపాతీస్ లోనికి పర్ఫెక్ట్ కాంబినేషన్ ఈ క్యాప్సికం టమాటో ఖోర్మా.",
    "[00:15] ఈవెన్ పూరీస్ లోకి, రైస్ లోకి కూడా చాలా బావుంటుంది. మైల్డ్ గా ఉండే పులావ్స్ లో కూడా.",
    "[00:20] ఇంకెందుకు ఆలస్యం? Let's start.",
    "[00:21] ముందుగా కడాయిలో పావు కప్పు నూనె హీట్ చేసుకోండి.",
    "[00:25] నూనె వేడెక్కాక రెండు ఎండుమిరపకాయలు, ఓ టీస్పూన్ జీలకర్ర వేసి కాస్త రోస్ట్ చేసుకున్నాక",
    "[00:31] ఓ పెద్ద ఉల్లిపాయ సన్నగా తరుగుకున్నది వేసి గోల్డెన్ బ్రౌన్ కలర్ వచ్చేదాకా మీడియం ఫ్లేమ్ లో ఫ్రై చేసుకోండి.",
    "[00:40] ఇప్పుడు ఓ టీస్పూన్ జింజర్ గార్లిక్ పేస్ట్ వేసి పచ్చి వాసన పోయేదాకా వేపుకోండి.",
    "[00:46] పచ్చి వాసన పోయాక పావు చెంచా పసుపు, అర చెంచా గరం మసాలా,",
    "[00:49] అర చెంచా ధనియాల పొడి, సాల్ట్, అర చెంచా జీలకర్ర పొడి వేసి",
    "[00:56] మసాలాస్ ని వేపుకున్నాక పావు కిలో టమాటో ప్యూరీ వేసుకోండి.",
    "[01:01] మీడియం ఫ్లేమ్ లో నూనె పైకి తేలి పచ్చి వాసన పోయేదాకా టమాటోలని వేపుకోండి.",
    "[01:07] నూనె పైకి తేలాక 200 గ్రాముల క్యాప్సికం క్యూబ్స్ వేసుకొని",
    "[01:10] మీడియం ఫ్లేమ్ మీద కలుపుకోండి.",
    "[01:13] మీడియం ఫ్లేమ్ మీద మూత పెట్టి నూనె పైకి తేలేదాకా కుక్ చేసుకోండి.",
    "[01:17] ఇప్పుడు రెండు రెమ్మల కరివేపాకు వేసి కలుపుకొని",
    "[01:25] పావు లీటర్ నీళ్లు పోసుకొని ఓ టేబుల్ స్పూన్ కారం వేసి కలుపుకొని",
    "[01:31] లో ఫ్లేమ్ మీద నూనె పైకి తేలేదాకా వేపుకొని",
    "[01:40] కొత్తిమీర చల్లి దింపేసుకోవడమే. చాలా సింపుల్ కదా?",
    "[01:43] మీరు ట్రై చేసి మీకు ఎలా కుదిరిందో కామెంట్ బాక్స్ లో తెలియజేయగలరా?",
    "[01:46] అంటూ సబ్స్క్రయిబ్ చేయడం మాత్రం మర్చిపోకండి."
  ],
  "transcription_english": [
    "[00:00] Hello Foodies, Welcome to Vismai Food. Today's special is Capsicum Tomato Masala.",
    "[00:06] It's very simple and very tasty too. It gets done very quickly.",
    "[00:09] For dinner, this Capsicum Tomato Korma is a perfect combination for rotis or chapatis.",
    "[00:15] It's very good even for pooris and rice. Even in mild pulaos.",
    "[00:20] Why delay? Let's start.",
    "[00:21] First, heat a quarter cup of oil in a kadai.",
    "[00:25] After the oil heats up, add two dry red chillies, one teaspoon cumin seeds and roast them a little.",
    "[00:31] Add one big finely chopped onion and fry on medium flame until it gets golden brown color.",
    "[00:40] Now add one teaspoon ginger garlic paste and fry until the raw smell goes away.",
    "[00:46] After the raw smell is gone, add quarter teaspoon turmeric, half teaspoon garam masala,",
    "[00:49] half teaspoon coriander powder, salt, half teaspoon cumin powder and",
    "[00:56] fry the masalas, then add quarter kilo tomato puree.",
    "[01:01] Fry the tomatoes on medium flame until oil floats up and the raw smell goes away.",
    "[01:07] After oil floats up, add 200 grams capsicum cubes and",
    "[01:10] mix on medium flame.",
    "[01:13] Cover with a lid on medium flame and cook until oil floats up.",
    "[01:17] Now add two sprigs of curry leaves and mix.",
    "[01:25] Pour quarter litre water, add one tablespoon chilli powder and mix.",
    "[01:31] Fry on low flame until oil floats up.",
    "[01:40] Sprinkle coriander and take it off. Very simple, right?",
    "[01:43] Can you try it and let me know in the comment box how it turned out for you?",
    "[01:46] And don't forget to subscribe."
  ]
}