{
  "metadata": {
    "title": "ప్రసాదం దద్యోధనం - Method 2 | Prasadam Temple Style Curd Rice Recipe in Telugu by Vismai Food",
    "channel_name": "Vismai Food",
    "publish_date": "2019-09-26",
    "view_count": 3900000,
    "like_count": 11000,
    "duration": "03:06",
    "language": "Telugu",
    "video_id": "j3XlQxZk1d4",
    "url": "https://www.youtube.com/watch?v=j3XlQxZk1d4",
    "description": "Prasadam Daddojanam - Method 2 | Prasadam Temple Style Curd Rice Recipe in Telugu by Vismai Food. We have followed the temple prasadam style for preparing Dadhyodanam recipe in Telugu. Daddojanam is also called curd rice.",
    "ingredients_detected": [
      "Rice",
      "Milk",
      "Water",
      "Salt",
      "Curd",
      "Oil",
      "Mustard Seeds",
      "Cumin Seeds",
      "Chana Dal",
      "Urad Dal",
      "Dry Chillies",
      "Curry Leaves"
    ]
  },
  "transcription_telugu": [
    "[00:00] తెలుగుంటి అల్లుడు రాముడు, ఆడపడుచు సీతమ్మ.",
    "[00:04] అలాంటి మన ఆరాధ్య దైవాలు సీతారాముల అనుగ్రహం అనుకంప ప్రతి ప్రేక్షకుడిపై ఉండాలని కోరుకుంటుంది విస్మయ్ ఫుడ్ టీమ్.",
    "[00:13] ఇవాల్టి ప్రత్యేకమైన వంటకం ప్రసాదం దద్యోధనం.",
    "[00:15] మాములుగా చేసుకునేటువంటి దద్యోధనానికి, ఆలయాల్లో ప్రసాదంగా ఇచ్చేటువంటి దద్యోధనానికి ఎంతో వ్యత్యాసం ఉంది.",
    "[00:22] సహజంగా మనమందరం కూడా పెరుగన్నాన్ని దద్దోజనం అంటాం. సరైన మాట దద్యోధనం.",
    "[00:27] భగవంతుడికి నివేదించేటువంటి ప్రసాదాలలో ఆగమశాస్త్రాల ప్రకారం కొన్ని విధానాలు, పద్ధతులు ఉన్నాయి. అప్పుడే ఆ రుచి వస్తుంది.",
    "[00:35] యూట్యూబ్ లో మీకు ఎక్కడా ఈ రెసిపీ కనిపించనే కనిపించదు.",
    "[00:39] ఇది వైదికంగా ప్రసాదాలు చేసేవారిని అడిగి తెలుసుకుని చేస్తున్నటువంటి రెసిపీ.",
    "[00:44] రామనవమి నాడు సీతారాముల వారికి ఈ ప్రసాదాన్ని నివేదించి వారి సంపూర్ణమైన అనుగ్రహం, అనుకంప పొందండి.",
    "[00:52] ముందుగా కుక్కర్లో గంటసేపు కడిగి నానబెట్టిన బియ్యం ఒక కప్పు తీసుకోండి.",
    "[00:57] ఇందులో ఒకటిన్నర కప్పుల పాలు, ఒక కప్పు నీళ్లు పోసుకోండి.",
    "[01:02] దీన్ని మీడియం ఫ్లేమ్ మీద మూడు విజిల్స్ రానివ్వండి. అప్పుడే అన్నం మెత్తగా ఉడుకుతుంది.",
    "[01:09] అన్నం మెత్తగా ఉడికించుకున్నాక రుచికి సరిపడా ఉప్పు వేసి, వేడి మీద ఉన్నప్పుడే అన్నాన్ని మెత్తగా ఎనుపుకోండి.",
    "[01:15] భగవంతుడికి నివేదించే ఏ పదార్థమైనా సరే వేడిగానే ఉండాలి. చల్లనిది పనికిరాదు, పులిసిపోయినా అది పనికిరాదు.",
    "[01:22] అందుకే మనకు ఆలయాల్లో ఇచ్చేటువంటి దద్యోధనం వేడిగా ఉంటుంది. గమనించారా?",
    "[01:29] అన్నం మెత్తగా ఎనుపుకున్నాక రెండు టేబుల్ స్పూన్ల కమ్మటి పెరుగు వేసుకోండి.",
    "[01:33] ఇందులో పావు కప్పు చొప్పున పాలు పోసుకుంటూ బాగా కలుపుకోండి.",
    "[01:37] ఈ అన్నానికి మనకి కనీసం 300ml పాలు అవసరం అవుతాయి. కాబట్టి కొంచెం కొంచెంగా పోసుకుంటూ కలుపుకోండి.",
    "[01:43] కొత్త బియ్యం అయితే ఈ ప్రసాదానికి ఇంకా రుచిగా ఉంటుంది.",
    "[01:46] ఇందాక చెప్పాను కదా ప్రసాదం వేడిగానే ఉండి తీరాలి.",
    "[01:50] వేడి మీద పెరుగు వేస్తే విరిగిపోతుంది అన్నంలో. అందుకే పెరుగు చాలా కొద్దిగా వాడి, అచ్చంగా పాలతోనే కలుపుతారు ఈ దద్యోధనాన్ని.",
    "[01:58] ఇప్పుడు అర్థమైందా ఈ ప్రసాదానికి ఎందుకంత కమ్మదనమో?",
    "[02:02] ఇప్పుడు తాలింపు కోసం రెండు టీస్పూన్ల నూనె వేడి చేసుకుని, అర టీస్పూన్ ఆవాలు, అర టీస్పూన్ జీలకర్ర...",
    "[02:07] అర టీస్పూన్ శనగపప్పు, అర టీస్పూన్ మినపప్పు, రెండు ఎండుమిర్చి, ఒక రెమ్మ కరివేపాకు వేసి వేయించుకోండి.",
    "[02:14] మనం తాలింపుల్లో సహజంగా ఇంగువ వేస్తాం. కానీ ప్రసాదంగా ఇచ్చేటువంటి దద్యోధనంలో ఇంగువ వేయనే వేయరు. అందుకే నేను వేయలేదు.",
    "[02:22] మీకు నచ్చితే ఇందులో ఎండుమిర్చికి బదులు మిరియాలు కూడా వాడుకోవచ్చు.",
    "[02:26] ఇప్పుడు ఈ తాలింపును వేడిగా ఉన్నటువంటి పెరుగన్నంలో వేసి కలుపుకోండి.",
    "[02:30] తాలింపులు, నూనె మరీ ఎక్కువగా వేయకండి. పెరుగన్నంలోని కమ్మదనాన్ని డామినేట్ చేస్తుంది తాలింపు ప్లేవర్.",
    "[02:36] అంతే! ఎంతో రుచికరమైనటువంటి ప్రసాదం దద్యోధనం తయారైపోయింది.",
    "[02:40] ఓసారి భగవంతుడికి నివేదన చేసి తిని చూడండి, ఈ ప్రసాదం రుచికి మీరు విస్మయులవుతారు.",
    "[02:46] సరిగ్గా ఆలయాల్లో ఇచ్చేటువంటి ప్రసాదం రుచొస్తుంది మీకు.",
    "[02:50] ఇది మీరు ప్రసాదంగానే కాదు, పిల్లల లంచ్ బాక్స్ లో పెట్టి పంపించినా మధ్యాహ్నానికి కూడా పులుపెక్కదు.",
    "[02:56] ఇంకా ఈ వేసవిలో బ్రేక్ ఫాస్ట్ గా తీసుకుంటే ఎంతో హాయిగా అనిపిస్తుంది పొట్టకి.",
    "[03:00] నచ్చిందా? తప్పకుండా మీరు ప్రయత్నించి మీకెలా నచ్చిందో ఖచ్చితంగా కామెంట్ చేసి చెప్పండి."
  ],
  "transcription_english": [
    "[00:00] Rama is the son-in-law of Telugu households, and Sita is the daughter.",
    "[00:04] The Vismai Food team wishes that the grace and compassion of our worshipped deities, Sita and Rama, be upon every viewer.",
    "[00:13] Today's special dish is Prasadam Daddojanam (Curd Rice).",
    "[00:15] There is a lot of difference between the Daddojanam made usually and the Daddojanam given as Prasadam in temples.",
    "[00:22] Naturally, we all call curd rice as \"Daddojanam\". The correct word is \"Dadhyodanam\".",
    "[00:27] According to Agama Shastras, there are certain methods and procedures for the offerings made to God. Only then does that taste come.",
    "[00:35] You will not see this recipe anywhere on YouTube.",
    "[00:39] This is a recipe made after inquiring with those who make Prasadam vedically.",
    "[00:44] Offer this Prasadam to Sita and Rama on Rama Navami and receive their complete grace and compassion.",
    "[00:52] First, take one cup of rice that has been washed and soaked for an hour in a cooker.",
    "[00:57] Pour one and a half cups of milk and one cup of water into it.",
    "[01:02] Let it cook for three whistles on medium flame. Only then will the rice cook softly.",
    "[01:09] After cooking the rice soft, add salt to taste and mash the rice softly while it is still hot.",
    "[01:15] Any item offered to God must be hot. Cold items are not suitable, and fermented (sour) items are not suitable either.",
    "[01:22] That is why the Daddojanam given to us in temples is hot. Have you noticed?",
    "[01:29] After mashing the rice softly, add two tablespoons of fresh curd.",
    "[01:33] Mix well while adding milk, a quarter cup at a time.",
    "[01:37] We need at least 300ml of milk for this rice. So add it little by little while mixing.",
    "[01:43] If it is new rice, this Prasadam will be even tastier.",
    "[01:46] As I said earlier, the Prasadam must be hot.",
    "[01:50] If you add curd to hot rice, it curdles. That's why they use very little curd and mix this Daddojanam purely with milk.",
    "[01:58] Now do you understand why this Prasadam is so delicious?",
    "[02:02] Now heat two teaspoons of oil for tempering, add half a teaspoon of mustard seeds, half a teaspoon of cumin seeds...",
    "[02:07] Add half a teaspoon of chana dal, half a teaspoon of urad dal, two dry chillies, a sprig of curry leaves and fry.",
    "[02:14] We usually add asafoetida in tempering. But they do not add asafoetida in the Daddojanam given as Prasadam. That is why I did not add it.",
    "[02:22] If you like, you can use black pepper instead of dry chillies in this.",
    "[02:26] Now add this tempering to the hot curd rice and mix.",
    "[02:30] Do not add too much tempering or oil. The tempering flavor dominates the deliciousness of the curd rice.",
    "[02:36] That's it! The very tasty Prasadam Daddojanam is ready.",
    "[02:40] Offer it to God once and taste it, you will be amazed by the taste of this Prasadam.",
    "[02:46] You will get the exact taste of the Prasadam given in temples.",
    "[02:50] Not just as Prasadam, even if you pack this in children's lunch box, it won't turn sour by afternoon.",
    "[02:56] Also, if taken as breakfast in this summer, it feels very comfortable for the stomach.",
    "[03:00] Did you like it? You must try it and definitely comment and tell us how you liked it."
  ]
}