{
  "metadata": {
    "title": "Undralla Payasam | ఉండ్రాళ్ళ పాయసం | Vinayaka Chavithi Prasadam | Ganesh Chaturthi Recipes",
    "channel_name": "Vismai Food",
    "publish_date": "2021-09-08",
    "view_count": 1334914,
    "like_count": 21000,
    "duration": "02:55",
    "language": "Telugu",
    "video_id": "9B0kPzCg-2M",
    "url": "https://www.youtube.com/watch?v=9B0kPzCg-2M",
    "description": "A full description of the video.",
    "ingredients_detected": [
      "Water",
      "Wet Rice Flour",
      "Jaggery",
      "Milk",
      "Cardamom Powder",
      "Fresh Coconut gratings",
      "Edible Camphor",
      "Cashews",
      "Raisins"
    ]
  },
  "transcription_telugu": [
    "[00:00:00.224] Hello Foodies, welcome to Vismai Food.",
    "[00:02:124] ఇవాల్టి స్పెషల్ వినాయక చవితి స్పెషల్ ఉండ్రాళ్ళ పాయసం.",
    "[00:06:064] ఇది రుచికి రుచి ఆరోగ్యం.",
    "[00:07:494] కొన్ని పద్ధతులు పాటిస్తే పర్ఫెక్ట్ ఉండ్రాళ్ళ పాయసం వస్తుంది.",
    "[00:11:134] మా పద్ధతిలో ఉండ్రాళ్ళ పాయసం చేస్తే కచ్చితంగా పండగవేళ హైలెట్ అయిపోతుంది ఈ ప్రసాదం.",
    "[00:15:474] ఈ ప్రసాదమే కాదు పర్ఫెక్ట్ గా వచ్చేటువంటి మరెన్నో వినాయకుడి ప్రసాదాలు వస్తున్నాయి.",
    "[00:19:424] పాల తాలికలతో సహా.",
    "[00:21:264] ఇక మొదలెడదామా.",
    "[00:22:644] ఇప్పుడు ఒక కప్పు నీళ్లు మరిగించుకోండి.",
    "[00:24:624] ఈ నీళ్లలో మీకు నచ్చితే రెండు టేబుల్ స్పూన్ల బెల్లం కూడా వేసుకోవచ్చు కానీ నేను వేయడం లేదు.",
    "[00:28:444] వేయడంవల్ల ఉండ్రాళ్ళు తియ్యగా ఉంటాయి.",
    "[00:31:304] ఇప్పుడు నీళ్లు బాగా మరుగుతున్నప్పుడు మాత్రమే ఓ కప్పు తడి పిండి వేసుకోండి.",
    "[00:35:554] తడిపిండి అంటే మీ అందరికీ తెలిసే ఉంటుంది.",
    "[00:36:994] రాత్రంతా బియ్యాన్ని నానబెట్టుకోవాలి.",
    "[00:38:644] నానబెట్టుకున్న బియ్యాన్ని తెల్లవారాక వంపి అర్ధగంట ఉంచి ఆ తర్వాత మిక్సీ పట్టుకోవాలి.",
    "[00:44:114] ఆ తర్వాత జల్లించుకోవాలి.",
    "[00:45:624] ఆ తర్వాత వచ్చే పిండే తడిపిండి.",
    "[00:48:204] ఇది కొంచెం చెమ్మగా ఉంటుంది.",
    "[00:49:954] ఈ పిండి ఓ కప్పు వేసుకోవాలి.",
    "[00:52:104] ఈ పిండి వేస్తేనే ఉండ్రాళ్ళు సాఫ్ట్ గా జ్యూసీగా ఉంటాయి.",
    "[00:55:164] ఈ పిండి వేసి బాగా కలిపి చల్లారేంతవరకు పక్కన ఉంచుకోండి.",
    "[00:58:858] ముందుగా ఒక కప్పు చిక్కటి పాలను పోసి మరిగించుకోండి.",
    "[01:01:838] మరిగిన తర్వాత దింపి చల్లార్చుకోండి.",
    "[01:04:478] ఇప్పుడు ఒక కప్పు బెల్లం ఇందులో పావు కప్పు నీళ్లు పోసి నిదానంగా మరగనివ్వండి.",
    "[01:10:338] ఓ తీగపాకం రానక్కర్లేదు.",
    "[01:11:798] ఇలా పొంగితే చాలు.",
    "[01:13:208] బెల్లం ఇలా పొంగుతున్నప్పుడు ఇందులో అర లీటర్ నీళ్లు పోసి, ఒక టీ స్పూన్ యాలకుల పొడి, అర కప్పు పచ్చి కొబ్బరి తురుము వేసి నిదానంగా ఈ పానకాన్ని తెర్లకాలనివ్వండి.",
    "[01:26:908] ఈలోపు గోరువెచ్చగా ఉన్నటువంటి బియ్యప్పిండిని చిన్నచిన్న గోలీ సైజు ఉండేటువంటి ఉండ్రాళ్లుగా చేసుకోండి.",
    "[01:32:678] యాక్చువల్గా ఇదే పిండిని తాలికల్లా కూడా చేసుకోవచ్చు.",
    "[01:34:618] చూడడానికి బాగుంటుంది ఇది ఆప్షన్.",
    "[01:36:628] శ్వేత రెండు విధాలుగా చేస్తోంది.",
    "[01:38:438] ఈ ఉండ్రాళ్ల పిండిని కొంచెం పక్కన ఉంచుకోండి.",
    "[01:41:401] ఇప్పుడు బాగా మరుగుతున్నటువంటి ఈ పానకంలో ఉండ్రాళ్లు, సిద్ధం చేసుకున్నటువంటి తాలికలు వేసి హైఫ్లేమ్ మీద ఓ 15 నిమిషాల పాటు మరగనివ్వండి.",
    "[01:49:731] గుర్తుంది కదా మీరు తడిపిండి వాడితేనే పాకం లోపల దాకా వెళుతుంది.",
    "[01:52:841] పొడి పిండి వాడితే లోపల పిండిగా మిగిలిపోతుంది.",
    "[01:55:421] ఇప్పుడు ఇందాక పక్కన ఉంచుకున్నటువంటి ఈ పిండిలో అర కప్పు నీళ్లు పోసి ఎక్కడా గడ్డలు లేకుండా కలుపుకోండి.",
    "[02:01:471] ఇప్పుడు కలుపుకున్నటువంటి ఈ పిండిని మరుగుతున్నటువంటి పానకంలో వేసి వెంటనే కలపండి.",
    "[02:06:231] దీనివల్ల ఉండ్రాళ్ల పాయసం చిక్కగా వస్తుంది.",
    "[02:08:491] ఇది వేసి లో ఫ్లేమ్ మీద 15 నిమిషాల పైన మరగనివ్వాలి.",
    "[02:17:921] ఇప్పుడు కాచి పక్కన ఉంచుకున్నటువంటి పాలను పోసి బాగా కలుపుకోండి.",
    "[02:22:211] నచ్చితే ఇందులో ఓ చిటికెడు పచ్చకర్పూరం కూడా వేసుకోండి.",
    "[02:24:491] పచ్చ కర్పూరం వేస్తే నిజమైన ప్రసాదం రుచి వస్తుంది.",
    "[02:27:661] అంతే ఎంతో రుచికరమైనటువంటి వినాయకుడికి ఇష్టమైనటువంటి ఉండ్రాళ్ల పాయసం రెడీ.",
    "[02:32:821] దీన్ని ఓపిగ్గా మరిగిస్తేనే ఉండ్రాళ్లు పానకాన్ని పీలుస్తాయి.",
    "[02:35:461] లేదంటే లోపల పిండిగా మిగిలిపోతుందని గుర్తుంచుకోండి.",
    "[02:38:221] చాలు ఎప్పుడు చేసినా పర్ఫెక్ట్ గా వస్తుంది.",
    "[02:40:701] మీకు నచ్చిందా.",
    "[02:41:641] మరి అయితే మీరు ట్రై చేసి మీకు ఎలా కుదిరిందో.",
    "[02:44:421] మీకు నచ్చిందా.",
    "[02:45:111] మరి అయితే తప్పకుండా ఈ పండగవేళ వినాయకుడికి నివేదించి ఆ గణనాధుని అనుకంప ఆశీర్వాదాలు పొందండి.",
    "[02:51:241] బై ద వే మీకు ఎలా కుదిరిందో కచ్చితంగా ఆ పిక్ ని Vismai Food Instagram లోనూ పోస్ట్ చేయండి."
  ],
  "transcription_english": [
    "[00:00:00.224] Hello Foodies, welcome to Vismai Food.",
    "[00:02:124] Today's special is Vinayaka Chavithi special Undralla Payasam.",
    "[00:06:064] It's tasty and healthy.",
    "[00:07:494] If you follow a few methods, you'll get the perfect Undralla Payasam.",
    "[00:11:134] If you make Undralla Payasam our way, this prasad will surely be the highlight of the festival.",
    "[00:15:474] Not just this prasad, many more perfect prasadams for Lord Vinayaka are coming up.",
    "[00:19:424] Including Paala Thalikalu.",
    "[00:21:264] Shall we start?",
    "[00:22:644] Now, boil one cup of water.",
    "[00:24:624] If you like, you can add two tablespoons of jaggery to this water, but I am not adding it.",
    "[00:28:444] Adding it makes the undrallu (dumplings) sweet.",
    "[00:31:304] Now, only when the water is boiling vigorously, add one cup of wet rice flour.",
    "[00:35:554] You all might know what wet flour is.",
    "[00:36:994] The rice has to be soaked overnight.",
    "[00:38:644] The next morning, drain the soaked rice, let it sit for half an hour, and then grind it in a mixer.",
    "[00:44:114] After that, sieve it.",
    "[00:45:624] The flour you get after that is wet flour.",
    "[00:48:204] It will be slightly moist.",
    "[00:49:954] You need to add one cup of this flour.",
    "[00:52:104] Only if you use this flour, the undrallu will be soft and juicy.",
    "[00:55:164] Add this flour, mix well, and keep it aside to cool down.",
    "[00:58:858] First, pour one cup of thick milk and bring it to a boil.",
    "[01:01:838] After it boils, take it off the heat and let it cool.",
    "[01:04:478] Now, take one cup of jaggery, add a quarter cup of water to it, and let it boil slowly.",
    "[01:10:338] It doesn't need to reach a string consistency.",
    "[01:11:798] It's enough if it froths like this.",
    "[01:13:208] When the jaggery is frothing like this, add half a liter of water, one teaspoon of cardamom powder, half a cup of fresh coconut gratings, and let this syrup come to a rolling boil.",
    "[01:26:908] Meanwhile, take the lukewarm rice dough and make small, marble-sized balls (undrallu).",
    "[01:32:678] Actually, you can also make thick noodles (thalikalu) with the same dough.",
    "[01:34:618] It looks good; this is optional.",
    "[01:36:628] Swetha is making it in two ways.",
    "[01:38:438] Keep a little of this undrallu dough aside.",
    "[01:41:401] Now, into the vigorously boiling syrup, add the undrallu and the prepared thalikalu, and let it boil on high flame for about 15 minutes.",
    "[01:49:731] Remember, only if you use wet flour will the syrup penetrate inside.",
    "[01:52:841] If you use dry flour, it will remain as uncooked flour inside.",
    "[01:55:421] Now, in the dough that we kept aside earlier, add half a cup of water and mix it without any lumps.",
    "[02:01:471] Now, add this mixed flour paste into the boiling syrup and stir immediately.",
    "[02:06:231] This will thicken the Undralla Payasam.",
    "[02:08:491] After adding this, you must let it boil on low flame for over 15 minutes.",
    "[02:17:921] Now, add the boiled and cooled milk and mix well.",
    "[02:22:211] If you like, you can also add a pinch of edible camphor.",
    "[02:24:491] Adding edible camphor gives it the authentic taste of prasad.",
    "[02:27:661] That's it, the very delicious Undralla Payasam, a favorite of Lord Vinayaka, is ready.",
    "[02:32:821] Only if you boil this patiently will the undrallu absorb the syrup.",
    "[02:35:461] Otherwise, remember that it will remain as uncooked flour inside.",
    "[02:38:221] That's enough, it will turn out perfect every time you make it.",
    "[02:40:701] Did you like it?",
    "[02:41:641] Then you try it and let us know how it turned out for you.",
    "[02:44:421] Did you like it?",
    "[02:45:111] Then, definitely offer this to Lord Vinayaka this festival and receive the grace and blessings of Gananadha.",
    "[02:51:241] By the way, be sure to post a picture of how it turned out for you on the Vismai Food Instagram."
  ]
}