{
  "metadata": {
    "title": "Rava Undrallu | రవ్వ ఉండ్రాళ్ళు | Vinayaka Chavithi Prasadam | Ganesh Chaturthi Recipes | Kudumulu",
    "channel_name": "Vismai Food",
    "publish_date": "2021-09-07",
    "view_count": 526210,
    "like_count": 12000,
    "duration": "02:03",
    "language": "Telugu",
    "video_id": "T0X212i-cQY",
    "url": "https://www.youtube.com/watch?v=T0X212i-cQY",
    "description": "A full recipe for Rava Undrallu, a special dish for the Vinayaka Chavithi festival. Also known as Uppu Undrallu, this is a simple and tasty prasad that is loved by both adults and children.",
    "ingredients_detected": [
      "Rice ravva",
      "Water",
      "Chana Dal",
      "Cumin",
      "Ghee",
      "Salt"
    ]
  },
  "transcription_telugu": [
    "[00:00:158] Hello Foodies, welcome to Vismai Food.",
    "[00:02:468] ఇవాల్టి స్పెషల్ వినాయక చవితి స్పెషల్ రవ్వ ఉండ్రాళ్ళు.",
    "[00:05:438] ఉండ్రాళ్ళు, కుడుముల్లో చాలా చాలా రకాలు ఉన్నాయి.",
    "[00:08:418] ఇది అందులో ఒకటి.",
    "[00:09:478] దీన్నే కొందరు ఉప్పు ఉండ్రాళ్ళు అని కూడా అంటారు.",
    "[00:11:978] చాలా సులభంగా చేసుకునేటువంటి రుచికరమైన ప్రసాదం.",
    "[00:14:738] గణనాధుడే కాదు, పిల్లలు కూడా చాలా ఇష్టంగా తింటారు ఈ ఉండ్రాళ్ళని.",
    "[00:18:618] ఇంకా నేను మీకు పండగ ముందు రోజే పండగ రోజు ఎలా సులభంగా, ఈజీగా, తక్కువ టైంలో ఎక్కువ ప్రసాదాలు చేసుకోవాలి, ఎలా ప్లాన్ చేయాలి లాంటి టిప్స్ తో ఓ వీడియో పోస్ట్ చేస్తాను.",
    "[00:27:898] తప్పక ఆ వీడియోను చూసి పండగని ఆనందంగా ఎంజాయ్ చేయండి.",
    "[00:31:698] ఇప్పుడు రెసిపీ చూద్దాం.",
    "[00:32:828] ముందుగా పాన్ లో ఒక కప్పు బియ్యపు రవ్వ వేసి, దీన్ని లైట్ గోల్డెన్ కలర్ వచ్చేంత వరకు కలుపుతూ లో ఫ్లేమ్ మీదే వేపుకోండి.",
    "[00:39:278] బియ్యపు రవ్వ రెడీమేడ్ గా దొరుకుతుంది.",
    "[00:40:658] లేనివారు బియ్యాన్ని రాత్రంతా నానబెట్టి, తెల్లారాక ఆరపోసి, డ్రై అయ్యాక రవ్వగా మిక్సీ పట్టుకుంటే అదే బియ్యపు రవ్వ.",
    "[00:47:118] ఇది బాగా వేగితే మంచి సువాసన వస్తుంది.",
    "[00:48:988] ఆ స్టేజిలో దింపి పక్కన ఉంచుకోండి.",
    "[00:50:888] ఇప్పుడు కప్పుకి మూడు కప్పుల నీళ్లు పోసి, ఇందులో ఒక టేబుల్ స్పూన్ పచ్చి శనగపప్పు, ఒక టీ స్పూన్ జీలకర్ర, ఒక టీ స్పూన్ నెయ్యి వేసి నీళ్ళని తెర్లకాకనివ్వండి.",
    "[01:03:708] నీళ్లు మరుగుతున్నప్పుడు రుచికి సరిపడా సాల్ట్ వేసి బాగా కలుపుకొని, రోస్ట్ చేసి ఉంచుకున్నటువంటి బియ్యపు రవ్వ వేసి బాగా కలిపి, మూతపెట్టి లో ఫ్లేమ్ మీద రవ్వ మెత్తగా కుక్ అవ్వనివ్వండి.",
    "[01:15:378] మీరు అడుగు మందంగా ఉన్నటువంటి పాన్ వాడకపోతే గనుక అడుగంటేస్తుందని గుర్తుపెట్టుకోండి.",
    "[01:20:418] రవ్వ ఉడికిపోయాక స్టవ్ ఆఫ్ చేసి బాగా కలుపుకోండి.",
    "[01:24:978] ఆ తర్వాత రవ్వనంతా కూడా ఇలా అదిమి పెట్టి ఓ ముద్దగా చేసి, మూత పెట్టి 15 నిమిషాలు వదిలేయండి.",
    "[01:30:578] దీనివల్ల రవ్వ లోపల స్టీమ్ అయ్యి చాలా మెత్తగా, స్పాంజీగా ఉంటాయి ఉండ్రాళ్ళు.",
    "[01:34:838] 15 నిమిషాల తర్వాత ఇంకా రవ్వ గోరువెచ్చగా ఉంటుంది.",
    "[01:37:628] ఆ స్టేజిలో ఒక టేబుల్ స్పూన్ నెయ్యి వేసి రవ్వని గట్టిగా పిండుతూ బాగా కలుపుకోండి.",
    "[01:43:288] ఆ తర్వాత చేతులకి నెయ్యి రాసి ఉండ్రాళ్ళుగా ఒత్తుకోండి.",
    "[01:46:488] ఈ ప్రసాదంలో సహజంగా అల్లం తరుగు, కరివేపాకు, పచ్చిమిర్చి లాంటివి ఏవీ వెయ్యరు.",
    "[01:50:548] ఈ ప్రసాదం ఇంతే.",
    "[01:51:508] ఇది ఎంతో రుచిగా ఉంటుంది.",
    "[01:52:438] పిల్లలు కూడా చాలా ఇష్టపడతారు.",
    "[01:54:838] మీకు నచ్చిందా?",
    "[01:55:628] మరి అయితే మీరు ట్రై చేసి మీకు ఎలా కుదిరిందో కచ్చితంగా ఆ పిక్ ని Vismai Food Instagram లో పోస్ట్ చేయండి.",
    "[02:00:438] ఈ పండగ వేళని ఆనందంగా ఎంజాయ్ చేయండి."
  ],
  "transcription_english": [
    "[00:00:158] Hello Foodies, welcome to Vismai Food.",
    "[00:02:468] Today's special is Vinayaka Chavithi special Rava Undrallu.",
    "[00:05:438] There are many varieties of undrallu and kudumulu.",
    "[00:08:418] This is one of them.",
    "[00:09:478] Some also call this Uppu Undrallu (Salt Undrallu).",
    "[00:11:978] It's a delicious prasad that can be made very easily.",
    "[00:14:738] Not just Lord Ganesha, even kids will love these undrallu.",
    "[00:18:618] Also, the day before the festival, I will post a video with tips on how to easily and quickly make many prasads in less time and how to plan for it.",
    "[00:27:898] Be sure to watch that video and enjoy the festival happily.",
    "[00:31:698] Now, let's see the recipe.",
    "[00:32:828] First, in a pan, add one cup of rice ravva and roast it on low flame, stirring continuously, until it turns a light golden color.",
    "[00:39:278] Rice ravva is available ready-made.",
    "[00:40:658] If not, you can soak rice overnight, drain and air-dry it the next morning, and once dry, grind it into a coarse powder in a mixer to get rice ravva.",
    "[00:47:118] When it's well-roasted, it will give off a nice aroma.",
    "[00:48:988] At that stage, take it off the heat and keep it aside.",
    "[00:50:888] Now, for one cup of ravva, add three cups of water, one tablespoon of chana dal, one teaspoon of cumin, and one teaspoon of ghee, and bring the water to a rolling boil.",
    "[01:03:708] When the water is boiling, add salt to taste, mix well, then add the roasted rice ravva, mix well, cover, and let the ravva cook on low flame until it becomes soft.",
    "[01:15:378] Remember that if you don't use a thick-bottomed pan, it might stick to the bottom.",
    "[01:20:418] Once the ravva is cooked, turn off the flame and mix well.",
    "[01:24:978] After that, press the ravva together to form a lump, cover it, and leave it for 15 minutes.",
    "[01:30:578] This will allow the ravva to steam internally, making the undrallu very soft and spongy.",
    "[01:34:838] After 15 minutes, the ravva will still be lukewarm.",
    "[01:37:628] At this stage, add one tablespoon of ghee and knead the ravva mixture firmly.",
    "[01:43:288] Then, grease your hands with ghee and shape them into undrallu (balls).",
    "[01:46:488] Traditionally, things like chopped ginger, curry leaves, or green chilies are not added to this prasad.",
    "[01:50:548] This prasad is just this.",
    "[01:51:508] It tastes very delicious.",
    "[01:52:438] Kids will also like it a lot.",
    "[01:54:838] Did you like it?",
    "[01:55:628] Then you try it and be sure to post a picture of how it turned out on the Vismai Food Instagram.",
    "[02:00:438] Enjoy this festive occasion happily."
  ]
}