{
  "metadata": {
    "title": "Modak Recipe | మోదకాలు | Vinayaka Chavithi Prasadam | Ganesh Chaturthi Recipes | Vinayakudi Naivedyam",
    "channel_name": "Vismai Food",
    "publish_date": "2018-09-06",
    "view_count": 2320146,
    "like_count": 40000,
    "duration": "02:23",
    "language": "Telugu",
    "video_id": "8eQNwN1b6XQ",
    "url": "https://www.youtube.com/watch?v=8eQNwN1b6XQ",
    "description": "A traditional recipe for Modak, a sweet dumpling offered to Lord Ganesha during the Vinayaka Chavithi festival. This version is popular in Maharashtra and North India and is considered a favorite of the deity.",
    "ingredients_detected": [
      "Jaggery (Bellam)",
      "Water",
      "Cardamom powder",
      "Fresh Coconut gratings",
      "Rice flour",
      "Salt",
      "Ghee/Oil"
    ]
  },
  "transcription_telugu": [
    "[00:00:158] Hello friends, welcome to Vismai Food.",
    "[00:01:978] ఇవాల్టి స్పెషల్ వినాయకునికి ప్రీతి అయిన మోదకాలు.",
    "[00:05:408] ఈ మోదకాలు దక్షిణ భారతదేశంలో ఉన్న ఉత్తరాది వారు, మహారాష్ట్రీయులు ఎక్కువగా చేస్తూ ఉంటారు.",
    "[00:10:768] ఈ మోదకాలలోనే కాలానుగుణంగా ఎన్నో రుచులు, రకాలు వచ్చాయి.",
    "[00:14:388] అవన్నీ నేను మీకు మరుసటి సంవత్సరం చెప్తాను.",
    "[00:16:538] ఇక మొదలు పెడదామా?",
    "[00:17:638] వినాయకునికి ఎంతో ప్రీతిపాత్రమైన మోదకాలు.",
    "[00:22:378] ముందుగా పాన్ లో ఓ కప్పు బెల్లం వేసుకోండి.",
    "[00:24:628] ఇందులో పావు కప్పు నీళ్లు పోసి, బెల్లం కరిగి ఓ తీగ పాకం వచ్చేంతవరకు ఉడికించుకోండి.",
    "[00:33:638] ఓ తీగ పాకం వచ్చాక అప్పుడు ఒక టీ స్పూన్ యాలకులపొడి, ఒక కప్పు పచ్చి కొబ్బరి తురుము వేసి పాకం గట్టిపడేంతవరకు కలుపుతూ కుక్ చేసుకోండి సన్నని సెగ మీద.",
    "[00:43:538] ఈ పాకం ఇలా నురగ నురగగా రాగానే దింపి చల్లార్చుకోండి.",
    "[00:48:268] ఇప్పుడు ఒక కప్పు నీళ్లు మరిగించుకోవాలి.",
    "[00:50:548] ఇందులో చిటికెడు ఉప్పు,",
    "[00:55:18] ఒక కప్పు కంటే ఓ చెంచాడు పిండి ఎక్కువ వేసి స్టవ్ ఆపేసి బాగా కలుపుకోండి.",
    "[00:59:718] ఇది వేడి మీదే బాగా ఒత్తుకొని తీరాలి.",
    "[01:02:648] అందుకే తడి గుడ్డ కప్పి వేడి మీదే గుడ్డతో సహా ఒత్తుకుంటే పిండి బాగా కలుస్తుంది, మీరూ కలపగలుగుతారు.",
    "[01:09:508] వేడి మీద ఒత్తకపోతే పిండి పొడిబారిపోతుంది, మీకు మోదకాలు రావని గుర్తుంచుకోండి.",
    "[01:16:328] పిండి బాగా సాఫ్ట్ గా ఒత్తుకున్నాక,",
    "[01:19:428] ఇప్పుడు చల్లారినటువంటి కొబ్బరి హల్వా ఇలా గట్టిపడుతుంది.",
    "[01:22:378] దీన్ని చిన్న చిన్న బాల్స్ గా చేసుకోండి.",
    "[01:26:248] ఇప్పుడు బియ్యం పిండి ముద్దని పల్చగా చేత్తో ఒత్తుకొని,",
    "[01:29:408] కొబ్బరి ఉండని లోపలికి తోస్తూ, పిండిని నిదానంగా పగుళ్లు రాకుండా పైకి లాగుతూ అంచు పైకి లాగి సీల్ చేయండి.",
    "[01:37:618] ఈ మోదకాల పై పిండి ఎంత పల్చగా ఉంటే అంత బాగా వచ్చినట్లు మోదకాలు.",
    "[01:42:648] పై పిండి మందంగా ఉంటే మోదకాలు రుచిగా ఉండవని గుర్తుంచుకోండి.",
    "[01:47:188] ఇలాగే అన్ని మోదకాలు సిద్ధం చేసుకోండి.",
    "[01:49:588] ఇప్పుడు రెండు కప్పుల నీళ్లు పోసి పైన ఇలాంటి జల్లెడ పెట్టండి.",
    "[01:53:778] ఈ జల్లెడ మీద నూనె రాసి మోదకాలు పెట్టి మూతపెట్టి లో ఫ్లేమ్ మీద 15 నుంచి 18 నిమిషాలు స్టీమ్ చేసుకోండి.",
    "[02:02:448] 17 నిమిషాల తర్వాత మోదకాలు ఉడికి ఇలా ఊరిస్తాయి.",
    "[02:05:858] చాలా బాగున్నాయి కదా?",
    "[02:07:378] నిజంగా చాలా బాగుంటాయి.",
    "[02:08:448] ఇవి మనసారా స్వామికి నివేదించి మంచి బుద్ధిని ఇమ్మని వేడుకోండి.",
    "[02:11:988] తప్పక అనుగ్రహిస్తాడు.",
    "[02:13:398] మీరు ఈ వినాయక చవితికి స్వామి వారికి ఈ మోదకాలను నివేదించి ఆయన అనుగ్రహం, అనుకంప పొందండి.",
    "[02:18:928] మరిన్ని రెసిపీస్ కోసం vismaifood.com వెబ్సైట్ విజిట్ చేయడం అస్సలు మర్చిపోకండి."
  ],
  "transcription_english": [
    "[00:00:158] Hello friends, welcome to Vismai Food.",
    "[00:01:978] Today's special is Modak, which is dear to Lord Vinayaka.",
    "[00:05:408] These Modaks are mostly made by North Indians and Maharashtrians living in South India.",
    "[00:10:768] Over time, many tastes and varieties of these Modaks have emerged.",
    "[00:14:388] I will tell you all about them next year.",
    "[00:16:538] Shall we start now?",
    "[00:17:638] Modaks, which are very dear to Lord Vinayaka.",
    "[00:22:378] First, add one cup of jaggery to a pan.",
    "[00:24:628] Add a quarter cup of water to this, let the jaggery melt, and cook until it reaches a one-string consistency.",
    "[00:33:638] Once it reaches a one-string consistency, add one teaspoon of cardamom powder, one cup of fresh coconut gratings, and cook on low heat, stirring, until the syrup thickens.",
    "[00:43:538] As soon as the syrup becomes frothy like this, take it off the heat and let it cool.",
    "[00:48:268] Now, you need to boil one cup of water.",
    "[00:50:548] In this, a pinch of salt,",
    "[00:55:18] add slightly more than one cup of rice flour (one cup plus one spoon), turn off the stove, and mix well.",
    "[00:59:718] This must be kneaded well while it is hot.",
    "[01:02:648] That's why, if you cover it with a damp cloth and knead it while it's hot along with the cloth, the dough mixes well and you will be able to handle it.",
    "[01:09:508] If you don't knead it while it's hot, the dough will become dry and powdery, and remember that you won't be able to make Modaks.",
    "[01:16:328] After kneading the dough until it's very soft,",
    "[01:19:428] now, the cooled coconut halwa will become firm like this.",
    "[01:22:378] Make small balls out of it.",
    "[01:26:248] Now, take the rice dough ball and flatten it thinly with your hand.",
    "[01:29:408] While pushing the coconut ball inside, slowly pull the dough upwards without cracks, pull the edge up and seal it.",
    "[01:37:618] The thinner the outer layer of these Modaks, the better they have turned out.",
    "[01:42:648] Remember that if the outer dough is thick, the Modaks won't taste good.",
    "[01:47:188] Prepare all the Modaks in the same way.",
    "[01:49:588] Now, pour two cups of water and place a sieve-like plate on top.",
    "[01:53:778] Grease this sieve with oil, place the Modaks, cover with a lid, and steam on low flame for 15 to 18 minutes.",
    "[02:02:448] After 17 minutes, the Modaks will be cooked and look this tempting.",
    "[02:05:858] They look great, don't they?",
    "[02:07:378] They really taste very good.",
    "[02:08:448] Offer these to the Lord with all your heart and pray for good wisdom.",
    "[02:11:988] He will surely bless you.",
    "[02:13:398] This Vinayaka Chavithi, offer these Modaks to the Lord and receive his grace and compassion.",
    "[02:18:928] For more recipes, don't forget to visit the vismaifood.com website."
  ]
}