{
  "metadata": {
    "title": "Paala Talikalu | పాల తాలికలు | Vinayaka Chavithi Prasadam | Ganesh Chaturthi Recipes | Vinayakudi Naivedyam",
    "channel_name": "Vismai Food",
    "publish_date": "2018-09-08",
    "view_count": 7532713,
    "like_count": 82000,
    "duration": "04:05",
    "language": "Telugu",
    "video_id": "ZU4T8z-G4Is",
    "url": "https://www.youtube.com/watch?v=ZU4T8z-G4Is",
    "description": "A traditional recipe for Paala Talikalu, a sweet dish made with rice flour, jaggery, and milk, specially prepared as a prasad for the Vinayaka Chavithi festival. This dish is also a significant part of Telugu wedding traditions.",
    "ingredients_detected": [
      "Rice",
      "Jaggery",
      "Water",
      "Milk",
      "Sabudana (Sago)",
      "Cardamom Powder",
      "Ghee",
      "Dry Coconut",
      "Cashews",
      "Raisins"
    ]
  },
  "transcription_telugu": [
    "[00:00:233] Hello friends, welcome to Vismai food.",
    "[00:02:163] ఇవాల్టి స్పెషల్ వినాయక చవితి స్పెషల్ పాల తాళికలు.",
    "[00:06:143] ఇవి ప్రత్యేకించి వినాయకుడికే కాదు చాలా ప్రాంతాల్లో సారెతో పాటు కొత్త పెళ్లి కూతురితో ఇచ్చి పంపుతారు.",
    "[00:12:33] ఇంకా ఇవి తెలుగు వారి ఇళ్లల్లో ఏ శుభకార్యం జరిగినా ఇది చేసి వారి ఆనందాన్ని పంచుకుంటారు అందరితో.",
    "[00:17:743] ఇది ఎంతో ఆరోగ్యం కూడా.",
    "[00:19:143] కొన్ని పద్ధతులు పాటిస్తే చాలు కమ్మనైన పాలతాళికలు చేసేయొచ్చు.",
    "[00:22:423] ఇవి మీరు ఎప్పుడు చేసినా చాలా బాగా వస్తాయి.",
    "[00:24:993] ఇంకా నేను మీకు ఈ వినాయక చవితికి తక్కువ టైంలో ప్రసాదాలు ఎలా ప్లాన్ చేస్తే త్వరగా అయిపోతాయో రేపు ఓ వీడియో పోస్ట్ చేస్తాను.",
    "[00:31:673] తప్పక చూడండి.",
    "[00:32:913] ఇక మొదలెడదామా?",
    "[00:34:163] ముందుగా రాత్రంతా నానబెట్టినటువంటి ఒకటిన్నర కప్పుల బియ్యాన్ని ఇలా వడకట్టుకొని 30 నిమిషాలు ఆరనివ్వండి.",
    "[00:40:413] ఆరనిచ్చిన వెంటనే మిక్సీలో వేసి ఫైన్ గా పౌడర్ చేసుకోండి.",
    "[00:44:893] ఇప్పుడు జల్లించండి.",
    "[00:46:583] మిగిలిన రవ్వని మళ్లీ జల్లించుకోండి.",
    "[00:48:883] తడి పిండి ఎప్పుడూ మన అవసరానికంటే కాస్త ఎక్కువగా ఉండడం మేలు.",
    "[00:51:983] అందుకే నేను ఎక్కువ బియ్యాన్ని నానబెట్టడం జరిగింది.",
    "[00:54:683] చూడండి పిండి ఇలా పట్టుకుంటే ముద్ద కట్టాలి.",
    "[00:57:323] దీన్ని తడిపిండి అంటారు.",
    "[00:59:453] ఇప్పుడు రెండు టేబుల్ స్పూన్ల బెల్లం, 30 ml నీళ్లు పోసి బెల్లాన్ని కరగనివ్వండి.",
    "[01:07:313] ఇప్పుడు ఒక కప్పు తడి బియ్యం పిండిని వేసి స్టవ్ ఆపేసి బాగా కలుపుకోండి.",
    "[01:11:723] తడి పిండికి ఎక్కువగా నీరు పట్టదు.",
    "[01:13:613] ఏ మాత్రం నీరు ఎక్కువైపోయినా జారైపోతుందని గుర్తుంచుకోండి.",
    "[01:16:713] పిండి మరీ జారుగా ఉంటే తాలికలు విరిగిపోతాయి, గట్టిగా ఉంటే తాలికలు పాలని పీల్చవని గుర్తుంచుకోండి.",
    "[01:21:553] కొద్దిగా నీరు పోసి పిండిని సెమీ సాఫ్ట్ గా చేసుకోండి.",
    "[01:25:733] ఇప్పుడు చిన్న గోలీ సైజు అంత ఉండల్ని చేసి ఇలా పొడవుగా ఒత్తుకోండి.",
    "[01:29:943] ఇవి మరీ మందంగా ఉండకూడదు అలా అని మరీ పలుచగాను ఉండకూడదు.",
    "[01:33:513] ఈ తాలికలన్నీ చేశాక రెండు టేబుల్ స్పూన్ల పిండిని తీసి పక్కన ఉంచుకోండి.",
    "[01:37:623] ఈ పిండిలో బెల్లం వేయడం వల్ల తాలికలు చప్పగా ఉండవు.",
    "[01:41:223] ఇప్పుడు ఒక కప్పు బెల్లం తీసుకోండి.",
    "[01:42:863] ఇందులో పావు కప్పు నీళ్లు పోసి బెల్లాన్ని కరిగించండి.",
    "[01:46:583] బెల్లం కరిగాక పూర్తిగా చల్లారనివ్వాలి.",
    "[01:49:743] ఇప్పుడు రెండు కప్పులు అంటే అర లీటర్ పాలు, పావు లీటర్ నీళ్లు పోసి పాలని మరగనివ్వండి.",
    "[01:55:103] పాలు బాగా మరుగుతున్నప్పుడు రెండు టేబుల్ స్పూన్లు 30 నిమిషాలు నానబెట్టినటువంటి సగ్గుబియ్యం వేసుకోండి.",
    "[02:01:23] సగ్గుబియ్యం వేసి బాగా కలిపి, మూత పెట్టి ఓ 10 నిమిషాల పాటు మరగనివ్వండి.",
    "[02:10:563] సగ్గుబియ్యం సగం పైన ఉడకాలి.",
    "[02:12:873] సగం పైన ఉడికాక అప్పుడు తాలికలు వేసి, మూత పెట్టి కదపకుండా ఐదు నిమిషాలు లో ఫ్లేమ్ మీద కుక్ చేసుకోండి.",
    "[02:19:483] వెంటనే గరిటె పెడితే విరిగిపోతాయని తాలికల్ని గుర్తుంచుకోండి.",
    "[02:22:833] ఐదు నిమిషాల తర్వాత ఓసారి నిదానంగా కలుపుకోండి.",
    "[02:26:13] ఆ తర్వాత మూత పెట్టి తాలికల్ని మెత్తగా ఉడికించుకోండి.",
    "[02:30:973] ఓ తాలికను తీసి ఇలా కట్ చేసి చూస్తే ఉడికిందో లేనిదో తెలిసిపోతుంది.",
    "[02:34:643] తాలికలు ఉడికినట్లయితే పక్కనుంచుకున్నటువంటి తాలికల పిండిలో కాసిన్ని నీళ్లు పోసి ఎక్కడా గడ్డలు లేకుండా కలుపుకొని తాలికల్లో వేసి, నిదానంగా సన్నని సెగ మీద 10 నుంచి 12 నిమిషాల పాటు మరగనివ్వండి.",
    "[02:49:133] ఈ పిండి వేయడం వల్ల ఇది చిక్కబడుతుంది.",
    "[02:51:653] మీరు ఇంకో విషయం గుర్తుపెట్టుకోవాలి.",
    "[02:52:953] తాలికలు వేడి మీద సహజంగానే కాస్త పచ్చిగా అనిపిస్తాయి కానీ చల్లారే పాటికి పూర్తిగా ఉడికి ఉంటాయని గుర్తుంచుకోండి.",
    "[02:59:713] ఈ తాలికలు చూడండి ఇంత చిక్కగా ఉంటే చాలు.",
    "[03:02:133] మరీ ఎక్కువగా చిక్కగా ఉడికించుకున్నట్లయితే చల్లారే పాటికి మరీ చిక్కబడిపోతాయని గుర్తుంచుకోండి.",
    "[03:06:643] కొంచెం జారుగా ఉండేటట్టు చూసుకోండి.",
    "[03:08:483] ఇప్పుడు స్టవ్ ఆపేసి ఒక టీ స్పూన్ యాలకుల పొడి, పూర్తిగా చల్లారినటువంటి బెల్లం పాకం జల్లెడలో పోసి వడకట్టుకొని తాలికల్లో కలపండి.",
    "[03:17:103] ఈ బెల్లం పాకం పూర్తిగా చల్లారే ఉండాలి.",
    "[03:19:753] అప్పుడే పాలు విరగవు.",
    "[03:21:493] ఏదో ఒకటి వేడిగా ఉండాలి పాకం అయినా తాలికలైనా.",
    "[03:24:263] మనం అందుకే బెల్లం పాకాన్ని చల్లార్చి ఇందులో పోస్తున్నాం.",
    "[03:27:143] పాకం పోశాక నిదానంగా కలుపుకోండి.",
    "[03:29:663] ఇప్పుడు రెండు టేబుల్ స్పూన్ల నెయ్యి కరిగించి అందులో మూడు టేబుల్ స్పూన్ల ఎండుకొబ్బరి పలుకులు వేసి బాగా కలుపుకోండి.",
    "[03:35:453] ఎండుకొబ్బరి పలుకులు సగం పైన వేగాక అప్పుడు రెండు టేబుల్ స్పూన్ల జీడిపప్పు పలుకులు,",
    "[03:40:223] ఒక టేబుల్ స్పూన్ ఎండుద్రాక్ష వేసి కలుపుకోండి.",
    "[03:43:183] ఇప్పుడు వీటిని తాలికల్లో కలిపేయండి.",
    "[03:45:193] అంతే, ఎంతో రుచికరమైన అందరికీ నచ్చేలా మెచ్చేలాంటి తాలికలు రెడీ అయిపోయాయి.",
    "[03:50:813] ఈ కమ్మని పాయసాన్ని గణనాధునికి నివేదించి మంచి బుద్ధిని ప్రసాదించమని వేడుకుందాం.",
    "[03:55:653] మీకు నచ్చిందా?",
    "[03:56:883] మరి అయితే మీరు ట్రై చేసి మీకు ఎలా కుదిరిందో కచ్చితంగా ఆ పిక్ ని Vismai Food Instagram లో పోస్ట్ చేయండి.",
    "[04:01:663] బై ద వే vismaifood.com వెబ్సైట్ విజిట్ చేయడం అస్సలు మర్చిపోకండి."
  ],
  "transcription_english": [
    "[00:00:233] Hello friends, welcome to Vismai Food.",
    "[00:02:163] Today's special is Vinayaka Chavithi special, Paala Talikalu.",
    "[00:06:143] These are not just for Lord Vinayaka; in many regions, they are given to the new bride along with her wedding trousseau.",
    "[00:12:33] Moreover, in Telugu households, for any auspicious occasion, this is made and shared with everyone to spread joy.",
    "[00:17:743] It's also very healthy.",
    "[00:19:143] By following a few methods, you can make delicious Paala Talikalu.",
    "[00:22:423] They will turn out great every time you make them.",
    "[00:24:993] Also, for this Vinayaka Chavithi, I will post a video tomorrow on how to plan and prepare prasadam quickly in less time.",
    "[00:31:673] Be sure to watch it.",
    "[00:32:913] Shall we start?",
    "[00:34:163] First, take one and a half cups of rice soaked overnight, drain it, and let it dry for 30 minutes.",
    "[00:40:413] Immediately after drying, grind it into a fine powder in a mixer.",
    "[00:44:893] Now, sieve it.",
    "[00:46:583] Sieve the remaining coarse bits again.",
    "[00:48:883] It's always better to have a little more wet flour than you need.",
    "[00:51:983] That's why I soaked more rice.",
    "[00:54:683] See, when you press the flour like this, it should form a lump.",
    "[00:57:323] This is called wet flour (tadi pindi).",
    "[00:59:453] Now, take two tablespoons of jaggery, 30 ml of water, and let the jaggery dissolve.",
    "[01:07:313] Now, add one cup of wet rice flour, turn off the stove, and mix well.",
    "[01:11:723] Wet flour doesn't absorb much water.",
    "[01:13:613] Remember that if you add even a little extra water, it will become runny.",
    "[01:16:713] If the dough is too runny, the talikalu will break; if it's too hard, the talikalu won't absorb the milk, remember that.",
    "[01:21:553] Add a little water and make the dough semi-soft.",
    "[01:25:733] Now, take small marble-sized balls of dough and roll them into long strands.",
    "[01:29:943] They shouldn't be too thick or too thin.",
    "[01:33:513] After making all the talikalu, keep aside two tablespoons of the dough.",
    "[01:37:623] Adding jaggery to this dough prevents the talikalu from being bland.",
    "[01:41:223] Now, take one cup of jaggery.",
    "[01:42:863] Add a quarter cup of water to it and dissolve the jaggery.",
    "[01:46:583] After the jaggery dissolves, let it cool down completely.",
    "[01:49:743] Now, pour two cups, which is half a liter of milk, and a quarter liter of water, and bring the milk to a boil.",
    "[01:55:103] When the milk is boiling well, add two tablespoons of sago soaked for 30 minutes.",
    "[02:01:23] After adding the sago, mix well, cover, and let it simmer for about 10 minutes.",
    "[02:10:563] The sago should be more than half cooked.",
    "[02:12:873] Once it's more than half cooked, add the talikalu, cover, and cook on low flame for five minutes without stirring.",
    "[02:19:483] Remember that if you stir immediately, the talikalu will break.",
    "[02:22:833] After five minutes, stir gently once.",
    "[02:26:13] Then, cover and cook the talikalu until they are soft.",
    "[02:30:973] Take one talika and cut it to check if it's cooked.",
    "[02:34:643] If the talikalu are cooked, take the reserved talikalu dough, add a little water, mix it without lumps, add it to the talikalu, and let it simmer on low heat for 10 to 12 minutes.",
    "[02:49:133] Adding this flour will thicken it.",
    "[02:51:653] You need to remember one more thing.",
    "[02:52:953] The talikalu will naturally feel a bit raw when hot, but remember that they will be fully cooked by the time they cool down.",
    "[02:59:713] Look at these talikalu; this thickness is enough.",
    "[03:02:133] If you cook it to be thicker, remember that it will become even thicker as it cools.",
    "[03:06:643] Make sure it's a bit runny.",
    "[03:08:483] Now, turn off the stove, add one teaspoon of cardamom powder, and strain the completely cooled jaggery syrup through a sieve and add it to the talikalu.",
    "[03:17:103] This jaggery syrup must be completely cool.",
    "[03:19:753] Only then will the milk not curdle.",
    "[03:21:493] One of them has to be hot, either the syrup or the talikalu.",
    "[03:24:263] That's why we are adding the cooled jaggery syrup.",
    "[03:27:143] After adding the syrup, stir gently.",
    "[03:29:663] Now, melt two tablespoons of ghee and add three tablespoons of dry coconut pieces and mix well.",
    "[03:35:453] When the coconut pieces are more than half fried, add two tablespoons of cashews,",
    "[03:40:223] and one tablespoon of raisins and mix.",
    "[03:43:183] Now, add these to the talikalu.",
    "[03:45:193] That's it, the very delicious talikalu that everyone will like and appreciate are ready.",
    "[03:50:813] Let's offer this delicious payasam to Lord Ganesha and pray for good wisdom.",
    "[03:55:653] Did you like it?",
    "[03:56:883] Then, you try it and be sure to post a picture of how it turned out for you on Vismai Food's Instagram.",
    "[04:01:663] By the way, don't forget to visit the vismaifood.com website."
  ]
}