{
  "metadata": {
    "title": "వినాయక చవితి ప్రసాదాలు|తక్కువ టైంలో ఎక్కువ ప్రసాదాలు|Prasadam Recipes|Ganesh Chaturthi|Vismai Food",
    "channel_name": "Vismai Food",
    "publish_date": "2021-09-09",
    "view_count": 292305,
    "like_count": 9100,
    "duration": "05:00",
    "language": "Telugu",
    "video_id": "yC-r_6772rU",
    "url": "https://www.youtube.com/watch?v=yC-r_6772rU",
    "description": "A guide on how to plan and prepare multiple prasadams for the Vinayaka Chavithi festival efficiently and without stress. The video provides tips on pre-preparation and suggests various recipes.",
    "ingredients_detected": [
      "Rice",
      "Urad Dal",
      "Jaggery",
      "Wet Rice Flour (Tadi Pindi)",
      "Rava Laddu",
      "Rava Appalu",
      "Poha Laddu",
      "Paala Poori",
      "Panakam",
      "Daddojanam",
      "Temple Style Pulihora",
      "Poornalu",
      "Panasa Kudumulu",
      "Biyyam Rava Halwa (Tiruvathirai Kali)",
      "Undralla Payasam",
      "Rava Undrallu",
      "Bellam Appalu",
      "Paakam Puri",
      "Modak",
      "Perugu Vadalu"
    ]
  },
  "transcription_telugu": [
    "[00:00:237] Hello Foodies, welcome to Vismai Food.",
    "[00:02:377] Vismai Food ప్రేక్షకులందరికీ వినాయక చవితి శుభాకాంక్షలు.",
    "[00:05:527] గణనాధుడు మీ అందరికీ మంచి బుద్ధి, సిద్దితో పాటు ఆయన అనుగ్రహం ఎల్లవేళలా అందించాలని కోరుకుంటోంది Vismai Food టీం.",
    "[00:12:447] వినాయక చవితి అనగానే ఎంతో సందడి ప్రతీ ఇంట్లో.",
    "[00:14:737] దాంతో పాటు ఎంతో హడావిడి.",
    "[00:16:117] అనుకున్నది అనుకున్నట్లు జరగలేదని, టైంకి అందించలేదని ఆ గొడవలు, అలకలు, అరుపులు.",
    "[00:21:287] ఆఖరికి పూజ దగ్గరికి వచ్చి కూర్చునేసరికి మధ్యాహ్నం 12:00, 1:00.",
    "[00:25:287] ఓ పక్క ఆకలి, మరోపక్క ప్రశాంతత లేదు.",
    "[00:28:347] ఏదో చేశాం అని అనిపిస్తారు పూజ చాలామంది.",
    "[00:31:227] పండగని ఎంతో హాయిగా, మనశ్శాంతిగా ఎలా ముగించాలో ఈ వీడియో చివరి వరకు చూడండి.",
    "[00:36:347] ముందుగా Vismai Food ఛానల్ లో బోలెడన్ని ప్రసాదాల రెసిపీస్ ఉన్నాయి.",
    "[00:39:797] అవన్నీ కూడా నేను vismaifood.com వెబ్సైట్ లో ప్రత్యేకంగా చవితి ప్రసాదాల పేరిట ఓ దగ్గర ఏరి కూర్చి పెట్టాను.",
    "[00:45:677] మీరు వెబ్సైట్ విజిట్ చేసి చదువుకొని చేసుకోవచ్చు.",
    "[00:47:797] లేదంటే నేను సజెస్ట్ చేస్తున్న రెసిపీస్ అన్నీ కూడా కింద డిస్క్రిప్షన్ బాక్స్ లో లింక్స్ ఉంచాను.",
    "[00:52:137] అవీ కూడా చేసుకోవచ్చు.",
    "[00:54:927] ఇప్పుడు పాయింట్ నెంబర్ 1.",
    "[00:56:457] ప్రసాదాల కోసం ఓ రోజు ముందే అన్నీ ప్లాన్ చేసుకోండి.",
    "[01:00:477] పక్కాగా కూర్చొని ఈ ప్రసాదాలు చేసుకోవాలి అని ఓ లిస్ట్ రాసుకోండి.",
    "[01:04:167] దానికి కావలసిన సామాగ్రి అంతా ముందు రోజే సిద్ధం చేసుకోండి.",
    "[01:08:147] అంటే ఎగ్జాంపుల్ తడిపిండి ఉందనుకోండి, ఇది ముందు రోజే మీరు తయారు చేసుకొని ఓ జిప్ లాక్ బ్యాగ్ లో కానీ ఏదైనా డబ్బాలో కానీ పెట్టి డీప్ ఫ్రీజర్ లో పెట్టేసారనుకోండి, నెక్స్ట్ డే అది తడిగానే ఉంటుంది, తడిపిండి లాగే పనిచేస్తుంది అని గుర్తుంచుకోండి.",
    "[01:19:987] ఇంకా మీకు కావలసినంత బెల్లం ముందు రోజే కొట్టి ఉంచుకోండి.",
    "[01:23:597] పని సులభం అవుతుంది.",
    "[01:25:127] ఇలాంటివి చిన్న చిన్నవి అన్నీ కూడా ముందు రోజే సిద్ధం చేసుకొని ఉంచుకోండి.",
    "[01:28:907] పాయింట్ నెంబర్ 2.",
    "[01:29:837] పండగవేళ అన్ని కొత్త ప్రసాదాలు వెరైటీ ప్రసాదాలు చేయాలని మాత్రం అనుకోకండి.",
    "[01:33:917] మీకు రాని ప్రసాదాల జోలికి వెళ్ళకండి.",
    "[01:36:747] మీరు చేసుకునే ప్రసాదాల్లో ఒకటి లేదంటే రెండు కొత్త వెరైటీలు చేయండి.",
    "[01:40:877] మిగిలినవన్నీ కూడా మీకు తెలిసిన ప్రసాదాలు ఎన్ని వచ్చో అన్నే చేసుకోండి.",
    "[01:44:667] దీనివల్ల పని సులభం అవుతుంది, త్వరగా చేయగలుగుతారు.",
    "[01:47:677] ఇంకా మీకు చాలా క్విక్ గా అయిపోయేటువంటి రవ్వ కేసరి, అటుకుల రవ్వ కేసరి, ఇన్స్టెంట్ చల్లగారెలు ఇలాంటివి ఏవైనా చేసుకోవచ్చు.",
    "[01:53:577] చాలా త్వరగా అయిపోతాయి.",
    "[01:54:627] అవన్నీ మీరు ప్లాన్ చేసుకునే దాన్ని బట్టి ఉంటుంది.",
    "[01:57:607] పాయింట్ నెంబర్ 3.",
    "[01:58:657] ప్రసాదాలు ఇన్ని సంఖ్యలో చేయాలి, 11 ఉండాలి, 9 ఉండాలి, 6 ఉండాలి ఇలాంటివి ఏవీ పెట్టుకోకండి.",
    "[02:03:977] మనసారా కుదురుగా ఎన్ని చేయగలరో అన్నే చేయండి.",
    "[02:07:377] అదే ముఖ్యం.",
    "[02:08:417] అప్పుడే మీరు ప్రశాంతంగా వంట ముగించి, పూజ దగ్గర ఎక్కువ టైం గడపడానికి కుదురుతుంది.",
    "[02:13:467] పాయింట్ నెంబర్ 4.",
    "[02:14:487] రోజూ మీరు నిద్ర లేచే సమయం ఏదైతే ఉంటుందో పండగ రోజు మీరు కచ్చితంగా ఆ టైంకి వంట మొదలు పెట్టేసి ఉండాలి.",
    "[02:21:637] అప్పుడే మీకు ప్రసాదాలు త్వరగా అవుతాయి.",
    "[02:23:437] ఇంట్లో వారిని కూడా స్నానాలు చేసి ఉండేలా చూసుకోండి.",
    "[02:26:157] దానివల్ల మీకు ప్రసాదాలలో ఏదైనా సాయం చేయడంతో పాటు, ఇంట్లో పనులు ఏమైనా చేసి సాయం చేయగలుగుతారు.",
    "[02:31:857] మీరు ఎలాగో బోలెడన్ని ప్రసాదాలు చేస్తారు కాబట్టి, ఈ పండగవేళ ఉల్లి, వెల్లుల్లి వేయకుండా ఓ పప్పు, ఓ పచ్చడి చేస్తే, మధ్యాహ్నం భోజనానికి కూడా ఈ ప్రసాదాల టైంలోనే వంట ముగించేయొచ్చు మీరు.",
    "[02:42:377] ఇప్పుడు ఏం ప్రసాదాలు చేసుకోవాలో చెప్తాను.",
    "[02:44:747] ఛానల్ లో రెండు రకాల పులిహోరలు ఉన్నాయి.",
    "[02:46:587] దీంతో పాటు మీకు నచ్చితే రెడీమేడ్ పులిహోర పేస్ట్ కూడా ఉంది.",
    "[02:49:577] అది ముందు రోజే గానీ సిద్ధం చేసి ఉంచుకున్నట్లయితే పని చాలా సులభం అయిపోతుంది.",
    "[02:54:197] పులిహోర కోసం అన్నం వండుకునేటప్పుడు కాస్త ఎక్కువగా వండుకున్నట్లయితే, అందులో కొంత అన్నంలో తాలింపు వేసి, పెరుగు కలిపితే దద్దోజనం సిద్ధమైపోతుంది.",
    "[03:02:647] అలాగే మీరు ప్లాన్డ్ గా ఇంకొంచెం బియ్యం ఎక్కువ పోసుకున్నట్లయితే, మధ్యాహ్నం భోజనానికి కూడా అదే అన్నం సరిపోతుంది.",
    "[03:07:957] మీరు మినపప్పు నానెసేటప్పుడు ఒక రెసిపీకి కాకుండా రెండు మూడు రెసిపీలు ప్లాన్ చేసుకున్నట్లయితే, ఒకేసారి పిండి రుబ్బినవాళ్ళు అవుతారు.",
    "[03:16:797] మీరు ఒకే మినపప్పుతో గారెలు వేసుకోవచ్చు.",
    "[03:19:147] కొంచెం పాకం పట్టి పాకంలో వేస్తే పాకం గారెలు అవుతాయి.",
    "[03:22:157] పెరుగు కలిపితే పెరుగువడలు అవుతాయి.",
    "[03:24:267] కొంచెం ఇడ్లీ రవ్వ కలిపి ఓ అర్ధ గంట నానబెట్టి, ఉల్లిపాయ వేయకుండా వేస్తే పునుకులు కూడా తయారవుతాయి.",
    "[03:29:417] ఇంకా ఇదే ఇడ్లీ పిండిలో కొంచెం బియ్యం పిండి కలిపి నానబెట్టేస్తే పూర్ణాలు సిద్ధమవుతాయి.",
    "[03:35:17] ఈ రెసిపీస్ అన్నీ కూడా నేను మీకు కింద డిస్క్రిప్షన్ బాక్స్ లో ఉంచానని మాత్రం గుర్తుంచుకోండి.",
    "[03:39:357] ఇంకా మీరు చాలా క్విక్ గా, తప్పనిసరిగా చేయాల్సిన రెసిపీ పానకం ఉండేలా చూసుకోండి.",
    "[03:44:277] జస్ట్ ఐదు నిమిషాల్లో తయారైపోతుంది పానకం.",
    "[03:46:427] ఆ రెసిపీ కూడా కింద డిస్క్రిప్షన్ బాక్స్ లో ఉంది.",
    "[03:49:87] మీరు తడి బియ్యం గానీ ముందు రోజే సిద్ధం చేసుకున్నట్లయితే, మీరు సులభంగా పాల తాలికలు చేయగలరు.",
    "[03:53:877] ఇంకా నేను రేపు పెట్టబోయేటువంటి బెల్లం, కొబ్బరి కుడుములు కూడా చేసేయొచ్చు.",
    "[03:57:177] పాల తాలికలు, రవ్వ ఉండ్రాళ్ళు ఇవేవీ వద్దనుకుంటే, సింపుల్ గా మోదకాలు కూడా చేసుకోవచ్చు.",
    "[04:02:467] ఇంకా మీకు ఓపిక ఉండి, చేసుకోగలను అనుకుంటే చక్కెర పొంగలి చేసుకోండి.",
    "[04:06:477] Vismai Food ఛానల్ లో పరమాన్నం రెసిపీ లేదు.",
    "[04:08:707] కానీ మీరు ఆ రెసిపీ కూడా చేసుకోవచ్చు.",
    "[04:11:157] ఈ ప్రసాదాలలో నేను కొన్ని చెప్పకపోవచ్చు.",
    "[04:13:287] కొన్ని ఎక్కువ అవ్వచ్చు, తక్కువ అవ్వచ్చు.",
    "[04:15:107] తప్పక ఉండాల్సి ఉండొచ్చు, లేకపోవచ్చు.",
    "[04:17:667] అయినా ఏమీ పర్వాలేదు, భగవంతుడికి ఏమీ కోపం రాదు.",
    "[04:20:537] కాబట్టి సాధ్యమైనంత వరకు మనశ్శాంతిగా ఉండేలా ప్రసాదాలు తయారు చేసుకోండి.",
    "[04:25:357] నేను డివైడ్ చేసిన కాలమ్స్ అన్నింటిలో మీరు ఒక్కొక్క రెసిపీ చేసినా, కనీసం 8 నుంచి 9 రెసిపీస్ అవుతాయి.",
    "[04:30:577] ఇవన్నీ చేయడానికి మీకు కనీసం 3 నుంచి 4 గంటల టైం పడుతుంది.",
    "[04:34:67] అంటే మీరు ఉదయం 6:00 గంటలకల్లా వంట మొదలు పెట్టేసినట్లయితే, 10:00 గంటల లోపే మీరు పూజ మొదలుపెట్టేయగలరు.",
    "[04:40:537] అంటే 11:00, 12:00 ఇంటి లోపు మీరు కచ్చితంగా భోజనాలు కూడా ముగించేయగలుగుతారు.",
    "[04:45:117] ఇంకా మీకు చాలా క్విక్ గా కూడా అయిపోవచ్చు.",
    "[04:46:777] కానీ మీరు చేసుకునే ప్లానింగ్ ని బట్టి ఆధారపడి ఉంది.",
    "[04:49:987] ఇక్కడ నేను ప్రస్తావించిన ప్రతీ రెసిపీ లింక్ కింద డిస్క్రిప్షన్ బాక్స్ లో ఉంచాను చూడండి.",
    "[04:55:407] ఈ పండగని Vismai Food ప్రసాదాలతో మనసారా ఆస్వాదించాలని కోరుకుంటోంది Vismai Food టీం."
  ],
  "transcription_english": [
    "[00:00:237] Hello Foodies, welcome to Vismai Food.",
    "[00:02:377] Happy Vinayaka Chavithi wishes to all Vismai Food viewers.",
    "[00:05:527] The Vismai Food team wishes that Lord Ganesha blesses you all with good intellect, success, and his constant grace.",
    "[00:12:447] Vinayaka Chavithi means a lot of celebration in every home.",
    "[00:14:737] Along with that comes a lot of rush.",
    "[00:16:117] There are arguments, sulking, and shouting because things didn't go as planned or weren't offered on time.",
    "[00:21:287] By the time everyone finally sits for the puja, it's 12:00 or 1:00 in the afternoon.",
    "[00:25:287] On one hand, there's hunger, and on the other, there's no peace.",
    "[00:28:347] Many people feel like they just performed the puja for the sake of it.",
    "[00:31:227] Watch this video until the end to learn how to conclude the festival happily and peacefully.",
    "[00:36:347] Firstly, the Vismai Food channel has plenty of prasadam recipes.",
    "[00:39:797] I have specially curated and placed them all in one place on the vismaifood.com website under the name 'Chavithi Prasadalu'.",
    "[00:45:677] You can visit the website, read, and make them.",
    "[00:47:797] Alternatively, all the recipes I am suggesting are linked in the description box below.",
    "[00:52:137] You can make those as well.",
    "[00:54:927] Now for point number 1.",
    "[00:56:457] Plan everything for the prasadam one day in advance.",
    "[00:59:000] Sit down with a clear mind and make a list of the prasadam dishes you want to prepare.",
    "[01:04:167] Get all the necessary ingredients ready the day before.",
    "[01:08:147] For example, if you need wet rice flour, prepare it the day before, put it in a ziplock bag or a container, and keep it in the deep freezer. The next day, it will still be wet and will work just like fresh wet rice flour, remember that.",
    "[01:19:987] Also, crush the required amount of jaggery the day before.",
    "[01:23:597] The work becomes easier.",
    "[01:25:127] Prepare all such small things the day before.",
    "[01:28:907] Point number 2.",
    "[01:29:837] Don't plan to make only new and variety prasadam dishes on the festival day.",
    "[01:33:917] Don't venture into making prasadam you are not familiar with.",
    "[01:36:747] Among the prasadams you make, try one or two new varieties.",
    "[01:40:877] For the rest, make only the ones you already know how to make.",
    "[01:44:667] This makes the work easier and you can do it faster.",
    "[01:47:677] Also, you can make quick dishes like Rava Kesari, Atukula Rava Kesari, Instant Challa Garelu.",
    "[01:53:577] They get ready very quickly.",
    "[01:54:627] It all depends on how you plan.",
    "[01:57:607] Point number 3.",
    "[01:58:657] Don't set rules like you must make a certain number of prasadams, like 11, 9, or 6.",
    "[02:03:977] Make as many as you can comfortably and with a peaceful mind.",
    "[02:07:377] That is what's important.",
    "[02:08:417] Only then can you finish cooking peacefully and spend more time at the puja.",
    "[02:13:467] Point number 4.",
    "[02:14:487] Whatever time you usually wake up, you must start cooking at that time on the festival day.",
    "[02:21:637] Only then will your prasadam be ready quickly.",
    "[02:23:437] Make sure your family members are also done with their baths.",
    "[02:26:157] That way, they can help you with the prasadam preparation and other household chores.",
    "[02:31:857] Since you'll be making a lot of prasadam anyway, if you make a dal and a chutney without onion and garlic on the festival day, you can finish the cooking for lunch at the same time as the prasadam.",
    "[02:42:377] Now, I'll tell you what prasadam to make.",
    "[02:44:747] The channel has two types of pulihora.",
    "[02:46:587] Along with that, if you like, there's also a ready-made pulihora paste.",
    "[02:49:577] If you prepare that the day before, the work becomes very easy.",
    "[02:54:197] When cooking rice for pulihora, if you cook a little extra, you can take some of that rice, add tempering and curd to it, and daddojanam will be ready.",
    "[03:02:647] Similarly, if you plan and cook a little more rice, that same rice will be enough for lunch.",
    "[03:07:957] When you soak urad dal, if you plan for two or three recipes instead of just one, you can grind the batter all at once.",
    "[03:16:797] With the same urad dal batter, you can make garelu.",
    "[03:19:147] Make a little syrup and add them to it to make paakam garelu.",
    "[03:22:157] If you add curd, they become perugu vadalu.",
    "[03:24:267] If you add a little idli rava, let it soak for half an hour, and make them without onion, you can also make punukulu.",
    "[03:29:417] Furthermore, if you mix a little rice flour into this same idli batter and let it soak, poornalu will be ready.",
    "[03:35:17] Remember that I have provided the links for all these recipes in the description box below.",
    "[03:39:357] Also, a recipe you must make quickly and surely is panakam.",
    "[03:44:277] Panakam can be prepared in just five minutes.",
    "[03:46:427] That recipe is also in the description box below.",
    "[03:49:87] If you prepare the wet rice flour the day before, you can easily make paala talikalu.",
    "[03:53:877] And you can also make the bellam kobbari kudumulu that I will be posting tomorrow.",
    "[03:57:177] If you don't want paala talikalu or rava undrallu, you can simply make modak as well.",
    "[04:02:467] And if you have the patience and feel you can do it, make sakkarai pongal.",
    "[04:06:477] The Vismai Food channel doesn't have a paramannam recipe.",
    "[04:08:707] But you can make that recipe too.",
    "[04:11:157] I may have missed some prasadams here.",
    "[04:13:287] There could be more or less.",
    "[04:15:107] Some might be mandatory, some might not be.",
    "[04:17:667] Even so, it's okay, God won't be angry.",
    "[04:20:537] Therefore, prepare the prasadam in a way that allows you to be as peaceful as possible.",
    "[04:25:357] If you make one recipe from each of the columns I've divided, you'll have at least 8 to 9 recipes.",
    "[04:30:577] To make all of these, you will need at least 3 to 4 hours.",
    "[04:34:67] This means if you start cooking by 6:00 AM, you can start the puja before 10:00 AM.",
    "[04:40:537] That means you can definitely finish your lunch before 11:00 or 12:00.",
    "[04:45:117] You might even finish much quicker.",
    "[04:46:777] But it depends on your planning.",
    "[04:49:987] I have placed the link for every recipe mentioned here in the description box below, please check.",
    "[04:55:407] The Vismai Food team wishes that you enjoy this festival wholeheartedly with Vismai Food's prasadams."
  ]
}