{
  "metadata": {
    "title": "Bellam Kudumulu | బెల్లం కుడుములు | Vinayaka Chavithi Prasadam | Ganesh Chaturthi Recipes | Kudumulu",
    "channel_name": "Vismai Food",
    "publish_date": "2021-09-08",
    "view_count": 315682,
    "like_count": 7800,
    "duration": "01:57",
    "language": "Telugu",
    "video_id": "8T4U2oI6v1c",
    "url": "https://www.youtube.com/watch?v=8T4U2oI6v1c",
    "description": "A recipe for Bellam Kudumulu, a traditional sweet offered to Lord Ganesha during the Vinayaka Chavithi festival. This healthy and tasty dish is also prepared for housewarming ceremonies.",
    "ingredients_detected": [
      "Water",
      "Chanadal",
      "Jaggery",
      "Fresh Coconut grated",
      "Cardamom Powder",
      "Wet Rice Flour/Rice Flour",
      "Ghee"
    ]
  },
  "transcription_telugu": [
    "[00:00:237] Hello Foodies, welcome to Vismai Food.",
    "[00:02:407] ఇవాల్టి స్పెషల్ వినాయక చవితి స్పెషల్ బెల్లం కుడుములు.",
    "[00:05:327] వినాయకుడికి ఎంతో ప్రీతి ఐనవంటే ఈ కుడుముల్ని ఇంటి గృహప్రవేశాలప్పుడు ప్రతీ ఒక్కరూ చేస్తూ ఉంటారు.",
    "[00:10:737] చాలా చాలా బాగుంటాయి, చాలా హెల్దీ కూడా.",
    "[00:12:877] ఈ పండక్కి ఇలాంటి క్విక్ అండ్ ఈజీ ప్రసాదాలు ప్లాన్ చేయండి.",
    "[00:15:377] ఈజీగా అయిపోతాయి.",
    "[00:16:877] చాలా చాలా బాగుంటాయి ఈ ప్రసాదాలు.",
    "[00:18:497] Let's start.",
    "[00:21:297] ముందుగా 300ml నీళ్లు మరిగించుకోండి.",
    "[00:24:27] ఇందులో గంటపాటు నానబెట్టినటువంటి పచ్చిశనగపప్పు రెండు టేబుల్ స్పూన్స్ వేసి మెత్తగా ఉడకనివ్వండి.",
    "[00:29:137] తెలంగాణలో చాలామంది పచ్చిశనగపప్పుకి బదులు బొబ్బర్లు కూడా వాడతారు.",
    "[00:32:517] నచ్చితే అవీ కూడా వేసుకోండి.",
    "[00:34:947] ఇప్పుడు ఇందులో ముప్పావు కప్పు బెల్లం తురుము వేసి కరిగించండి.",
    "[00:37:657] బెల్లం కరిగాక రెండు టేబుల్ స్పూన్ల పచ్చి కొబ్బరి తురుము వేసి, బాగా కలుపుకొని పాకం ఓ పొంగు రానివ్వండి.",
    "[00:45:907] పాకం ఓ పొంగు వచ్చాక ఓ టీ స్పూన్ యాలకులపొడి, ఓ కప్పు తడి బియ్యం పిండి వేసి కొద్దికొద్దిగా పోసుకుంటూ పిండి బాగా ముద్దగా అయ్యేంతవరకు కలుపుకోండి.",
    "[00:56:887] పిండి కాస్త గట్టిపడగానే స్టవ్ ఆపేసి కలుపుకోండి.",
    "[00:59:337] మరింత గట్టిపడుతుంది.",
    "[01:01:547] ఇప్పుడు దీన్ని చల్లారనివ్వండి.",
    "[01:03:977] పిండి గోరువెచ్చగా ఉన్నప్పుడు చేతులకి నెయ్యి రాసుకొని బాగా కలుపుకొని, ఇలా ముట్టీల షేప్ లో చేసుకోండి.",
    "[01:15:377] లేదంటారా, మీరు బాల్స్ గా చేసుకోవచ్చు, అరిసెల్లా ఫ్లాట్ గా కూడా ఒత్తుకోవచ్చు.",
    "[01:19:157] మీకు నచ్చిన షేప్ లో మీరు చేసుకోవచ్చు.",
    "[01:21:47] ఇప్పుడు ఇలాంటి స్టీమర్ ని గ్రీస్ చేసుకోండి.",
    "[01:23:257] ఇవి లేనివారు ఇడ్లీ ప్లేట్స్ ని స్టీమ్ చేసుకోండి.",
    "[01:26:227] ఇప్పుడు దీన్ని మరుగుతున్న నీళ్లలో పెట్టి దాని మీద కుడుములన్నీ పెట్టి మూత పెట్టి 8 నిమిషాల పాటు మీడియం ఫ్లేమ్ మీద స్టీమ్ చేసుకోండి.",
    "[01:34:577] ఆ తర్వాత దింపి సర్వ్ చేసుకోండి.",
    "[01:36:997] ఇందులోనే బోల్డన్ని కారం కుడుములు చేస్తారు తెలంగాణలో.",
    "[01:39:577] అవి చాలా ఫేమస్.",
    "[01:40:777] అవన్నీ నేను మీకు మరో సందర్భంలో చెప్తాను.",
    "[01:42:997] ఇవి మీకు కనీసం మూడు నాలుగు రోజుల పాటు నిల్వ ఉంటాయి కూడా.",
    "[01:45:987] అన్నీ రెడీగా ఉంటే జస్ట్ 10 అంటే 10 నిమిషాలు అంతే.",
    "[01:49:577] నచ్చిందా?",
    "[01:50:337] మరి అయితే మీరు ట్రై చేసి మీకు ఎలా కుదిరిందో కచ్చితంగా ఆ పిక్ ని Vismai Food Instagram లో పోస్ట్ చేయండి.",
    "[01:54:337] బై ద వే vismaifood.com వెబ్సైట్ విజిట్ చేయడం అస్సలు మర్చిపోకండి."
  ],
  "transcription_english": [
    "[00:00:237] Hello Foodies, welcome to Vismai Food.",
    "[00:02:407] Today's special is Vinayaka Chavithi special Bellam Kudumulu.",
    "[00:05:327] These kudumulu are very dear to Lord Vinayaka and are also made by everyone for housewarming ceremonies.",
    "[00:10:737] They are very, very good and also very healthy.",
    "[00:12:877] For this festival, plan such quick and easy prasadams.",
    "[00:15:377] They are easy to make.",
    "[00:16:877] These prasadams are very, very good.",
    "[00:18:497] Let's start.",
    "[00:21:297] First, boil 300ml of water.",
    "[00:24:27] Add two tablespoons of chana dal soaked for an hour and let it cook until soft.",
    "[00:29:137] In Telangana, many people use black-eyed peas instead of chana dal.",
    "[00:32:517] If you like, you can add those too.",
    "[00:34:947] Now, add three-fourths of a cup of grated jaggery and let it dissolve.",
    "[00:37:657] After the jaggery dissolves, add two tablespoons of fresh coconut gratings, mix well, and let the syrup come to a boil.",
    "[00:45:907] Once the syrup comes to a boil, add one teaspoon of cardamom powder and one cup of wet rice flour, adding it little by little and stirring until the flour forms a thick dough.",
    "[00:56:887] As soon as the dough thickens a bit, turn off the stove and mix.",
    "[00:59:337] It will thicken further.",
    "[01:01:547] Now, let this cool down.",
    "[01:03:977] When the dough is lukewarm, grease your hands with ghee, knead it well, and shape them into 'muttila' (fist) shape.",
    "[01:15:377] Alternatively, you can make them into balls or flatten them like ariselu.",
    "[01:19:157] You can make them in any shape you like.",
    "[01:21:47] Now, grease a steamer like this.",
    "[01:23:257] Those who don't have this can steam them in idli plates.",
    "[01:26:227] Now, place this in boiling water, place all the kudumulu on it, cover with a lid, and steam on medium flame for 8 minutes.",
    "[01:34:577] After that, take them out and serve.",
    "[01:36:997] In Telangana, they also make a lot of savory kudumulu.",
    "[01:39:577] They are very famous.",
    "[01:40:777] I will tell you about all of those on another occasion.",
    "[01:42:997] These can also be stored for at least three to four days.",
    "[01:45:987] If everything is ready, it takes just 10 minutes, that's it.",
    "[01:49:577] Did you like it?",
    "[01:50:337] Then, you try it and be sure to post a picture of how it turned out for you on Vismai Food's Instagram.",
    "[01:54:337] By the way, don't forget to visit vismaifood.com website."
  ]
}