{
  "metadata": {
    "title": "Karivepaku Karam | కరివేపాకు కారం | Perfect Andhra Style Curry Leaves Powder | Vismai Food Recipes",
    "channel_name": "Vismai Food",
    "publish_date": "2021-02-18",
    "view_count": 1357984,
    "like_count": 23000,
    "duration": "01:59",
    "language": "Telugu",
    "video_id": "G9aQ1dI1tYk",
    "url": "https://www.youtube.com/watch?v=G9aQ1dI1tYk",
    "description": "A detailed recipe for making perfect Andhra-style Karivepaku Karam (Curry Leaves Powder). This versatile powder can be enjoyed with idli, dosa, and hot rice with ghee.",
    "ingredients_detected": [
      "Oil",
      "Chana Dal",
      "Urad Dal",
      "Coriander",
      "Dry Chillies",
      "Curry leaves",
      "Cumin",
      "Tamarind",
      "Turmeric",
      "Salt"
    ]
  },
  "transcription_telugu": [
    "[00:00:158] Hello Foodies, welcome to Vismai Food.",
    "[00:02:168] ఇవాల్టి స్పెషల్ కరివేపాకు కారం.",
    "[00:04:308] ఛానల్ లో ఎందరో సబ్స్క్రైబర్స్ రిక్వెస్ట్ చేసిన రెసిపీ ఇది.",
    "[00:07:238] మీకు చాలా పర్ఫెక్ట్ గా వస్తుంది ఈ కొలతలతో చేస్తే.",
    "[00:09:968] ఇడ్లీ, అట్టులోకి చాలా చాలా బాగుంటుంది.",
    "[00:12:38] ఇంకా వేడి వేడి అన్నంలో నెయ్యి వేసుకొని కరివేపాకు కారం వేసుకొని తింటే ప్రత్యేకంగా చెప్పక్కర్లేదు.",
    "[00:16:898] ఇంకా మీరు చికెన్ ఫ్రై గాని చేస్తున్నట్లయితే, ఆఖరిన కరివేపాకు కారం కాస్త జల్లి చూడండి, మస్త్ ఉంటది.",
    "[00:22:158] ఆ రెసిపీ నేను మీకు మరోసారి చెప్తాను.",
    "[00:23:688] Let's start the best కరివేపాకు కారం పొడి.",
    "[00:26:658] ముందుగా మూకుట్లో రెండు టేబుల్ స్పూన్ల ఆయిల్ హీట్ చేసి అందులో రెండు టేబుల్ స్పూన్ల శనగపప్పు, మూడు టేబుల్ స్పూన్ల మినప్పప్పు వేసి కేవలం మీడియం ఫ్లేమ్ మీద బాగా కలుపుతూ మంచి అరోమా వచ్చేంత వరకు ఫ్రై చేసుకోండి.",
    "[00:38:648] టైం తీసుకొని బాగా వేపితే చాలా అరోమాటిక్ గా ఉంటుంది ఈ పౌడర్.",
    "[00:41:888] ఇవి సగం పైన వేగాక అప్పుడు మూడు టేబుల్ స్పూన్ల ధనియాలు వేసి వేపుకోండి.",
    "[00:45:518] కేవలం మీడియం ఫ్లేమ్ మీదే.",
    "[00:48:88] ధనియాలు కూడా బాగా వేగాక అప్పుడు ఓ 20 ఎండుమిర్చి వేసి మరో రెండు మూడు నిమిషాల పాటు వేపుకోండి.",
    "[00:54:148] హై క్వాలిటీ ఎండుమిర్చి వాడుకుంటే సరైన కారం ఉంటుంది.",
    "[00:57:738] ఎండుమిర్చి కూడా వేగాక 50 గ్రాములు కడిగి నీడన ఆరబెట్టినటువంటి ముదురు కరివేపాకు వేసి, జస్ట్ ఓ రెండు మూడు నిమిషాల పాటు వేపుకోండి చాలు.",
    "[01:06:408] కరివేపాకు ఎక్కువగా వేపితే ఆకులోని ఫ్లేవర్ మిస్ అయిపోతుంది, కారం పొడిలో ఏ ఫ్లేవర్ ఉండదు.",
    "[01:11:888] కొన్ని నెలల క్రితం ఛానల్ లో నల్ల కారం కూడా అప్లోడ్ చేశాం.",
    "[01:13:588] అది కూడా మీరు ట్రై చేయండి, చాలా చాలా బాగుంటుంది.",
    "[01:16:38] నల్ల కారం రెసిపీ లింక్ కింద డిస్క్రిప్షన్ బాక్స్ లో ఉంది చూడండి.",
    "[01:20:98] దింపేముందు ఓ టీ స్పూన్ జీలకర్ర వేసుకొని దింపేసుకోండి.",
    "[01:26:228] చల్లారాక మిక్సీ జార్ లో వేసుకోండి.",
    "[01:30:608] తర్వాత నిమ్మకాయ సైజు అంత చింతపండు, అర టీ స్పూన్ పసుపు, రుచికి సరిపడా సాల్ట్ వేసి మెత్తగా గ్రైండ్ చేసుకోండి.",
    "[01:37:378] దంచితే ఇంకా ఇంకా బాగుంటుంది ఈ పౌడర్ మిక్సీలో వేసిన దానికంటే.",
    "[01:40:958] కుదిరితే అలాగే చేయండి.",
    "[01:42:618] అంతే, you are done.",
    "[01:43:898] స్పైసీ కరివేపాకు కారం పొడి రెడీ.",
    "[01:46:208] ఇది మీరు అన్నం, ఇడ్లీ, అట్టు దేనిలో తిన్నా చాలా చాలా బాగుంటుంది.",
    "[01:50:888] నచ్చిందా?",
    "[01:51:718] మరి అయితే మీరు ట్రై చేసి మీకు ఎలా కుదిరిందో కచ్చితంగా ఆ పిక్ ని Vismai Food Instagram లో పోస్ట్ చేయండి.",
    "[01:56:178] బై ద వే vismaifood.com వెబ్సైట్ విజిట్ చేయండి, మరిన్ని రెసిపీస్ కోసం."
  ],
  "transcription_english": [
    "[00:00:158] Hello Foodies, welcome to Vismai Food.",
    "[00:02:168] Today's special is Karivepaku Karam (Curry Leaves Powder).",
    "[00:04:308] This is a recipe requested by many subscribers on the channel.",
    "[00:07:238] It will turn out perfectly for you if you make it with these measurements.",
    "[00:09:968] It's very, very good with idli and dosa.",
    "[00:12:38] And needless to say, it's delicious when mixed with hot rice and ghee.",
    "[00:16:898] Also, if you are making chicken fry, try sprinkling a little of this curry leaves powder at the end, it will be amazing.",
    "[00:22:158] I will share that recipe with you another time.",
    "[00:23:688] Let's start the best Karivepaku Karam powder.",
    "[00:26:658] First, heat two tablespoons of oil in a pan, add two tablespoons of chana dal, three tablespoons of urad dal, and fry only on medium flame, stirring well, until a nice aroma comes out.",
    "[00:38:648] If you take your time and roast it well, this powder will be very aromatic.",
    "[00:41:888] When they are more than half fried, add three tablespoons of coriander seeds and fry.",
    "[00:45:518] Only on medium flame.",
    "[00:48:88] After the coriander seeds are also well fried, add about 20 dry red chilies and fry for another two to three minutes.",
    "[00:54:148] If you use high-quality dry red chilies, you will get the right amount of spice.",
    "[00:57:738] After the dry red chilies are also fried, add 50 grams of mature curry leaves that have been washed and shade-dried, and just fry for two to three minutes, that's enough.",
    "[01:06:408] If you fry the curry leaves too much, the flavor of the leaves will be lost, and the spice powder will have no flavor.",
    "[01:11:888] A few months ago, we also uploaded Nalla Karam (black spice powder) on the channel.",
    "[01:13:588] You can try that too, it's very, very good.",
    "[01:16:38] The link to the Nalla Karam recipe is in the description box below, please check.",
    "[01:20:98] Before taking it off the heat, add one teaspoon of cumin and then remove it.",
    "[01:26:228] After it cools down, put it in a mixer jar.",
    "[01:30:608] Then, add a lemon-sized piece of tamarind, half a teaspoon of turmeric, and salt to taste, and grind it into a fine powder.",
    "[01:37:378] This powder tastes even better if it is pounded rather than ground in a mixer.",
    "[01:40:958] If possible, do it that way.",
    "[01:42:618] That's it, you are done.",
    "[01:43:898] Spicy Karivepaku Karam powder is ready.",
    "[01:46:208] It tastes very, very good with rice, idli, or dosa.",
    "[01:50:888] Did you like it?",
    "[01:51:718] Then, you try it and be sure to post a picture of how it turned out for you on Vismai Food's Instagram.",
    "[01:56:178] By the way, visit the vismaifood.com website for more recipes."
  ]
}