{
  "metadata": {
    "title": "Sorakaya Kobbari Pala Kura | సొరకాయ కొబ్బరి పాల కూర | Bottle gourd with Coconut Milk | Vismai Food",
    "channel_name": "Vismai Food",
    "publish_date": "2019-07-25",
    "view_count": 890833,
    "like_count": 13000,
    "duration": "02:03",
    "language": "Telugu",
    "video_id": "8i4U2w5d0_M",
    "url": "https://www.youtube.com/watch?v=8i4U2w5d0_M",
    "description": "A recipe for Sorakaya Kobbari Pala Kura (Bottle Gourd with Coconut Milk), a healthy and tasty dish particularly suitable for hot climates and those with health issues like acidity, BP, and sugar.",
    "ingredients_detected": [
      "Curd",
      "Water",
      "Bottle Gourd",
      "Salt",
      "Curry leaves",
      "Green Chillies",
      "Coconut Milk",
      "Oil",
      "Mustard",
      "Cumin",
      "Dry Chillies"
    ]
  },
  "transcription_telugu": [
    "[00:00:248] Hey Foodies, welcome to Vismai Food.",
    "[00:02:188] ఇవాల్టి స్పెషల్ సొరకాయ కొబ్బరి పాల కూర.",
    "[00:05:328] ఇది ప్రత్యేకించి వేడి వాతావరణం ఉండేటువంటి దక్షిణాది రాష్ట్రాల వారికి చాలా పర్ఫెక్ట్.",
    "[00:09:638] శరీరం ఎప్పుడూ వేడి చేస్తూ ఉన్నా, అరికాళ్ల మంటలు, కడుపు మంట, గ్యాస్ ప్రాబ్లం, బీపీ, షుగర్లు ఇలాంటి వాటితో పాటు బరువు తగ్గాలనుకునేవారు కూడా ఇలాంటి కమ్మటి కూరలు తింటే ఎంతో గుణం కనిపిస్తుంది.",
    "[00:20:418] చూడటానికి చాలా సింపుల్ గా అనిపించొచ్చు ఈ కూర.",
    "[00:22:98] కానీ రుచిలోనూ ఆరోగ్యపరంగానూ ఎంతో మేలు చేస్తుంది ఈ కూర.",
    "[00:25:618] Let's start.",
    "[00:26:478] ముందుగా అర కప్పు కమ్మటి పెరుగు తీసుకోండి.",
    "[00:28:448] అందులో 200 ml నీళ్లు పోసి బాగా కలుపుకోండి.",
    "[00:33:918] తర్వాత అర కిలో లేత సొరకాయ ముక్కలు చెక్కు తీసినవి వేసుకోండి.",
    "[00:37:638] ఇప్పుడు స్టవ్ ఆన్ చేసి బాగా కలుపుకొని, సాల్ట్, రెండు రెబ్బల కరివేపాకు, మూడు పచ్చిమిర్చి చీలికలు వేసి బాగా కలుపుకొని, మూత పెట్టి మీడియం ఫ్లేమ్ మీద మజ్జిగలో ముక్క మెత్తబడి, మజ్జిగ ఆల్మోస్ట్ ఇగిరిపోయేంతవరకు కుక్ చేసుకోవాలి.",
    "[00:57:488] ఆల్మోస్ట్ అంతా కుక్ అయిపోయాక ఇప్పుడు 300 ml చిక్కటి కొబ్బరిపాలు పోసి, బాగా కలుపుకొని, మూత పెట్టి పాలు ఇగిరిపోయేంత వరకు కుక్ చేసుకోండి.",
    "[01:06:218] ఇలాంటి కూరలు చేసుకొని తింటే ఎక్కువ కూర తినగలుగుతారు.",
    "[01:09:298] బీపీలు, షుగర్లు ఉన్నవాళ్లే కాదు, ఎదిగే పిల్లలకు కూడా చాలా మంచిది.",
    "[01:13:588] ఇది మీరు ఒక్కసారి నా మాట నమ్మి ట్రై చేసి చూడండి.",
    "[01:15:938] 'నిజమేనండి, మీరు చెప్పింది, చాలా బాగుంది, మా ఇంట్లో అందరికీ నచ్చింది' అని అనక మానరు.",
    "[01:20:648] అంత బాగుంటుంది.",
    "[01:21:658] ఇంకా ఇది ఇలా కాస్త పాలు ఉండగానే దింపేసుకోండి.",
    "[01:25:218] ఇప్పుడు ఒక టేబుల్ స్పూన్ నూనె వేడి చేసి, అందులో ఒక టీ స్పూన్ ఆవాలు, అర టీ స్పూన్ జీలకర్ర, రెండు ఎండుమిర్చి వేసి వేపుకొని కూరలో కలుపుకోండి.",
    "[01:34:108] ఈ కూర కారంగా ఉండనే ఉండకూడదు, ఉండదు కూడా.",
    "[01:36:718] కారం, పసుపు ఇలాంటివి ఈ కూరలో వేయకండి.",
    "[01:39:628] మీకు కారం అంతా వేసిన ఆ రెండు మూడు పచ్చిమిర్చి, తాలింపులో వేసినటువంటి ఎండుమిర్చి నుండే రావాలి, వస్తుంది.",
    "[01:45:628] ఈ కూర ఇంతే కమ్మగా ఉంటుంది.",
    "[01:47:498] తిన్న తర్వాత చాలా హాయిగా ఉంటుంది పొట్టకి.",
    "[01:50:528] నచ్చిందా మీకు?",
    "[01:51:718] నిజంగా నచ్చి తీరుతుంది.",
    "[01:53:238] మీరొకసారి ట్రై చేసి మీకు ఎలా కుదిరిందో కచ్చితంగా ఆ విషయాన్ని కామెంట్ బాక్స్ లో తెలియజేయండి.",
    "[01:57:438] తయారు చేసిన ఆ పిక్ ని Vismai Food Instagram లో పోస్ట్ చేయండి.",
    "[02:00:278] మరిన్ని రెసిపీస్ కోసం vismaifood.com వెబ్సైట్ విజిట్ చేయండి."
  ],
  "transcription_english": [
    "[00:00:248] Hey Foodies, welcome to Vismai Food.",
    "[00:02:188] Today's special is Sorakaya Kobbari Pala Kura (Bottle Gourd with Coconut Milk).",
    "[00:05:328] This is particularly perfect for the people of the southern states with a hot climate.",
    "[00:09:638] This tasty curry provides great benefits for those who often have body heat, burning sensation in the feet, stomach irritation, gas problems, BP, and sugar, as well as for those who want to lose weight.",
    "[00:20:418] This curry might look very simple.",
    "[00:22:98] But this curry is very beneficial in terms of taste and health.",
    "[00:25:618] Let's start.",
    "[00:26:478] First, take half a cup of fresh curd.",
    "[00:28:448] Add 200 ml of water to it and mix well.",
    "[00:33:918] Then, add half a kilo of peeled and cubed tender bottle gourd pieces.",
    "[00:37:638] Now, turn on the stove, mix well, add salt, two sprigs of curry leaves, three slit green chilies, mix well, cover and cook on medium flame until the bottle gourd pieces are soft in the buttermilk and the buttermilk is almost absorbed.",
    "[00:57:488] When it's almost cooked, add 300 ml of thick coconut milk, mix well, cover, and cook until the milk is absorbed.",
    "[01:06:218] If you make and eat such curries, you can eat more curry.",
    "[01:09:298] It's very good not just for people with BP and sugar, but also for growing children.",
    "[01:13:588] You must try this once, trusting my word.",
    "[01:15:938] You will surely say, 'It's true what you said, it's very good, everyone in my house liked it.'",
    "[01:20:648] It's that good.",
    "[01:21:658] Also, take it off the heat when there is still some milk left.",
    "[01:25:218] Now, heat one tablespoon of oil, add one teaspoon of mustard seeds, half a teaspoon of cumin, and two dry red chilies, fry them, and add to the curry.",
    "[01:34:108] This curry should not be spicy, and it won't be.",
    "[01:36:718] Don't add chili powder, turmeric, etc., to this curry.",
    "[01:39:628] All the spice should come from the two or three green chilies and the dry red chilies used in the tempering, and it will.",
    "[01:45:628] This curry is just this, tasty.",
    "[01:47:498] After eating, the stomach feels very light.",
    "[01:50:528] Did you like it?",
    "[01:51:718] You will surely like it.",
    "[01:53:238] You try it once and be sure to let us know how it turned out for you in the comment box.",
    "[01:57:438] Post the picture of the dish you made on Vismai Food's Instagram.",
    "[02:00:278] For more recipes, visit the vismaifood.com website."
  ]
}