{
  "metadata": {
    "title": "పల్లీ చింతకాయ రోటి పచ్చడి| ఓ సారి దోశ ఇడ్లి లోకి ఇది తిని చుడండి| #PeanutChutney for Tiffins",
    "channel_name": "Vismai Food",
    "publish_date": "2018-11-13",
    "view_count": 350384,
    "like_count": 3464,
    "duration": "02:09",
    "language": "Telugu",
    "video_id": "KakOYr6u9A8",
    "url": "https://www.youtube.com/watch?v=KakOYr6u9A8",
    "description": "Unique and tasty Peanut Chutney with raw tamarind for idli and dosa by Vismai Food.",
    "ingredients_detected": [
      "1 Cup Peanuts",
      "1 tsp Oil",
      "10-12 Green Chillies",
      "1/2 Cup Fresh Coconut pieces",
      "3-4 Raw Tamarind (Chintakayalu) - boiled/steamed",
      "Salt (to taste)",
      "4-5 Garlic pods",
      "1/2 tsp Cumin seeds",
      "2 tbsps Oil (for tempering)",
      "1 tsp Mustard seeds",
      "1 tsp Urad dal",
      "2 Dry Red chillies",
      "1 Sprig Curry leaves",
      "1/4 tsp Asafoetida (Hing)"
    ]
  },
  "transcription_telugu": [
    "[00:00:00.000] హలో ఫుడీస్, వెల్కమ్ టు విస్మయ్ ఫుడ్. ఇవాల్టి స్పెషల్ పల్లీ చింతకాయ రోటి పచ్చడి.",
    "[00:00:10.000] మామూలుగా చేసే పల్లీ చట్నీ కంటే ఇది చాలా డిఫరెంట్ గా, టేస్టీగా ఉంటుంది. ఇడ్లీ, దోశల్లోకి అద్భుతంగా ఉంటుంది.",
    "[00:00:22.000] ముందుగా ఒక కప్పు పల్లీలను లో ఫ్లేమ్ మీద దోరగా వేయించి పొట్టు తీసి పక్కన పెట్టుకోండి.",
    "[00:00:35.000] ఒక టీస్పూన్ ఆయిల్ హీట్ చేసి 10-12 పచ్చిమిర్చిని వేయించి పక్కన ఉంచండి.",
    "[00:00:45.000] చింతకాయలను కొద్దిగా నీళ్లలో వేసి మెత్తగా అయ్యే వరకు ఉడికించాలి. చల్లారాక పీచు, గింజలు తీసి గుజ్జును సిద్ధం చేసుకోండి.",
    "[00:01:00.000] మిక్సీ జార్ లో వేయించిన పల్లీలు, పచ్చిమిర్చి, పచ్చి కొబ్బరి ముక్కలు, ఉడికించిన చింతకాయ గుజ్జు వేయండి.",
    "[00:01:12.000] ఇందులో వెల్లుల్లి రెబ్బలు, జీలకర్ర, ఉప్పు వేసి తగినన్ని నీళ్లు పోసి మెత్తగా గ్రైండ్ చేసుకోండి.",
    "[00:01:25.000] పోపు కోసం రెండు టేబుల్ స్పూన్ల నూనె వేడి చేసి ఆవాలు, మినప్పప్పు, ఎండుమిర్చి, కరివేపాకు, ఇంగువ వేసి వేయించండి.",
    "[00:01:40.000] ఈ పోపును చట్నీలో కలిపితే ఎంతో రుచికరమైన పల్లీ చింతకాయ పచ్చడి రెడీ.",
    "[00:01:55.000] చింతకాయ సీజన్ లో ఈ పచ్చడిని తప్పకుండా ట్రై చేయండి. మీ ఫీడ్ బ్యాక్ మాకు చెప్పండి."
  ],
  "transcription_english": [
    "[00:00:00.000] Hello Foodies, welcome to Vismai Food. Today's special is Peanut Raw Tamarind Chutney.",
    "[00:00:10.000] This is very different and tastier than regular peanut chutney. It pairs perfectly with idli and dosa.",
    "[00:00:22.000] First, roast 1 cup of peanuts on low flame, remove the skin, and set aside.",
    "[00:00:35.000] Heat 1 tsp oil and fry 10-12 green chillies; keep them aside.",
    "[00:00:45.000] Boil raw tamarind in a little water until soft. Once cooled, remove the fiber and seeds to extract the pulp.",
    "[00:01:00.000] In a mixer jar, add roasted peanuts, green chillies, fresh coconut pieces, and the tamarind pulp.",
    "[00:01:12.000] Add garlic pods, cumin seeds, salt, and enough water; grind into a smooth paste.",
    "[00:01:25.000] For tempering, heat 2 tbsps oil and add mustard seeds, urad dal, dry red chillies, curry leaves, and asafoetida.",
    "[00:01:40.000] Mix this tempering into the chutney. The delicious Peanut Tamarind Chutney is ready.",
    "[00:01:55.000] Do try this chutney during the raw tamarind season and share your feedback with us."
  ]
}