{
  "metadata": {
    "title": "Boodida Gummadikaya Salad | బూడిద గుమ్మడికాయ సలాడ్ | Isha Foundation Special | Ash Gourd Salad | Vismai Food",
    "channel_name": "Vismai food",
    "publish_date": "2020-03-05",
    "view_count": 751265,
    "like_count": 14000,
    "duration": "02:00",
    "language": "Telugu",
    "video_id": "Xh0y_0n9B8I",
    "url": "https://www.youtube.com/watch?v=Xh0y_0n9B8I",
    "description": "A recipe for a special Ash Gourd Salad from the Isha Foundation, also referred to as 'amrutham' (nectar) for its numerous health benefits. The video claims that regular consumption for 15 days can lead to noticeable positive changes in the body, including weight loss, body cooling, improved sperm count, and control over blood pressure and acidity.",
    "ingredients_detected": [
      "Ash gourd",
      "Curd",
      "Pomegranate",
      "Black pepper Powder",
      "Salt",
      "Roasted Peanuts"
    ]
  },
  "transcription_telugu": [
    "[00:00:159] Hey Foodies, welcome to Vismai Food.",
    "[00:02:149] ఇవాల్టి స్పెషల్ ఈషా ఫౌండేషన్ స్పెషల్ బూడిద గుమ్మడికాయ సలాడ్.",
    "[00:06:559] దీన్నే నేను అమృతం అంటాను.",
    "[00:08:189] సరిగ్గా ఇది అమృతంలా పనిచేస్తుంది.",
    "[00:10:399] ఇది కనీసం ఓ 15 రోజుల పాటు క్రమం తప్పకుండా తింటే మీ శరీరంలో జరిగేటువంటి మార్పుల్ని మీరే చూస్తారు.",
    "[00:16:329] ఈ సలాడ్ శరీరానికి, మనసుకి కొత్త ప్రాణశక్తిని ఇస్తుంది.",
    "[00:20:419] ఈ సలాడ్ రుచికి రుచి ఆరోగ్యానికి ఆరోగ్యం.",
    "[00:23:449] మీకు హార్మోనల్ ఇంబ్యాలెన్స్ ఉన్నా, రాను రాను రంగు తగ్గిపోతున్నా, బీపీ, షుగర్లు ఇలాంటి వాటితో పాటు బరువు తగ్గాలనుకునే వాళ్ళు కూడా ఇలాంటి కమ్మటి సలాడ్ తింటే ఎంతో గుణం కనిపిస్తుంది.",
    "[00:30:19] మీకు చక్కటి ఆరోగ్యం కావాలనుకున్నా, ఎవరూ ఏది కోరుకున్నా ఈ సలాడ్ వాళ్ళకి పర్ఫెక్ట్.",
    "[00:33:639] Let's start.",
    "[00:34:319] ముందుగా 500 గ్రాముల బూడిద గుమ్మడికాయని చెక్కు తీసుకోండి.",
    "[00:39:279] చాలా చాలా రుచిగా ఉంటుంది.",
    "[00:41:9] అంతకు మించి కొన్ని వందల రెట్లు ఆరోగ్యాన్ని ఇస్తుంది.",
    "[00:45:9] ఇప్పుడు ఈ బూడిద గుమ్మడికాయని తురుముకోండి.",
    "[00:52:139] ఆ తర్వాత జల్లెడలో వేసి రసం పిండండి.",
    "[00:55:189] ఈ రసాన్ని అలా తాగేయొచ్చు, పారేయకండి.",
    "[00:57:129] కొబ్బరి బోండం కంటే కూడా గొప్ప హెల్త్ బెనిఫిట్స్ ఉన్నాయి ఈ రసంలో.",
    "[01:01:459] ఇది సరిగ్గా మీరు ఒక 15 రోజుల పాటు పొద్దున్న, సాయంత్రం తాగి చూడండి.",
    "[01:04:959] మీ శరీరంలో జరిగేటువంటి మార్పును మీరే చూస్తారు.",
    "[01:09:129] ఈ తురుములో అర చెంచాడు మిరియాల పొడి, రుచికి సరిపడా సాల్ట్, అర కప్పు దానిమ్మ గింజలు, పావు లీటర్ కమ్మటి తాజా పెరుగును మాత్రమే వేసి బాగా కలుపుకోండి.",
    "[01:18:619] మీకు నచ్చితే ఇందులో వేయించినటువంటి పల్లీలు వేసుకోండి, ఇంకా ఇంకా బాగుంటుంది దీని రుచి.",
    "[01:24:269] అంతే, you are done.",
    "[01:25:529] ఇది బరువు తగ్గాలనుకునే వారికి, చక్కని ఆరోగ్యం కావాలనుకునే వారికి, రోజు రోజుకి శరీరకాంతి తగ్గిపోతున్న వారికి, హార్మోనల్ ఇంబ్యాలెన్స్ ఉన్నవారికి, పురుషులలో వీర్యం ఉత్తేజితం అవ్వడానికి ఎంతగానో హెల్ప్ చేస్తుంది.",
    "[01:38:299] అసలు ఇది తిన్న రోజున మీ బాడీ ఎంత లైట్ గా ఫీల్ అవుతుందో చూడండి.",
    "[01:41:409] అస్సలు మత్తుని ఇవ్వనే ఇవ్వదు.",
    "[01:43:869] ఇది పసిపిల్లల నుంచి పెద్దవారి వరకు అందరూ, అన్ని వయసుల వారు, అన్ని సందర్భాల్లోనూ తీసుకోవచ్చు.",
    "[01:49:929] మీకు నచ్చిందా?",
    "[01:50:879] మరి అయితే మీరు ట్రై చేసి మీకు ఎలా కుదిరిందో కచ్చితంగా ఆ పిక్ ని Vismai Food Instagram లో పోస్ట్ చేయండి.",
    "[01:55:549] ఈ రెసిపీ గురించి మరింత ఇన్ఫర్మేషన్ కోసం vismaifood.com వెబ్సైట్ విజిట్ చేయండి."
  ],
  "transcription_english": [
    "[00:00:159] Hey Foodies, welcome to Vismai Food.",
    "[00:02:149] Today's special is Isha Foundation's special Ash Gourd Salad.",
    "[00:06:559] I call this 'Amrutham' (nectar).",
    "[00:08:189] It works exactly like nectar.",
    "[00:10:399] If you eat this regularly for at least 15 days, you will see the changes in your body yourself.",
    "[00:16:329] This salad gives new life force to the body and mind.",
    "[00:20:419] This salad is both tasty and healthy.",
    "[00:23:449] Whether you have hormonal imbalance, your skin complexion is fading, or you have issues like BP, sugar, or if you want to lose weight, eating such a delicious salad will show great benefits.",
    "[00:30:19] Whether you want good health or anything else, this salad is perfect for you.",
    "[00:33:639] Let's start.",
    "[00:34:319] First, take 500 grams of ash gourd and peel it.",
    "[00:39:279] It is very, very tasty.",
    "[00:41:9] More than that, it gives hundreds of times more health.",
    "[00:45:9] Now, grate this ash gourd.",
    "[00:52:139] Then, put it in a sieve and squeeze out the juice.",
    "[00:55:189] You can drink this juice as it is, don't throw it away.",
    "[00:57:129] This juice has greater health benefits than tender coconut water.",
    "[01:01:459] Just try drinking this for 15 days, morning and evening.",
    "[01:04:959] You will see the changes happening in your body yourself.",
    "[01:09:129] In this grated mixture, add half a teaspoon of black pepper powder, salt to taste, half a cup of pomegranate seeds, and only a quarter liter of delicious fresh curd, and mix well.",
    "[01:18:619] If you like, you can add roasted peanuts to it, it will taste even better.",
    "[01:24:269] That's it, you are done.",
    "[01:25:529] This greatly helps those who want to lose weight, those who want good health, those whose skin glow is reducing day by day, those with hormonal imbalance, and in stimulating sperm in men.",
    "[01:38:299] Just see how light your body feels on the day you eat this.",
    "[01:41:409] It doesn't cause any drowsiness at all.",
    "[01:43:869] This can be consumed by everyone, from young children to the elderly, people of all ages, and on all occasions.",
    "[01:49:929] Did you like it?",
    "[01:50:879] Then, you try it and be sure to post a picture of how it turned out for you on Vismai Food's Instagram.",
    "[01:55:549] For more information about this recipe, visit the vismaifood.com website."
  ]
}