{
  "metadata": {
    "title": "Pachi Mirchi Tomato Pappu | రాయలసీమ స్టైల్ పచ్చిమిర్చి టమాటో పప్పు | Rayalaseema Pappu | Vismai Food",
    "channel_name": "Vismai Food",
    "publish_date": "2020-02-13",
    "view_count": 2724213,
    "like_count": 31000,
    "duration": "02:15",
    "language": "Telugu",
    "video_id": "8zO8eB91gq8",
    "url": "https://www.youtube.com/watch?v=8zO8eB91gq8",
    "description": "A recipe for a traditional Rayalaseema-style dal made with green chilies and tomatoes. This spicy dal is known for its unique and delicious taste, different from the usual dal preparations.",
    "ingredients_detected": [
      "Toovar Dal/Kandipappu",
      "Spicy Green Chillies",
      "Onion Cubes",
      "Desi Tomato",
      "Coriander Seeds",
      "Cumin",
      "Turmeric",
      "Water",
      "Salt",
      "Oil",
      "Chana Dal",
      "Urad Dal",
      "Mustard",
      "Dry Chillies",
      "Asofetida",
      "Small onion Slit",
      "Curry leaves",
      "Coriander Chopped"
    ]
  },
  "transcription_telugu": [
    "[00:00:237] Hello Foodies, welcome to Vismai Food.",
    "[00:02:447] ఇవాల్టి స్పెషల్ రాయలసీమ స్టైల్ పచ్చిమిర్చి టమాటో పప్పు.",
    "[00:05:647] రెగ్యులర్ గా అందరూ చేసుకునే పప్పుకి కాస్త భిన్నంగా చేస్తారు.",
    "[00:08:337] కానీ రుచి మాత్రం చాలా చాలా గొప్పగా ఉంటుంది.",
    "[00:11:327] నేను కర్నూల్ జిల్లా డోన్ కి దగ్గరలో చనుగొండ్ల అని ఓ చిన్న పల్లెటూరు ఉంది.",
    "[00:14:987] అక్కడికి తొమ్మిదేళ్ల క్రితం ఓ షూటింగ్ నిమిత్తం వెళ్ళాను.",
    "[00:17:667] అక్కడ ఒక ఆవిడ మధ్యాహ్నం భోజనానికి వాళ్ళ ఇంటికి రమ్మని పిలిచారు.",
    "[00:19:967] అప్పటికప్పుడు కట్టెల పొయ్యి మీద ఈ పప్పు వండి జొన్న రొట్టెలు పెట్టారు.",
    "[00:23:907] ఆహా, ఎంత బాగుందో ఈ పప్పు.",
    "[00:26:937] నేను మా షూటింగ్ ఫుడ్ అంతా వదిలేసి, ఆవిడ ఆప్యాయంగా వడ్డించిన ఆ భోజనాన్ని, ఆ పప్పునే తిన్నాను.",
    "[00:32:747] ఎంత బాగుందో!",
    "[00:33:637] ఆ రెసిపీయే మీకోసం.",
    "[00:35:107] ముందుగా కుక్కర్ లో అర కప్పు కందిపప్పు 30 నిమిషాలు నానబెట్టింది వేసుకోండి.",
    "[00:38:937] ఇందులో 10 నుంచి 12 పచ్చిమిర్చి, రెండు పెద్ద ఉల్లిపాయలు నాలుగు సగాలుగా చేసినవి, మూడు పుల్లటి దేశవాళీ టమాటాలు మాత్రమే వేసుకోండి.",
    "[00:48:87] ఇందులో ఒక టీ స్పూన్ ధనియాలు, ఒక టీ స్పూన్ జీలకర్ర, అర టీ స్పూన్ పసుపు,",
    "[00:53:307] అర లీటర్ నీళ్లు పోసి, రుచికి సరిపడా సాల్ట్ వేసి మీడియం ఫ్లేమ్ మీద మూడు విజిల్స్ రానివ్వండి.",
    "[01:03:577] పప్పు పట్టుకుంటే మెత్తగా ఉడికి ఉండాలి.",
    "[01:05:547] అలా ఉడికాక పప్పు గుత్తితో బాగా ఎనుపుకోండి.",
    "[01:11:797] ఇప్పుడు రెండు టేబుల్ స్పూన్ల నూనె వేడి చేసి, ఇందులో ఒక టేబుల్ స్పూన్ శనగపప్పు, ఒక టీ స్పూన్ మినప్పప్పు, ఒక టీ స్పూన్ ఆవాలు, ఒక టీ స్పూన్ జీలకర్ర, రెండు ఎండుమిర్చి వేసి తాలింపుని ఎర్రగా వేగనివ్వండి.",
    "[01:27:447] తాలింపు వేగాక అప్పుడు పావు చెంచాడు ఇంగువ వేసి బాగా కలుపుకోండి.",
    "[01:31:817] ఇప్పుడు ఓ చిన్న ఉల్లిపాయ చీలికలు వేసి ఉల్లిపాయల్ని మగ్గనివ్వండి.",
    "[01:38:817] ఉల్లిపాయలు మగ్గాక అప్పుడు ఓ రెబ్బ కరివేపాకు వేసి వేపుకోండి.",
    "[01:43:727] ఇప్పుడు ఒక పెద్ద పిడికెడు కాడలతో సహా కొత్తిమీర తురుము వేసి 30 నిమిషాలు వేపుకోండి.",
    "[01:48:477] కొత్తిమీర కాడలతో సహా వేస్తే ఫ్లేవర్ చాలా చాలా బాగుంటుంది.",
    "[01:51:577] ఇది వేపి దింపి పప్పులో కలిపేసుకోండి.",
    "[01:54:627] ఈ రెసిపీకి చింతపండు వాడరు.",
    "[01:56:457] పులుపంతా టొమాటోల నుండే రావాలి, కారం అస్సలు వేయరు.",
    "[01:59:747] చూడటానికి చాలా సింపుల్ గా అనిపిస్తుంది.",
    "[02:01:667] కానీ రొట్టెల్లో తింటుంటే ఆహా, ఎంత బాగుంటుందో, చాలా స్పైసీగా ఉంటుంది ఈ పప్పుని మాత్రం గుర్తుపెట్టుకోండి.",
    "[02:08:527] మీకు నచ్చిందా?",
    "[02:09:477] మరి అయితే మీరు ట్రై చేసి మీకు ఎలా కుదిరిందో కచ్చితంగా ఆ పిక్ ని Vismai Food Instagram లో పోస్ట్ చేయండి.",
    "[02:13:587] బై ద వే vismaifood.com వెబ్సైట్ విజిట్ చేయండి, మరిన్ని రెసిపీస్ కోసం."
  ],
  "transcription_english": [
    "[00:00:237] Hello Foodies, welcome to Vismai Food.",
    "[00:02:447] Today's special is Rayalaseema style Green Chilli Tomato Dal.",
    "[00:05:647] It's made a bit differently from the regular dal everyone makes.",
    "[00:08:337] But the taste is very, very great.",
    "[00:11:327] I went to a small village called Chanugondla near Done in Kurnool district for a shoot nine years ago.",
    "[00:17:667] A lady there invited us to her house for lunch.",
    "[00:19:967] She cooked this dal on a wood-fired stove and served it with jowar rotis.",
    "[00:23:907] Ah, this dal was so good.",
    "[00:26:937] I left all our shoot food and ate the meal she served with so much affection, and that dal.",
    "[00:32:747] It was so good!",
    "[00:33:637] That recipe is for you.",
    "[00:35:107] First, in a cooker, take half a cup of toor dal soaked for 30 minutes.",
    "[00:38:937] In this, add 10 to 12 green chilies, two large onions quartered, and only three sour desi tomatoes.",
    "[00:48:87] In this, add one teaspoon of coriander seeds, one teaspoon of cumin, half a teaspoon of turmeric,",
    "[00:53:307] pour half a liter of water, add salt to taste, and cook on medium flame for three whistles.",
    "[01:03:577] The dal should be soft when pressed.",
    "[01:05:547] Once cooked, mash it well with a dal masher.",
    "[01:11:797] Now, heat two tablespoons of oil, in this add one tablespoon of chana dal, one teaspoon of urad dal, one teaspoon of mustard seeds, one teaspoon of cumin, and two dry red chilies, and let the tempering fry until golden brown.",
    "[01:27:447] Once the tempering is fried, add a quarter teaspoon of asafoetida and mix well.",
    "[01:31:817] Now, add one small sliced onion and let the onions cook.",
    "[01:38:817] Once the onions are cooked, add a sprig of curry leaves and fry.",
    "[01:43:727] Now, add a large handful of chopped coriander with stems and fry for 30 minutes.",
    "[01:48:477] The flavor will be very, very good if you add coriander with its stems.",
    "[01:51:577] After frying, take it off the heat and mix it into the dal.",
    "[01:54:627] Tamarind is not used in this recipe.",
    "[01:56:457] All the tanginess should come from the tomatoes, and no chili powder is added.",
    "[01:59:747] It looks very simple.",
    "[02:01:667] But when you eat it with rotis, ah, it's so good, this dal is very spicy, remember that.",
    "[02:08:527] Did you like it?",
    "[02:09:477] Then you try it and be sure to post a picture of how it turned out for you on Vismai Food's Instagram.",
    "[02:13:587] By the way, visit vismaifood.com website for more recipes."
  ]
}