{
  "metadata": {
    "title": "Palak Chicken Curry | పాలక్ చికెన్ | Palak Chicken in Telugu | Chicken Curry Recipes | Vismai Food",
    "channel_name": "Vismai Food",
    "publish_date": "2019-10-17",
    "view_count": 4191894,
    "like_count": 53000,
    "duration": "02:44",
    "language": "Telugu",
    "video_id": "R-kM3w11qQk",
    "url": "https://www.youtube.com/watch?v=R-kM3w11qQk",
    "description": "A unique recipe for Palak Chicken, different from the typical Punjabi style. This version incorporates Telugu flavors and spices, offering a distinct and delicious taste. The video provides a step-by-step guide to making this special chicken curry.",
    "ingredients_detected": [
      "Water",
      "Palak (Spinach)",
      "Onion",
      "Green Chillies",
      "Fresh Coconut",
      "Ginger",
      "Garlic pods",
      "Poppy Seeds (Khuskhus)",
      "Melon Seeds",
      "Oil",
      "Curry Leaves",
      "Turmeric",
      "Chicken",
      "Garam Masala",
      "Butter",
      "Ghee"
    ]
  },
  "transcription_telugu": [
    "[00:00:199] హలో ఫుడీస్, వెల్కమ్ టు విస్మై ఫుడ్.",
    "[00:02:189] ఇవాల్టి స్పెషల్ పాలక్ చికెన్.",
    "[00:04:479] పాలక్ చికెన్ యూజువల్గా పంజాబీ రెసిపీ.",
    "[00:06:559] దీన్ని ధాబాల్లో ఓలాగా, ఇంట్లో ఓలాగా చేస్తారు.",
    "[00:09:89] కానీ నేను మీకు మరోలా చేస్తాను.",
    "[00:11:479] అంటే తెలుగు వారి ఫ్లేవర్స్, మసాలాలతో.",
    "[00:13:959] అబ్బో ఏముంటుందోలే.",
    "[00:15:699] చాలా ఎంజాయ్ చేస్తారు.",
    "[00:17:429] Let's start విస్మై ఫుడ్ స్పెషల్ పాలక్ చికెన్.",
    "[00:19:969] ఇది ఎక్స్క్లూసివ్ మా స్టైల్ అన్నమాట.",
    "[00:22:749] ముందుగా అర లీటర్ నీళ్లు మరిగించుకోండి.",
    "[00:25:319] ఇందులో ఓ పెద్ద కట్ట పాలకూర వేసి జస్ట్ మూడు నిమిషాలు బాయిల్ చేసుకొని దింపేయండి.",
    "[00:29:649] పాలకూర ఎక్కువగా బాయిల్ చేస్తే నలుపొస్తుంది.",
    "[00:32:149] దీన్ని వడకట్టి పక్కన ఉంచుకోండి.",
    "[00:39:569] ఇప్పుడు మిక్సీ జార్లో ఓ ఉల్లిపాయ తరుగు, ఏడెనిమిది పచ్చిమిర్చి, అరకప్పు తాజా పచ్చి కొబ్బరి పలుకులు, ఇంచ్ అల్లం తరుగు, ఏడెనిమిది వెల్లుల్లి, ఒక టీ స్పూన్ గసగసాలు, ఒక టేబుల్ స్పూన్ కర్బూజా గింజలు, కాసిన్ని నీళ్లు వేసి మెత్తని పేస్ట్ గా చేసుకోండి.",
    "[00:56:889] కర్బూజా గింజలు గాని దొరకనట్లయితే జీడిపప్పు వాడుకోవచ్చు.",
    "[00:58:919] గసగసాలకు బదులు కూడా జీడిపప్పు వాడుకోవచ్చు.",
    "[01:01:459] ఇప్పుడు చల్లారిన పాలకూరని నీళ్లు వేయకుండా మెత్తని పేస్ట్ గా చేసుకోండి.",
    "[01:06:969] ఇప్పుడు మూకుట్లో పావు కప్పు ఆయిల్ హీట్ చేసుకోండి.",
    "[01:09:829] ఇందులో రెండు రెబ్బల కరివేపాకు వేసి చిటపటమనిపించండి.",
    "[01:14:489] ఇప్పుడు మెత్తగా గ్రైండ్ చేసుకున్నటువంటి ఉల్లి, కొబ్బరి మసాలా పేస్ట్ వేసి లో టు మీడియం ఫ్లేమ్ మీద అడుగంటకుండా, పచ్చివాసన పోయి, మంచి రంగు, మంచి సువాసన వచ్చేంతవరకు ఫ్రై చేసుకోండి.",
    "[01:23:499] చిక్కదనం ఆటోమేటిక్ గా అదే వచ్చేస్తుంది.",
    "[01:26:399] ఇష్ నిజమేనండి బాబు.",
    "[01:28:609] ఇప్పుడు అర టీ స్పూన్ పసుపు వేసి మరో రెండు మూడు నిమిషాల పాటు వేపుకోండి.",
    "[01:34:649] ఇప్పుడు 30 నిమిషాల పాటు ఉప్పేసిన నీళ్లలో నానబెట్టినటువంటి అరకిలో చికెన్ వేసి నాలుగైదు నిమిషాల పాటు బాగా ఫ్రై చేసుకోండి హైఫ్లేమ్ మీద.",
    "[01:41:409] ఇలా ఫ్రై చేయకపోతే పచ్చివాసన వస్తుందని గుర్తుపెట్టుకోండి.",
    "[01:46:209] ఇప్పుడు 400 ml నీళ్లు పోసి నిదానంగా మీడియం ఫ్లేమ్ మీద కూర దగ్గర పడనివ్వండి.",
    "[01:54:999] కూర దగ్గర పడ్డాక ఒక టీ స్పూన్ విస్మై ఫుడ్ స్పెషల్ గరం మసాలా వేసి, గ్రైండ్ చేసుకున్నటువంటి పాలకూర పేస్ట్ వేసి బాగా కలుపుకొని, లో ఫ్లేమ్ మీద నీరు ఇగిరిపోయి పాలకూర ముక్కలకి పట్టేంత వరకు ఫ్రై చేసుకోండి.",
    "[02:10:489] నీరు ఇగిరిపోయాక పావు కప్పు బటర్ వేసుకోండి.",
    "[02:12:969] ఇది వేస్తేనే అసలు మజా.",
    "[02:14:599] బటర్ కి బదులు మీరు నెయ్యి కూడా వేసుకోవచ్చు.",
    "[02:17:409] ఇది వేసి ఘీ పైకి తేలేంత వరకు వేగనివ్వండి.",
    "[02:19:699] ఆ తర్వాత దింపేసుకోండి.",
    "[02:21:719] అంతే, ఘుమఘుమాయించిపోయేటువంటి పాలక్ చికెన్ రెడీ.",
    "[02:25:219] ఇది మీకు రోటీ, చపాతీల్లో అయితే తిరుగు ఉండదు, చాలా చాలా బాగుంటుంది.",
    "[02:29:19] రైస్ లోకి కూడా చాలా బాగుంటుంది.",
    "[02:31:189] Trust me, ఇది ఒక్కరే కూర అంతా లాగించేసినా ఆశ్చర్యపోనక్కర్లేదు.",
    "[02:34:299] అంత బాగుంటుంది.",
    "[02:36:269] మీకు నచ్చిందా?",
    "[02:37:449] మరి అయితే మీరు ట్రై చేసి మీకు ఎలా కుదిరిందో కచ్చితంగా ఆ పిక్ ని Vismai Food Instagram లో పోస్ట్ చేయండి.",
    "[02:41:929] బై ద వే vismaifood.com వెబ్సైట్ విజిట్ చేయడం అస్సలు మర్చిపోకండి."
  ],
  "transcription_english": [
    "[00:00:199] Hello Foodies, welcome to Vismai Food.",
    "[00:02:189] Today's special is Palak Chicken.",
    "[00:04:479] Palak Chicken is usually a Punjabi recipe.",
    "[00:06:559] It's made one way in dhabas and another way at home.",
    "[00:09:89] But I'll make it for you in another way.",
    "[00:11:479] That is, with Telugu flavors and spices.",
    "[00:13:959] Oh, it's going to be so good.",
    "[00:15:699] You'll enjoy it a lot.",
    "[00:17:429] Let's start Vismai Food's special Palak Chicken.",
    "[00:19:969] This is exclusively our style.",
    "[00:22:749] First, boil half a liter of water.",
    "[00:25:319] In this, add one big bunch of spinach and just boil it for three minutes and then take it out.",
    "[00:29:649] If you boil the spinach for too long, it will turn black.",
    "[00:32:149] Strain it and keep it aside.",
    "[00:39:569] Now, in a mixer jar, add one chopped onion, seven to eight green chilies, half a cup of fresh coconut pieces, an inch of chopped ginger, seven to eight garlic cloves, one teaspoon of poppy seeds, one tablespoon of melon seeds, and a little water, and grind it into a fine paste.",
    "[00:56:889] If you don't have melon seeds, you can use cashews.",
    "[00:58:919] You can also use cashews instead of poppy seeds.",
    "[01:01:459] Now, grind the cooled spinach into a fine paste without adding water.",
    "[01:06:969] Now, heat a quarter cup of oil in a pan.",
    "[01:09:829] In this, add two sprigs of curry leaves and let them splutter.",
    "[01:14:489] Now, add the finely ground onion and coconut masala paste and fry on low to medium flame, stirring continuously, until the raw smell is gone, it gets a nice color, and a good aroma comes out.",
    "[01:23:499] The thickness will come automatically.",
    "[01:26:399] Yes, really, sir!",
    "[01:28:609] Now, add half a teaspoon of turmeric and fry for another two to three minutes.",
    "[01:34:649] Now, add half a kilo of chicken soaked in salt water for 30 minutes and fry it well for four to five minutes on high flame.",
    "[01:41:409] If you don't fry it like this, it will smell raw, remember that.",
    "[01:46:209] Now, add 400 ml of water and slowly let the curry thicken on a medium flame.",
    "[01:54:999] Once the curry thickens, add one teaspoon of Vismai Food's special garam masala, the ground spinach paste, mix well, and fry on low flame until the water evaporates and the spinach coats the chicken pieces.",
    "[02:10:489] After the water evaporates, add a quarter cup of butter.",
    "[02:12:969] This is what gives it the real fun.",
    "[02:14:599] You can also use ghee instead of butter.",
    "[02:17:409] After adding it, fry until the ghee floats on top, then take it off the heat.",
    "[02:21:719] That's it, the aromatic Palak Chicken is ready.",
    "[02:25:219] It's unbeatable with roti and chapati, very, very good.",
    "[02:29:19] It's also very good with rice.",
    "[02:31:189] Trust me, you won't be surprised if one person finishes the whole curry.",
    "[02:34:299] It's that good.",
    "[02:36:269] Did you like it?",
    "[02:37:449] Then you try it and be sure to post a picture of how it turned out for you on Vismai Food's Instagram.",
    "[02:41:929] By the way, don't forget to visit vismaifood.com."
  ]
}