{
  "metadata": {
    "title": "Kakarakaya Ulli Karam | కాకరకాయ ఉల్లి కారం | Kakarakaya Fry | Bitter Gourd Fry | Vismai Food",
    "channel_name": "Vismai Food",
    "publish_date": "2019-09-03",
    "view_count": 3800000,
    "like_count": 44000,
    "duration": "02:27",
    "language": "Telugu",
    "video_id": "wzQ_75Q8wJ8",
    "url": "https://www.youtube.com/watch?v=wzQ_75Q8wJ8",
    "description": "A recipe for an exceptionally tasty Kakarakaya Ulli Karam (Bitter Gourd with Onion Spice). The host shares a personal story of discovering this delicious dish in a small village and emphasizes its unforgettable taste, especially when served with hot rice and ghee.",
    "ingredients_detected": [
      "Tender Bittergourd",
      "Turmeric",
      "Salt",
      "Onions",
      "Chilli powder",
      "Garlic",
      "Cumin",
      "Oil",
      "Curry leaves"
    ]
  },
  "transcription_telugu": [
    "[00:00:125] Hello Foodies, welcome to Vismai Food.",
    "[00:02:185] ఇవాల్టి స్పెషల్ అద్దిరిపోయేటువంటి కాకరకాయ ఉల్లి కారం.",
    "[00:06:145] ఇది ఓసారి టేస్ట్ చేశారంటే దీని రుచి ఎప్పటికీ మర్చిపోలేరు.",
    "[00:09:475] అంత సూపర్బ్ గా ఉంటుంది.",
    "[00:11:455] వేడి వేడి అన్నంలో కాస్త నెయ్యి వేసుకొని తిని చూడండి, కచ్చితంగా ఆ పూట నాలుగైదు ముద్దలు ఎక్కువే తింటారు.",
    "[00:17:155] అంత బాగుంటుంది.",
    "[00:18:245] అసలు ఈ కూర రుచిని వర్ణించడానికి మాటల్లేవ్.",
    "[00:20:735] అంతే, అంత బాగుంటుంది.",
    "[00:22:985] Let's start కాకరకాయ ఉల్లి కారం.",
    "[00:25:215] ముందుగా 400 గ్రాముల లేత కాకరకాయల్ని చెక్కు తీసుకోండి.",
    "[00:30:225] ఆ తర్వాత రెండు ఇంచ్ ముక్కలుగా కట్ చేసుకోండి, తలా తోకా తీసేసి.",
    "[00:37:785] ఇప్పుడు కాకరకాయలో ఒక టీ స్పూన్ పసుపు, ఒక టీ స్పూన్ ఉప్పు వేసి బాగా పట్టించి 30 నిమిషాలు పక్కన ఉంచేయండి.",
    "[00:45:625] 30 నిమిషాల తర్వాత ఇదిగో ఇలా నీరంతా దిగుతుంది కాకరకాయలో నుంచి.",
    "[00:49:505] ఆ తర్వాత ఒక్కో కాకరకాయని పట్టి గట్టిగా పిండితే మిగిలిన చేదు కూడా దిగిపోతుంది.",
    "[00:55:675] ఇలా అన్ని పిండుకొని పక్కన ఉంచుకోండి.",
    "[00:56:925] ఇప్పుడు మిక్సీ జార్ లో పావు కిలో ఉల్లిపాయ తరుగు, రెండు టేబుల్ స్పూన్ల కారం,",
    "[01:02:225] ఏడెనిమిది వెల్లుల్లి, ఒక టీ స్పూన్ జీలకర్ర, సాల్ట్ వేసి మెత్తని పేస్ట్ గా చేసుకోండి.",
    "[01:08:145] ఇప్పుడు పావు కప్పు ఆయిల్ హీట్ చేసి కాకరకాయల్ని ఐదారు నిమిషాలు వేపుకోండి చాలు, మరీ ఎక్కువగా వేపకండి.",
    "[01:14:265] ఇలా వేపడం వల్ల కాకరకాయ లోపల కూడా పర్ఫెక్ట్ గా మగ్గుతుంది.",
    "[01:24:815] ఇప్పుడు కాయల్లోని గింజలు తీసేయండి.",
    "[01:26:955] ఇప్పుడు ఇందులో జాగ్రత్తగా ఉల్లిపాయ పేస్ట్ స్టఫ్ చేసుకోండి.",
    "[01:30:465] చాలామంది పచ్చి కాకరకాయల్లోనే ఉల్లిపాయ పేస్ట్ స్టఫ్ చేసి చేస్తారు.",
    "[01:33:965] ఆ పద్ధతి కూడా బాగుంటుంది కానీ వేగడానికి ఎక్కువ టైం పట్టడంతో పాటు లోపల పర్ఫెక్ట్ గా మగ్గదు.",
    "[01:39:135] అందుకే మేమిలా చేస్తాం ఎప్పుడూ.",
    "[01:41:485] కాకరకాయలు వేపుకున్న నూనెలో మరో రెండు టేబుల్ స్పూన్ల ఆయిల్ వేసి, అందులో స్టఫ్ చేసుకున్నటువంటి కాకరకాయ ముక్కలన్నీ సర్ది, మిగిలిన ఉల్లిపాయ పేస్ట్ కూడా వేసి నిదానంగా కలిపి, మీడియం ఫ్లేమ్ మీద వేపుకోవాలి ఈ కూరని.",
    "[01:53:815] ఉల్లిపాయల్లోని నీరు ఇగిరిపోయి, ఎర్రగా కూర వేగడానికి కనీసం 18 నుంచి 20 నిమిషాల టైం పడుతుంది.",
    "[02:00:875] యాక్చువల్గా ఈ కూరని నాన్ స్టిక్ ప్యాన్ లో కంటే కూడా కాస్ట్ ఐరన్ మూకుళ్లలో లేదంటే ఐరన్ మూకుళ్లలో చేస్తేనే అసలు మజా.",
    "[02:07:355] కాస్త అడుగంటుతుంది, కానీ ఆ అడుగంటిన దానిలోనే అసలు రుచి ఉంటుంది.",
    "[02:10:725] దింపే ముందు ఓ రెబ్బ కరివేపాకు వేసుకొని దింపుకోండి.",
    "[02:13:385] బాగా టైం తీసుకొని ఓపిగ్గా కూర చేసుకుంటే దీని రుచికి తిరుగుండదు అంతే అని మాత్రం గుర్తుంచుకోండి.",
    "[02:19:575] నచ్చిందా?",
    "[02:20:125] మరి అయితే మీరు ట్రై చేసి మీకు ఎలా కుదిరిందో కచ్చితంగా ఆ పిక్ ని Vismai Food Instagram లో పోస్ట్ చేయండి.",
    "[02:24:505] బై ద వే vismaifood.com వెబ్సైట్ విజిట్ చేయండి, మరిన్ని రెసిపీస్ కోసం."
  ],
  "transcription_english": [
    "[00:00:125] Hello Foodies, welcome to Vismai Food.",
    "[00:02:185] Today's special is the amazing Kakarakaya Ulli Karam (Bitter Gourd with Onion Spice).",
    "[00:06:145] If you taste this once, you will never forget its taste.",
    "[00:09:475] It's that superb.",
    "[00:11:455] Try eating it with hot rice and a little ghee; you will definitely eat four to five extra morsels that meal.",
    "[00:17:155] It's that good.",
    "[00:18:245] There are no words to describe the taste of this curry.",
    "[00:20:735] That's it, it's that good.",
    "[00:22:985] Let's start Kakarakaya Ulli Karam.",
    "[00:25:215] First, peel 400 grams of tender bitter gourds.",
    "[00:30:225] Then, cut them into two-inch pieces, removing the ends.",
    "[00:37:785] Now, add one teaspoon of turmeric and one teaspoon of salt to the bitter gourd, coat them well, and set them aside for 30 minutes.",
    "[00:45:625] After 30 minutes, you see, the water from the bitter gourd gets released like this.",
    "[00:49:505] Then, take each bitter gourd piece and squeeze it tightly to remove the remaining bitterness.",
    "[00:55:675] Squeeze all of them and keep them aside.",
    "[00:56:925] Now, in a mixer jar, add a quarter kilo of chopped onions, two tablespoons of chili powder,",
    "[01:02:225] seven to eight garlic cloves, one teaspoon of cumin, and salt, and grind it into a fine paste.",
    "[01:08:145] Now, heat a quarter cup of oil and fry the bitter gourds for five to six minutes, that's enough; don't fry them for too long.",
    "[01:14:265] Frying them this way ensures that the bitter gourd cooks perfectly on the inside as well.",
    "[01:24:815] Now, remove the seeds from the gourds.",
    "[01:26:955] Now, carefully stuff the onion paste into them.",
    "[01:30:465] Many people stuff the onion paste into raw bitter gourds.",
    "[01:33:965] That method is also good, but it takes more time to fry, and it doesn't cook perfectly on the inside.",
    "[01:39:135] That's why we always do it this way.",
    "[01:41:485] In the same oil used for frying the bitter gourds, add another two tablespoons of oil, arrange the stuffed bitter gourd pieces, add the remaining onion paste, mix gently, and fry this curry on medium flame.",
    "[01:53:815] It takes at least 18 to 20 minutes for the water from the onions to evaporate and the curry to turn reddish-brown.",
    "[02:00:875] Actually, this curry tastes best when made in a cast iron or iron pan rather than a non-stick pan.",
    "[02:07:355] It might stick a little, but the real taste is in that browned part.",
    "[02:10:725] Before taking it off the heat, add a sprig of curry leaves and then remove it.",
    "[02:13:385] Just remember that if you take your time and cook this curry patiently, its taste is unbeatable.",
    "[02:19:575] Did you like it?",
    "[02:20:125] Then you try it and be sure to post a picture of how it turned out for you on Vismai Food's Instagram.",
    "[02:24:505] By the way, visit vismaifood.com for more recipes."
  ]
}