{
  "metadata": {
    "title": "7 Best Onion Recipes | Onion Pakodi, Korma, Rings, Chutney, Pulusu | Vismai Food",
    "channel_name": "Vismai Food",
    "publish_date": "2020-01-01",
    "view_count": 131000,
    "like_count": 2000,
    "duration": "13:26",
    "language": "Telugu",
    "video_id": "H3q4YM-p4Ww",
    "url": "https://www.youtube.com/watch?v=H3q4YM-p4Ww&list=PLD2vlKwLAN3AoDW8dziT7BDqzc39ysKSz&index=184",
    "description": "A compilation of 7 delicious onion-based recipes including Crispy Onion Pakodi, Onion Korma, Onion Rings, Onion Chutney, Onion Pulusu, Onion Coconut Chutney, and Soft Onion Pakodi (Gatti Pakodi).",
    "ingredients_detected": [
      "Onion",
      "Green chillies",
      "Salt",
      "Red Chilli Powder",
      "Ginger garlic paste",
      "Roasted cumin powder",
      "Coriander powder",
      "Cumin seeds",
      "Coriander seeds",
      "Chickpea flour (Besan)",
      "Rice flour",
      "Water",
      "Oil",
      "Curry leaves",
      "Cashew",
      "Dry Coconut Powder",
      "Sesame Seeds",
      "Garam masala",
      "Turmeric",
      "Tomatoes",
      "Tamarind",
      "Coriander leaves",
      "Refined Flour (Maida)",
      "Corn flour",
      "Black pepper powder",
      "Garlic powder",
      "Bread crumbs",
      "Mustard seeds",
      "Urad dal",
      "Dry Red Chillies",
      "Hing (Asafoetida)",
      "Sambar Onion",
      "Jaggery",
      "Fenugreek seeds",
      "Garlic pods",
      "Fresh Coconut",
      "Cooking Soda"
    ]
  },
  "transcription_telugu": [
    "[00:00] హలో ఫుడీస్, విస్మయి ఫుడ్‌కు స్వాగతం.",
    "[00:01] ఇవాళ అత్యంత రుచికరమైన స్నాక్ — ఉల్లిపాయ పకోడీ ఎలా తయారు చేయాలో చూపిస్తాను.",
    "[00:10] దీన్నే గట్టి పకోడీ అని కూడా అంటారు.",
    "[00:12] పర్ఫెక్ట్ స్వీట్ షాప్ స్టైల్ రెసిపీ ఇది.",
    "[00:15] చాలా క్రిస్పీగా, క్రంచీగా చాలా చాలా బాగుంటాయి. లెట్స్ స్టార్ట్.",
    "[00:20] ముందుగా 300 గ్రాముల ఉల్లిపాయలను తొక్క తీసి, అర్ధంగా కట్ చేసి, నిలువుగా మరీ సన్నగా కాకుండా తరిగి పెట్టుకోండి.",
    "[00:35] ఇప్పుడు నాలుగు పచ్చిమిర్చులను చీల్చి పక్కన పెట్టుకోండి.",
    "[00:42] ఇప్పుడు మిక్సింగ్ బౌల్‌లో ఉల్లిపాయలు, పచ్చిమిర్చులు, ఉప్పు, ఒక టేబుల్ స్పూన్ కారం, ఒక టేబుల్ స్పూన్ తాజా గా రుబ్బుకున్న అల్లం వెల్లుల్లి ముద్ద వేయండి.",
    "[00:53] ఒక టీ స్పూన్ వేయించిన జీలకర్ర పొడి, ఒక టీ స్పూన్ ధనియాల పొడి, ఒక టీ స్పూన్ జీలకర్ర, ఒక టీ స్పూన్ ధనియాలు బాగా క్రష్ చేసి వేయండి.",
    "[01:06] వీటన్నిటిని ఉల్లిపాయలను బాగా ఒత్తుతూ గట్టిగా కలపండి.",
    "[01:13] ఉల్లిపాయలకు సరిపడా — అంటే 150 గ్రాముల సెనగపిండి, రెండు టేబుల్ స్పూన్లు బియ్యం పిండి వేసుకోండి.",
    "[01:20] ముందుగా ఈ పిండంతా ఉల్లిపాయలకు పట్టేలా పొడి పొడిగా పైకి కిందకి కలపండి.",
    "[01:26] ఆ తర్వాత కొంచెం ప్రెషర్ ఇస్తూ గట్టిగా కలపండి.",
    "[01:30] ఇప్పుడు కేవలం ఒక టేబుల్ స్పూన్ నీళ్లు మాత్రమే వేసి పిండిని కలపండి.",
    "[01:36] ఉల్లిపాయల నుంచి వచ్చే నీరే సరిపోతుంది. కొంచెం ముద్దలా రావాలి కాబట్టి అంతే నీళ్లు చాలు.",
    "[01:46] ఇప్పుడు బాగా వేడెక్కిన నూనెలో కొంచెం ముద్దను చేతుల్లోకి తీసుకుని, వేళ్లతో పొడి పొడిగా వేసుకుంటూ వేయండి.",
    "[01:56] ఈ పకోడీలను మీడియం ఫ్లేమ్‌పై క్రిస్పీగా వేయించండి.",
    "[02:09] 95% వేగాక దింపేయండి. బయటకు తీసిన తర్వాత వేడి వల్ల ఉల్లిపాయలు మరింత మృదువుగా అవుతాయి.",
    "[02:15] పకోడీలు వేయించాక, రెండు రెబ్బల కరివేపాకు వేసి వేయించి పక్కన పెట్టుకోండి.",
    "[02:27] వేయించిన కరివేపాకును పకోడీల మీద చల్లండి."
  ],
  "transcription_english": [
    "[00:00] Hello Foodies, Welcome to Vismai Food.",
    "[00:01] Today I will show you how to make the most yummiest snack, Onion Pakodi.",
    "[00:10] This is also called Gatti Pakodi (Hard Pakoda).",
    "[00:12] This is a perfect sweet shop style recipe.",
    "[00:15] They will be very crispy and crunchy. Let's start.",
    "[00:20] First, peel 300 grams of onion, cut into half, and slice them lengthwise but not too thin.",
    "[00:35] Now slit four green chillies and keep aside.",
    "[00:42] Now in a mixing bowl, add onions, green chillies, salt, one tablespoon chilli powder, one tablespoon freshly ground ginger garlic paste.",
    "[00:53] Add one teaspoon roasted cumin powder, one teaspoon coriander powder, one teaspoon cumin seeds, and one teaspoon crushed coriander seeds.",
    "[01:06] Squeeze the onions tightly while mixing everything together.",
    "[01:13] Add exactly half the amount of onions, which is 150 grams of chickpea flour (besan), and two tablespoons of rice flour.",
    "[01:20] First, toss the onions up and down so the flour coats them well.",
    "[01:26] Then apply some pressure and mix tightly.",
    "[01:30] Now add just one tablespoon of water, that's it, and mix the dough tightly.",
    "[01:36] The moisture from the onions is enough for this. We add water just to bind it a little.",
    "[01:46] Now take small portions of the dough into your hand and drop them into piping hot oil loosely with your fingers.",
    "[01:56] Fry this pakodi on medium flame until crispy.",
    "[02:09] Remove when 95% fried. The onions will cook further with the heat after taking them out.",
    "[02:15] After frying the pakodi, fry two sprigs of curry leaves and keep them aside.",
    "[02:27] Sprinkle the fried curry leaves over the pakodi.",
    "[02:39] Hey Foodies, Welcome to Vismai Food. Today's spicy recipe is Onion Korma.",
    "[02:57] Heat one teaspoon oil in a kadai, add sliced onions and fry until the raw smell goes and they turn golden color.",
    "[03:07] After they are almost 60% fried, add two tablespoons of cashews, two tablespoons of dry coconut powder and fry on low flame.",
    "[03:14] After it changes color, add one tablespoon sesame seeds, fry until they pop and let it cool.",
    "[03:20] Transfer this cooled mixture into a jar, add some water and make a fine paste.",
    "[03:28] Now heat three tablespoons of oil in a kadai, add one tablespoon ginger garlic paste, salt, half teaspoon garam masala, two pinches of turmeric...",
    "[03:37] Add one tablespoon chilli powder, one teaspoon coriander powder, one teaspoon roasted cumin powder and fry the masala well.",
    "[03:47] Once the oil separates, add two tomatoes paste and mix well, add large onion petals from one big onion and cook on medium flame.",
    "[04:02] Once onions are cooked well, add a quarter cup of tamarind juice and cook until oil separates.",
    "[04:09] Only after oil separates, add the ground onion paste, mix well, add 200ml water and cook on low flame.",
    "[04:22] While boiling, a foam will form on top, remove that foam, the curry will look very good.",
    "[04:30] Add some coriander leaves along with stems, mix well, and cook on low flame until the curry thickens and oil floats on top. That's it, Curry Ready.",
    "[04:50] Today's special is Onion Rings. This is a perfect snack.",
    "[05:05] First, add half a cup of maida to a bowl. Add a little salt, and add rings sliced from a large onion.",
    "[05:19] Place a plate on the bowl and toss well so the maida coats the onions well.",
    "[05:24] Now sprinkle some water and toss again. Then the maida will stick to the onions even better.",
    "[05:32] Now take all the onion rings onto a plate...",
    "[05:38] Into the remaining maida, add two tablespoons corn flour, half teaspoon pepper powder, and half teaspoon garlic powder.",
    "[05:48] Add water and mix the batter to a flowing consistency.",
    "[05:57] Now dip the onion rings in the mixed batter and coat well with bread crumbs two or three times.",
    "[06:22] Now drop them in hot oil and fry on medium-high heat for two to three minutes.",
    "[06:31] Remove as soon as they turn light golden color. That's it, Ready.",
    "[06:48] Today's special is Onion Chutney. It tastes very good if made in this style.",
    "[06:59] Heat two tablespoons oil in a kadai, add one tablespoon mustard seeds, one teaspoon cumin seeds, quarter cup urad dal and roast well.",
    "[07:11] Now add 6-7 dry red chillies, four green chillies and fry well for three to four minutes. Cool down after frying.",
    "[07:23] Now in the same kadai, add chopped onions from three big onions, add one tablespoon oil, and fry on medium flame for 4-5 minutes until raw smell goes.",
    "[07:34] After raw smell goes, add lemon-sized tamarind and roast for another two minutes and let it cool.",
    "[07:42] Now add the cooled mustard and dry chillies to a jar and make a fine powder.",
    "[07:52] Now add the fried onions and salt, and make a fine paste.",
    "[08:00] Now heat two tablespoons oil, add half teaspoon mustard seeds, a pinch of hing, two sprigs of curry leaves and fry well, mix this tempering into the onion chutney, that's it.",
    "[08:32] Hello Foodies, Welcome to Vismai Food. Today's special is The Best Onion Pulusu (Stew).",
    "[08:50] First soak 50 grams tamarind in hot water, extract the juice and keep aside.",
    "[08:56] Now heat three tablespoons oil in a pan, add two sliced regular onions, and 10 to 12 sambar onions.",
    "[09:07] After they soften a bit, add salt, one teaspoon chilli powder, mix well, cover and cook the onions only on medium flame.",
    "[09:23] After onions are cooked well, add 300ml tamarind juice. Add another 300ml water, half teaspoon turmeric, 50 grams jaggery...",
    "[09:35] Add three slit green chillies, mix well, and let it boil on low flame for 15 minutes.",
    "[09:49] After 15 minutes, add 50ml water to one teaspoon rice flour and mix without lumps.",
    "[09:58] After mixing, pour it slowly into the boiling stew, mix well, cover and boil for another three to four minutes.",
    "[10:09] Now sprinkle two tablespoons chopped coriander, mix well and set aside.",
    "[10:14] Now heat two tablespoons oil, add one teaspoon fenugreek seeds, and let them fry more than half.",
    "[10:20] After frying, add one teaspoon mustard seeds and let them splutter. After spluttering add one teaspoon cumin, two dry chillies, a sprig of curry leaves and fry well, add a pinch of hing too...",
    "[10:35] Add the tempering to the stew. That's it, You are Done.",
    "[10:55] Hello My Dear Foodies, Welcome to Vismai Food. Today let's learn how to make Onion Coconut Chutney.",
    "[11:03] For this, heat half teaspoon oil, add 6 garlic pods.",
    "[11:11] Add two green chillies, two large chopped onions and saute for a while.",
    "[11:19] Add a sprig of curry leaves, one teaspoon cumin seeds, one cup fresh coconut pieces and saute for two minutes...",
    "[11:31] Take into a jar, add salt, add some water and make a fine paste, that's it.",
    "[11:50] Hey Foodies, Welcome to Vismai Food. Today's special is Simple yet Tasty Onion Curry Leaves Soft Pakodi.",
    "[12:11] First in a mixer jar, add one large chopped onion, three chopped green chillies, half teaspoon cumin, one tablespoon tamarind, salt, quarter teaspoon turmeric, half bunch coriander leaves with stems and make a fine paste.",
    "[12:27] Now for pakodi batter, add one cup besan (gram flour), quarter cup rice flour, add water and mix the batter like bajji batter.",
    "[12:37] Now add quarter teaspoon soda, the smoothly ground onion-chilli paste, two bunches of mature curry leaves and mix well.",
    "[12:51] Now drop them like pakodis in hot oil. Fry these pakodis on medium to high flame."
  ]
}