{
  "metadata": {
    "title": "సొంటి కారం|Dry Ginger Powder|Sukku karam|ఈ పొడి తో 3 ముద్దలు చాలు మీ ఆరోగ్యాన్ని బాగుచేయడానికి",
    "channel_name": "Vismai Food",
    "publish_date": "2019-09-08",
    "view_count": 227000,
    "like_count": 4200,
    "duration": "02:02",
    "language": "Telugu",
    "video_id": "buzeJP5x7CA",
    "url": "https://www.youtube.com/watch?v=buzeJP5x7CA&list=PLD2vlKwLAN3AoDW8dziT7BDqzc39ysKSz&index=185",
    "description": "Sonti Karam or Dry Ginger Powder recipe by Vismai Food. This healthy powder aids digestion and is suitable for all ages, from 6-month-old infants to the elderly. It helps with appetite, indigestion, and stomach ailments.",
    "ingredients_detected": [
      "Ghee",
      "Dry Ginger",
      "Cumin Seeds",
      "Dry Red Chillies",
      "Black Pepper",
      "Salt"
    ]
  },
  "transcription_telugu": [
    "[00:00] హలో ఫుడీస్, విస్మయి ఫుడ్‌కు స్వాగతం.",
    "[00:01] ఇవాళ్టి స్పెషల్ — ఆరు నెలల పసి పిల్లల నుంచి అరవై ఏళ్ల పైబడిన పెద్దవారి వరకు పొట్టను శుద్ధి చేయగలిగే మహత్తరమైన సొంటి కారం.",
    "[00:11] వారంలో రెండు లేదా మూడు ముద్దలు తింటే చాలు.",
    "[00:15] ఆకలి పుట్టించి, అజీర్తిని పోగొట్టి, కడుపులో ఉండే దోషాలన్నీ పోగొట్టడానికి ఇది చాలా బాగా పనిచేస్తుంది.",
    "[00:21] ప్రతి ఇంట్లో ఉండాల్సిన ఆరోగ్య ప్రదాయిని ఈ పొడి.",
    "[00:25] ఈ పొడిని తయారు చేసి డబ్బాలో పెట్టుకుంటే కనీసం ఆరు ఏడు నెలల పాటు నిల్వ ఉంటుంది కూడా.",
    "[00:30] ఇక మొదలుద్దామా?",
    "[00:32] ముందుగా ముక్కులో ఒక టేబుల్ స్పూన్ నెయ్యి కరిగించుకోండి.",
    "[00:35] ఇందులో 50 గ్రాముల సొంటి వేసి కేవలం మీడియం ఫ్లేమ్ మీద మాత్రమే సొంటి ఎర్రగా వేగేంతవరకు వేయించుకోండి.",
    "[00:43] హై ఫ్లేమ్ మీద అస్సలు వేయకండి.",
    "[00:45] సొంటి లోపలిదాకా వేగితే చక్కగా పొంగుతుంది. ఎర్రగా వేగి అలా పొంగాక అప్పుడు రెండు టీ స్పూన్లు జీలకర్ర వేయండి.",
    "[00:51] రెండు అంటే రెండు ఎండు మిర్చి వేసుకోండి.",
    "[00:53] మీకు ఇక్కడ నచ్చితే ఎండు మిర్చికి బదులుగా ముప్పావు చెంచా మిరియాలు కూడా వేసుకోవచ్చు, ఇంకా బాగుంటుంది.",
    "[00:58] ఇవి వేసి ఒక నిమిషం పాటు వేయించి దింపేసుకోండి.",
    "[01:02] ఇప్పుడు వేయించిన సొంటిని బాగా నలగ కొట్టుకోండి.",
    "[01:05] ఇలా నలగ కొట్టుకోకపోతే మిక్సీలో అస్సలు నలగదు.",
    "[01:13] దంచుకున్న ఈ సొంటి పొడిని చిన్న చిన్న ముక్కలుగా చేసుకోండి.",
    "[01:17] ఇప్పుడు ఈ పొడిని మిక్సీ జార్‌లో వేసుకోండి.",
    "[01:20] ఇందులోనే రుచికి సరిపడా ఉప్పు వేసి మెత్తని పొడిగా చేయండి.",
    "[01:26] ఈ పొడిని వేడి వేడి అన్నంలో కొద్దిగా నెయ్యి వేసుకుని కేవలం ఒక చిటికెడు వేసి బాగా కలిపి ఒక ముద్ద తినాలి అంతే.",
    "[01:32] ఆ తరువాత మీరు ఏమి తినాలో అది తినేసేయండి.",
    "[01:35] ఇలా వారానికి కేవలం రెండు నుంచి మూడు ముద్దలు తింటే చాలు.",
    "[01:38] తరచూ వాంతులు చేసే పిల్లలకు తప్పకుండా ఇది పెట్టండి — చాలా మంచి గుణం కనిపిస్తుంది.",
    "[01:42] ఇంకా మీరు మజ్జిగ లేదా మజ్జిగ చారు చేసుకుంటున్నప్పుడు కొద్దిగా ఈ పొడి కలిపి చూడండి.",
    "[01:46] రుచికి రుచి, ఆరోగ్యానికి ఆరోగ్యం.",
    "[01:49] మళ్లీ చెప్తున్నాను — మరీ ఎక్కువగా తినకండి రుచి బాగుందని, విరేచనాలు అవుతాయి.",
    "[01:53] మీకు నచ్చిందా? మరైతే మీరు ట్రై చేసి మీకు ఎలా కుదిరిందో కచ్చితంగా ఆ ఫోటోను విస్మయి ఫుడ్ ఇన్‌స్టాగ్రామ్‌లో పోస్ట్ చేయండి.",
    "[01:59] బై ద వే, vismaifood.com వెబ్‌సైట్ విజిట్ చేయడం అస్సలు మర్చిపోకండి."
  ],
  "transcription_english": [
    "[00:00] Hello Foodies, Welcome to Vismai Food.",
    "[00:01] Today's special is a magnificent Sonti Karam (Dry Ginger Powder) that can cleanse the stomach of everyone from six-month-old infants to sixty-year-old elders.",
    "[00:11] Just eat two or three balls (morsels) a week, that's enough.",
    "[00:15] It works very well to induce appetite, cure indigestion, and remove all impurities in the stomach.",
    "[00:21] This powder is a health giver that should be in every home.",
    "[00:25] If you prepare this powder and store it in a box, it will last for at least six to seven months.",
    "[00:30] Shall we start?",
    "[00:32] First, melt one tablespoon of ghee in a pan.",
    "[00:35] Add 50 grams of dry ginger to this and fry only on medium flame until the dry ginger turns red.",
    "[00:43] Do not fry on high flame at all.",
    "[00:45] If the dry ginger fries to the inside, it puffs up nicely. After it turns red and puffs up, add two teaspoons of cumin seeds...",
    "[00:51] Add two, just two dry red chilies.",
    "[00:53] If you like, you can add three-quarter teaspoon of black pepper instead of dry red chilies here, it will be even better.",
    "[00:58] Add these and fry for a minute and take it off.",
    "[01:02] Now crush the fried dry ginger well.",
    "[01:05] If you don't crush it like this, it won't grind at all in the mixer.",
    "[01:13] Break this crushed dry ginger powder into small pieces.",
    "[01:17] Now put this powder in a mixer jar.",
    "[01:20] Add salt to taste in this and make it into a soft powder.",
    "[01:26] Put a little ghee in hot rice, add just a pinch of this powder, mix well and eat one morsel, that's it.",
    "[01:32] After that, you can eat whatever you want.",
    "[01:35] Like this, you just have to eat two to three morsels a week, that's it.",
    "[01:38] Definitely give this to children who frequently have Vata (gastric) issues, it shows very good results.",
    "[01:42] Also, when you are making buttermilk or buttermilk rasam, try adding a little bit of this powder.",
    "[01:46] Taste for taste, health for health.",
    "[01:49] I am telling you again, don't eat too much because it tastes good, it will cause loose motions.",
    "[01:53] Did you like it? Then you try it and definitely post that pic on Vismai Food Instagram on how it turned out for you.",
    "[01:59] By the way, don't forget to visit vismaifood.com website."
  ]
}