{
  "metadata": {
    "title": "Bendakaya Karam Vepudu | Besan Bhindi Masala Fry | Okra Fry Recipe In Telugu | Vismai Food",
    "channel_name": "Vismai Food",
    "publish_date": "2019-09-17",
    "view_count": 2500000,
    "like_count": 45000,
    "duration": "02:04",
    "language": "Telugu",
    "video_id": "Fqv-lXzH4yE",
    "url": "https://www.youtube.com/watch?v=Fqv-lXzH4yE",
    "description": "Hello Foodies, Today's special is my favorite Bendakaya Karam Podi Vepudu. If you love Okra, you must try this recipe. Unlike the regular Okra fry, this spicy and tangy version tastes amazing. It is a perfect recipe for lunch or dinner. \n\nIngredients:\n1/2 Cup Besan/Chickpea Flour\n1/4 Cup Oil\n1 tsp Ajwain/Vaamu\n500gms Bhindi/Okra\nSalt\n1 tsp Aamchoor Powder (optional)\n1/2 tsp Turmeric\n1 tsp Coriander Powder\n1 tsp Garam Masala\n1 tbsp Chilli Powder\n1/2 tsp Saunf powder\n\nMethod:\n1. Roast Besan on low flame until aromatic.\n2. Heat oil, add ajwain and okra pieces.\n3. Add salt, amchoor, turmeric and fry covered.\n4. Mix roasted besan with spice powders.\n5. Add the powder mix to fried okra and cook until golden.",
    "ingredients_detected": [
      "Chickpea Flour (Besan)",
      "Oil",
      "Ajwain (Vaamu)",
      "Okra (Bendakaya)",
      "Salt",
      "Amchoor Powder",
      "Turmeric",
      "Coriander Powder",
      "Garam Masala",
      "Chilli Powder",
      "Saunf Powder (Fennel Powder)",
      "Lemon Juice"
    ]
  },
  "transcription_telugu": [
    "[00:00] హలో ఫుడీస్, వెల్కమ్ టు విస్మయ్ ఫుడ్. ఇవాల్టి స్పెషల్ నా ఫేవరెట్ బెండకాయ కారం పొడి వేపుడు.",
    "[00:06] బెండకాయ అంటే ప్రాణం పెట్టేవారు ఖచ్చితంగా ఈ రెసిపీని ట్రై చేసి తీరాల్సిందే. అంత బాగుంటుంది.",
    "[00:11] ఎప్పుడూ చేసుకునే బెండకాయ ఫ్రైకి భిన్నంగా కారంగా పుల్ల పుల్లగా భలే బాగుంటుంది.",
    "[00:16] మధ్యాహ్నం లంచ్ లోకి డిన్నర్ లోకి చాలా పర్ఫెక్ట్ రెసిపీ ఇది. లెట్స్ స్టార్ట్.",
    "[00:20] ముందుగా అర కప్పు అంటే 110 గ్రాముల శనగపిండి వేసి లో ఫ్లేమ్ మీద మంచి సువాసన వచ్చేంతవరకు ఫ్రై చేసుకోండి.",
    "[00:27] ఇది రంగు మారి మంచి సువాసన రావడానికి కనీసం 8 నుంచి 10 నిమిషాల టైం పడుతుంది. ఇది రంగు మారాక తీసి పక్కన ఉంచుకోండి.",
    "[00:35] ఇప్పుడు పావు కప్పు ఆయిల్ హీట్ చేసుకోండి. ఇందులో ఓ టీస్పూన్ వాము వేసి వేయించుకోండి.",
    "[00:43] ఆ తర్వాత అర కిలో లేత బెండకాయ ముక్కలు అంగుళం సైజు కట్ చేసుకున్నవి వేసుకోండి. దీనికి ఆయిల్ పట్టించి సాల్ట్ వేసి కలుపుకోండి.",
    "[00:53] ఇప్పుడు ఓ టీస్పూన్ ఆమ్చూర్ పౌడర్ అదేనండి ఎండిన మామిడికాయ పొడి. ఇది వేయడం వల్ల కూరకి మంచి పులుపు వస్తుంది. ఇది దొరక్కపోతే స్కిప్ చేసేయండి.",
    "[01:02] ఇందులో అర టీస్పూన్ పసుపు వేసి బాగా కలుపుకొని టాస్ చేసుకుని మూత పెట్టి బెండకాయల్ని వేగనివ్వండి.",
    "[01:08] మధ్య మధ్యలో కలుపుతూ ఉండాలి. ఈ ఫ్రై అంతా మీడియం ఫ్లేమ్ మీద వేగాలి.",
    "[01:13] ఈ లోపు వేయించుకున్న శనగపిండిలో ఓ టీస్పూన్ ధనియాల పొడి, ఓ టీస్పూన్ గరం మసాలా, ఓ టేబుల్ స్పూన్ కారం, అర టీస్పూన్ సోంపు పొడి వేసి బాగా కలుపుకోండి.",
    "[01:21] సోంపు పొడి వేయడం వల్ల చాలా మంచి ఫ్లేవర్ వస్తుంది.",
    "[01:28] ఇప్పుడు బాగా వేగినటువంటి బెండకాయ ముక్కల్లో ఈ శనగపిండి వేసి బాగా కలుపుకోండి.",
    "[01:35] కలుపుకొని మూత పెట్టి మరో మూడు నాలుగు నిమిషాల పాటు వేగనివ్వండి.",
    "[01:41] ఆ తర్వాత మంచి గోల్డెన్ కలర్ లోకి వస్తుంది. అప్పుడు దింపి సర్వ్ చేసుకోండి.",
    "[01:45] ఆమ్చూర్ లేనివారు శనగపిండి వేసాక అరచెక్క నిమ్మరసం కూడా పిండుకోవచ్చు.",
    "[01:50] ఈ కూర చేసిన రోజున ఎంత తృప్తిగా భోజనం చేస్తారో అందరూ... ఇది నిజంగా నిజం.",
    "[01:54] చాలా బాగుంటుంది. మీకు నచ్చిందా? మరైతే మీరు ట్రై చేసి మీకు ఎలా కుదిరిందో ఖచ్చితంగా ఆ పిక్ ని విస్మయ్ ఫుడ్ ఇన్‌స్టాగ్రామ్‌లో పోస్ట్ చేయండి.",
    "[02:00] బై ది వే vismaifood.com వెబ్సైట్ విజిట్ చేయడం అస్సలు మర్చిపోకండి."
  ],
  "transcription_english": [
    "[00:00] Hello Foodies! Welcome to Vismai Food. Today's special is my favorite Okra Spiced Powder Fry (Bendakaya Karam Podi Vepudu).",
    "[00:06] Those who love okra must definitely try this recipe. It is that good.",
    "[00:11] Unlike the regular okra fry we always make, this one is spicy, tangy, and tastes amazing.",
    "[00:16] This is a very perfect recipe for afternoon lunch or dinner. Let's start.",
    "[00:20] First, add half a cup, which is 110 grams, of gram flour (besan) and fry it on low flame until it gives a nice aroma.",
    "[00:27] It takes at least 8 to 10 minutes for it to change color and release a nice aroma. Once it changes color, remove and keep it aside.",
    "[00:35] Now heat a quarter cup of oil. Add one teaspoon of ajwain (carom seeds) to it and fry.",
    "[00:43] After that, add half a kilo of tender okra pieces cut into inch-sized pieces. Coat them with oil, add salt, and mix.",
    "[00:53] Now add a teaspoon of amchur powder, which is dried mango powder. Adding this gives a nice sourness to the curry. If you don't find it, you can skip it.",
    "[01:02] Add half a teaspoon of turmeric to this, mix well, toss it, cover with a lid, and let the okra fry.",
    "[01:08] You must keep mixing in between. This entire fry should be cooked on medium flame.",
    "[01:13] Meanwhile, in the roasted gram flour, add a teaspoon of coriander powder, a teaspoon of garam masala, a tablespoon of chili powder, and half a teaspoon of fennel powder and mix well.",
    "[01:21] Adding fennel powder gives a very nice flavor.",
    "[01:28] Now add this gram flour mixture to the well-fried okra pieces and mix well.",
    "[01:35] Mix it, cover it, and let it fry for another three to four minutes.",
    "[01:41] After that, it will turn into a nice golden color. Then remove from heat and serve.",
    "[01:45] Those who don't have amchur can squeeze half a lemon slice after adding the gram flour.",
    "[01:50] Everyone will eat so satisfactorily on the day you make this curry... this is truly true.",
    "[01:54] It will be very good. Did you like it? Then you must try it and definitely post the pic of how it turned out for you on Vismai Food Instagram.",
    "[02:00] By the way, don't forget to visit the vismaifood.com website."
  ]
}