{
  "metadata": {
    "title": "Oats Masala Wada|ఓట్స్ మసాలా వడ|Oats Masala vada recipe by vismai food| Masala wada in telugu",
    "channel_name": "Vismai Food",
    "publish_date": "2019-09-10",
    "view_count": 143000,
    "like_count": 2500,
    "duration": "02:00",
    "language": "Telugu",
    "video_id": "S3zfoBoOI1h",
    "url": "https://www.youtube.com/watch?v=S3zfoBoOI1h",
    "description": "Healthy Masala Oats Wada | How to make Oats Masala Vada - Vismai Food. These spicy Oats Vadas are a great snack to go with the evening cup of tea. Here is a detailed recipe of Oats Masala Vadas with images and a video.",
    "ingredients_detected": [
      "Chana dal (1/2 Cup, soaked 2 hours)",
      "Oats (3/4 Cup)",
      "Chilli powder (1/2 tsp)",
      "Green Chilli (1 chopped)",
      "Onion (1 chopped)",
      "Salt",
      "Crushed Coriander (1 tsp)",
      "Water (3 tbsps)",
      "Coriander leaves (1/2 bunch chopped)",
      "Oil (for deep frying)"
    ]
  },
  "transcription_telugu": [
    "[00:00] హేయ్ ఫుడీస్, వెల్కమ్ టు విస్మయ్ ఫుడ్. ఇవాల్టి స్పెషల్ హెల్తీ టేస్టీ ఓట్స్ మసాలా వడ.",
    "[00:05] అబ్బబ్బబ్బ భలే ఉంటాయి ఈ వడలు. చాలా క్విక్ గా అయిపోతాయి కూడా.",
    "[00:09] బెస్ట్ పార్ట్ ఏంటంటే అస్సలు ఆయిల్ అబ్సార్బ్ చేయవు ఇవి. పిల్లల లంచ్ బాక్సులకి, ఆఫీసులకి వెళ్లేవారికి క్విక్ గా, ఈజీగా అయిపోయేటువంటి ఓ హెల్తీ ఆప్షన్ ఇది.",
    "[00:17] ఎంత బాగుంటాయో ఇవి, మీరే అంటారు ఒకసారి తిన్నాక. నిజమేనండి, భలే ఉన్నాయి, మా ఇంట్లో అందరూ మెచ్చుకున్నారు.",
    "[00:23] మా పిల్లలు ఇలా తిన్నారు, అలా తిన్నారు అని కచ్చితంగా కామెంట్ చేస్తారు, అంత బాగుంటాయి ఈ వడలు. లెట్స్ స్టార్ట్.",
    "[00:28] ముందుగా మిక్సీ జార్ లో అర కప్పు రెండు గంటల పాటు నానబెట్టుకున్నటువంటి పచ్చి శనగపప్పు వేసి, బరకగా రుబ్బుకోవాలి అస్సలు నీళ్ళు యాడ్ చేయనేకూడదు.",
    "[00:36] వీటిని బరకగా రుబ్బుకున్నప్పుడు కాస్తన్ని పప్పులు పప్పులుగానే ఉండనివ్వండి. వేగాక చాలా బాగుంటాయి వడలు.",
    "[00:41] ఇందులో ముప్పావు కప్పు ఓట్స్, అర టీ స్పూన్ కారం, ఓ పచ్చిమిర్చి తరుగు.",
    "[00:46] ఓ చిన్న ఉల్లిపాయ సన్నని తరుగు, సాల్ట్, ఓ టీ స్పూన్ నలిపిన ధనియాలు వేసి ముందు పిండిని పిండుతూ బాగా కలుపుకోండి.",
    "[00:55] ఆ తర్వాత కాసిన్ని కాసిన్ని నీళ్ళు యాడ్ చేసుకోండి. దీనికి మాకు మూడు టేబుల్ స్పూన్ల నీళ్ళు సరిపోయాయి.",
    "[01:01] పిండి గట్టిగా ఉండాలి, లేదంటే నూనెలో వేయగానే వడలు విరిగిపోతాయి. ఇది బాగా పిండుతూ కలుపుకోవాలి.",
    "[01:07] పిండి కలుపుకున్నాక ఓసారి వడ చేసుకుని చూడండి. ముద్దగా, పర్ఫెక్ట్ గా వడ షేప్ నిలుస్తుందా? ఓకే.",
    "[01:13] పొడి పొడిగా అవుతుంటే గనుక చెంచాల చొప్పున నీళ్ళు యాడ్ చేసుకుంటూ కలుపుకోండి. ఇప్పుడు అరకట్ట కొత్తిమీర తరుగు పిండిలో బాగా కలుపుకోండి.",
    "[01:19] ఆ తర్వాత వేడి వేడి నూనెలో వడల మాదిరిగా వేసుకోండి. వడలు వేయగానే గరిటె పెట్టేయకండి నూనెలో.",
    "[01:26] ఇవి బాగా వేడెక్కిన నూనెలో వేసి మీడియం ఫ్లేమ్ మీద మంచి గోల్డెన్ బ్రౌన్ కలర్ వచ్చేంత వరకు వేపుకోండి.",
    "[01:36] చూసారా? కాసేపటికి ఇంత బ్యూటిఫుల్ గా క్రిస్పీగా వస్తాయి ఇవి.",
    "[01:40] వేడి వేడిగా అల్లం పచ్చడితో తింటుంటే మజాలే మజాలే అన్నట్లే ఉంటుంది. మరి నిజంగా అంత బాగుంటాయి. కచ్చితంగా మీరు ట్రై చేయాల్సినటువంటి రెసిపీ.",
    "[01:50] మీకు నచ్చిందా? మరైతే మీరు ట్రై చేసి మీకు ఎలా కుదిరిందో కచ్చితంగా ఆ పిక్ ని విస్మయ్ ఫుడ్ ఇన్స్టాగ్రామ్ లో పోస్ట్ చేయండి.",
    "[01:55] బై ది వే vismaifood.com వెబ్సైట్ విజిట్ చేయడం అస్సలు మర్చిపోకండి."
  ],
  "transcription_english": [
    "[00:00] Hey Foodies, Welcome to Vismai Food. Today's special is Healthy Tasty Oats Masala Vada.",
    "[00:05] Oh my! These vadas are so tasty. They can be made very quickly too.",
    "[00:09] The best part is they don't absorb oil at all. It's a quick, easy, and healthy option for kids' lunch boxes and office goers.",
    "[00:17] You will say yourself how good they are once you eat them. Truly, they are great, everyone at my home praised them.",
    "[00:23] You will definitely comment saying how your kids enjoyed them this way and that way. These vadas are that good. Let's start.",
    "[00:28] First, add half a cup of chana dal soaked for two hours into a mixer jar and grind it coarsely; do not add water at all.",
    "[00:36] When grinding coarsely, let some lentils remain whole. The vadas will taste great after frying.",
    "[00:41] In this, add 3/4 cup oats, 1/2 tsp chili powder, one chopped green chili.",
    "[00:46] Add one small finely chopped onion, salt, one tsp crushed coriander seeds and mix well by squeezing the dough first.",
    "[00:55] Then add water little by little. For us, three tablespoons of water were sufficient.",
    "[01:01] The dough must be stiff, otherwise the vadas will break as soon as they are put in oil. You must mix it by squeezing well.",
    "[01:07] After mixing the dough, try making a vada. Does it hold the vada shape perfectly as a lump? Okay.",
    "[01:13] If it is becoming crumbly, add water by spoonfuls and mix. Now mix half a bunch of chopped coriander well into the dough.",
    "[01:19] Then drop them like vadas into hot oil. Do not put the ladle in the oil immediately after dropping the vadas.",
    "[01:26] Fry them in well-heated oil on medium flame until they turn a nice golden brown color.",
    "[01:36] See? After a while, they turn out this beautifully crispy.",
    "[01:40] Eating them hot with ginger chutney feels like pure bliss. They are truly that good. It is definitely a recipe you must try.",
    "[01:50] Did you like it? Then try it and definitely post the pic of how it turned out for you on Vismai Food Instagram.",
    "[01:55] By the way, don't forget to visit the vismaifood.com website."
  ]
}