{
  "metadata": {
    "title": "Boondi Kurma Recipe",
    "channel_name": "Vismai Food",
    "publish_date": "2020-05-15",
    "view_count": 557879,
    "like_count": 8900,
    "duration": "03:09",
    "language": "te",
    "video_id": "r7c1v2Z6Z4Q",
    "url": "https://www.youtube.com/watch?v=r7c1v2Z6Z4Q",
    "description": "A step-by-step video on how to make Boondi Kurma, a flavorful and easy-to-make Indian curry. The video covers the preparation of boondi from scratch and the making of the rich korma gravy.",
    "ingredients_detected": [
      "Senagapindi/Besan",
      "Rice Flour",
      "Water",
      "Oil",
      "Cashews",
      "Melon Seeds",
      "Cumin",
      "Ginger-Garlic Paste",
      "Onions",
      "Green Chillies",
      "Curry leaves",
      "Turmeric",
      "Salt",
      "Chilli powder",
      "Garam masala",
      "Roasted Cumin powder",
      "Coriander"
    ]
  },
  "transcription_telugu": [
    "[00:00:00.000] హే ఫుడీస్ వెల్కమ్ టు విస్మై ఫుడ్.",
    "[00:02:140] ఇవాల్టి స్పెషల్ నా ఆల్ టైం ఫేవరెట్ బూందీ కోర్మా.",
    "[00:05:910] ఇంట్లో కూరగాయలే లేనప్పుడు ఈజీగా ఇది చేసేయండి.",
    "[00:08:790] తిని అందరు ఫిదా అయిపోతారు అంతే.",
    "[00:10:470] ఫ్యామిలీ ఫ్యామిలీ నిజంగా చాలా చాలా బావుంటుంది.",
    "[00:13:900] రైస్ లోకి చాలా చాలా బావుంటుంది ఈ కర్రీ.",
    "[00:16:150] మీరు ఈ కర్రీని ఇక్కడ చూసేయండి.",
    "[00:18:220] చేసే ముందు ఓ సారి vismaifood.com వెబ్సైట్ విసిట్ చేసి జాగ్రత్తగా చదువుకుంటూ చేయండి.",
    "[00:22:150] మీకున్న డౌట్స్ అన్ని అక్కడ క్లారిఫై చేయబడతాయి.",
    "[00:24:600] చాలా ఈజీగా ఉంటుంది చేసుకోవడానికి కూడా.",
    "[00:27:140] లెట్స్ స్టార్ట్.",
    "[00:28:160] ముందుగా 1/2 కప్పు శెనగపిండి, 2 tbsps బియ్యం పిండి వేసి బాగా కలుపుకోండి.",
    "[00:34:110] ఇప్పుడు నీళ్ళు పోసి గరిట జారుగా పిండిని కలుపుకోండి.",
    "[00:39:350] ఇప్పుడు లోతుగా ఉన్న మూకుడులో నూనె సలసల కాగుతూ ఉండాలి.",
    "[00:42:350] అందులో బూందీ చేసుకోవాలి.",
    "[00:43:990] ఈ బూందీ గరిట మీద పెద్ద గరిటతో శెనగపిండి నిదానంగా పోసుకుంటూ సలసల కాగేటువంటి నూనెలో కేవలం హై ఫ్లేమ్ మీద మాత్రమే వేపుకోవాలి.",
    "[00:53:140] అప్పుడే బూందీ క్రంచీగా వస్తాయి.",
    "[00:55:820] ఇలా బూందీ అంత హై ఫ్లేమ్ మీద వేపుకున్నాక తీసి పక్కన ఉంచుకోండి.",
    "[01:01:830] ఇప్పుడు మిక్సీ జార్ లో 30 నిమిషాలు నానబెట్టినటువంటి 3 tbsps జీడిపప్పు, 2 tsps కర్బూజ గింజలు వేసి మెత్తని పేస్ట్ గా చేసుకోండి.",
    "[01:10:480] ఇప్పుడు 1/4 కప్పు నూనె హీట్ చేసి అందులో 1 tsp జీలకర్ర వేసి వేయించుకోండి.",
    "[01:16:530] ఆ తర్వాత 1 tsp అల్లం వెల్లుల్లి పేస్ట్ వేసి వేయించుకోండి.",
    "[01:21:840] ఇప్పుడు 2 పెద్ద ఉల్లిపాయల తరుగు పేస్ట్ చేసి వేసుకోండి.",
    "[01:25:220] ఇందులో 5 పచ్చిమిర్చి చీలికలు, 1 రెబ్బ కరివేపాకు వేసి ఉల్లిపాయల్లోంచి పచ్చి వాసన పోయేంత వరకు మీడియం ఫ్లేమ్ మీద వేపుకోండి.",
    "[01:33:480] ఉల్లిపాయలో పచ్చి వాసన పోయాక అప్పుడు జీడిపప్పు పేస్ట్ వేసి బాగా కలుపుతూ రంగు మారేంత వరకు ఫ్రై చేసుకోవాలి.",
    "[01:42:150] ఇది ఎంత బాగా వేగితే కూరకి అంత రుచి వస్తుందని మాత్రం గుర్తుంచుకోండి.",
    "[01:45:670] ఇది రంగు మారేంత వరకు కలుపుతూనే ఉండాలి.",
    "[01:47:890] కలపకపోతే అడుగు పట్టేస్తుంది.",
    "[01:49:950] ఇది రంగు మారేంత వరకు వేగడానికి కనీసం 8 నుంచి 10 నిమిషాల టైం పడుతుంది.",
    "[01:54:190] మీడియం ఫ్లేమ్ మీదే వేపాలి.",
    "[01:56:190] ఇది రంగు మారుతూ ఉండగా అప్పుడు 1/2 tsp పసుపు, సాల్ట్, 1 tbsp కారం వేసి బాగా కలుపుకోండి.",
    "[02:07:930] ఇప్పుడు 750ml నీళ్ళు పోసి బాగా కలుపుకొని మూత పెట్టి కూరని చిక్కబడనివ్వండి.",
    "[02:22:120] కూర ఇలా చిక్కబడుతూ ఉండగా అప్పుడు 3/4 tsp గరం మసాలా, 3/4 tsp వేయించిన జీలకర్ర పొడి, 2 tbsps కొత్తిమీర తరుగు చల్లి బాగా కలుపుకొని హై ఫ్లేమ్ మీద మరో రెండు నిమిషాలు ఉడకనివ్వండి.",
    "[02:33:780] కూర మరీ చిక్కగా ఉడకనివ్వకండి.",
    "[02:35:100] కాస్త జారుగా ఉండగానే దింపేసుకోండి.",
    "[02:37:370] చల్లారుతున్న కొద్దీ ఇంకా చిక్కబడుతుంది కూర.",
    "[02:40:340] జస్ట్ సర్వ్ చేసుకోవడానికి 5 నిమిషాల ముందు వేయించుకున్నటువంటి బూందీ వేసి కలిపేసుకోండి.",
    "[02:45:840] అంతే ఎంతో టేస్టీ ఐన బూందీ కూర్మా రెడీ.",
    "[02:49:150] ఈ రెసిపీ గురించి డీటెయిల్డ్ గా మీ డౌట్స్ అన్ని క్లారిఫై చేస్తూ vismaifood.com వెబ్సైట్ లో రెసిపీ ఉంచాను.",
    "[02:53:230] జాగ్రత్తగా చదువుకొని చేయండి.",
    "[02:54:830] పర్ఫెక్ట్ రెసిపీని ఎంజాయ్ చేయండి.",
    "[02:56:490] మీకు నచ్చిందా?",
    "[02:57:480] మరి అయితే మీరు ట్రై చేసి మీకు ఎలా కుదిరిందో కచ్చితంగా ఆ పిక్ ని విస్మై ఫుడ్ ఇన్స్టాగ్రామ్ లో పోస్ట్ చేయండి.",
    "[03:01:840] బై ది వే vismaifood.com వెబ్సైట్ విసిట్ చేయడం అస్సలు మర్చిపోకండి."
  ],
  "transcription_english": [
    "[00:00:00.000] Hey foodies, welcome to Vismai Food.",
    "[00:02:140] Today's special is my all-time favorite Boondi Korma.",
    "[00:05:910] When there are no vegetables at home, you can easily make this.",
    "[00:08:790] Everyone who eats it will be impressed, that's it.",
    "[00:10:470] The whole family will love it, it's really, really good.",
    "[00:13:900] This curry goes very, very well with rice.",
    "[00:16:150] You can watch how to make this curry here.",
    "[00:18:220] Before making it, visit the vismaifood.com website and read the instructions carefully while you cook.",
    "[00:22:150] All your doubts will be clarified there.",
    "[00:24:600] It's also very easy to make.",
    "[00:27:140] Let's start.",
    "[00:28:160] First, take 1/2 cup of gram flour and 2 tbsps of rice flour and mix them well.",
    "[00:34:110] Now, add water and mix the flour to a flowing consistency.",
    "[00:39:350] Now, the oil in a deep pan should be sizzling hot.",
    "[00:42:350] We need to make boondi in it.",
    "[00:43:990] Slowly pour the gram flour batter with a large ladle over a boondi ladle into the sizzling hot oil and fry only on high flame.",
    "[00:53:140] Only then will the boondi turn out crunchy.",
    "[00:55:820] After frying all the boondi on high flame, take them out and keep them aside.",
    "[01:01:830] Now, in a mixer jar, add 3 tbsps of cashews soaked for 30 minutes and 2 tsps of melon seeds, and grind them into a fine paste.",
    "[01:10:480] Now, heat 1/4 cup of oil and add 1 tsp of cumin seeds and fry.",
    "[01:16:530] After that, add 1 tsp of ginger-garlic paste and fry.",
    "[01:21:840] Now, make a paste of 2 large chopped onions and add it.",
    "[01:25:220] In this, add 5 slit green chilies and 1 sprig of curry leaves, and fry on medium flame until the raw smell of the onions is gone.",
    "[01:33:480] Once the raw smell of the onion is gone, add the cashew paste and mix well, and fry until it changes color.",
    "[01:42:150] Remember, the better this is fried, the tastier the curry will be.",
    "[01:45:670] Keep stirring until it changes color.",
    "[01:47:890] If you don't stir, it will stick to the bottom.",
    "[01:49:950] It takes at least 8 to 10 minutes to fry until it changes color.",
    "[01:54:190] You have to fry on medium flame.",
    "[01:56:190] While it's changing color, add 1/2 tsp of turmeric, salt, and 1 tbsp of chili powder and mix well.",
    "[02:07:930] Now, add 750ml of water, mix well, cover, and let the curry thicken.",
    "[02:22:120] While the curry is thickening, add 3/4 tsp of garam masala, 3/4 tsp of roasted cumin powder, and 2 tbsps of chopped coriander, mix well, and let it cook for another two minutes on high flame.",
    "[02:33:780] Don't let the curry get too thick.",
    "[02:35:100] Take it off the heat when it's still a bit runny.",
    "[02:37:370] The curry will thicken more as it cools.",
    "[02:40:340] Just 5 minutes before serving, add the fried boondi and mix.",
    "[02:45:840] That's it, the very tasty Boondi Korma is ready.",
    "[02:49:150] I have posted the recipe on the vismaifood.com website with detailed information and clarifications for all your doubts.",
    "[02:53:230] Read it carefully and make it.",
    "[02:54:830] Enjoy the perfect recipe.",
    "[02:56:490] Did you like it?",
    "[02:57:480] Then try it and be sure to post a picture of how it turned out on the Vismai Food Instagram.",
    "[03:01:840] By the way, don't forget to visit the vismaifood.com website."
  ]
}