{
  "metadata": {
    "title": "Sorakaya Pachadi Recipe | Bottle Gourd Chutney",
    "channel_name": "Vismai Food",
    "publish_date": "2019-09-05",
    "view_count": 2736780,
    "like_count": 40000,
    "duration": "01:47",
    "language": "te",
    "video_id": "E382AeVgS-w",
    "url": "https://www.youtube.com/watch?v=E382AeVgS-w",
    "description": "A step-by-step video on how to make Sorakaya Pachi Mirchi Pachadi (Bottle Gourd and Green Chilli Chutney). This chutney is a versatile side dish that pairs well with rice, idli, dosa, and chapati.",
    "ingredients_detected": [
      "Oil",
      "Bottle Gourd (Sorakaya)",
      "Green Chillies",
      "Tomatoes",
      "Salt",
      "Turmeric",
      "Coriander",
      "Tamarind",
      "Mustard seeds",
      "Urad dal",
      "Dry Chillies",
      "Cumin",
      "Curry leaves",
      "Hing/Asafoetida",
      "Garlic (optional)"
    ]
  },
  "transcription_telugu": [
    "[00:00:00.000] హే ఫుడీస్ వెల్కమ్ టు విస్మై ఫుడ్.",
    "[00:02:261] ఇవాల్టి స్పెషల్ సొరకాయ పచ్చిమిర్చి పచ్చడి.",
    "[00:05:071] అన్నం, ఇడ్లీ, అట్టు, చపాతీల్లోకి ఎక్సలెంట్ గా ఉంటుంది ఈ పచ్చడి.",
    "[00:08:921] టిఫిన్స్ లోకి ఏదో పల్లీలు, పుట్నాల పప్పుల చట్నీకి మనం అలవాటు పడిపోయాం కానీ,",
    "[00:12:751] ఇలాంటి పచ్చళ్లు అంతకంటే చాలా బావుంటాయి.",
    "[00:14:981] వండే తీరు, వేసే పదార్ధాల మీద ఆధారపడి ఉంటుంది రుచి అంతా.",
    "[00:18:611] ఓ సారి మీరు ఇది ట్రై చేసి చూడండి, చాలా నచ్చుతుంది మీకు.",
    "[00:21:841] లెట్స్ స్టార్ట్.",
    "[00:22:421] ముందుగా పాన్ లో రెండు టీ స్పూన్ల ఆయిల్ హీట్ చేసి,",
    "[00:24:811] అందులో చెక్కు తీసినటువంటి లేత గింజ పడనటువంటి సొరకాయ ముక్కలు మూడు కప్పులు, అంటే సుమారుగా 400 గ్రాములు వేసుకోండి.",
    "[00:31:851] ఇందులో 15 పచ్చిమిర్చి వేసుకోండి.",
    "[00:33:961] మిరపకాయల కారాన్ని బట్టి అడ్జస్ట్ చేసుకోండి.",
    "[00:36:901] వీటిని కలిపి మూత పెట్టి నాలుగు నిమిషాల పాటు మగ్గనివ్వండి.",
    "[00:41:691] ఆ తరువాత రెండు టొమాటో ముక్కలు, సాల్ట్, అర టీ స్పూన్ పసుపు వేసి, టొమాటోలు మెత్తగా మగ్గిపోయేంత వరకు మీడియం ఫ్లేమ్ మీద మూత పెట్టి కుక్ చేసుకోండి.",
    "[00:53:711] టొమాటోలు మగ్గాక, ఓ సారి కలుపుకొని స్టవ్ ఆపేసి, పిడికెడు కాడలతో సహా కొత్తిమీర, ఓ టేబుల్ స్పూన్ చింతపండు వేసి, ఓ సారి కలుపుకొని, కొత్తిమీరని ఆ వేడికి మగ్గనివ్వండి, చల్లారేంత వరకు మూకుడులోనే.",
    "[01:06:541] చల్లారిన తరువాత ఫైన్ గా పేస్ట్ చేసుకోండి.",
    "[01:12:151] ఇప్పుడు రెండు టీ స్పూన్ల ఆయిల్ హీట్ చేసి, అందులో ఓ టీ స్పూన్ ఆవాలు, ఓ టీ స్పూన్ మినపప్పు, రెండు ఎండుమిర్చి, ఓ టీ స్పూన్ జీలకర్ర, ఓ రెబ్బ కరివేపాకు, ఓ చిటికెడు ఇంగువ వేసి వేపుకోండి.",
    "[01:21:731] నచ్చిన వారు రెండు వెల్లుల్లి రెబ్బలు కూడా వేసుకోవచ్చు.",
    "[01:24:141] ఈ తాలింపును పచ్చడిలో కలిపేయండి.",
    "[01:26:451] అంతే యమ్మీ యమ్మీగా ఉండేటువంటి ఆనపకాయ పచ్చడి రెడీ.",
    "[01:30:451] ఇది మీరు ఓ సారి అట్టు, ఇడ్లీలోకి ట్రై చేసి చూడండి, ఎంతగా ఎంజాయ్ చేస్తారో మీ ఫ్యామిలీ అంతా మీరే చూస్తారు.",
    "[01:35:861] చాలా పర్ఫెక్ట్ గా వస్తుంది, చాలా బావుంటుంది.",
    "[01:38:431] కచ్చితంగా మీరు ట్రై చేసి మీకు ఎలా కుదిరిందో ఆ పిక్ ని విస్మై ఫుడ్ ఇన్స్టాగ్రామ్ లో పోస్ట్ చేయండి.",
    "[01:42:371] బై ది వే, vismaifood.com వెబ్సైట్ విసిట్ చేయడం అస్సలు మర్చిపోకండి, మరెన్నో రెసిపీస్ కోసం."
  ],
  "transcription_english": [
    "[00:00:00.000] Hey foodies, welcome to Vismai Food.",
    "[00:02:261] Today's special is bottle gourd and green chili chutney.",
    "[00:05:071] This chutney is excellent with rice, idli, dosa, and chapati.",
    "[00:08:921] We have gotten used to peanut and roasted gram chutneys for breakfast,",
    "[00:12:751] but chutneys like these are much better.",
    "[00:14:981] The entire taste depends on the way it is cooked and the ingredients used.",
    "[00:18:611] Try this once, you will like it a lot.",
    "[00:21:841] Let's start.",
    "[00:22:421] First, heat two teaspoons of oil in a pan.",
    "[00:24:811] In it, add three cups of peeled, tender, seedless bottle gourd pieces, which is about 400 grams.",
    "[00:31:851] Add 15 green chilies to this.",
    "[00:33:961] Adjust according to the spiciness of the chilies.",
    "[00:36:901] Mix them, cover, and let it cook for four minutes.",
    "[00:41:691] After that, add two chopped tomatoes, salt, and half a teaspoon of turmeric, cover and cook on medium flame until the tomatoes are soft and mushy.",
    "[00:53:711] Once the tomatoes are cooked, mix once and turn off the stove. Add a fistful of coriander with stems and a tablespoon of tamarind, mix once, and let the coriander wilt in that heat, right in the pan until it cools down.",
    "[01:06:541] After it cools down, grind it to a fine paste.",
    "[01:12:151] Now, heat two teaspoons of oil, and in it add one teaspoon of mustard seeds, one teaspoon of urad dal, two dry red chilies, one teaspoon of cumin seeds, a sprig of curry leaves, and a pinch of asafoetida and fry.",
    "[01:21:731] Those who like it can also add two cloves of garlic.",
    "[01:24:141] Add this tempering to the chutney.",
    "[01:26:451] That's it, the yummy yummy bottle gourd chutney is ready.",
    "[01:30:451] Try this once with dosa and idli, and you'll see for yourself how much your whole family enjoys it.",
    "[01:35:861] It comes out very perfectly and is very tasty.",
    "[01:38:431] Definitely try it, and post a picture of how it turned out for you on the Vismai Food Instagram.",
    "[01:42:371] By the way, don't forget to visit the vismaifood.com website for many more recipes."
  ]
}