{
  "metadata": {
    "title": "MASALA GUTTI BENDAKAYA FRY | మసాలా గుత్తి బెండకాయ వేపుడు | STUFFED OKRA FRY",
    "channel_name": "Vismai Food",
    "publish_date": "2019-08-01",
    "view_count": 6253456,
    "like_count": 71000,
    "duration": "02:27",
    "language": "te",
    "video_id": "J9g3O5tS4yA",
    "url": "https://www.youtube.com/watch?v=J9g3O5tS4yA",
    "description": "A step-by-step video on how to make Masala Gutti Bendakaya Vepudu (Stuffed Okra Fry). This flavorful dish is a popular South Indian preparation where tender okra are stuffed with a spicy masala powder and pan-fried.",
    "ingredients_detected": [
      "Oil",
      "Dry Chillies",
      "Coriander Seeds",
      "Chana dal",
      "Urad dal",
      "Garlic Pods",
      "Peanuts",
      "Cumin",
      "Turmeric",
      "Sesame Seeds",
      "Salt",
      "Tender Okra"
    ]
  },
  "transcription_telugu": [
    "[00:00:00.000] హే ఫుడీస్ వెల్కమ్ టు విస్మై ఫుడ్.",
    "[00:01:978] ఇవాల్టి స్పెషల్ మసాలా గుత్తి బెండకాయ వేపుడు.",
    "[00:05:138] చాలా చాలా రుచిగా ఉంటుంది.",
    "[00:06:408] బెండకాయ కూర అంటే ఇష్టపడని వారు కూడా ఇలా చేస్తే చాలా బాగా ఇష్టపడతారు.",
    "[00:10:248] వేడి వేడి అన్నంలో కాస్త నెయ్యి వేసుకుని తింటే చాలా చాలా రుచిగా ఉంటుంది.",
    "[00:14:528] మీరు ఎప్పుడు చేసినా పర్ఫెక్ట్ గా ఎలా రావాలో కొన్ని టిప్స్ ఉన్నాయి.",
    "[00:17:748] జాగ్రత్తగా వీడియో చివరి వరకు చూడండి.",
    "[00:19:308] లెట్స్ స్టార్ట్.",
    "[00:20:258] ముందుగా ఒక టేబుల్ స్పూన్ ఆయిల్ హీట్ చేసి అందులో 10 నుంచి 15 బాగా కారంగా ఉన్న ఎండుమిర్చి వేసుకోండి.",
    "[00:25:758] ఒక నిమిషం పాటు ఫ్రై చేసుకోండి.",
    "[00:27:548] ఆ తర్వాత పావు కప్పు ధనియాలు, ఒక టేబుల్ స్పూన్ శనగపప్పు, ఒక టేబుల్ స్పూన్ మినపప్పు, పది వెల్లుల్లి రెబ్బలు, పావు కప్పు వేరుశనగపప్పు, ఒక టీ స్పూన్ జీలకర్ర వేసి లో ఫ్లేమ్ మీద ఎర్రగా మంచి సువాసన వచ్చేంతవరకు ఫ్రై చేసుకుని తీరాలి.",
    "[00:42:998] ఇవి ఎంత బాగా వేగితే ఈ కూరకు అంత రుచి వస్తుంది.",
    "[00:46:668] దింపేముందు పావు చెంచా పసుపు, ఒక టీ స్పూన్ నువ్వులు, సాల్ట్ వేసి బాగా కలుపుకుని పూర్తిగా చల్లారనివ్వండి.",
    "[00:56:108] పూర్తిగా చల్లారాక జార్ లో వేసి మెత్తని పొడిగా చేసుకోండి.",
    "[01:01:618] పొడి అయ్యాక ఒక టేబుల్ స్పూన్ నీళ్లు పోసి ముద్దగా చేసుకోండి.",
    "[01:07:138] ఇప్పుడు కేవలం లేలేత బెండకాయలు 300 గ్రాములు తీసుకోండి.",
    "[01:11:328] తలా తోకలు తీసేయండి.",
    "[01:13:308] తర్వాత మధ్యకి చీరేయండి.",
    "[01:15:638] లేతవి అయితేనే ఈ కూరకి రుచి అని మాత్రం మర్చిపోకండి.",
    "[01:18:298] కట్ చేసుకున్న ప్రతి బెండకాయని వేలితో కాస్త స్ప్రెడ్ చేసి ఉంచుకోండి.",
    "[01:23:668] ఇప్పుడు రెడీ చేసి ఉంచుకున్నటువంటి పొడిని స్టఫ్ చేసుకోండి.",
    "[01:31:118] ఇప్పుడు మూడు టేబుల్ స్పూన్ల నూనె వేడిచేసి అందులో బెండకాయలు సర్ది లో ఫ్లేమ్ మీద మూతపెట్టి మూడు నాలుగు నిమిషాలపాటు మగ్గనివ్వండి.",
    "[01:40:548] మూడు నిమిషాల తర్వాత నిదానంగా తిప్పుకుంటూ అన్ని వైపులా ఎర్రగా కాలనివ్వండి.",
    "[01:47:118] ఇవి వేగడానికి కాస్త టైం పడుతుంది, ఓపిగ్గా వేపుకోవాలి.",
    "[01:50:528] అన్ని వైపులా ఎర్రగా కాలాక మంచి సువాసన వస్తూ ఉంటుంది.",
    "[01:53:238] ఆ స్టేజ్ లో కాస్త ఉప్పు పైన చల్లుకోండి.",
    "[01:55:548] ఎందుకంటే బెండకాయలు చప్పగా అనిపించవు.",
    "[01:58:38] అలాగే మిగిలి ఉన్నటువంటి పొడి చల్లి మూత పెట్టి మరో రెండు నిమిషాలు మగ్గనివ్వండి.",
    "[02:02:868] అంతే ఎక్సలెంట్ గుత్తి బెండకాయ వేపుడు రెడీ.",
    "[02:05:408] ఇది వేడి వేడి అన్నంలో నెయ్యి వేసుకుని తింటే చాలా చాలా రుచిగా ఉంటుంది.",
    "[02:09:558] కానీ పప్పుల్ని మంచి సువాసన వచ్చేంత వరకు వేపి తీరాలి.",
    "[02:12:818] లేలేత బెండకాయలే ఉండి తీరాలి.",
    "[02:14:508] అప్పుడే ఈ కూర మీరు ఎప్పుడు చేసినా పర్ఫెక్ట్ గా వస్తుంది.",
    "[02:17:918] మీకు నచ్చిందా?",
    "[02:18:968] మరి అయితే మీరు ట్రై చేసి మీకు ఎలా కుదిరిందో ఆ పిక్ ని విస్మై ఫుడ్ ఇన్స్టాగ్రామ్ లో పోస్ట్ చేయండి.",
    "[02:22:838] బై ది వే, vismaifood.com వెబ్సైట్ విసిట్ చేయడం అస్సలు మర్చిపోకండి."
  ],
  "transcription_english": [
    "[00:00:00.000] Hey foodies, welcome to Vismai Food.",
    "[00:01:978] Today's special is Masala Stuffed Okra Fry.",
    "[00:05:138] It will be very, very tasty.",
    "[00:06:408] Even those who don't like okra curry will love it when made this way.",
    "[00:10:248] It tastes very, very delicious with a little ghee in hot rice.",
    "[00:14:528] There are some tips on how to get it perfect every time you make it.",
    "[00:17:748] Watch the video carefully until the end.",
    "[00:19:308] Let's start.",
    "[00:20:258] First, heat one tablespoon of oil and add 10 to 15 very spicy dry red chilies.",
    "[00:25:758] Fry for a minute.",
    "[00:27:548] After that, add a quarter cup of coriander seeds, one tablespoon of chana dal, one tablespoon of urad dal, ten garlic cloves, a quarter cup of peanuts, and one teaspoon of cumin seeds, and you must fry on low flame until they turn red and aromatic.",
    "[00:42:998] The better these are fried, the tastier this curry will be.",
    "[00:46:668] Before removing from heat, add a quarter spoon of turmeric, one teaspoon of sesame seeds, and salt, mix well, and let it cool completely.",
    "[00:56:108] Once completely cooled, put it in a jar and grind it into a fine powder.",
    "[01:01:618] After it becomes a powder, add one tablespoon of water and make it into a paste.",
    "[01:07:138] Now, take only 300 grams of very tender okra.",
    "[01:11:328] Cut off the ends.",
    "[01:13:308] Then slit it in the middle.",
    "[01:15:638] Don't forget that this curry is tasty only with tender ones.",
    "[01:18:298] Gently spread open each cut okra with your finger.",
    "[01:23:668] Now, stuff it with the prepared powder.",
    "[01:31:118] Now, heat three tablespoons of oil, arrange the okra in it, cover, and let it cook on low flame for three to four minutes.",
    "[01:40:548] After three minutes, slowly turn them over and let them brown on all sides.",
    "[01:47:118] It takes some time for these to fry, you have to be patient.",
    "[01:50:528] Once it's browned on all sides, it will have a nice aroma.",
    "[01:53:238] At that stage, sprinkle a little salt on top.",
    "[01:55:548] Because the okra won't taste bland.",
    "[01:58:38] Also, sprinkle the remaining powder, cover, and let it cook for another two minutes.",
    "[02:02:868] That's it, excellent stuffed okra fry is ready.",
    "[02:05:408] This is very, very tasty with ghee in hot rice.",
    "[02:09:558] But you must roast the lentils until they are very fragrant.",
    "[02:12:818] You must use only tender okra.",
    "[02:14:508] Only then will this curry turn out perfect every time you make it.",
    "[02:17:918] Did you like it?",
    "[02:18:968] Then try it and be sure to post a picture of how it turned out on the Vismai Food Instagram.",
    "[02:22:838] By the way, don't forget to visit the vismaifood.com website."
  ]
}