{
  "metadata": {
    "title": "MUNAKKAYA MENTHI AAVAKAYA | మునక్కాయ మెంతి ఆవకాయ | DRUMSTICK PICKLE",
    "channel_name": "Vismai Food",
    "publish_date": "2018-05-18",
    "view_count": 2430944,
    "like_count": 35000,
    "duration": "02:29",
    "language": "te",
    "video_id": "kF82X25-2U0",
    "url": "https://www.youtube.com/watch?v=kF82X25-2U0",
    "description": "A detailed recipe for making Munakkaya Menthi Ooragaya (Drumstick Fenugreek Pickle), a traditional South Indian pickle. The video covers the process of preparing the spice mix and pickling the drumsticks for long shelf life.",
    "ingredients_detected": [
      "Fenugreek seeds (Menthulu)",
      "Mustard seeds (Aavalu)",
      "Peanut oil",
      "Drumsticks (Munakkada)",
      "Chilli Powder",
      "Salt",
      "Tamarind",
      "Turmeric"
    ]
  },
  "transcription_telugu": [
    "[00:00:00.000] హే ఫుడీస్, వెల్కమ్ టు విస్మై ఫుడ్.",
    "[00:02:186] ఇవాల్టి స్పెషల్ మునక్కాడ మెంతి ఊరగాయ.",
    "[00:05:076] ఈ పచ్చడి మీకు కనీసం ఆరు నెలల పైన నిల్వ ఉంటుంది కూడా.",
    "[00:08:166] మునక్కాయల్లోనే ఎన్నో రకాల పచ్చళ్ళు పెట్టొచ్చు.",
    "[00:11:136] మునక్కాయ నిమ్మకాయ కారం, మునక్కాయ ఆవకాయ, మునక్కాయ బెల్లం వేసిన పచ్చడి, ఇలా ఎన్నో ఎన్నో రకాలు ఉన్నాయి.",
    "[00:16:476] అవన్నీ నేను మీకు త్వరలో చూపిస్తాను.",
    "[00:18:246] వేడి వేడి అన్నంలో నెయ్యి వేసుకుని తింటుంటే ఇంకేం వద్దనిపిస్తుంది.",
    "[00:21:036] ఈ పచ్చడితోనే మొత్తం లాగించేస్తారు, అంత రుచిగా ఉంటుంది ఈ పచ్చడి.",
    "[00:24:646] ముందు ఈ రెసిపీని జాగ్రత్తగా ఇక్కడ చూసేయండి.",
    "[00:26:886] ఈ రెసిపీని చాలా డీటెయిల్డ్ గా నేను vismaifood.com వెబ్సైట్ లో ఉంచాను.",
    "[00:30:526] చేసే ముందు ఓసారి అక్కడికి వెళ్ళి చదువుకొని కూడా చేయండి.",
    "[00:33:596] రెసిపీ లింక్ కోసం కింద డిస్క్రిప్షన్ బాక్స్ చూడండి.",
    "[00:35:886] లెట్స్ స్టార్ట్. ముందుగా 1 tbsp మెంతులు, 1 tbsp ఆవాలు వేసి లో ఫ్లేమ్ మీద కలుపుతూ వేయించుకోండి.",
    "[00:42:226] ఆవాలు, మెంతులు కలుపుతూనే ఉండాలి, అలాగే వేగాలి.",
    "[00:46:166] మెంతులు ఎర్రగా వేగితే మంచి అరోమా వస్తుంది, చాలా రుచిగా ఉంటుంది.",
    "[00:50:566] మెంతులు ఎర్రగా వేగడానికి కనీసం 10 నిమిషాల పైనే టైం పడుతుంది.",
    "[00:54:686] ఇలా వేగాక దింపి చల్లార్చుకోండి.",
    "[00:59:226] ఇప్పుడు 200ml వేరుశనగ నూనె పోసి బాగా వేడి చేసుకోండి.",
    "[01:03:626] నూనె ఖచ్చితంగా బాగా వేడెక్కిన తర్వాత మాత్రమే,",
    "[01:06:646] నాలుగు బాగా కండగల మునక్కాడల్ని బాగా కడిగి తుడిచి ఆరబెట్టి పీచు తీసేసినటువంటి మునక్కాయల్ని,",
    "[01:13:216] ఒక నిమిషం పాటు ఫ్రై చేసుకొని స్టవ్ ఆపేసేయండి.",
    "[01:15:986] ఆ వేడెక్కిన నూనెకి మునక్కాయడ మగ్గిపోతుంది.",
    "[01:19:156] ఎక్కువగా వేపితే మునక్కాడలో కండ మిగలదు, పీచు తప్ప అని గుర్తుంచుకోండి.",
    "[01:22:746] మునక్కాడల్ని నూనెలోనే చల్లారనివ్వండి.",
    "[01:24:676] కాసేపటికి నూనె గోరువెచ్చగా అవుతుంది.",
    "[01:26:276] అప్పుడు 50 గ్రాముల పచ్చళ్ళ కారం,",
    "[01:33:436] 35 గ్రాముల ఉప్పు వేసి నిదానంగా పట్టించండి.",
    "[01:41:256] ఇప్పుడు చల్లారిన ఆవాలు, మెంతుల్ని ఓ మిక్సీ జార్ లో వేసి,",
    "[01:44:606] నిమ్మకాయంత సైజు చింతపండు వేసి మెత్తని పొడిగా చేసుకోండి.",
    "[01:48:986] ఇప్పుడు ఈ గ్రైండ్ చేసుకున్న మెంతి పొడిని ములక్కాడలో వేసి,",
    "[01:51:576] అలాగే 1/2 tsp పసుపు కూడా వేసి ముక్కలకు బాగా పట్టించండి.",
    "[01:56:566] ఇది పట్టించి కనీసం మూడు నాలుగు గంటల పాటు అలా గాలికి వదిలేయండి.",
    "[02:01:466] వెనకటికి అయితే రాత్రంతా వదిలేసేవారు గుడ్డ కప్పి.",
    "[02:04:146] ఆ తర్వాత జాడీలో పెట్టి రెండు రోజుల తర్వాత ఎంజాయ్ చేయండి.",
    "[02:07:956] రెండు రోజుల తర్వాత ముక్క ఊరి చాలా చాలా రుచిగా ఉంటుంది.",
    "[02:11:156] ఖచ్చితంగా మీ అందరికీ నచ్చి తీరుతుంది.",
    "[02:13:596] వేడివేడిగా నెయ్యన్నంలో లేదా పెరుగు అన్నంలో ఓ ముక్క వేసుకుని చూడండి ఎంత రుచిగా ఉంటుందో.",
    "[02:18:276] మీ అందరికీ ఖచ్చితంగా నచ్చి తీరుతుంది.",
    "[02:20:236] మీరు ట్రై చేసి మీకు ఎలా కుదిరిందో ఖచ్చితంగా ఆ పిక్ ని విస్మై ఫుడ్ ఇన్స్టాగ్రామ్ లో పోస్ట్ చేయండి.",
    "[02:24:196] బై ది వే, కామెంట్ సెక్షన్ లోనూ తెలియజేయండి.",
    "[02:25:886] vismaifood.com వెబ్సైట్ విసిట్ చేసి జాగ్రత్తగా చదువుకొని కూడా చేయొచ్చు."
  ],
  "transcription_english": [
    "[00:00:00.000] Hey foodies, welcome to Vismai Food.",
    "[00:02:186] Today's special is drumstick fenugreek pickle.",
    "[00:05:076] This pickle will last for at least six months.",
    "[00:08:166] There are many types of pickles you can make with drumsticks.",
    "[00:11:136] Drumstick lemon chili, drumstick mustard pickle, drumstick jaggery pickle, there are so many varieties.",
    "[00:16:476] I will show you all of them soon.",
    "[00:18:246] When you eat it with hot rice and ghee, what more could you want?",
    "[00:21:036] You'll finish all your rice with just this pickle, it's that delicious.",
    "[00:24:646] First, watch this recipe carefully here.",
    "[00:26:886] I have put this recipe in great detail on the vismaifood.com website.",
    "[00:30:526] Before making it, you can go there and read it as you cook.",
    "[00:33:596] For the recipe link, check the description box below.",
    "[00:35:886] Let's start. First, add 1 tbsp of fenugreek and 1 tbsp of mustard seeds and fry on low flame, stirring.",
    "[00:42:226] You have to keep stirring the mustard and fenugreek seeds, and they need to be roasted that way.",
    "[00:46:166] When the fenugreek seeds turn red, they give off a good aroma and taste very good.",
    "[00:50:566] It takes at least over 10 minutes for the fenugreek seeds to turn red.",
    "[00:54:686] After frying like this, remove from heat and let it cool.",
    "[00:59:226] Now, add 200ml of peanut oil and heat it well.",
    "[01:03:626] Only after the oil is definitely very hot,",
    "[01:06:646] take four fleshy drumsticks, wash them well, wipe them dry, de-string them,",
    "[01:13:216] fry for a minute and turn off the stove.",
    "[01:15:986] The drumstick will soften in that hot oil.",
    "[01:19:156] Remember, if you fry for too long, there will be no flesh left in the drumstick, only fiber.",
    "[01:22:746] Let the drumsticks cool down in the oil.",
    "[01:24:676] After a while, the oil will become lukewarm.",
    "[01:26:276] Then, add 50 grams of pickle chili powder,",
    "[01:33:436] add 35 grams of salt and gently coat.",
    "[01:41:256] Now, put the cooled mustard and fenugreek seeds in a mixer jar,",
    "[01:44:606] add a lemon-sized ball of tamarind, and grind to a fine powder.",
    "[01:48:986] Now, add this ground fenugreek powder to the drumsticks,",
    "[01:51:576] and also add 1/2 tsp of turmeric and coat the pieces well.",
    "[01:56:566] After coating, leave it in the open for at least three to four hours.",
    "[02:01:466] Traditionally, they used to cover it with a cloth and leave it overnight.",
    "[02:04:146] After that, transfer it to a jar and enjoy after two days.",
    "[02:07:956] After two days, the pieces will be well soaked and will be very, very tasty.",
    "[02:11:156] Everyone will surely love it.",
    "[02:13:596] Try eating a piece in hot ghee rice or curd rice, and see how delicious it is.",
    "[02:18:276] Everyone will surely like it.",
    "[02:20:236] You try it and be sure to post a picture of how it turned out on the Vismai Food Instagram.",
    "[02:24:196] By the way, also let me know in the comment section.",
    "[02:25:886] You can also visit vismaifood.com and read it carefully while you cook."
  ]
}