{
  "metadata": {
    "title": "POMFRET FISH FRY | చందువ చేపల వేపుడు | CHANDUVA FISH FRY",
    "channel_name": "Vismai Food",
    "publish_date": "2018-05-18",
    "view_count": 6052737,
    "like_count": 61000,
    "duration": "02:47",
    "language": "te",
    "video_id": "rT8g5j4Yd0A",
    "url": "https://www.youtube.com/watch?v=rT8g5j4Yd0A",
    "description": "A detailed recipe for making a perfect Pomfret Fish Fry, also known as Chanduva fish fry. The video demonstrates how to prepare the marinade, coat the fish, and fry it to achieve a crispy and spicy result. Tips are provided for ensuring the fish is cooked perfectly.",
    "ingredients_detected": [
      "Ginger Garlic paste",
      "Turmeric",
      "Salt",
      "Chilli powder",
      "Pepper Powder",
      "Lemon Juice",
      "Pomfret Fish",
      "Besan/Senagapindi (Gram flour)",
      "Semolina/Bombay ravva",
      "Oil"
    ]
  },
  "transcription_telugu": [
    "[00:00] హే ఫుడీస్, వెల్కమ్ టు విస్మై ఫుడ్.",
    "[00:03] ఇవాల్టి స్పెషల్ పర్ఫెక్ట్ పాంఫ్రెట్ ఫిష్ ఫ్రై.",
    "[00:06] దీన్నే చందువ చేప అని కూడా అంటారు.",
    "[00:08] ఇది చాలా చాలా టేస్టీగా ఉంటుంది.",
    "[00:10] ఒక్కటే ముల్లు, ఈజీగా తినేయొచ్చు.",
    "[00:13] ఈ రెసిపీని తెలుగువారికంటే కూడా మహారాష్ట్ర, కర్ణాటక, గోవా వాళ్ళు చాలా ఎక్కువగా తింటుంటారు.",
    "[00:18] ఇది నేను చాలా క్రిస్పీగా, స్పైసీగా, క్రంచీగా ఉండేట్లుగా ఇంకా పర్ఫెక్ట్ గా ఫ్రై అవ్వడానికి కావలసిన టిప్స్ తో చెప్తున్నాను.",
    "[00:25] ఎప్పుడు చేసినా చాలా బాగా వస్తుంది.",
    "[00:27] లెట్స్ స్టార్ట్. ముందుగా ఒక టేబుల్ స్పూన్ అల్లం వెల్లుల్లి పేస్ట్, అర టీ స్పూన్ పసుపు, సాల్ట్, ముప్పావు టీ స్పూన్ మిరియాల పొడి, ఒక టేబుల్ స్పూన్ కారం, రెండు టీ స్పూన్ల నిమ్మరసం వేసి ఒక పేస్ట్ గా చేసుకోండి.",
    "[00:38] ఇప్పుడు అరకిలో క్లీన్ చేసినటువంటి చేపల్ని తీసుకోండి.",
    "[00:41] ఇలా గాట్లు పెట్టి ఉండాలి దీనిమీద.",
    "[00:43] ఇప్పుడు ఒక టీ స్పూన్ మసాలా పేస్ట్ చేప ముక్క మీద వేసి, దానికి పైన, కింద, లోపల అన్ని వైపులా బాగా పట్టించండి.",
    "[00:50] 500 గ్రాములకి నాకు రెండు చేపలు వచ్చాయి.",
    "[00:53] ఈ చేపల్ని చేపలు చేపలుగానే కాలుస్తారు.",
    "[00:56] మసాలాలు బాగా పట్టించి 30 నిమిషాలు అలా వదిలేయండి.",
    "[01:00] ఇప్పుడు చేపల పైన కోటింగ్ కోసం రెండు టీ స్పూన్ల శెనగపిండి, అర కప్పు బొంబాయి రవ్వ వేసి బాగా కలుపుకోండి.",
    "[01:06] బాగా కలుపుకున్నాక, నానబెట్టినటువంటి చేపని అన్ని వైపులా ఈ పొడితో బాగా కోట్ చేసుకోండి.",
    "[01:11] పైన కింద ఒకటి రెండు సార్లు కోట్ చేయండి, అప్పుడు బాగా థిక్ గా ఫామ్ అవుతుంది కోటింగ్.",
    "[01:16] నేను ఈ చేపల్ని గ్రిల్ చేయడం కోసం మేయర్ బ్రాండ్ వారి నాన్ స్టిక్ గ్రిల్ ప్యాన్ వాడుతున్నాను.",
    "[01:21] ఇది 100% టాక్సిన్, లెడ్, క్యాడ్మియం ఫ్రీ.",
    "[01:24] ఇంకా FDA అప్రూవ్డ్ కూడా.",
    "[01:26] చాలా స్పేషియస్ ఈ ప్యాన్ పైగా థిక్ బాడీతో ఉంది.",
    "[01:29] దీని మీద ప్యాటీస్, బర్గర్స్, స్టిక్కీస్, శాండ్విచెస్ ఇలా ఏవైనా చేసుకోవచ్చు.",
    "[01:33] హీట్ ని ఈవెన్ గా ప్రొడ్యూస్ చేయడం వల్ల గ్యాస్ కూడా తక్కువగా కన్స్యూమ్ అవుతుంది.",
    "[01:37] బెస్ట్ నాన్ స్టిక్ గ్రిల్ ప్యాన్ అంటే ఇదే.",
    "[01:40] ఈ ప్యాన్ కోసం కింద డిస్క్రిప్షన్ బాక్స్ లో లింక్ ఉంచాను, చూడండి.",
    "[01:43] ఈ ప్యాన్ మీద ఇప్పుడు రెండు టేబుల్ స్పూన్ల ఆయిల్ తో బ్రష్ చేసి, కోట్ చేసుకున్నటువంటి చేప ముక్కలు జాగ్రత్తగా సర్ది కేవలం మీడియం ఫ్లేమ్ మీద మాత్రమే ఎర్రగా క్రిస్పీగా కాల్చుకోండి.",
    "[01:52] ఒక్కో సైడ్ కనీసం ఆరు నుంచి ఏడు నిమిషాలు కాల్చుకోవాలి మీడియం ఫ్లేమ్ మీద.",
    "[01:56] ఆరేడు నిమిషాల తర్వాత పై వైపు ఆయిల్ అప్లై చేసి తిప్పి మళ్ళీ ఆరేడు నిమిషాలు కాల్చుకోండి.",
    "[02:02] ఇవి సరిగ్గా లోపలి దాకా మగ్గి పైన క్రిస్పీగా అవ్వడానికి కనీసం 18 నుంచి 20 నిమిషాల టైం పడుతుంది.",
    "[02:08] ఈ రెండు చేపలకి కనీసం పావు కప్పు పైనే ఆయిల్ పడుతుంది.",
    "[02:12] అంచుల వెంట ఆయిల్ వేసుకుంటూ కాల్చుకోండి.",
    "[02:16] 20 నిమిషాల తర్వాత ఇదిగో ఇలా ఉంటుంది.",
    "[02:19] ఇలా ఎర్రగా కాలాక తీసి వేడివేడిగా ఎంజాయ్ చేయండి.",
    "[02:23] ఈ చేపని యాస్ ఇట్ ఈస్ గా స్టార్టర్ గా మీరు అలా కూర్చుని ఎంజాయ్ చేసేయొచ్చు.",
    "[02:28] లేదా మిరియాల చారుతో గానీ పప్పు చారుతో కానీ చాలా చాలా రుచిగా ఉంటుంది.",
    "[02:32] మీరు ఎప్పుడు చేసినా చాలా పర్ఫెక్ట్ గా వస్తుంది, అందరికీ నచ్చి తీరుతుంది.",
    "[02:36] మీకు నచ్చిందా?",
    "[02:38] మరి అయితే మీరు ట్రై చేసి మీకు ఎలా కుదిరిందో కచ్చితంగా ఆ పిక్ ని విస్మై ఫుడ్ ఇన్స్టాగ్రామ్ లో పోస్ట్ చేయండి.",
    "[02:43] బై ది వే, vismaifood.com వెబ్సైట్ విసిట్ చేయడం అస్సలు మర్చిపోకండి."
  ],
  "transcription_english": [
    "[00:00] Hey foodies, welcome to Vismai Food.",
    "[00:03] Today's special is the perfect Pomfret Fish Fry.",
    "[00:06] This is also called Chanduva fish.",
    "[00:08] This is very, very tasty.",
    "[00:10] Only one bone, easy to eat.",
    "[00:13] This recipe is eaten more by people from Maharashtra, Karnataka, and Goa than by Telugu people.",
    "[00:18] I'm telling you this with tips to make it very crispy, spicy, crunchy, and to fry perfectly.",
    "[00:25] It will turn out great every time you make it.",
    "[00:27] Let's start. First, take one tablespoon of ginger-garlic paste, half a teaspoon of turmeric, salt, three-quarters of a teaspoon of pepper powder, one tablespoon of chili powder, and two teaspoons of lemon juice, and make it into a paste.",
    "[00:38] Now take half a kilo of cleaned fish.",
    "[00:41] It should have slits on it like this.",
    "[00:43] Now take one teaspoon of the masala paste, put it on the fish piece, and apply it well on the top, bottom, and inside, on all sides.",
    "[00:50] For 500 grams, I got two fish.",
    "[00:53] These fish are cooked whole.",
    "[00:56] Apply the masalas well and leave it for 30 minutes.",
    "[01:00] Now, for the coating on the fish, take two teaspoons of gram flour and half a cup of Bombay rava (semolina) and mix well.",
    "[01:06] After mixing well, coat the marinated fish well with this powder on all sides.",
    "[01:11] Coat it once or twice on the top and bottom, then the coating will form very thick.",
    "[01:16] To grill these fish, I am using a non-stick grill pan from the Meyer brand.",
    "[01:21] This is 100% toxin, lead, and cadmium free.",
    "[01:24] And it's also FDA approved.",
    "[01:26] This pan is very spacious and has a thick body.",
    "[01:29] You can make patties, burgers, stickies, sandwiches, and anything else on it.",
    "[01:33] Because it produces heat evenly, it also consumes less gas.",
    "[01:37] This is the best non-stick grill pan.",
    "[01:40] I have put a link for this pan in the description box below, check it out.",
    "[01:43] Now, brush this pan with two tablespoons of oil, carefully arrange the coated fish pieces, and cook only on medium flame until they are red and crispy.",
    "[01:52] Each side should be cooked for at least six to seven minutes on medium flame.",
    "[01:56] After six or seven minutes, apply oil on the top side, flip it, and cook for another six or seven minutes.",
    "[02:02] It takes at least 18 to 20 minutes for these to cook properly on the inside and become crispy on the outside.",
    "[02:08] These two fish will need at least over a quarter cup of oil.",
    "[02:12] Cook by adding oil along the edges.",
    "[02:16] After 20 minutes, it will look like this.",
    "[02:19] Once it turns red like this, take it out and enjoy it hot.",
    "[02:23] You can enjoy this fish as a starter just as it is.",
    "[02:28] Or it tastes very, very delicious with pepper rasam or dal.",
    "[02:32] It will turn out very perfectly every time you make it, and everyone will surely like it.",
    "[02:36] Did you like it?",
    "[02:38] Then try it and be sure to post a picture of how it turned out on the Vismai Food Instagram.",
    "[02:43] By the way, don't forget to visit the vismaifood.com website."
  ]
}