{
  "metadata": {
    "title": "DADDYODANAM | Navaratri Prasadam Recipes | Temple Style Curd Rice | Sonti Daddojanam",
    "channel_name": "Vismai Food",
    "publish_date": "2018-10-14",
    "view_count": 829562,
    "like_count": 12000,
    "duration": "02:48",
    "language": "te",
    "video_id": "M0t8K3fI3fI",
    "description": "A traditional South Indian recipe for Daddojanam (Curd Rice), a special prasadam prepared during Navaratri. This temple-style curd rice is known for its unique flavor from dry ginger (sonti) and other spices.",
    "ingredients_detected": [
      "Rice",
      "Water",
      "Ghee",
      "Dry Ginger (Sonti)",
      "Mustard seeds",
      "Chana dal",
      "Urad dal",
      "Pepper",
      "Cumin",
      "Dry Chillies",
      "Curry Leaves",
      "Green Chilli (optional)",
      "Ginger",
      "Salt",
      "Fresh curd",
      "Boiled & Cooled Milk",
      "Coriander"
    ]
  },
  "transcription_telugu": [
    "[00:00:00.000] హలో ఫుడీస్, వెల్కమ్ టు విస్మై ఫుడ్.",
    "[00:02:182] ఇవాల్టి స్పెషల్ నవరాత్రుల స్పెషల్ దద్ద్యోదనం.",
    "[00:05:542] ఛానల్ లో ఇంతకుముందు ఒక ప్రసాదం రెసిపీ ఉంది.",
    "[00:07:612] అది పుణ్యక్షేత్రాల్లో ఇచ్చేటువంటి ప్రసాదం.",
    "[00:10:422] ఇది అన్ని ఆలయాల్లో ప్రత్యేకించి వైష్ణవాలయాల్లో ఇచ్చేటువంటి ప్రసాదం.",
    "[00:15:372] ఈ దధ్యోదనాన్ని స్వీకరించడం వల్ల ఎన్నో ఆరోగ్య ప్రయోజనాలు ఉన్నాయి.",
    "[00:18:962] అవన్నీ నేను వివరంగా వీడియోలో చెప్తాను.",
    "[00:21:402] ఇంకా ఈ దధ్యోదనమే కాదు, ఎన్నో రకాల దధ్యోదనాలు ఉన్నాయి.",
    "[00:24:282] అవన్నీ నేను మరో సందర్భంలో చెప్తాను.",
    "[00:26:402] ముందుగా ముప్పావు కప్పు బియ్యం కడిగి 30 నిమిషాలు నానబెట్టినది కుక్కర్ లో వేసుకోండి.",
    "[00:30:602] ఇందులో 750ml నీళ్లు పోసి మూత పెట్టి మీడియం ఫ్లేమ్ మీద నాలుగు విజిల్స్ రానివ్వండి.",
    "[00:36:582] హై ఫ్లేమ్ మీద వండకండి, మీడియం ఫ్లేమ్ మీద వండితేనే అన్నం మెత్తగా ఉడుకుతుంది.",
    "[00:40:532] అన్నం మెత్తగా ఉడికి తీరాలి.",
    "[00:42:852] ఇప్పుడు ఒక టీ స్పూన్ నెయ్యి వేడి చేసి, అందులో అర ఇంచ్ సొంటి వేసి సొంటి పైన చెక్కు ఎర్రబడేంత వరకు మీడియం ఫ్లేమ్ మీద వేపుకోండి.",
    "[00:50:882] ఇది వేగడానికి నాలుగైదు నిమిషాల టైం పడుతుంది కానీ మీడియం ఫ్లేమ్ మీదే వేపాలి.",
    "[00:54:872] ఇది ఖచ్చితంగా వేసి తీరాలి.",
    "[00:57:432] ఇది వేసిన దధ్యోదనం తింటే చాలు, చలి వల్ల కలిగేటువంటి దోషాలను పూర్తిగా నివారిస్తుంది.",
    "[01:02:62] శ్వాస ఇబ్బందులు, రొంప ఇలాంటి వాటి నుండి ఉపశమనం లభిస్తుంది.",
    "[01:05:812] అందుకే ప్రత్యేకించి ధనుర్మాసంలో వైష్ణవాలయాల్లో ఈ ప్రసాదాన్ని నివేదిస్తారు.",
    "[01:10:652] సొంటి ఎర్రగా వేగాక తీసి మెత్తని పొడిగా చేసుకోండి.",
    "[01:14:382] ఇప్పుడు రెండు టేబుల్ స్పూన్ల నెయ్యి వేడి చేసి, అందులో ఒక టీ స్పూన్ ఆవాలు వేసి చిటపటమనిపించండి.",
    "[01:19:602] ఆ తర్వాత ఒక టేబుల్ స్పూన్ శనగపప్పు, ఒక టేబుల్ స్పూన్ మినపప్పు, ముప్పావు టీ స్పూన్ మిరియాలు తప్పక వేసి తీరాలి.",
    "[01:27:12] ఒక టీ స్పూన్ జీలకర్ర వేసి వేపుకోండి.",
    "[01:29:432] నచ్చితే నూనెతో కూడా తాలింపు పెట్టుకోవచ్చు.",
    "[01:31:762] తాలింపు ఆల్మోస్ట్ వేగాక అప్పుడు రెండు ఎండుమిర్చి, ఓ రెబ్బ కరివేపాకు వేసి వేపుకొని,",
    "[01:36:992] కారం తక్కువగా ఉన్నటువంటి ఓ మిర్చి వేసుకోండి.",
    "[01:40:242] అలాగే అర టీ స్పూన్ అల్లం తరుగు వేసి వేపుకోండి.",
    "[01:42:642] పచ్చిమిర్చి కేవలం రుచి కోసమే అని గమనించండి, వేయకపోయినా పర్వాలేదు.",
    "[01:47:372] ఇప్పుడు మెత్తగా వండుకున్నటువంటి అన్నంలో సాల్ట్ వేసి సగం అన్నాన్ని మెత్తగా ఎనుపుకోండి.",
    "[01:56:52] ఆ తర్వాత కమ్మటి అర లీటర్ పెరుగు, పావు లీటర్ కాచి చల్లార్చినటువంటి పాలు, తాలింపు వేసుకోండి.",
    "[02:02:302] ఉప్పు వేసాక వేడివేడి పాలు పోయకండి, విరిగేందుకు అవకాశం ఎక్కువగా ఉంటుంది.",
    "[02:05:462] తర్వాత ఒక టీ స్పూన్ సొంటి పొడి వేసి బాగా కలుపుకోండి.",
    "[02:09:412] బాగా కలుపుకున్నాక మళ్లీ పావు లీటర్ కాచి చల్లార్చినటువంటి పాలు పోసుకోండి.",
    "[02:13:692] అంటే అర లీటర్ పెరుగు, అర లీటర్ పాలు అన్నమాట.",
    "[02:16:922] అలాగే రెండు టేబుల్ స్పూన్ల కొత్తిమీర వేసి బాగా కలుపుకోండి.",
    "[02:20:252] దధ్యోదనం కలిపిన వెంటనే కాస్త జారుగా అనిపిస్తుంది, అనిపించాలి కూడా.",
    "[02:24:622] టైం గడుస్తున్న కొద్దీ సరైన కన్సిస్టెన్సీకి వచ్చేస్తుంది.",
    "[02:27:722] ఇది రుచికి రుచి, ఆరోగ్యానికి ఆరోగ్యం.",
    "[02:29:922] తిన్న తర్వాత ఖచ్చితంగా మీ శ్వాసలో ఎంత తేడా వస్తుందో మీరే గమనిస్తారు.",
    "[02:34:642] అంత ఆరోగ్యప్రదం ఈ దధ్యోదనం.",
    "[02:36:432] ఈ ప్రసాదాన్ని దుర్గమ్మకి నివేదించి సర్వ శుభాలను పొందాలని కోరుకుంటోంది విస్మై ఫుడ్ టీం.",
    "[02:41:432] మీరు తప్పక ఈ నవరాత్రుల్లో ఈ ప్రసాదాన్ని తయారు చేసి అమ్మవారికి నివేదించి ఆవిడ అనుగ్రహాన్ని, అనుకంపని పొందండి."
  ],
  "transcription_english": [
    "Hello foodies, welcome to Vismai Food.",
    "Today's special is Navaratri special Daddojanam.",
    "There is already a prasadam recipe on the channel.",
    "That is the prasadam given in holy places.",
    "This is the prasadam given in all temples, especially Vaishnava temples.",
    "Eating this daddojanam has many health benefits.",
    "I will explain all of them in detail in the video.",
    "And it's not just this daddojanam, there are many types of daddojanam.",
    "I will tell you about all of them on another occasion.",
    "First, take three-quarters of a cup of rice, wash it, soak it for 30 minutes, and put it in a pressure cooker.",
    "Add 750ml of water to this, close the lid, and cook for four whistles on medium flame.",
    "Don't cook on high flame, the rice will cook soft only if you cook on medium flame.",
    "The rice must be cooked soft.",
    "Now, heat one teaspoon of ghee, add half an inch of dry ginger to it, and fry on medium flame until the skin of the dry ginger turns red.",
    "It takes four to five minutes to fry this, but you must fry on medium flame.",
    "This must be added.",
    "If you eat daddojanam with this, it will completely prevent the ailments caused by cold.",
    "It provides relief from breathing problems, cold, and the like.",
    "That is why this prasadam is offered in Vaishnava temples, especially in the month of Dhanurmasam.",
    "After the dry ginger turns red, take it out and grind it into a fine powder.",
    "Now, heat two tablespoons of ghee, add one teaspoon of mustard seeds, and let them splutter.",
    "After that, add one tablespoon of chana dal, one tablespoon of urad dal, and three-quarters of a teaspoon of peppercorns, which must be added.",
    "Add one teaspoon of cumin seeds and fry.",
    "If you like, you can also temper with oil.",
    "When the tempering is almost done, add two dry red chilies, a sprig of curry leaves and fry.",
    "Add one chili that is less spicy.",
    "Also, add half a teaspoon of chopped ginger and fry.",
    "Note that green chili is only for taste, it's okay if you don't add it.",
    "Now, add salt to the softly cooked rice and mash half of the rice.",
    "After that, add half a liter of fresh curd, a quarter liter of boiled and cooled milk, and the tempering.",
    "Don't pour hot milk after adding salt, there is a high chance of it curdling.",
    "Then, add one teaspoon of dry ginger powder and mix well.",
    "After mixing well, add another quarter liter of boiled and cooled milk.",
    "That is, half a liter of curd and half a liter of milk.",
    "Also, add two tablespoons of coriander and mix well.",
    "As soon as the daddojanam is mixed, it will seem a little runny, and it should.",
    "As time passes, it will reach the right consistency.",
    "This is good for taste and good for health.",
    "You will notice the difference in your breathing after eating it.",
    "This daddojanam is that healthy.",
    "The Vismai Food team wishes that you offer this prasadam to Goddess Durga and receive all her blessings.",
    "You must definitely prepare this prasadam during this Navaratri, offer it to the Goddess, and receive her grace and compassion."
  ]
}