{
  "metadata": {
    "title": "MUDDA PAPPU RECIPE | ANDHRA MUDDA PAPPU | HOW TO MAKE PERFECT MUDDA PAPPU",
    "channel_name": "Vismai Food",
    "publish_date": "2018-02-23",
    "view_count": 2732959,
    "like_count": 30000,
    "duration": "01:57",
    "language": "te",
    "video_id": "8i-B08e5s8M",
    "url": "https://www.youtube.com/watch?v=8i-B08e5s8M",
    "description": "A detailed recipe for making the perfect Andhra style Mudda Pappu (thick dal). This video guides on how to roast the dal for a unique aroma, cook it to the right consistency, and temper it for enhanced flavor.",
    "ingredients_detected": [
      "Tova Dal/Kandi Pappu",
      "Water",
      "Turmeric",
      "Salt",
      "Ghee",
      "Hing/Inguva",
      "Cumin"
    ]
  },
  "transcription_telugu": [
    "[00:00] హలో ఫుడీస్, వెల్కమ్ టు విస్మై ఫుడ్.",
    "[00:02] ఇవాల్టి స్పెషల్ పర్ఫెక్ట్ ముద్దపప్పు.",
    "[00:05] ఏంటి, కందిపప్పు ఉడకేసి ఎనిపేదాన్ని కూడా ఓ రెసిపీ అంటారా, మళ్ళీ దానికి ఓ వీడియో కూడానా అని మీకు అనిపించొచ్చు.",
    "[00:09] అంత సింపుల్ గా చెప్తే అది విస్మై ఫుడ్ ఎలా అవుతుంది?",
    "[00:12] ఏ ప్రత్యేకత లేకుండా నేను వీడియో ఎప్పటికీ పోస్ట్ చేయను.",
    "[00:15] మీరు ఈ పద్ధతిలో గాని ముద్దపప్పు చేస్తే, ఖచ్చితంగా రుచికరమైన ముద్దపప్పుని ఎంజాయ్ చేస్తారు.",
    "[00:19] ఇది మీకు ఆవకాయ పచ్చడిలోకి, దప్పళం, ముక్కల పులుసు ఇలాంటివాటిలోకి చాలా చాలా రుచిగా ఉంటుంది.",
    "[00:23] ఈ ముద్దపప్పులో మీరు ఒట్టి నెయ్యి వేసుకుని తిన్నా కూడా చాలా బాగుంటుంది.",
    "[00:27] ఈవెన్ పసిపిల్లలు కూడా చాలా ఎంజాయ్ చేస్తారు ఈ పప్పుని.",
    "[00:31] లెట్స్ స్టార్ట్. ముందుగా మూకుళలో అర కప్పు కందిపప్పు వేసి మీడియం ఫ్లేమ్ మీద కందిపప్పు రంగు మారి మంచి సువాసన వచ్చేంత వరకు కలుపుతూనే వేపుకోవాలి.",
    "[00:39] ఇది మంచి సువాసన వచ్చేంత వరకు వేపితేనే అసలు రుచి.",
    "[00:43] కందిపప్పు మంచి సువాసన వచ్చాక దింపి ఓ సారి జస్ట్ కడిగేసి కుక్కర్ లో వేసుకోండి.",
    "[00:48] ఇప్పుడు ఇందులో ఒకటిన్నర కప్పుల నీళ్లు పోసి, అర చెంచా పసుపు వేసి, మీడియం ఫ్లేమ్ మీద మాత్రమే ఆరేడు విజిల్స్ రానివ్వండి.",
    "[00:54] పప్పు వేయించడం వల్ల ఉడికేందుకు కాస్త టైం పడుతుంది.",
    "[00:58] స్టీమ్ అంతా పోయాక రుచికి సరిపడా సాల్ట్ వేసి పప్పు గుత్తితో బాగా ఎనుపుకోండి.",
    "[01:03] పప్పు వెన్నలా ఉండాలి, పలుకు అన్నదే ఉండకూడదు.",
    "[01:06] ఒకవేళ మీకు పప్పు గుత్తితో ఎనపడానికి కష్టంగా ఉంటే గనక మిక్సీలో అయినా వేయండి.",
    "[01:10] కానీ పప్పు మాత్రం వెన్నలా ఉండి తీరాలి.",
    "[01:13] ఒకవేళ మీరు పప్పుకు కాస్త ఎక్కువ నీళ్లు గాని వేసినట్లయితే, కాసేపు పొయ్యి మీద పెట్టి ఉడికించుకోండి, చిక్కబడుతుంది పప్పు.",
    "[01:19] ఇప్పుడు రెండు టీ స్పూన్ల నెయ్యి వేడి చేసుకోండి.",
    "[01:23] ఇందులో పావు చెంచా ఇంగువ, అర చెంచా జీలకర్ర వేసి వేయించి పప్పులో కలిపేసుకోండి.",
    "[01:28] నెయ్యిలో ఇంగువ, జీలకర్ర వేసి వేయించి పప్పులో కలపడం వల్ల సహజంగా వాతం చేసే గుణం ఉన్నటువంటి పప్పు త్వరగా అరిగేందుకు దోహదం చేస్తాయి.",
    "[01:34] ఇక నెయ్యి, జీలకర్ర, ఇంగువ కలిసినటువంటి అరోమా గురించి ప్రత్యేకంగా చెప్పేది ఏం లేదు.",
    "[01:38] ఓసారి ఇలా ట్రై చేసి చూడండి, ఖచ్చితంగా మీకు నచ్చి తీరుతుంది.",
    "[01:42] ఈ పప్పు వండుతుంటేనే ఇల్లు ఇల్లంతా గుమాయించిపోతుంది, అంత బాగుంటుంది ఈ పప్పు.",
    "[01:46] మీకు నచ్చిందా?",
    "[01:48] మరి అయితే మీరు ట్రై చేసి మీకు ఎలా కుదిరిందో ఖచ్చితంగా ఆ పిక్ ని విస్మై ఫుడ్ ఇన్స్టాగ్రామ్ లో పోస్ట్ చేయండి.",
    "[01:52] బై ది వే, vismaifood.com వెబ్సైట్ విసిట్ చేయడం అస్సలు మర్చిపోకండి."
  ],
  "transcription_english": [
    "[00:00] Hello foodies, welcome to Vismai Food.",
    "[00:02] Today's special is the perfect Mudda Pappu.",
    "[00:05] What, you call boiling and mashing toor dal a recipe, and even make a video for it? You might think that.",
    "[00:09] If I explain it that simply, how can it be Vismai Food?",
    "[00:12] I will never post a video without any specialty.",
    "[00:15] If you make mudda pappu in this way, you will definitely enjoy a delicious mudda pappu.",
    "[00:19] This goes very, very well with mango pickle, dappalam, and vegetable curries.",
    "[00:23] Even if you just eat this mudda pappu with ghee, it will be very good.",
    "[00:27] Even young children will enjoy this dal very much.",
    "[00:31] Let's start. First, add half a cup of toor dal to a pan and roast it on medium flame, stirring, until the dal changes color and gives off a nice aroma.",
    "[00:39] The real taste comes only when you roast it until it gives off a good aroma.",
    "[00:43] After the toor dal gives off a nice aroma, take it off the heat, just wash it once, and put it in a pressure cooker.",
    "[00:48] Now, add one and a half cups of water to this, half a spoon of turmeric, and cook on medium flame only for six to seven whistles.",
    "[00:54] Since the dal is roasted, it takes a little longer to cook.",
    "[00:58] After all the steam has escaped, add salt to taste and mash it well with a dal masher.",
    "[01:03] The dal should be like butter, there should be no lumps.",
    "[01:06] If you find it difficult to mash with a dal masher, you can even put it in a mixer.",
    "[01:10] But the dal must be like butter.",
    "[01:13] If you have added a little too much water to the dal, cook it on the stove for a while, the dal will thicken.",
    "[01:19] Now, heat two teaspoons of ghee.",
    "[01:23] Add a quarter spoon of asafoetida and half a spoon of cumin seeds to this, fry, and add to the dal.",
    "[01:28] Adding roasted asafoetida and cumin seeds in ghee to the dal helps in the quick digestion of the dal, which naturally has a vata-aggravating quality.",
    "[01:34] And there's nothing special to say about the aroma of ghee, cumin, and asafoetida mixed together.",
    "[01:38] Try it like this once, you will definitely like it.",
    "[01:42] Just cooking this dal will fill the whole house with its aroma, this dal is that good.",
    "[01:46] Did you like it?",
    "[01:48] Then try it and be sure to post a picture of how it turned out on the Vismai Food Instagram.",
    "[01:52] By the way, don't forget to visit the vismaifood.com website."
  ]
}