{
  "metadata": {
    "title": "CABBAGE SAMBAR | Vismai Food | Cabbage Recipes",
    "channel_name": "Vismai Food",
    "publish_date": "2018-04-12",
    "view_count": 919864,
    "like_count": 13000,
    "duration": "03:55",
    "language": "te",
    "video_id": "9o_C0xP9-74",
    "url": "https://www.youtube.com/watch?v=9o_C0xP9-74",
    "description": "A step-by-step recipe for making a delicious and aromatic Cabbage Sambar. This Vismai Food video details the process of roasting dal for a unique flavor, preparing a fresh sambar masala powder, and combining everything to create a perfect sambar that pairs well with rice and tiffins.",
    "ingredients_detected": [
      "Toor Dal (Kandipappu)",
      "Water",
      "Oil",
      "Fenugreek (Menthulu)",
      "Chana Dal",
      "Black Pepper",
      "Coriander seeds",
      "Rice",
      "Dry Chillies",
      "Cumin",
      "Curry leaves",
      "Asafoetida (Inguva)",
      "Fresh Coconut",
      "Cabbage",
      "Tamarind Juice",
      "Turmeric",
      "Salt",
      "Green Chillies",
      "Tomatoes",
      "Jaggery",
      "Coriander",
      "Ghee",
      "Mustard seeds",
      "Garlic"
    ]
  },
  "transcription_telugu": [
    "[00:00:00.000] హలో ఫుడీస్, వెల్కమ్ టు విస్మై ఫుడ్.",
    "[00:02:445] ఇవాల్టి స్పెషల్ కమ్మని క్యాబేజీ సాంబార్.",
    "[00:05:45] సాంబార్లలో ఎన్ని రకాలు ఉన్నాయో, బెండకాయ, ముల్లంగి, కదంబం, కళ్యాణం సాంబార్ ఇలా అన్నీ ఇన్నీ కావు, ఎన్నెన్నో ఉన్నాయి.",
    "[00:12:435] ఎప్పుడు తినే సాంబార్ కి కాస్త భిన్నంగా ఈ క్యాబేజీ సాంబార్ చేయండి.",
    "[00:15:935] ఫ్యామిలీ ఫ్యామిలీకి నచ్చేస్తుంది అంతే.",
    "[00:18:145] పిల్లలు చాలా ఎంజాయ్ చేస్తారు, చాలా కమ్మగా ఉంటుంది.",
    "[00:20:945] ఎప్పుడు చేసినా చాలా పర్ఫెక్ట్ గా వస్తుంది.",
    "[00:23:645] అప్రిషియేషన్ గ్యారెంటీడ్ రెసిపీ.",
    "[00:24:995] లెట్స్ స్టార్ట్.",
    "[00:25:995] ముందుగా అర కప్పు కందిపప్పు వేసి లో ఫ్లేమ్ మీద మంచి సువాసన వచ్చి కాస్త రంగు మారేంత వరకు రోస్ట్ చేసుకోండి.",
    "[00:31:365] రంగు మారి సువాసన రాగానే దింపి బాగా కడగండి.",
    "[00:39:625] ఆ తర్వాత కుక్కర్లో వేసి 750ml నీళ్లు పోసి, మీడియం ఫ్లేమ్ మీద ఆరేడు విజిల్స్ రానివ్వండి.",
    "[00:45:25] వేగిన పప్పు కదా, ఉడకడానికి టైం పడుతుంది మెత్తగా.",
    "[00:48:265] ఇప్పుడు సాంబార్ మసాలా కోసం 1 tsp నూనె వేడి చేసి, అందులో 1 tsp మెంతులు, 2 tsps శెనగపప్పు వేసి ఎర్రగా వేపుకోండి.",
    "[00:56:45] ఇవి బాగా వేగాక అప్పుడు 1 tsp మిరియాలు, 2 tsps ధనియాలు, 1 tbsp బియ్యం, మూడు ఎండుమిర్చి తరుగు, 1 tsp జీలకర్ర వేసి, మసాలాల్ని లో టు మీడియం ఫ్లేమ్ మీద వేపుకోండి.",
    "[01:09:455] మసాలాలు అలా వేపితేనే గుమగుమలాడిపోతుంది సాంబార్.",
    "[01:13:585] దింపే ముందు ఓ రెబ్బ కరివేపాకు, పావు చెంచా ఇంగువ, ఓ పిడికెడు పచ్చి కొబ్బరి వేసి బాగా కలిపి స్టవ్ ఆపేసి పూర్తిగా చల్లారనివ్వండి.",
    "[01:22:355] చల్లారిన తర్వాత మిక్సీ జార్లో వేసి కాస్త నీళ్లు పోసి మెత్తని పేస్ట్ గా చేసుకోండి.",
    "[01:33:645] ఇప్పుడు ఓ లీటర్ నీళ్లు పోసి, అందులో సన్నగా తరిగినటువంటి అరకిలో క్యాబేజీ వేసి మూత పెట్టి, సగం పైన ఉడికించుకోండి.",
    "[01:41:885] పూర్తిగా అస్సలు ఉడికించనేకూడదు.",
    "[01:44:605] అలా ఉడికిస్తే సాంబార్ ఉడికే పాటికి చిదురు చిదురు అయిపోతుంది.",
    "[01:47:745] సగం పైన ఉడికిన క్యాబేజీని వడకట్టేయండి.",
    "[01:50:375] ఇలా వడకట్టడం వల్ల క్యాబేజీలోని పసర వాసన పోతుంది.",
    "[01:58:655] ఇప్పుడు ఉడికిన కందిపప్పును మెత్తగా ఎనుపుకోండి.",
    "[02:02:855] ఇప్పుడు ఓ పెద్ద నిమ్మకాయ సైజు అంత చింతపండు నుండి తీసినటువంటి చింతపండు పులుసు ఓ లీటర్ మరిగించుకోండి.",
    "[02:09:475] పులుసు మరుగుతుండగా అప్పుడు 1/2 tsp పసుపు, సాల్ట్, రెండు పచ్చిమిర్చి చీలికలు, రెండు నాలుగు సగాలుగా చేసినటువంటి టొమాటోలు, మెత్తగా ఎనుపుకున్న కందిపప్పు వేసి బాగా కలిపి,",
    "[02:24:605] వడకట్టుకున్న క్యాబేజీ, గ్రైండ్ చేసుకున్నటువంటి మసాలా పేస్ట్ కూడా వేసి బాగా కలుపుకోండి.",
    "[02:33:785] అలాగే 1 tbsp కారం,",
    "[02:38:785] 2 tsps బెల్లం తరుగు, రెండు రెబ్బల కరివేపాకు వేసి బాగా కలిపి మూత పెట్టి మీడియం ఫ్లేమ్ మీద 15 నిమిషాల పాటు బాగా మరగనివ్వండి.",
    "[02:47:945] 15 నిమిషాల తర్వాత ఇదిగో ఇలా ఉంటుంది సాంబార్.",
    "[02:55:625] ఇప్పుడు రెండు టేబుల్ స్పూన్ల ఆయిల్ హీట్ చేసి, ఇందులో 1 tsp ఆవాలు, 1 tsp మెంతులు వేసి ఎర్రగా వేగనివ్వండి.",
    "[03:02:475] ఇవి వేగుతూ ఉండగా అప్పుడు 1 tsp జీలకర్ర వేసి వేగనిచ్చి,",
    "[03:06:855] పావు చెంచా ఇంగువ, నాలుగు దంచినటువంటి వెల్లుల్లి, రెండు ఎండుమిర్చి, ఓ రెబ్బ కరివేపాకు వేసి వేపి,",
    "[03:15:735] మరుగుతున్న సాంబార్లో తాలింపు వేయండి.",
    "[03:17:855] అలాగే ఓ పిడికెడు కొత్తిమీర కూడా వేసి వెంటనే మూత పెట్టి మరో రెండు నిమిషాల పాటు హై ఫ్లేమ్ మీద బాగా మరగనివ్వండి.",
    "[03:24:465] ఇలా మరగనివ్వడం వల్ల తాలింపులోని సువాసన సాంబార్ కి పడుతుంది.",
    "[03:27:905] అంతే కమ్మటి క్యాబేజీ సాంబార్.",
    "[03:30:865] ఈ సాంబార్ మీరు వండుతుంటేనే ఇల్లు ఇల్లంతా గుమగుమలాడిపోతుంది, అంత బావుంటుంది ఈ సాంబార్.",
    "[03:35:165] మీరు ఎప్పుడు చేసినా చాలా పర్ఫెక్ట్ గా వస్తుంది.",
    "[03:38:435] మీరు గుర్తుంచుకోవాల్సింది ఈ సాంబార్ కమ్మగా ఉంటుంది, కారంగా ఘాటుగా అస్సలు ఉండదు.",
    "[03:42:615] ఒకవేళ మీకు అలా కావాలంటే మీకు తగ్గట్లుగా ఉప్పు కారాలు అడ్జస్ట్ చేసుకోండి.",
    "[03:46:585] మీకు నచ్చిందా?",
    "[03:47:755] మరి అయితే మీరు ట్రై చేసి మీకు ఎలా కుదిరిందో ఖచ్చితంగా ఆ పిక్ ని విస్మై ఫుడ్ ఇన్స్టాగ్రామ్ లో పోస్ట్ చేయండి.",
    "[03:51:985] బై ది వే, vismaifood.com వెబ్సైట్ విసిట్ చేయడం అస్సలు మర్చిపోకండి."
  ],
  "transcription_english": [
    "Hello foodies, welcome to Vismai Food.",
    "Today's special is delicious cabbage sambar.",
    "There are so many types of sambar, okra, radish, kadambam, kalyanam sambar, there are countless varieties.",
    "Make this cabbage sambar as a little change from the usual sambar you eat.",
    "The whole family will love it, that's it.",
    "Kids will enjoy it a lot, it will be very delicious.",
    "It turns out perfectly every time you make it.",
    "An appreciation-guaranteed recipe.",
    "Let's start.",
    "First, add half a cup of toor dal and roast it on low flame until it gets a nice aroma and changes color slightly.",
    "As soon as it changes color and gives off a good aroma, take it off the heat and wash it well.",
    "After that, put it in a pressure cooker, add 750ml of water, and cook for six to seven whistles on medium flame.",
    "Since it's roasted dal, it will take time to cook until soft.",
    "Now, for the sambar masala, heat 1 tsp of oil, add 1 tsp of fenugreek seeds, and 2 tsps of chana dal and fry until they turn red.",
    "After these are well fried, add 1 tsp of pepper, 2 tsps of coriander, 1 tbsp of rice, three chopped dry red chilies, 1 tsp of cumin, and fry the masalas on low to medium flame.",
    "The sambar will be aromatic only if you roast the masalas like that.",
    "Before taking it off the heat, add a sprig of curry leaves, a quarter spoon of asafoetida, a fistful of fresh coconut, mix well, turn off the stove, and let it cool completely.",
    "After it cools down, put it in a mixer jar, add some water, and grind it to a fine paste.",
    "Now, add one liter of water, add half a kilo of finely chopped cabbage, cover, and cook until more than half done.",
    "It should not be cooked completely.",
    "If you cook it like that, it will become mushy by the time the sambar is cooked.",
    "Drain the cabbage that is more than half cooked.",
    "Draining it like this removes the raw smell of the cabbage.",
    "Now, mash the cooked toor dal until soft.",
    "Now, boil one liter of tamarind juice extracted from a large lemon-sized ball of tamarind.",
    "While the juice is boiling, add 1/2 tsp of turmeric, salt, two slit green chilies, two tomatoes cut into four halves, and the mashed toor dal, and mix well.",
    "Add the drained cabbage and the ground masala paste and mix well.",
    "Also, add 1 tbsp of chili powder,",
    "2 tsps of jaggery, and two sprigs of curry leaves, mix well, cover, and let it boil well on medium flame for 15 minutes.",
    "After 15 minutes, the sambar will look like this.",
    "Now, heat two tablespoons of oil, add 1 tsp of mustard seeds, and 1 tsp of fenugreek seeds, and let them turn red.",
    "While these are frying, add 1 tsp of cumin seeds and let them fry.",
    "Add a quarter spoon of asafoetida, four crushed garlic cloves, two dry red chilies, and a sprig of curry leaves, fry,",
    "and add the tempering to the boiling sambar.",
    "Also, add a fistful of coriander, immediately cover, and let it boil well on high flame for another two minutes.",
    "Boiling it like this infuses the aroma of the tempering into the sambar.",
    "That's it, delicious cabbage sambar.",
    "When you are cooking this sambar, the whole house will be filled with its aroma, this sambar is that good.",
    "It will turn out very perfectly every time you make it.",
    "You must remember that this sambar is delicious, not spicy or pungent at all.",
    "If you want it that way, adjust the salt and chili according to your taste.",
    "Did you like it?",
    "Then try it and be sure to post a picture of how it turned out on the Vismai Food Instagram.",
    "By the way, don't forget to visit the vismaifood.com website."
  ]
}