{
  "metadata": {
    "title": "PERFECT DHABA DAL | ढाबा दाल | DHABA STYLE DAL FRY",
    "channel_name": "Vismai Food",
    "publish_date": "2017-12-04",
    "view_count": 6667107,
    "like_count": 78000,
    "duration": "02:47",
    "language": "te",
    "video_id": "8VbCPt9022o",
    "url": "https://www.youtube.com/watch?v=8VbCPt9022o",
    "description": "A detailed recipe for making authentic Dhaba style dal fry. The video demonstrates the use of husked urad dal and a blend of aromatic spices to create a rich and flavorful dal, perfect with roti or rice.",
    "ingredients_detected": [
      "Husked Urad dal",
      "Turmeric",
      "Salt",
      "Water",
      "Ghee/Oil",
      "Cumin",
      "Ginger",
      "Garlic",
      "Onion",
      "Green Chillies",
      "Tomato Puree",
      "Coriander",
      "Masala Powder (made from Cinnamon, Coriander Seeds, Cumin, Saunf, Javitri, Chilli Powder, Salt, Turmeric)"
    ]
  },
  "transcription_telugu": [
    "[00:00:00.000] హే ఫుడీస్, వెల్కమ్ టు విస్మై ఫుడ్.",
    "[00:02:839] ఇవాల్టి స్పెషల్ పర్ఫెక్ట్ ఢాబా దాల్.",
    "[00:05:19] కాయగూరలు మార్చి మార్చి, ఎప్పుడూ ఒకటే తినేటువంటి కందిపప్పు కంటే,",
    "[00:08:929] ఇలా మినపప్పుతో కొన్ని ఏరోమాటిక్ మసాలాలు జతచేసి తింటే,",
    "[00:12:879] ఆహా, ఆ టేస్టే ఎంత బాగుంటుందో.",
    "[00:14:989] ఎదిగే పిల్లలకి చాలా ఆరోగ్యం.",
    "[00:17:159] ఈరోజు మా స్పెషల్ పప్పు అని గర్వంగా చెప్పుకునే అంత బాగుంటుంది ఈ పప్పు.",
    "[00:21:289] చాలా స్పెషల్ రెసిపీ ఇది.",
    "[00:22:459] ముఖ్యంగా రోటీల్లోకి, రైస్ లోకి చాలా చాలా బాగుంటుంది.",
    "[00:25:749] చాలా పర్ఫెక్ట్ గా వస్తుంది.",
    "[00:26:749] లెట్స్ స్టార్ట్.",
    "[00:28:349] ముందుగా నాలుగు గంటల నానబెట్టినటువంటి బద్దలుగా ఉన్నటువంటి మినపప్పు అర కప్పు కుక్కర్ లో వేసుకోండి.",
    "[00:33:969] కాస్త పసుపు, కొద్దిగా సాల్ట్ వేసి, ఇందులో రెండు కప్పుల నీళ్లు పోసి, మీడియం ఫ్లేమ్ మీద ఏడెనిమిది విజిల్స్ రానివ్వాలి, మీడియం ఫ్లేమ్ మీద మాత్రమే.",
    "[00:43:59] పప్పు పట్టుకుంటే వెన్నలా మెత్తగా ఉడికి ఉండాలి.",
    "[00:46:189] ఇది మస్ట్, అప్పుడే రుచి.",
    "[00:51:309] ఇప్పుడు ప్యాన్ లో ఒక చిన్న దాల్చిన చెక్క, ఒక టేబుల్ స్పూన్ ధనియాలు, ఒక టీ స్పూన్ జీలకర్ర, ఒక టీ స్పూన్ సోంపు వేసి లో ఫ్లేమ్ మీద మంచి సువాసన వచ్చేంత వరకు రోస్ట్ చేసుకోండి.",
    "[01:02:189] మంచి సువాసన వచ్చాక దింపి మిక్సీ జార్ లో వేసి, అందులో కొద్దిగా జాపత్రి, ఒక టేబుల్ స్పూన్ కారం, సాల్ట్, అర టీ స్పూన్ పసుపు వేసి ఫైన్ గా గ్రైండ్ చేసేసుకోండి.",
    "[01:13:629] ఇప్పుడు రెండు టేబుల్ స్పూన్ల నెయ్యి కరిగించుకోండి.",
    "[01:16:349] నెయ్యికి బదులు మీరు నూనె కూడా వాడుకోవచ్చు ఇక్కడ.",
    "[01:18:239] నెయ్యి వేడెక్కాక ఒక టీ స్పూన్ జీలకర్ర, ఒక టీ స్పూన్ అల్లం తరుగు, ఒక టేబుల్ స్పూన్ వెల్లుల్లి తరుగు వేసి ఎర్రగా వేపుకోండి.",
    "[01:28:139] ఇవి బాగా వేగాక, అప్పుడు ఒక ఉల్లిపాయ, మూడు పచ్చిమిర్చి తరుగు వేసి, ఉల్లిపాయలు పూర్తిగా మగ్గేంత వరకు ఫ్రై చేసుకోండి.",
    "[01:36:139] ఉల్లిపాయల్ని మరీ ఎర్రగా వేపకండి.",
    "[01:38:719] ఉల్లిపాయలు పూర్తిగా మగ్గాక, నీళ్లతో సహా మినపప్పు వేసి రెండు నిమిషాల పాటు బాగా ఫ్రై చేసుకోండి.",
    "[01:47:619] రెండు నిమిషాల తర్వాత, ముప్పావు కప్పు టొమాటో ప్యూరీ వేసుకోండి.",
    "[01:50:189] ఇది రెండు పెద్ద టొమాటోల ప్యూరీ.",
    "[01:52:19] ఇది వేసి టొమాటోల్లోంచి పచ్చి వాసన పోయేంత వరకు కుక్ చేసుకోండి.",
    "[01:56:49] దీనికి కనీసం ఏడు నుంచి ఎనిమిది నిమిషాలు టైం పడుతుంది.",
    "[01:58:339] పచ్చి వాసన పోయాక, పావు లీటర్ నీళ్లు పోసి, పప్పుని మెత్తగా దగ్గర పడేంత వరకు ఉడికించుకోండి.",
    "[02:07:349] పప్పు దగ్గర పడుతుండగా, గ్రైండ్ చేసుకున్నటువంటి మసాలా పౌడర్ చల్లి బాగా కలుపుకొని,",
    "[02:12:139] మరో మూడు నిమిషాలు ఉడకనివ్వండి.",
    "[02:14:139] మరో మూడు నిమిషాలు ఉడకనివ్వడం వల్ల ఫ్లేవర్స్ బాగా పడతాయి పప్పుకి.",
    "[02:22:429] దింపే ముందు రెండు టేబుల్ స్పూన్ల కొత్తిమీర తరుగు చల్లి బాగా కలుపుకొని దింపేసుకోండి.",
    "[02:26:509] ఈ పప్పుని మాత్రం కాస్త జారుగా ఉండగానే దింపేసుకోండి.",
    "[02:29:439] పొట్టు పప్పు కదా, చల్లారుతున్న కొద్దీ గట్టి పడిపోతూ ఉంటుంది.",
    "[02:32:329] చాలా చాలా హెల్తీ, చాలా చాలా టేస్టీ.",
    "[02:35:559] మీకు ఖచ్చితంగా నచ్చి తీరుతుంది.",
    "[02:37:799] ఏంటి మరి మీకు నచ్చిందా?",
    "[02:38:919] మరి అయితే మీరు ట్రై చేసి మీకు ఎలా కుదిరిందో ఖచ్చితంగా ఆ పిక్ ని విస్మై ఫుడ్ ఇన్స్టాగ్రామ్ లో పోస్ట్ చేయండి.",
    "[02:42:859] బై ది వే, vismaifood.com వెబ్సైట్ విసిట్ చేయడం అస్సలు మర్చిపోకండి."
  ],
  "transcription_english": [
    "Hello foodies, welcome to Vismai Food.",
    "Today's special is the perfect Dhaba Dal.",
    "Instead of eating the same old toor dal, changing vegetables every time,",
    "if you eat this dal made with urad dal and some aromatic spices,",
    "oh, how good that taste is.",
    "It's very healthy for growing children.",
    "This dal is so good that you can proudly say that our special for the day is dal.",
    "This is a very special recipe.",
    "It is especially very, very good with roti and rice.",
    "It will turn out perfectly.",
    "Let's start.",
    "First, add half a cup of split urad dal, soaked for four hours, to a pressure cooker.",
    "Add a little turmeric, a little salt, and two cups of water to this, and cook on medium flame for seven to eight whistles, only on medium flame.",
    "When you touch the dal, it should be cooked soft like butter.",
    "This is a must, only then will it taste good.",
    "Now, in a pan, add a small piece of cinnamon, one tablespoon of coriander seeds, one teaspoon of cumin seeds, and one teaspoon of fennel seeds, and roast on low flame until you get a good aroma.",
    "Once you get a good aroma, take it off the heat, put it in a mixer jar, and add a little mace, one tablespoon of chili powder, salt, and half a teaspoon of turmeric, and grind it to a fine powder.",
    "Now, melt two tablespoons of ghee.",
    "You can also use oil instead of ghee here.",
    "After the ghee heats up, add one teaspoon of cumin seeds, one teaspoon of chopped ginger, and one tablespoon of chopped garlic, and fry until red.",
    "After they are well fried, add one chopped onion and three chopped green chilies, and fry until the onions are fully cooked.",
    "Don't fry the onions until they are too red.",
    "After the onions are fully cooked, add the urad dal along with the water and fry well for two minutes.",
    "After two minutes, add three-quarters of a cup of tomato puree.",
    "This is the puree of two large tomatoes.",
    "Add this and cook until the raw smell of the tomatoes is gone.",
    "This will take at least seven to eight minutes.",
    "After the raw smell is gone, add a quarter liter of water and cook the dal until it becomes soft and thick.",
    "While the dal is thickening, sprinkle the ground masala powder and mix well.",
    "Let it cook for another three minutes.",
    "Cooking for another three minutes will allow the flavors to be absorbed well by the dal.",
    "Before taking it off the heat, sprinkle two tablespoons of chopped coriander, mix well, and take it off the heat.",
    "Make sure to take this dal off the heat when it's still a bit runny.",
    "It's dal with skin, so it will keep getting thicker as it cools.",
    "Very, very healthy, very, very tasty.",
    "You will definitely like it.",
    "So, did you like it?",
    "Then try it and be sure to post a picture of how it turned out on the Vismai Food Instagram.",
    "By the way, don't forget to visit the vismaifood.com website."
  ]
}