{
  "metadata": {
    "title": "VANGI BATH MASALA CURRY | KARNATAKA STYLE BRINJAL CURRY",
    "channel_name": "Vismai Food",
    "publish_date": "2018-02-12",
    "view_count": 2726715,
    "like_count": 35000,
    "duration": "02:32",
    "language": "te",
    "video_id": "8iR4rB0b52E",
    "url": "https://www.youtube.com/watch?v=8iR4rB0b52E",
    "description": "A detailed recipe for a Karnataka special Vangi Bath Masala curry. The video guides on how to prepare the unique masala powder from scratch and then use it to cook a flavorful brinjal curry. The dish is noted for being prepared without onion or garlic, making it a distinct and tasty option.",
    "ingredients_detected": [
      "Ghee",
      "Chana dal",
      "Urad dal/Minapappu",
      "Dry Coconut",
      "Coriander Seeds",
      "Cinnamon",
      "Cloves",
      "Dry Chillies",
      "Poppy Seeds",
      "Curry Leaves",
      "Jaggery",
      "Oil",
      "Brinjal (Vankaya)",
      "Turmeric",
      "Tamarind Juice",
      "Salt"
    ]
  },
  "transcription_telugu": [
    "[00:00] హే ఫుడీస్, వెల్కమ్ టు విస్మై ఫుడ్.",
    "[00:02] ఇవాల్టి స్పెషల్ కర్ణాటక స్పెషల్ వాంగీ బాత్ మసాలా.",
    "[00:05] నేను ఇది కూర్గ్ లో ఫస్ట్ టైం టేస్ట్ చేశాను, చాలా ఏళ్ల క్రితం.",
    "[00:08] అలా గుర్తుండిపోయింది అంతే, దీని రుచి అంటే అర్ధం చేసుకోండి ఇది ఎంత బాగుంటుందో.",
    "[00:13] బెస్ట్ పార్ట్ ఏంటంటే ఇందులో ఆనియన్ కానీ, గార్లిక్ కానీ లేనేలేవు.",
    "[00:17] చాలా చాలా బాగుంటుంది, రోజువారీ చేసుకునే కూరలకి పర్ఫెక్ట్ ఈ కూర.",
    "[00:21] ముందుగా పాన్ లో ఒక టీ స్పూన్ నెయ్యి కరిగించుకోండి.",
    "[00:24] నెయ్యి కరిగాక ఒక టేబుల్ స్పూన్ పచ్చి శనగపప్పు, ఒక టేబుల్ స్పూన్ మినపప్పు వేసి ఎర్రగా వేపుకోండి.",
    "[00:30] పప్పులు రంగు మారుతున్నప్పుడు రెండు టీ స్పూన్ల ఎండుకొబ్బరి పలుకులు, ఒక టేబుల్ స్పూన్ ధనియాలు, చిన్న దాల్చిన చెక్క, నాలుగైదు లవంగాలు, ఆరేడు ఎండుమిర్చి, ఒక టేబుల్ స్పూన్ గసగసాలు వేసి లో ఫ్లేమ్ మీద మంచి సువాసన వచ్చి రంగు మారేంత వరకు వేపుకోండి.",
    "[00:43] ఈ పప్పులు మీరు ఎంత ఓపిగ్గా, జాగ్రత్తగా వేపుకుంటే, కూర అంత రుచిగా ఉంటుందని గుర్తుంచుకోండి.",
    "[00:48] పప్పులు బాగా వేగిన తర్వాత ఒక రెబ్బ కరివేపాకు వేసి బాగా వేపుకొని ఆ తర్వాత దింపి పూర్తిగా చల్లారిన తర్వాత జార్లో వేసి, ఒక టీ స్పూన్ బెల్లం తరుగు వేసి మెత్తని పొడిగా చేసుకోండి.",
    "[00:58] ఇప్పుడు మూడు టేబుల్ స్పూన్ల ఆయిల్ హీట్ చేసి అందులో ఒక రెబ్బ కరివేపాకు వేసి వేపుకోండి.",
    "[01:03] అలాగే 400 గ్రాముల పొడవుగా చీరుకున్నటువంటి వంకాయ ముక్కలు వేసుకోండి.",
    "[01:08] యాక్చువల్ గా ట్రెడిషనల్ రెసిపీ అయితే తెల్ల పొడవు వంకాయల్ని మాత్రమే వాడతారు.",
    "[01:13] నాకు హైదరాబాద్ లో ఆ వంకాయలు అవైలబుల్ గా లేవు కాబట్టి నేను మామూలు బ్లూ పొడవు వంకాయలు వాడాను.",
    "[01:18] అర చెంచా పసుపు వేసి బాగా కలిపి మూత పెట్టి వంకాయల్ని బాగా మగ్గనివ్వండి.",
    "[01:25] వంకాయలు ఆల్మోస్ట్ మగ్గాక అప్పుడు 50 ml గోలీ సైజు చింతపండు నుంచి తీసినటువంటి చింతపండు పులుసు, రుచికి సరిపడా ఉప్పు వేసి బాగా కలిపి, చింతపండు పులుసు వంకాయకి బాగా పట్టేంత వరకు మీడియం ఫ్లేమ్ మీద కుక్ చేసుకోండి.",
    "[01:38] సారీ ఫ్రెండ్స్, చింతపండు పులుసు పోయగానే ఆవిరితో కెమెరాకి అడ్డొచ్చేసి మీకు ఉప్పు క్లిప్ కనిపించలేదు.",
    "[01:43] మేము ఉప్పు వేసాము, మీరు చింతపండు పులుసుతో పాటు ఉప్పు వేసుకోండి.",
    "[01:48] వంకాయలు చింతపండు పులుసుని బాగా పీల్చుకున్నాక, గ్రైండ్ చేసుకున్నటువంటి పొడి వేసి బాగా కలుపుకోండి.",
    "[01:54] వంకాయలు గాని మరీ మెత్తగా కుక్ చేసుకున్నట్లయితే ఈ పొడి వేయగానే ముద్ద అయిపోతుందని గుర్తుంచుకోండి.",
    "[02:00] ఈ పొడి వేసి రెండు నిమిషాల పాటు ఫ్రై చేసుకొని దింపే ముందు రెండు టీ స్పూన్ల నెయ్యి వేసి బాగా కలుపుకొని దింపేసుకోండి.",
    "[02:08] అంతే, గుమగుమలాడిపోయేటువంటి వాంగీ బాత్ కర్రీ రెడీ.",
    "[02:12] ఇది వేడివేడి నెయ్యన్నంలో చాలా చాలా బాగుంటుంది.",
    "[02:15] రోజువారీ చేసుకునే కూరలకి చాలా బాగుంటుంది ఈ కర్రీ.",
    "[02:18] ఈ పొడి ఒకసారి తయారు చేసుకుని మీరు ఫ్రిజ్ లో పెట్టుకుంటే ఎప్పుడు కావాలంటే అప్పుడు ఈ కూర తయారు చేసుకోవచ్చు.",
    "[02:24] మీకు నచ్చిందా?",
    "[02:26] మరి అయితే మీరు ట్రై చేసి మీకు ఎలా కుదిరిందో ఖచ్చితంగా ఆ పిక్ ని విస్మై ఫుడ్ ఇన్స్టాగ్రామ్ లో పోస్ట్ చేయండి.",
    "[02:30] బై ది వే, vismaifood.com వెబ్సైట్ విసిట్ చేయడం అస్సలు మర్చిపోకండి."
  ],
  "transcription_english": [
    "[00:00] Hello foodies, welcome to Vismai Food.",
    "[00:02] Today's special is Karnataka special Vangi Bath Masala.",
    "[00:05] I first tasted this in Coorg many years ago.",
    "[00:08] It has stayed with me ever since, so you can understand how good its taste is.",
    "[00:13] The best part is that there is no onion or garlic in it.",
    "[00:17] It is very, very good, and this curry is perfect for everyday meals.",
    "[00:21] First, melt one teaspoon of ghee in a pan.",
    "[00:24] After the ghee melts, add one tablespoon of chana dal and one tablespoon of urad dal and fry until they turn red.",
    "[00:30] When the dals are changing color, add two teaspoons of dry coconut pieces, one tablespoon of coriander seeds, a small piece of cinnamon, four to five cloves, six to seven dry red chilies, and one tablespoon of poppy seeds, and roast on low flame until you get a good aroma and they change color.",
    "[00:43] Remember, the more patiently and carefully you roast these dals, the tastier the curry will be.",
    "[00:48] After the dals are well roasted, add a sprig of curry leaves and fry well, then take it off the heat, and after it cools completely, put it in a jar, add one teaspoon of jaggery, and grind it into a fine powder.",
    "[00:58] Now, heat three tablespoons of oil, add a sprig of curry leaves, and fry.",
    "[01:03] Also, add 400 grams of long-sliced brinjal pieces.",
    "[01:08] Actually, the traditional recipe uses only long white brinjals.",
    "[01:13] Since those brinjals are not available to me in Hyderabad, I have used regular long blue brinjals.",
    "[01:18] Add half a spoon of turmeric, mix well, cover, and let the brinjals cook well.",
    "[01:25] When the brinjals are almost cooked, add 50 ml of tamarind juice extracted from a marble-sized ball of tamarind, salt to taste, and mix well, and cook on medium flame until the brinjal absorbs the tamarind juice well.",
    "[01:38] Sorry friends, as soon as I added the tamarind juice, the steam blocked the camera and you couldn't see the salt clip.",
    "[01:43] We have added salt, so you can add salt along with the tamarind juice.",
    "[01:48] After the brinjals have absorbed the tamarind juice well, add the ground powder and mix well.",
    "[01:54] Remember, if you cook the brinjals until they are too soft, it will become mushy as soon as you add this powder.",
    "[02:00] Add this powder, fry for two minutes, and before taking it off the heat, add two teaspoons of ghee, mix well, and take it off the heat.",
    "[02:08] That's it, the aromatic Vangi Bath curry is ready.",
    "[02:12] This is very, very good with hot ghee rice.",
    "[02:15] This curry is very good for everyday meals.",
    "[02:18] If you make this powder once and store it in the fridge, you can make this curry whenever you want.",
    "[02:24] Did you like it?",
    "[02:26] Then try it and be sure to post a picture of how it turned out on the Vismai Food Instagram.",
    "[02:30] By the way, don't forget to visit the vismaifood.com website."
  ]
}