{
  "metadata": {
    "title": "PRAWNS PULAV | ROYALLA PULAV | EASY PRAWNS RECIPE",
    "channel_name": "Vismai Food",
    "publish_date": "2017-10-23",
    "view_count": 3139316,
    "like_count": 35000,
    "duration": "02:46",
    "language": "te",
    "video_id": "8M4q_v1D818",
    "url": "https://www.youtube.com/watch?v=8M4q_v1D818",
    "description": "A quick and easy recipe for Prawns Pulao. This Vismai Food video provides a simple method for beginners and bachelors to make a flavorful and perfectly cooked prawn pulao with basic ingredients.",
    "ingredients_detected": [
      "Oil",
      "Turmeric",
      "Prawns",
      "Onion",
      "Green Chillies",
      "Ginger Garlic Paste",
      "Chilli Powder",
      "Salt",
      "Garam Masala",
      "Basmati Rice",
      "Coriander",
      "Pudina (Mint)",
      "Ghee",
      "Fried onions"
    ]
  },
  "transcription_telugu": [
    "[00:00] హే ఫుడీస్, వెల్కమ్ టు విస్మై ఫుడ్.",
    "[00:02] ఇవాల్టి స్పెషల్ క్విక్ అండ్ ఈజీ ప్రాన్స్ పులావ్.",
    "[00:05] ప్రాన్స్ పులావ్ చేసే తీరులోనే చాలా చాలా రకాలుగా ఉంది ప్రాంతాన్ని బట్టి.",
    "[00:09] కానీ నేను చెప్తున్నది చాలా సింపుల్ గా, క్విక్ గా, ఈజీగా అయిపోయేటువంటి ప్రాన్స్ పులావ్.",
    "[00:13] ఇది మీరు ఎప్పుడు చేసినా చాలా పర్ఫెక్ట్ గా వస్తుంది.",
    "[00:16] ఈవెన్ బిగినర్స్, బ్యాచిలర్స్ కూడా చాలా పర్ఫెక్ట్ గా చేసేస్తారు, అంత పర్ఫెక్ట్ గా వస్తుంది, అంత పర్ఫెక్ట్ కొలతలు ఇవి.",
    "[00:21] లెట్స్ స్టార్ట్. ముందుగా పాన్ లో పావు కప్పు ఆయిల్ హీట్ చేసి, అందులో అర టీ స్పూన్ పసుపు వేసి వేయించుకోండి.",
    "[00:28] ఆ తర్వాత పావు కిలో ప్రాన్స్ వేసి 80% ఫ్రై చేసుకోండి.",
    "[00:33] నేను సముద్రపు ప్రాన్స్ వాడుతున్నాను.",
    "[00:38] ఎందుకంటే ఇవి చిన్న చిన్నవిగా, ముద్ద ముద్దలోనూ తగులుతూ ఉంటాయి, తినేటప్పుడు చాలా బాగుంటాయని.",
    "[00:43] మీకు మీకు అందుబాటులో ఉన్నవి, మీకు నచ్చిన ప్రాన్స్ వాడుకోవచ్చు.",
    "[00:48] ఈ ప్రాన్స్ లోని నీరు ఎగిరిపోయి ఆయిల్ సెపరేట్ అవ్వాలి.",
    "[00:53] అలా అవ్వడానికి కనీసం 15 నుంచి 18 నిమిషాల పైనే టైం పడుతుంది.",
    "[00:58] ఆయిల్ సెపరేట్ అయిన తర్వాత అప్పుడు ఓ బౌల్ లోకి తీసుకోండి.",
    "[01:05] ప్రాన్స్ ని మరీ ఎర్రగా వేపితే రబ్బర్ ముక్కల్లా ఉంటాయని మాత్రం గుర్తుంచుకోండి.",
    "[01:10] అలా అని పచ్చి పచ్చిగా తీయకండి.",
    "[01:15] ఇది గుర్తుంచుకుంటే చాలు, ఎప్పుడు చేసినా చాలా పర్ఫెక్ట్ గా వస్తుంది.",
    "[02:35] మీకు నచ్చిందా?",
    "[02:38] మరి అయితే మీరు ట్రై చేసి మీకు ఎలా కుదిరిందో ఖచ్చితంగా ఆ పిక్ ని విస్మై ఫుడ్ ఇన్స్టాగ్రామ్ లో పోస్ట్ చేయండి.",
    "[02:42] బై ది వే, vismaifood.com వెబ్సైట్ విసిట్ చేయడం అస్సలు మర్చిపోకండి."
  ],
  "transcription_english": [
    "[00:00] Hey foodies, welcome to Vismai Food.",
    "[00:02] Today's special is quick and easy prawns pulao.",
    "[00:05] There are many different ways to make prawns pulao, depending on the region.",
    "[00:09] But the one I'm showing you is a very simple, quick, and easy prawns pulao.",
    "[00:13] This will turn out very perfectly every time you make it.",
    "[00:16] Even beginners and bachelors can make it very perfectly, it will turn out that perfectly, and these are the perfect measurements.",
    "[00:21] Let's start. First, heat a quarter cup of oil in a pan, add half a teaspoon of turmeric to it, and fry.",
    "[00:28] After that, add a quarter kilo of prawns and fry them 80%.",
    "[00:33] I am using sea prawns.",
    "[00:38] Because they are small and you get them in every bite, they taste very good when eating.",
    "[00:43] You can use the prawns that are available to you and that you like.",
    "[00:48] The water from these prawns should evaporate and the oil should separate.",
    "[00:53] It will take at least over 15 to 18 minutes for that to happen.",
    "[00:58] After the oil separates, take them out into a bowl.",
    "[01:05] Remember that if you fry the prawns until they are too red, they will be like rubber pieces.",
    "[01:10] And don't take them out raw either.",
    "[01:15] If you just remember this, it will turn out perfectly every time you make it.",
    "[02:35] Did you like it?",
    "[02:38] Then try it and be sure to post a picture of how it turned out on the Vismai Food Instagram.",
    "[02:42] By the way, don't forget to visit the vismaifood.com website."
  ]
}