{
  "metadata": {
    "title": "POTLAKAYA PERUGU PACHADI | SNAKE GOURD CURD CURRY",
    "channel_name": "Vismai Food",
    "publish_date": "2017-09-28",
    "view_count": 2180860,
    "like_count": 23000,
    "duration": "01:58",
    "language": "te",
    "video_id": "8U6w6eX-xic",
    "url": "[https://www.youtube.com/watch?v=8U6w6eX-xic](https://www.youtube.com/watch?v=8U6w6eX-xic)",
    "description": "A quick and easy recipe for Potlakaya Perugu Pachadi (Snake Gourd Curd Chutney). The video provides a simple method for beginners to prepare a tasty and healthy side dish that pairs well with both rice and rotis.",
    "ingredients_detected": [
      "Oil",
      "Fenugreek (Menthulu)",
      "Mustard seeds",
      "Cumin",
      "Urad dal",
      "Chana dal",
      "Dry chilli",
      "Curry Leaves",
      "Snake gourd",
      "Turmeric",
      "Salt",
      "Green Chillies",
      "Ginger",
      "Curd",
      "Onion"
    ]
  },
  "transcription_telugu": [
    "[00:00] హే ఫుడీస్, వెల్కమ్ టు విస్మై ఫుడ్.",
    "[00:03] ఇవాల్టి స్పెషల్ క్విక్ అండ్ ఈజీ పొట్లకాయ పెరుగు పచ్చడి.",
    "[00:06] చాలా ఈజీగా, క్విక్ గా అయిపోతుంది ఈ రెసిపీ.",
    "[00:09] బ్యాచిలర్స్ లేదా ఇప్పుడిప్పుడే వంట నేర్చుకునే వారు కూడా పర్ఫెక్ట్ గా తక్కువ టైంలో టేస్టీ కర్రీ చేసుకోవచ్చు.",
    "[00:15] చాలా చాలా రుచిగా ఉంటుంది, చాలా హెల్తీ కూడా.",
    "[00:18] అన్నంలోకి లేదా ఏదైనా రొట్టెల్లోకి చాలా చాలా బాగుంటుంది.",
    "[00:21] లెట్స్ స్టార్ట్. ముందుగా మూకుళలో రెండు టేబుల్ స్పూన్ల ఆయిల్ హీట్ చేసి, అందులో అర టీ స్పూన్ మెంతులు వేసి కాస్త రంగు మారనీయండి.",
    "[00:28] మెంతులు రంగు మారాక అప్పుడు అర టీ స్పూన్ ఆవాలు వేసి చిటపటమనిపించండి.",
    "[00:32] ఆవాలు చిటపటలాడాక అప్పుడు ఒక టీ స్పూన్ జీలకర్ర, ఒక టీ స్పూన్ మినపప్పు, ఒక టీ స్పూన్ శనగపప్పు వేసి తాలింపును ఎర్రగా వేగనివ్వండి.",
    "[00:40] తాలింపు ఎర్రగా వేగాక, ఒక ఎండుమిర్చి తరుగు, ఒక రెబ్బ కరివేపాకు తరుగు వేసి బాగా వేపండి.",
    "[00:45] ఇవి బాగా వేగాక సుమారు 300 గ్రాముల లేత పొట్లకాయ ముక్కలు వేసి, బాగా కలిపి, పావు చెంచా పసుపు, సాల్ట్ వేసి బాగా కలిపి ముక్కల్ని బాగా మగ్గనివ్వండి.",
    "[00:55] ఈ ముక్కలు మగ్గడానికి కనీసం 15 నుంచి 18 నిమిషాల టైం పడుతుంది.",
    "[01:00] మధ్య మధ్యలో కలుపుతూ ఉండాలి, లేదంటే అడుగు పట్టేస్తుంది.",
    "[01:05] ఇప్పుడు జార్లో నాలుగైదు పచ్చిమిర్చి, ఒక టీ స్పూన్ అల్లం తరుగు వేసి మెత్తని పేస్ట్ గా చేసుకోండి.",
    "[01:12] ముక్కలు బాగా మగ్గాక అప్పుడు అల్లం పచ్చిమిర్చి పేస్ట్ వేసి ఒక నిమిషం పాటు వేగనిచ్చి దింపేసి పూర్తిగా చల్లారనివ్వాలి.",
    "[01:20] ఇప్పుడు అర లీటర్ కమ్మని పెరుగుని బాగా చిలుక్కోండి.",
    "[01:25] బాగా చిలుక్కున్నాక పూర్తిగా చల్లారినటువంటి పొట్లకాయ వేసి కలిపి, ఒక చిన్న పచ్చి ఉల్లిపాయ ముక్కలు వేసి బాగా కలుపుకోండి.",
    "[01:35] ఉల్లిపాయ ముక్కలు పచ్చివి ఆఖరున వేస్తే తినేటప్పుడు చాలా బాగుంటాయి.",
    "[01:42] ఇదే పొట్లకాయ పెరుగు పచ్చడిని మరో తీరులో కూడా చేస్తారు, అది గుమగుమలాడిపోతూ చాలా చాలా బాగుంటుంది, అది నేను తొందరలో పోస్ట్ చేస్తాను.",
    "[01:50] మరి అయితే మీరు ట్రై చేసి మీకు ఎలా కుదిరిందో ఖచ్చితంగా ఆ పిక్ ని విస్మై ఫుడ్ ఇన్స్టాగ్రామ్ లో పోస్ట్ చేయండి.",
    "[01:54] బై ది వే, vismaifood.com వెబ్సైట్ విసిట్ చేయడం అస్సలు మర్చిపోకండి."
  ],
  "transcription_english": [
    "[00:00] Hey foodies, welcome to Vismai Food.",
    "[00:03] Today's special is quick and easy snake gourd yogurt chutney.",
    "[00:06] This recipe is very easy and quick to make.",
    "[00:09] Even bachelors or those who are just learning to cook can make this tasty curry perfectly in less time.",
    "[00:15] It is very, very tasty and very healthy too.",
    "[00:18] It goes very well with rice or any kind of roti.",
    "[00:21] Let's start. First, heat two tablespoons of oil in a pan, add half a teaspoon of fenugreek seeds and let them change color a little.",
    "[00:28] After the fenugreek seeds change color, add half a teaspoon of mustard seeds and let them splutter.",
    "[00:32] After the mustard seeds splutter, add one teaspoon of cumin seeds, one teaspoon of urad dal, one teaspoon of chana dal and fry the tempering until it turns red.",
    "[00:40] After the tempering turns red, add one chopped dry red chili and one sprig of chopped curry leaves and fry well.",
    "[00:45] After they are well fried, add about 300 grams of tender snake gourd pieces, mix well, add a quarter spoon of turmeric, salt, mix well and let the pieces cook well.",
    "[00:55] It will take at least 15 to 18 minutes for these pieces to cook.",
    "[01:00] You have to keep stirring in between, otherwise it will stick to the bottom.",
    "[01:05] Now, in a jar, add four to five green chilies and one teaspoon of chopped ginger and grind it into a fine paste.",
    "[01:12] After the pieces are well cooked, add the ginger-green chili paste and fry for a minute, then take it off the heat and let it cool completely.",
    "[01:20] Now, whisk half a liter of fresh yogurt well.",
    "[01:25] After whisking well, add the completely cooled snake gourd and mix.",
    "[01:35] Add small raw onion pieces and mix well.",
    "[01:42] Adding raw onion pieces at the end makes it very tasty to eat.",
    "[01:50] This same snake gourd yogurt chutney is also made in another way, which is very aromatic and very, very good. I will post that soon.",
    "[01:54] So, you try it and be sure to post a picture of how it turned out on the Vismai Food Instagram.",
    "[01:56] By the way, don't forget to visit the vismaifood.com website."
  ]
}