{
  "metadata": {
    "title": "#MuttonLiverKhorma | మటన్ లివర్ కర్రీ |The Best Mutton Liver Khorma | How To Make Liver curry",
    "channel_name": "Vismai Food",
    "publish_date": "2018-09-08",
    "view_count": 1875107,
    "like_count": 14090,
    "duration": "02:07",
    "language": "Telugu",
    "video_id": "PoCdzTeqkbI",
    "url": "http://www.youtube.com/watch?v=PoCdzTeqkbI",
    "description": "మటన్ లివర్ ఖోర్మా చాలా ఈజీ రెసిపీ. సరైన ఇంగ్రిడియంట్స్ సరైన టైమ్ లో వేసి కుక్ చేస్తే దీని రుచి అద్భుతంగా ఉంటుంది.",
    "ingredients_detected": [
      "Mutton Liver (మటన్ లివర్) - 500g",
      "Large Onion (పెద్ద ఉల్లిపాయ) - 1",
      "Green Chillies (పచ్చి మిర్చి) - 4",
      "Oil (నూనె) - 1/4 Cup+",
      "Curry Leaves (కరివేపాకు) - 2 Sprigs",
      "Salt (ఉప్పు)",
      "Ginger Garlic Paste (అల్లం వెల్లుల్లి ముద్ద) - 1 tbsp",
      "Turmeric (పసుపు) - 1/2 tsp",
      "Coriander Powder (ధనియాల పొడి) - 1 tbsp",
      "Chilli Powder (కారం) - 1 tbsp",
      "Fresh Coconut Paste (పచ్చి కొబ్బరి పేస్ట్) - 1/2 Cup",
      "Water (నీళ్లు) - 500ml",
      "Garam Masala (గరం మసాలా) - 1/2 tsp",
      "Coriander (కొత్తిమీర) - 1/2 Bunch"
    ]
  },
  "transcription_telugu": [
    "[00:00:00.000] హలో ఫుడీస్, వెల్కమ్ టు విస్మయి ఫుడ్. ఇవాల్టి స్పెషల్ మటన్ లివర్ ఖోర్మా. చాలా చాలా ఈజీ రెసిపీ.",
    "[00:00:07.500] సరైన ఇంగ్రిడియంట్స్ సరైన టైమ్ లో వేసి కుక్ చేస్తే దీని రుచి ఎంత బావుంటుందో!",
    "[00:00:13.200] నేను ఈ కూరకి చాలా తక్కువగా స్పైసెస్ వాడాను. మీకు కావాలంటే వేసుకోండి.",
    "[00:00:24.500] ముందుగా జార్ లో ఓ పెద్ద ఉల్లిపాయ తరుగు, మూడు నాలుగు పచ్చిమిర్చి వేసి ఫైన్ గా పేస్ట్ చేసుకొని పక్కన ఉంచుకోండి.",
    "[00:00:31.800] ఇప్పుడు కడాయిలో పావు కప్పు కంటే కొంచెం ఎక్కువగా ఆయిల్ హీట్ చేసుకొని అందులో ఓ రెబ్బ కరివేపాకు వేయాలి.",
    "[00:00:40.500] గ్రైండ్ చేసుకున్నటువంటి ఆనియన్ పేస్ట్ వేసి, సాల్ట్ వేసి మీడియం ఫ్లేమ్ మీద గోల్డెన్ బ్రౌన్ కలర్ వచ్చేంతవరకు వేయించుకోండి.",
    "[00:00:49.800] ఇప్పుడు ఓ టేబుల్ స్పూన్ ఫ్రెష్ గా రుబ్బుకున్నటువంటి అల్లం వెల్లుల్లి ముద్ద వేసి పచ్చి వాసన పోయేదాకా వేపుకోండి.",
    "[00:00:58.500] పచ్చి వాసన పోయి నూనె పైకి తేలాక, అప్పుడు అర చెంచా పసుపు, ఓ టేబుల్ స్పూన్ ధనియాల పొడి, ఓ టేబుల్ స్పూన్ కారం వేసి మీడియం ఫ్లేమ్ మీద వేపుకోవాలి.",
    "[00:01:08.600] బాగా వేపుకున్నాక అర కప్పు పచ్చి కొబ్బరి పేస్ట్ వేసి పచ్చి వాసన పోయి నూనె పైకి తేలేదాకా మీడియం ఫ్లేమ్ మీద ఫ్రై చేసుకోండి.",
    "[00:01:17.400] నూనె పైకి తేలాక 500ml వాటర్ పోసుకొని హై ఫ్లేమ్ మీద ఎసరు మరిగించుకోవాలి.",
    "[00:01:27.500] ఎసరు బాగా మరుగుతున్నప్పుడు అర కిలో శుభ్రం చేసుకున్నటువంటి మటన్ లివర్ ముక్కలు వేసి బాగా కలుపుకోవాలి.",
    "[00:01:34.200] ఫ్లేమ్ సిమ్ లో పెట్టి పదిహేను నుంచి ఇరవై నిమిషాల పాటు బాగా ఉడికించుకోండి.",
    "[00:01:39.800] నూనె పైకి తేలి కూర బాగా దగ్గర పడ్డాక అర చెంచా గరం మసాలా, అర కట్ట కొత్తిమీర తరుగు వేసి కలుపుకోవాలి.",
    "[00:01:52.400] ఓ రెబ్బ కరివేపాకు వేసి దించేసుకోవడమే; ఈ కూర కారంగా ఉంటుంది కానీ ఘాటుగా ఉండదు.",
    "[00:02:01.200] చక్కగా ఎక్కువ కూర కలుపుకొని తినొచ్చు. చాలా చాలా బావుంటుంది. మీరు ట్రై చేసి మీకు ఎలా నచ్చిందో చెప్పండి."
  ],
  "transcription_english": [
    "[00:00:00.000] Hello foodies, welcome to Vismai Food. Today's special is Mutton Liver Khorma. A very very easy recipe.",
    "[00:00:07.500] If cooked with the right ingredients at the right time, the taste is amazing!",
    "[00:00:13.200] I have used very few spices for this curry. You can add more if you like.",
    "[00:00:24.500] First, take one large chopped onion and 3-4 green chillies in a jar and grind into a fine paste.",
    "[00:00:31.800] Now heat a little more than 1/4 cup of oil in a pan and add a sprig of curry leaves.",
    "[00:00:40.500] Add the ground onion paste and salt; fry on medium flame until golden brown.",
    "[00:00:49.800] Now add one tablespoon of freshly ground ginger-garlic paste and fry until the raw smell disappears.",
    "[00:00:58.500] Once the raw smell is gone and oil floats, add 1/2 tsp turmeric, 1 tbsp coriander powder, and 1 tbsp chilli powder.",
    "[00:01:08.600] After frying well, add 1/2 cup fresh coconut paste and fry on medium flame until oil floats on top.",
    "[00:01:17.400] Once oil floats, pour 500ml water and bring the gravy to a boil on high flame.",
    "[00:01:27.500] When the gravy is boiling well, add half a kilo of cleaned mutton liver pieces and mix well.",
    "[00:01:34.200] Keep the flame on low and cook well for fifteen to twenty minutes.",
    "[00:01:39.800] After the oil floats and the curry thickens, add 1/2 tsp garam masala and 1/2 bunch of chopped coriander.",
    "[00:01:52.400] Add a sprig of curry leaves and take it off the heat; this curry is spicy but not pungent.",
    "[00:02:01.200] You can enjoy it with plenty of gravy. It's very good. Try it and let us know how you liked it."
  ]
}