{
  "metadata": {
    "title": "GONGURA CHEPALA PULUSU | గోంగూర చేపల పులుసు | GONGURA FISH CURRY",
    "channel_name": "Vismai Food",
    "publish_date": "2017-09-20",
    "view_count": 4771960,
    "like_count": 45000,
    "duration": "03:29",
    "language": "te",
    "video_id": "FqY9Wv8mXhA",
    "url": "https://www.youtube.com/watch?v=FqY9Wv8mXhA",
    "description": "A step-by-step video recipe for making Gongura Chepala Pulusu (Sorrel Leaves Fish Curry), a tangy and flavorful Andhra-style dish. The video includes tips for beginners to achieve the perfect taste and consistency.",
    "ingredients_detected": [
      "Fish",
      "Ginger garlic paste",
      "Salt",
      "Turmeric",
      "Chilli powder",
      "Oil",
      "Cumin",
      "Mustard",
      "Dry Chillies",
      "Onion",
      "Gongura/Sorrel Leaves",
      "Roasted methi seeds powder",
      "Coriander powder",
      "Garam masala",
      "Tomato puree",
      "Tamarind juice",
      "Coriander"
    ]
  },
  "transcription_telugu": [
    "[00:00:00.000] హే ఫుడీస్, వెల్కమ్ టు విస్మై ఫుడ్.",
    "[00:00:03.500] ఇవాల్టి స్పెషల్ గోంగూర చేపల పులుసు.",
    "[00:00:06.200] చాలా చాలా రుచిగా ఉంటుంది, వేడివేడి అన్నం, అట్టు, ఇడ్లీ, పరాఠా, చపాతీ ఇలా దేనిలోకైనా సరే చాలా చాలా బాగుంటుంది.",
    "[00:00:12.800] చేపల పులుసులు చేయడానికి భయపడే వారు కూడా ఈ టిప్స్ తో, ఈ కొలతలతో చేస్తే పర్ఫెక్ట్ గా ఈ రెసిపీ వచ్చి తీరుతుంది, అందరికీ నచ్చి తీరుతుంది.",
    "[00:00:19.400] దీనిలో బోలెడన్ని టిప్స్ ఉన్నాయి, అవన్నీ జాగ్రత్తగా ఫాలో అవ్వండి, పర్ఫెక్ట్ రెసిపీని ఎంజాయ్ చేయండి.",
    "[00:00:24.100] లెట్స్ స్టార్ట్. ముందుగా అరకిలో శుభ్రం చేసినటువంటి చేప ముక్కల్లో ఒక టీ స్పూన్ అల్లం వెల్లుల్లి పేస్ట్, కొద్దిగా సాల్ట్, అర చెంచా పసుపు, ఒక టీ స్పూన్ కారం వేసి ముక్కలకు బాగా పట్టించండి.",
    "[00:00:35.600] మీరు దీనికి మీకు నచ్చిన చేపలు వాడుకోవచ్చు, బోన్లెస్ చేపలు కూడా వాడుకోవచ్చు.",
    "[00:00:40.200] త్వరలో నేను మీకు చేపల కుర్మా ఇంకా తెలంగాణ స్టైల్ చేపల పులుసు కూడా చెప్తాను.",
    "[00:00:45.500] ఇప్పుడు వన్ థర్డ్ కప్పు ఆయిల్ హీట్ చేసి అందులో చేప ముక్కలు సర్ది మీడియం ఫ్లేమ్ మీద ఎర్రగా క్రిస్పీగా కాల్చుకోండి.",
    "[00:00:52.300] ఇవి రెండు పక్కలా ఎర్రగా వేగిన తర్వాత తీసి పక్కన ఉంచుకోండి.",
    "[00:00:58.100] ఇప్పుడు మరో రెండు టేబుల్ స్పూన్ల ఆయిల్ హీట్ చేసి, ఇందులో ఒక టీ స్పూన్ జీలకర్ర, ఒక టీ స్పూన్ ఆవాలు వేసి చిటపటమనిపించండి.",
    "[00:01:05.400] ఆ తర్వాత రెండు ఎండుమిర్చి వేసి, అలాగే ఒక పెద్ద ఉల్లిపాయ సన్నని తరుగు వేసి, మీడియం ఫ్లేమ్ మీద ఉల్లిపాయల్ని ఎర్రగా క్రిస్పీగా వేగనివ్వాలి.",
    "[00:01:12.600] ఇది ఖచ్చితంగా జరిగి తీరాలి.",
    "[00:01:15.200] ఉల్లిపాయలు ఎర్రగా వేగితేనే మీకు చిక్కటి పులుసు వస్తుంది, లేదంటే నీళ్ళ నీళ్ళగా ఉంటుందని పులుసుని గుర్తుంచుకోండి.",
    "[00:01:21.500] ఉల్లిపాయలు బాగా వేగాక అప్పుడు ఒక టేబుల్ స్పూన్ అల్లం వెల్లుల్లి పేస్ట్ వేసి వేగనివ్వండి.",
    "[00:01:26.300] ఒక కట్ట ఎర్ర గోంగూర ఆకుల తరుగు వేసి వేపుకోండి.",
    "[00:01:30.100] ఎర్ర గోంగూర అయితేనే మీకు పులుపు వస్తుంది కూరకి.",
    "[00:01:34.400] గోంగూర బాగా వేగి నూనె పైకి తేలేక అప్పుడు పావు చెంచా పసుపు, రెండు టీ స్పూన్ల కారం, సాల్ట్, ఒక టీ స్పూన్ వేయించిన మెంతిపిండి, ఒక టీ స్పూన్ ధనియాల పొడి, ముప్పావు చెంచా గరం మసాలా, మసాలాల్ని బాగా వేపుకోండి.",
    "[00:01:45.200] నా దగ్గర రెడీమేడ్ గా పొడులు ఉండడం వల్ల వేసేసాను.",
    "[00:01:49.500] మీకు నచ్చితే ధనియాలు, మెంతులు, గరం మసాలా సామాన్లన్నీ వేసి పొడిగా కొట్టుకొని అది కూడా వేసుకోవచ్చు, అది ఇంకా ఆరోమాటిక్ గా ఉంటుంది.",
    "[00:01:56.100] ఇప్పుడు కేవలం దేశవాళీ నాటు పుల్లటి టొమాటోలు రెండిటిని పేస్ట్ చేసింది వేసుకోండి.",
    "[00:02:01.300] దేశవాళీ టొమాటోలు అయితేనే కూరకు పులుపు వస్తుంది అని గుర్తుంచుకోండి.",
    "[00:02:05.600] టొమాటోలు బాగా వేగి తీరాలి.",
    "[00:02:08.400] ఇందులోని పచ్చి వాసన పోయి, నూనె పైకి తేలి ముద్దగా అవ్వాలి టొమాటోలు, అందాక వేపుకోవాలి.",
    "[00:02:14.200] ఈ నూనె పైకి తేలడానికి కనీసం ఏడు నుంచి ఎనిమిది నిమిషాల టైం పడుతుంది.",
    "[00:02:19.500] మీకు కూరలో పులుపు చాలనట్లయితే ఖచ్చితంగా 50 ml చింతపండు పులుసు పోసుకోండి, టొమాటోలు మగ్గిన తర్వాత మాత్రమే.",
    "[00:02:26.100] 350 ml నీళ్లు పోసి పులుసును తెర్లకాయనివ్వండి.",
    "[00:02:30.400] పులుసు తెర్లుతున్నప్పుడు చేప ముక్కలు వేసి లో ఫ్లేమ్ మీద నిదానంగా 20 నిమిషాలు పులుసును మరగనివ్వండి.",
    "[00:02:37.200] పులుసు ఎంత సన్నని సెగ మీద మరిగితే అంత రుచి వస్తుంది.",
    "[00:02:42.500] చూడండి, 20 నిమిషాల తర్వాత ఇదిగో ఇలా చిక్కబడుతుంది.",
    "[00:02:47.100] ఇప్పుడు రెండు టీ స్పూన్ల కొత్తిమీర తరుగు చల్లి దింపేసుకోండి.",
    "[00:02:51.300] ఈ పప్పుని మాత్రం కాస్త జారుగా ఉండగానే దింపేసుకోండి.",
    "[00:02:55.400] పొట్టు పప్పు కదా, చల్లారుతున్న కొద్దీ గట్టిపడిపోతూ ఉంటుంది.",
    "[00:03:00.200] చాలా చాలా హెల్తీ, చాలా చాలా టేస్టీ.",
    "[00:03:04.100] మీకు ఖచ్చితంగా నచ్చి తీరుతుంది.",
    "[00:03:07.300] ఏంటి మరి మీకు నచ్చిందా?",
    "[00:03:10.500] మరి అయితే మీరు ట్రై చేసి మీకు ఎలా కుదిరిందో ఖచ్చితంగా ఆ పిక్ ని విస్మై ఫుడ్ ఇన్స్టాగ్రామ్ లో పోస్ట్ చేయండి.",
    "[00:03:18.200] బై ది వే, vismaifood.com వెబ్సైట్ విసిట్ చేయడం అస్సలు మర్చిపోకండి."
  ],
  "transcription_english": [
    "[00:00:00.000] Hey foodies, welcome to Vismai Food.",
    "[00:00:03.500] Today's special is Gongura Fish Curry.",
    "[00:00:06.200] It's very, very tasty. It goes very, very well with hot rice, dosa, idli, paratha, chapati, and anything else.",
    "[00:00:12.800] Even those who are afraid to make fish curries can make this recipe perfectly with these tips and measurements. Everyone will surely like it.",
    "[00:00:19.400] There are a lot of tips in this. Follow all of them carefully and enjoy the perfect recipe.",
    "[00:00:24.100] Let's start. First, in half a kilo of cleaned fish pieces, add one teaspoon of ginger-garlic paste, a little salt, half a spoon of turmeric, and one teaspoon of chili powder, and coat the pieces well.",
    "[00:00:35.600] You can use any fish you like for this, you can also use boneless fish.",
    "[00:00:40.200] Soon, I will also show you how to make fish korma and Telangana-style fish curry.",
    "[00:00:45.500] Now, heat one-third cup of oil, arrange the fish pieces in it, and fry on medium flame until they are red and crispy.",
    "[00:00:52.300] After they are fried red on both sides, take them out and keep them aside.",
    "[00:00:58.100] Now, heat another two tablespoons of oil, add one teaspoon of cumin seeds, and one teaspoon of mustard seeds and let them splutter.",
    "[00:01:05.400] After that, add two dry red chilies, and also add one large finely chopped onion, and fry the onions on medium flame until they are red and crispy.",
    "[00:01:12.600] This must be done.",
    "[00:01:15.200] Only if the onions are fried red will you get a thick curry, otherwise remember that the curry will be watery.",
    "[00:01:21.500] After the onions are well fried, add one tablespoon of ginger-garlic paste and fry.",
    "[00:01:26.300] Add one bunch of chopped red gongura leaves and fry.",
    "[00:01:30.100] The curry will be sour only if you use red gongura.",
    "[00:01:34.400] After the gongura is well fried and the oil floats to the top, add a quarter spoon of turmeric, two teaspoons of chili powder, salt, one teaspoon of roasted fenugreek powder, one teaspoon of coriander powder, and three-quarters of a spoon of garam masala, and fry the masalas well.",
    "[00:01:45.200] I had ready-made powders, so I used them.",
    "[00:01:49.500] If you like, you can add coriander, fenugreek, and garam masala spices, grind them into a powder, and add that too. That will be even more aromatic.",
    "[00:01:56.100] Now, add the paste of only two desi, sour tomatoes.",
    "[00:02:01.300] Remember that the curry will be sour only with desi tomatoes.",
    "[00:02:05.600] The tomatoes must be well fried.",
    "[00:02:08.400] The raw smell should go away, the oil should float to the top, and the tomatoes should become a paste. Fry until then.",
    "[00:02:14.200] It will take at least seven to eight minutes for this oil to float to the top.",
    "[00:02:19.500] If you feel the curry is not sour enough, definitely add 50 ml of tamarind juice, only after the tomatoes are cooked.",
    "[00:02:26.100] Add 350 ml of water and let the curry boil.",
    "[00:02:30.400] When the curry is boiling, add the fish pieces and let the curry simmer slowly on low flame for 20 minutes.",
    "[00:02:37.200] The more the curry simmers on low flame, the tastier it will be.",
    "[00:02:42.500] See, after 20 minutes, it will thicken like this.",
    "[00:02:47.100] Now, sprinkle two teaspoons of chopped coriander and take it off the heat.",
    "[00:02:51.300] Make sure to take this dal off the heat when it's still a bit runny.",
    "[00:02:55.400] It's dal with skin, so it will keep getting thicker as it cools.",
    "[00:03:00.200] Very, very healthy, very, very tasty.",
    "[00:03:04.100] You will definitely like it.",
    "[00:03:07.300] So, did you like it?",
    "[00:03:10.500] Then try it and be sure to post a picture of how it turned out on the Vismai Food Instagram.",
    "[00:03:18.200] By the way, don't forget to visit the vismaifood.com website."
  ]
}