{
  "metadata": {
    "title": "Moringa Leaves Dal Fry | మునగాకు కందిపప్పు ఫ్రై | వారం లో 3 సార్లు తింటే ఎలాంటి కంటి సమస్యలున్నా పోతాయ్",
    "channel_name": "Vismai Food",
    "publish_date": "2019-10-30",
    "view_count": 348576,
    "like_count": 4630,
    "duration": "02:26",
    "language": "Telugu",
    "video_id": "5jmUq2UsbEI",
    "url": "https://www.youtube.com/watch?v=5jmUq2UsbEI",
    "description": "Healthy and nutritious Moringa Leaves Dal Fry (Munagaku Kandipappu Fry). This dish is excellent for eye health and general well-being.",
    "ingredients_detected": [
      "1 Cup Toor Dal (Kandipappu)",
      "2 Cups Fresh Moringa Leaves (Munagaku)",
      "3-4 tbsps Oil",
      "1 tsp Mustard seeds",
      "1 tsp Cumin seeds",
      "1 tbsp Bengal gram (Chana dal)",
      "1 tbsp Split Black gram (Urad dal)",
      "3-4 Dry red chillies",
      "10-12 Garlic pods (crushed)",
      "2 sprigs Curry leaves",
      "1 Large Onion (chopped)",
      "1/4 tsp Turmeric powder",
      "1 tsp Red chilli powder",
      "Salt (to taste)",
      "2 tbsps Dry coconut powder (optional)"
    ]
  },
  "transcription_telugu": [
    "[00:00:00.000] హలో ఫుడీస్, వెల్కమ్ టు విస్మయ్ ఫుడ్. ఇవాల్టి స్పెషల్ కంటి ఆరోగ్యానికి ఎంతో మేలు చేసే మునగాకు కందిపప్పు ఫ్రై.",
    "[00:00:15.000] ముందుగా ఒక కప్పు కందిపప్పును తగినన్ని నీళ్లు పోసి మరీ మెత్తగా కాకుండా పలుకుగా ఉండేలా ఉడికించి పక్కన పెట్టుకోవాలి.",
    "[00:00:35.000] మునగాకులను శుభ్రంగా కడిగి తడి లేకుండా ఆరబెట్టుకోవాలి.",
    "[00:00:50.000] కడాయిలో నూనె వేసి ఆవాలు, జీలకర్ర, శనగపప్పు, మినప్పప్పు, ఎండుమిర్చి, వెల్లుల్లి రెబ్బలు మరియు కరివేపాకు వేసి తాలింపు ఎర్రగా వేయించుకోవాలి.",
    "[00:01:15.000] ఇందులో ఉల్లిపాయ ముక్కలు వేసి కొంచెం వేగాక, శుభ్రం చేసిన మునగాకు వేసి ఆకు మెత్తబడే వరకు మగ్గించాలి.",
    "[00:01:40.000] ఇప్పుడు పసుపు, ఉప్పు, కారం వేసి కలిపి, ముందుగా ఉడికించిన కందిపప్పును ఇందులో వేసి బాగా కలపాలి.",
    "[00:02:05.000] పప్పులోని తడి పోయి పొడిపొడిగా అయ్యే వరకు ఐదు నిమిషాల పాటు వేయించాలి.",
    "[00:02:15.000] చివరగా ఎండు కొబ్బరి పొడి చల్లుకుంటే ఎంతో రుచికరమైన మునగాకు కందిపప్పు ఫ్రై రెడీ. ఇది అన్నంలోకి చాలా బాగుంటుంది."
  ],
  "transcription_english": [
    "[00:00:00.000] Hello Foodies, welcome to Vismai Food. Today's special is Moringa Leaves Dal Fry, which is excellent for eye health.",
    "[00:00:15.000] First, boil one cup of toor dal with sufficient water. Ensure it is cooked but still firm, not mushy; drain and set aside.",
    "[00:00:35.000] Thoroughly wash the moringa leaves and let them dry completely.",
    "[00:00:50.000] Heat oil in a pan and add mustard seeds, cumin, chana dal, urad dal, dry red chillies, garlic pods, and curry leaves; sauté until golden.",
    "[00:01:15.000] Add chopped onions. Once they are slightly fried, add the moringa leaves and sauté until they soften.",
    "[00:01:40.000] Add turmeric, salt, and red chilli powder. Mix in the boiled toor dal and combine everything well.",
    "[00:02:05.000] Fry for about five minutes until the moisture disappears and the dal becomes dry.",
    "[00:02:15.000] Finally, sprinkle some dry coconut powder and serve. The healthy Moringa Leaves Dal Fry is ready to be enjoyed with rice."
  ]
}