{
  "metadata": {
    "title": "Secret Spice Powder For Fries|కూర కారం|తరతరాల మా సీక్రెట్ కూర కారం| కుర రుచిని అమాంతం మార్చేసే కారం",
    "channel_name": "Vismai Food",
    "publish_date": "2019-10-31",
    "view_count": 3207846,
    "like_count": 47642,
    "duration": "03:34",
    "language": "Telugu",
    "video_id": "BrLx7NGOhaU",
    "url": "https://www.youtube.com/watch?v=BrLx7NGOhaU",
    "description": "Learn the secret Koora Karam (Spice Powder) recipe that's been passed down for generations. This special spice powder enhances the taste of any fry recipe.",
    "ingredients_detected": [
      "3/4 Cup Coriander Seeds (50gms)",
      "1 tbsp Cumin (15gms)",
      "1 tbsp Mustard (15gms)",
      "2 tbsps Peanuts (20gms)",
      "1 tbsp Chana Dal",
      "1 tbsp Urad dal",
      "2 tbsps Sesame Seeds",
      "Lemon Size Tamarind",
      "1 tsp Oil (for chilli roasting)",
      "125gms High Quality Dry Chillies",
      "20 Garlic pods",
      "2 tsps Salt",
      "1 tsp Turmeric Powder (10gms)"
    ]
  },
  "transcription_telugu": [
    "[00:00:00.000] హలో ఫుడీస్, వెల్కమ్ టు విస్మయ్ ఫుడ్. ఇవాల్టి స్పెషల్ విస్మయ్ ఫుడ్ సీక్రెట్ స్పైస్ పౌడర్. దీనినే కూర కారం అంటారు.",
    "[00:00:36.000] ముందుగా మూకుళ్ళో 3/4 కప్పు ధనియాలు వేసి కేవలం లో ఫ్లేమ్ మీద కలుపుతూ వేయించుకోవాలి.",
    "[00:00:51.000] ధనియాలు సగం పైన వేగాక, ఒక టేబుల్ స్పూన్ జీలకర్ర మరియు ఒక టేబుల్ స్పూన్ ఆవాలు వేసి లో ఫ్లేమ్ మీద వేయించుకోవాలి.",
    "[00:01:04.000] ఇవి రంగు మారి మంచి సువాసన వస్తున్నప్పుడు రెండు టేబుల్ స్పూన్ల పల్లీలు, ఒక టేబుల్ స్పూన్ శనగపప్పు, ఒక టేబుల్ స్పూన్ మినప్పప్పు మరియు రెండు టేబుల్ స్పూన్ల నువ్వులు వేసి వేయించుకోవాలి.",
    "[00:01:39.000] పప్పులు వేగి మంచి సువాసన వచ్చాక, స్టవ్ ఆపి నిమ్మకాయంత చింతపండు వేసి ఆ వేడికి మగ్గనివ్వాలి. ఇది పూర్తిగా చల్లారాలి.",
    "[00:01:56.000] ఇప్పుడు ఒక టీస్పూన్ నూనె వేసి 125 గ్రాముల ఎండుమిర్చిని లో ఫ్లేమ్ మీద వేయించి చల్లార్చుకోవాలి.",
    "[00:02:22.000] మొదట ఎండుమిర్చిని మెత్తని పొడిగా గ్రైండ్ చేసి, ఆ తర్వాత చల్లారిన పప్పులు, 20 వెల్లుల్లి రెబ్బలు మరియు రెండు టీస్పూన్ల ఉప్పు వేసి గ్రైండ్ చేయాలి.",
    "[00:02:46.000] చివరగా ఒక టీస్పూన్ పసుపు వేసి కలుపుకుంటే కూర కారం సిద్ధం. ఇది ఎయిర్ టైట్ డబ్బాలో పెడితే ఆరు నుండి ఏడు నెలల వరకు నిల్వ ఉంటుంది."
  ],
  "transcription_english": [
    "[00:00:00.000] Hello Foodies, welcome to Vismai Food. Today's special is Vismai Food's secret spice powder, also known as Koora Karam.",
    "[00:00:36.000] In a pan, add 3/4 cup coriander seeds and roast them on a low flame while stirring constantly.",
    "[00:00:51.000] When coriander is more than half roasted, add one tablespoon of cumin and one tablespoon of mustard seeds; roast on a low flame.",
    "[00:01:04.000] Once aromatic, add two tablespoons of peanuts, one tablespoon of chana dal, one tablespoon of urad dal, and two tablespoons of sesame seeds; roast well.",
    "[00:01:39.000] When aromatic, turn off the stove, add lemon-sized tamarind, and let it soften in the residual heat. Let the mixture cool completely.",
    "[00:01:56.000] Heat one teaspoon of oil and roast 125g of high-quality dry chillies on a low flame; let them cool.",
    "[00:02:22.000] First, grind the dry chillies into a fine powder, then add the cooled lentils, 20 garlic pods, and two teaspoons of salt; grind again.",
    "[00:02:46.000] Finally, add one teaspoon of turmeric powder and mix well; your Koora Karam is ready. Store it in an airtight jar for up to 6-7 months."
  ]
}