{
  "metadata": {
    "title": "Puri Curry | No Onion Puri Curry | పూరి కూర | కార్తీక మాసం స్పెషల్ | ఉల్లిపాయ వాడకుండా చేసే పూరి కూర",
    "channel_name": "Vismai Food",
    "publish_date": "2019-11-11",
    "view_count": 306816,
    "like_count": 3648,
    "duration": "02:38",
    "language": "Telugu",
    "video_id": "6aT9jilK8oI",
    "url": "https://www.youtube.com/watch?v=6aT9jilK8oI",
    "description": "Special No Onion Puri Curry (Potato Cabbage Peas Curry) recipe from Vismai Food, perfect for auspicious days and festivals.",
    "ingredients_detected": [
      "200-250g Cabbage (chopped)",
      "2 Potatoes (boiled and mashed)",
      "1/2 Cup Fresh Green Peas",
      "2 tsps Oil",
      "1 tsp Mustard seeds",
      "1 tsp Chana dal",
      "1 tsp Urad dal",
      "1 tsp Cumin seeds",
      "1 sprig Curry leaves",
      "2 Green chillies (slit)",
      "2 Dry red chillies",
      "1/2 tsp Ginger (chopped)",
      "1/2 tsp Turmeric powder",
      "Salt (to taste)",
      "1 tbsp Gram flour (Besan) mixed with 50ml water",
      "1 tbsp Tamarind juice",
      "400ml + 150ml Water"
    ]
  },
  "transcription_telugu": [
    "[00:00:00.000] హలో ఫుడీస్, వెల్కమ్ టు విస్మయ్ ఫుడ్. ఇవాల్టి స్పెషల్ ఉల్లిపాయ వాడకుండా చేసే పూరి కూర. ఇది కార్తీక మాసం మరియు వ్రతాల సమయాల్లో చాలా బాగుంటుంది.",
    "[00:00:25.000] ఒక పాన్ లో నూనె వేడి చేసి ఆవాలు, శనగపప్పు, మినప్పప్పు వేసి వేయించాలి.",
    "[00:00:40.000] అందులో జీలకర్ర, కరివేపాకు, పచ్చిమిర్చి, ఎండుమిర్చి మరియు అల్లం తరుగు వేసి వేయించుకోవాలి.",
    "[00:00:52.000] ఇప్పుడు సన్నగా తరిగిన క్యాబేజీ వేసి అందులో పసుపు, ఉప్పు వేసి హై ఫ్లేమ్ మీద మూడు నిమిషాల పాటు ఫ్రై చేయాలి.",
    "[00:01:08.000] ఆపై 400ml నీళ్లు పోసి మూత పెట్టి క్యాబేజీని మెత్తగా ఉడికించుకోవాలి.",
    "[00:01:20.000] క్యాబేజీ సగం ఉడికాక బటాణీలు వేసి రెండింటినీ మెత్తగా ఉడికించాలి.",
    "[00:01:35.000] ఒక టేబుల్ స్పూన్ శనగపిండిలో కొంచెం నీళ్లు కలిపి ఉండలు లేకుండా చేసి ఉడికిన కూరలో పోయాలి. ఆపై మరికొన్ని నీళ్లు, ఉడికించిన బంగాళదుంప ముక్కలు వేసి కలపాలి.",
    "[00:02:00.000] చివరగా ఒక టేబుల్ స్పూన్ చింతపండు పులుసు వేసి మూడు నిమిషాల పాటు ఉడికించి దించేయాలి. చల్లారిన తర్వాత కూర మరింత చిక్కబడుతుంది.",
    "[00:02:15.000] ఎంతో రుచికరమైన ఉల్లిపాయ లేని పూరి కూర సిద్ధం."
  ],
  "transcription_english": [
    "[00:00:00.000] Hello Foodies, welcome to Vismai Food. Today's special is No Onion Puri Curry, perfect for auspicious days and festivals.",
    "[00:00:25.000] Heat oil in a pan and add mustard seeds, chana dal, and urad dal; sauté well.",
    "[00:00:40.000] Add cumin, curry leaves, green chillies, dry red chillies, and chopped ginger; sauté until aromatic.",
    "[00:00:52.000] Add finely chopped cabbage, turmeric, and salt. Sauté on high flame for three minutes.",
    "[00:01:08.000] Pour in 400ml water, cover, and cook until the cabbage is soft.",
    "[00:01:20.000] When the cabbage is partially cooked, add fresh green peas and cook both until soft.",
    "[00:01:35.000] Mix one tablespoon of gram flour with water into a smooth paste and add it to the pan. Add more water and boiled, mashed potato pieces; mix well.",
    "[00:02:00.000] Finally, add one tablespoon of tamarind juice and cook for three more minutes before turning off the stove. The curry will thicken as it cools.",
    "[00:02:15.000] The delicious No Onion Puri Curry is ready to be served."
  ]
}