{
  "metadata": {
    "title": "Amaranth Leaves Subzi|Lost Recipe of Andhra|తోటకూర మెంతి కారం పులుసు| తరతరాల తెలుగు వారి వంటకం|",
    "channel_name": "Vismai Food",
    "publish_date": "2019-11-12",
    "view_count": 294041,
    "like_count": 4610,
    "duration": "03:05",
    "language": "Telugu",
    "video_id": "C4SCovHzBJY",
    "url": "https://www.youtube.com/watch?v=C4SCovHzBJY",
    "description": "విస్మయ్ ఫుడ్ అందిస్తున్న అంతరించిపోతున్న తరతరాల తెలుగు వారి రుచి - తోటకూర మెంతి కారం పులుసు. తక్కువ నూనెతో, ఉల్లిపాయ మరియు వెల్లుల్లి లేకుండా చేసే ఆరోగ్యకరమైన వంటకం.",
    "ingredients_detected": [
      "2 పెద్ద కట్టల తోటకూర (తరుగు)",
      "1 వంకాయ (ముక్కలు)",
      "చింతపండు పులుసు (నిమ్మకాయ పరిమాణంలో తీసినది - 250ml)",
      "1 tsp నూనె",
      "3/4 tsp మెంతులు",
      "3/4 tsp ఆవాలు",
      "1 tsp పొట్టు మినపప్పు",
      "10 ఎండుమిర్చి",
      "1 tsp జీలకర్ర",
      "చిటికెడు ఇంగువ",
      "2 రెబ్బల కరివేపాకు",
      "1/4 tsp పసుపు",
      "1 tsp బెల్లం తరుగు (ఐచ్ఛికం)",
      "1 tbsp బియ్యం పిండి (చిక్కదనం కోసం)",
      "రుచికి సరిపడా ఉప్పు"
    ]
  },
  "transcription_telugu": [
    "[00:00:00] హలో ఫుడీస్, వెల్కమ్ టు విస్మయ్ ఫుడ్. ఇవాల్టి స్పెషల్ అంతరించిపోతున్న తరతరాల తెలుగింటి రుచి తోటకూర మెంతి కారం పులుసు.",
    "[00:00:30] బాణలిలో 1 tsp నూనె వేడి చేసి మెంతులు, ఆవాలు వేసి ఎర్రగా వేయించాలి. ఆపై మినపప్పు, ఎండుమిర్చి, జీలకర్ర, ఇంగువ వేసి వేయించి చల్లార్చి మెత్తని పొడి (మెంతి కారం) చేసుకోవాలి.",
    "[00:01:13] వేరొక పాత్రలో 600-700ml నీరు పోసి, తోటకూర తరుగు, వంకాయ ముక్కలు, ఉప్పు, కరివేపాకు వేసి ముక్కలు మెత్తబడే వరకు ఉడికించాలి.",
    "[00:01:46] ముక్కలు ఉడికాక చింతపండు పులుసు, పసుపు మరియు ముందుగా సిద్ధం చేసుకున్న మెంతి కారం పొడి వేసి కలపాలి.",
    "[00:02:00] ఇందులో 1 tsp బెల్లం వేసి చిన్న మంట మీద 15-20 నిమిషాల పాటు బాగా మరగనివ్వాలి.",
    "[00:02:19] పులుసు మరిగిన తర్వాత, బియ్యం పిండిని కొద్దిగా నీటిలో కలిపి పులుసులో పోయాలి. దీనివల్ల పులుసుకి మంచి చిక్కదనం వస్తుంది.",
    "[00:02:45] మరో 5 నిమిషాల పాటు మరిగిస్తే ఎంతో రుచికరమైన తోటకూర మెంతి కారం పులుసు సిద్ధం. ఇది అన్నం, రోటీల్లోకి చాలా బాగుంటుంది."
  ],
  "transcription_english": [
    "[00:00:00] Hello Foodies, welcome to Vismai Food. Today's special is a traditional Andhra lost recipe - Thotakura Menthi Karam Pulusu.",
    "[00:00:30] Heat 1 tsp oil in a pan, roast fenugreek and mustard seeds. Add urad dal, dry chillies, cumin, and hing; grind them into a fine powder once cooled.",
    "[00:01:13] In a pot with 600-700ml water, add chopped amaranth leaves, brinjal cubes, salt, and curry leaves; cook until tender.",
    "[00:01:46] Add tamarind extract, turmeric, and the prepared menthi karam powder to the pot.",
    "[00:02:00] Add 1 tsp jaggery and let it simmer on low flame for 15-20 minutes for the flavors to develop.",
    "[00:02:19] Mix 1 tbsp rice flour in water and add it to the boiling pulusu to give it a thick consistency.",
    "[00:02:45] Boil for another 5 minutes. The delicious Thotakura Menthi Karam Pulusu is ready, pairing perfectly with rice and rotis."
  ]
}