{
  "metadata": {
    "title": "Cabbage Masala Vada | క్యాబేజీ మసాలా వడ | Crispy Veg Vada Recipe",
    "channel_name": "Vismai Food",
    "publish_date": "2020-04-20",
    "view_count": 850000,
    "like_count": 15000,
    "duration": "06:15",
    "language": "Telugu",
    "video_id": "AGJokgGrdAk",
    "url": "https://www.youtube.com/watch?v=AGJokgGrdAk",
    "description": "క్యాబేజీ తినని వారు కూడా ఎంతో ఇష్టంగా తినేలా, చాలా క్రిస్పీగా ఉండే మసాలా వడలు. ఇవి సాయంత్రం పూట స్నాక్స్‌లా చాలా బాగుంటాయి.",
    "ingredients_detected": [
      "1 కప్పు శనగపప్పు (2-3 గంటలు నానబెట్టినది)",
      "2 కప్పుల సన్నగా తరిగిన క్యాబేజీ",
      "1 పెద్ద ఉల్లిపాయ (సన్నగా తరిగినది)",
      "3-4 పచ్చిమిర్చి",
      "1 టీస్పూన్ అల్లం వెల్లుల్లి పేస్ట్",
      "1 టీస్పూన్ జీలకర్ర",
      "కొద్దిగా కరివేపాకు, కొత్తిమీర",
      "రుచికి సరిపడా ఉప్పు",
      "1-2 టేబుల్ స్పూన్ల బియ్యం పిండి (క్రిస్పీనెస్ కోసం)",
      "డీప్ ఫ్రైకి సరిపడా నూనె"
    ]
  },
  "transcription_telugu": [
    "[00:00:00.000] హలో ఫుడీస్, వెల్కమ్ టు విస్మయ్ ఫుడ్. ఇవాల్టి మన స్పెషల్ రెసిపీ క్యాబేజీ మసాలా వడ.",
    "[00:00:45.000] ముందుగా నానబెట్టుకున్న శనగపప్పును నీళ్లు లేకుండా మిక్సీ జార్‌లోకి తీసుకుని కొంచెం బరకగా గ్రైండ్ చేసుకోవాలి.",
    "[00:01:30.000] ఇప్పుడు ఒక బౌల్‌లో సన్నగా తరిగిన క్యాబేజీని తీసుకుని, అందులో ఉప్పు వేసి బాగా పిసికినట్టు కలిపితే నీరు వస్తుంది. ఆ నీటిని పిండేయాలి.",
    "[00:02:15.000] ఈ క్యాబేజీ మిశ్రమంలో గ్రైండ్ చేసిన పప్పు, ఉల్లిపాయ ముక్కలు, పచ్చిమిర్చి, జీలకర్ర, అల్లం వెల్లుల్లి పేస్ట్, కరివేపాకు, కొత్తిమీర వేయాలి.",
    "[00:03:00.000] వడలు క్రిస్పీగా రావడం కోసం కొంచెం బియ్యం పిండిని కూడా వేసి బాగా కలుపుకోవాలి.",
    "[00:04:10.000] పిండిని చిన్న చిన్న ఉండలుగా తీసుకుని, వడల్లా ఒత్తుకుని వేడిగా ఉన్న నూనెలో వేయాలి.",
    "[00:05:00.000] మంటను మీడియం ఫ్లేమ్‌లో ఉంచి రెండు వైపులా గోల్డెన్ బ్రౌన్ కలర్ వచ్చే వరకు వేయించుకోవాలి.",
    "[00:06:00.000] ఎంతో రుచికరమైన, క్రిస్పీ క్యాబేజీ మసాలా వడలు రెడీ."
  ],
  "transcription_english": [
    "[00:00:00.000] Hello Foodies, welcome to Vismai Food. Today's special recipe is Cabbage Masala Vada.",
    "[00:00:45.000] First, take the soaked chana dal in a mixer jar and grind it into a coarse paste without adding water.",
    "[00:01:30.000] Take finely shredded cabbage in a bowl, add salt, and squeeze out the excess water.",
    "[00:02:15.000] To this cabbage, add the ground dal paste, chopped onions, green chillies, cumin, ginger-garlic paste, curry leaves, and coriander.",
    "[00:03:00.000] Add some rice flour for extra crispiness and mix everything well.",
    "[00:04:10.000] Take small portions of the dough, shape them into vadas, and drop them into hot oil.",
    "[00:05:00.000] Fry them on medium flame until they turn golden brown on both sides.",
    "[00:06:00.000] Delicious and crispy Cabbage Masala Vadas are ready."
  ]
}