{
  "metadata": {
    "title": "Pudina Dal| పుదినా పప్పు| | Pudina Dal recipe |Pudina Pappu recipe in telugu @VismaiFood",
    "channel_name": "Vismai Food",
    "publish_date": "2018-11-28",
    "view_count": 539673,
    "like_count": 7669,
    "duration": "02:26",
    "language": "Telugu",
    "video_id": "-fH0H-zDtb0",
    "url": "https://www.youtube.com/watch?v=-fH0H-zDtb0",
    "description": "Simple and flavorful Mint Dal (Pudina Pappu) recipe in Telugu by Vismai Food.",
    "ingredients_detected": [
      "110gms Moong Dal (Pesarappu)",
      "Sufficient Water",
      "2 tbsps Ghee",
      "1 tsp Cumin seeds",
      "1/2 tsp Mustard seeds",
      "2 Dry Red chillies",
      "2 Pinches Asafoetida (Hing)",
      "1/2 tsp Urad dal",
      "1 Large Onion (chopped)",
      "1/4 tsp Turmeric powder",
      "50gms Fresh Pudina leaves (Mint)",
      "1 tbsp Chilli powder",
      "2 tbsps Lemon juice",
      "Salt (to taste)"
    ]
  },
  "transcription_telugu": [
    "[00:00:00.000] హలో ఫుడీస్, వెల్కమ్ టు విస్మయ్ ఫుడ్. ఇవాల్టి సింపుల్ అండ్ యమ్మీ రెసిపీ పుదీనా పప్పు.",
    "[00:00:15.000] చపాతీ, రోటీల్లోకి ఈ పప్పు చాలా బాగుంటుంది. ఒక్కసారి తింటే మళ్లీ మళ్లీ చేసుకుంటారు.",
    "[00:00:23.000] ముందుగా ఒక కప్పు (110 గ్రాములు) పెసరపప్పును లో ఫ్లేమ్ మీద మంచి సువాసన వచ్చే వరకు వేయించుకోండి.",
    "[00:00:35.000] వేయించిన పప్పును ఒక గిన్నెలో వేసి తగినన్ని నీళ్లు పోసి మెత్తగా ఉడికించి పక్కన పెట్టుకోండి.",
    "[00:00:52.000] బాణలిలో రెండు టేబుల్ స్పూన్ల నెయ్యి వేడి చేసి జీలకర్ర, ఆవాలు, ఎండుమిర్చి, ఇంగువ, మినప్పప్పు వేసి వేయించండి.",
    "[00:01:08.000] ఒక పెద్ద ఉల్లిపాయ తరుగు, పసుపు వేసి పచ్చి వాసన పోయే వరకు వేపుకోవాలి.",
    "[00:01:16.000] ఇందులో ఒక కట్ట (50 గ్రాములు) పుదీనా ఆకులు వేసి లో ఫ్లేమ్ మీద మగ్గనివ్వాలి.",
    "[00:01:30.000] ఆకులు మగ్గాక కారం, ఉప్పు వేసి బాగా కలుపుకుని, ఆ తర్వాత ఉడికించిన పప్పు వేయాలి.",
    "[00:01:48.000] కొద్దిగా (150ml) నీళ్లు పోసి పప్పును ఉడకనివ్వాలి.",
    "[00:01:55.000] పప్పు ఉడికాక స్టవ్ ఆఫ్ చేసి, రెండు టేబుల్ స్పూన్ల నిమ్మరసం వేసి కలపాలి. నిమ్మరసం అస్సలు మిస్ చేయకండి.",
    "[00:02:05.000] ఎంతో రుచికరమైన పుదీనా పప్పు రెడీ! ఇది వేడి అన్నం లేదా రోటీల్లోకి చాలా బాగుంటుంది."
  ],
  "transcription_english": [
    "[00:00:00.000] Hello Foodies, welcome to Vismai Food. Today's simple and yummy recipe is Pudina Dal.",
    "[00:00:15.000] This dal tastes great with chapati and roti. Once you taste it, you'll want it again.",
    "[00:00:23.000] First, roast 1 cup (110g) of moong dal on low flame until aromatic.",
    "[00:00:35.000] Cook the roasted dal in sufficient water until soft and set it aside.",
    "[00:00:52.000] Heat 2 tbsps ghee in a pan; add cumin, mustard, red chillies, asafoetida, and urad dal.",
    "[00:01:08.000] Add one large chopped onion and turmeric; sauté until the raw smell goes away.",
    "[00:01:16.000] Add 50g of fresh mint leaves (pudina) and cook on low flame until they soften.",
    "[00:01:30.000] Add chilli powder, salt, mix well, and then add the cooked dal.",
    "[00:01:48.000] Pour in 150ml of water and let the dal boil for a few minutes.",
    "[00:01:55.000] Turn off the heat and add 2 tbsps of lemon juice. Don't skip the lemon juice as it adds great flavor.",
    "[00:02:05.000] Delicious Pudina Dal is ready! It pairs perfectly with hot rice or rotis."
  ]
}