{
  "metadata": {
    "title": "StuffedTindoraFry|Best Fry For Rice|గుత్తి దొండకాయ ఫ్రై|తృప్తిగా భోజనం చయాలంటే ఈ కూర ట్రై చేయండి",
    "channel_name": "Vismai Food",
    "publish_date": "2019-11-15",
    "view_count": 597623,
    "like_count": 7700,
    "duration": "02:39",
    "language": "Telugu",
    "video_id": "ODDX7DJAq8M",
    "url": "http://www.youtube.com/watch?v=ODDX7DJAq8M",
    "description": "A traditional and flavorful Stuffed Tindora (Gutti Dondakaya) Fry recipe from Vismai Food, perfect for pairing with rice and ghee.",
    "ingredients_detected": [
      "300 gms Tender Tindora (Dondakaya)",
      "2 tsps Chana Dal",
      "2 tsps Coriander Seeds",
      "2 tsps Dry Coconut pieces",
      "1 tsp Cumin Seeds",
      "10-12 Dry Red Chillies",
      "2 tbsps Sesame Seeds",
      "1/3 Cup Oil",
      "1 pinch Hing (Asafoetida)",
      "1/4 tsp Turmeric Powder",
      "1 sprig Curry Leaves",
      "Salt (to taste)"
    ]
  },
  "transcription_telugu": [
    "[00:00:00.000] హలో ఫుడీస్, వెల్కమ్ టు విస్మయ్ ఫుడ్. ఇవాల్టి స్పెషల్ మసాలా గుత్తి దొండకాయ ఫ్రై.",
    "[00:00:19.000] ముందుగా ముకుళ్ళో రెండు టీస్పూన్ల శనగపప్పు వేసి లో ఫ్లేమ్ మీద మంచి సువాసన వచ్చే వరకు రోస్ట్ చేయండి.",
    "[00:00:25.000] ఆ తర్వాత ధనియాలు, ఎండు కొబ్బరి పలుకులు, జీలకర్ర మరియు ఎండుమిర్చి వేసి లో ఫ్లేమ్ మీద వేపుకోవాలి.",
    "[00:00:43.000] ఇప్పుడు ఇందులో నువ్వులు వేసి చిటపటలాడించి, చల్లారాక మిక్సీ జార్ లో ఉప్పు వేసి మెత్తని పొడిగా చేసుకోవాలి.",
    "[00:01:00.000] 300 గ్రాముల లేత దొండకాయలను తీసుకుని, తల తోక కట్ చేసి మధ్యలోకి నాలుగు పచ్చాలుగా చీల్చుకోవాలి.",
    "[00:01:17.000] తయారుచేసుకున్న మసాలా పొడిని దొండకాయల్లోకి కూరుకుని పక్కన ఉంచుకోవాలి.",
    "[00:01:31.000] పాన్ లో నూనె వేడి చేసి జీలకర్ర, ఇంగువ, పసుపు మరియు కరివేపాకు వేసి వేయించాలి.",
    "[00:01:42.000] స్టఫ్ చేసిన దొండకాయలను నూనెలో వేసి, మిగిలిన పొడిని కూడా చల్లి మీడియం ఫ్లేమ్ మీద మూత పెట్టి మగ్గనివ్వాలి.",
    "[00:02:03.000] 30 నిమిషాల పాటు ఓపికగా వేపిస్తే దొండకాయ లోపలి దాకా మగ్గి ఎంతో రుచికరమైన ఫ్రై సిద్ధమవుతుంది."
  ],
  "transcription_english": [
    "[00:00:00.000] Hello Foodies, welcome to Vismai Food. Today's special is Masala Stuffed Tindora Fry.",
    "[00:00:19.000] First, roast two teaspoons of chana dal in a pan on low flame until aromatic.",
    "[00:00:25.000] Then add coriander seeds, dry coconut pieces, cumin, and dry red chillies; roast them on low flame.",
    "[00:00:43.000] Now add sesame seeds, let them splutter, and once cooled, grind them into a fine powder with salt in a mixer jar.",
    "[00:01:00.000] Take 300 grams of tender tindora, trim the ends, and slit them into four sections (crosswise).",
    "[00:01:17.000] Stuff the prepared masala powder into the tindora and keep them aside.",
    "[00:01:31.000] Heat oil in a pan, add cumin, hing, turmeric, and curry leaves; sauté them.",
    "[00:01:42.000] Place the stuffed tindora in the oil, sprinkle the remaining powder, cover, and let them cook on medium flame.",
    "[00:02:03.000] Fry patiently for about 30 minutes until the tindora is cooked through and turns into a delicious fry."
  ]
}