{
  "metadata": {
    "title": "Coconut Rice| Prasadam Style Coconut Rice|కొబ్బరన్నం|బెస్ట్ కొబ్బరన్నం చేయాలంటే ఈ కొలతల్లో చేయండి!",
    "channel_name": "Vismai Food",
    "publish_date": "2019-11-24",
    "view_count": 3475531,
    "like_count": 31752,
    "duration": "01:48",
    "language": "Telugu",
    "video_id": "mD9Fa0ZDgVY",
    "url": "http://www.youtube.com/watch?v=mD9Fa0ZDgVY",
    "description": "A traditional and aromatic Prasadam style Coconut Rice recipe from Vismai Food, perfect for lunch boxes or as a divine offering.",
    "ingredients_detected": [
      "1 Cup Rice",
      "1.3/4 Cups 2nd Extract Coconut milk",
      "1/4 Cup Water",
      "1/2 tsp Oil",
      "Salt to taste",
      "3 tbsps Oil (for tempering)",
      "Handful of Cashews",
      "1 tsp Mustard seeds",
      "1 tsp Cumin seeds",
      "1 tsp Chana Dal",
      "1 tsp Urad Dal",
      "2 Sprigs Curry leaves",
      "3 Slit Green Chillies",
      "1/2 Fresh Coconut gratings",
      "Chopped Coriander",
      "Pinch of Hing (Optional)",
      "Dry Chillies (Optional)",
      "1/4 tsp Black pepper (Optional)"
    ]
  },
  "transcription_telugu": [
    "[00:00:00.000] హలో ఫుడీస్, వెల్కమ్ టు విస్మయ్ ఫుడ్. ఇవాల్టి స్పెషల్ కొబ్బరన్నం. ఇది చాలా టేస్టీగా ఉంటుంది.",
    "[00:00:19.000] ముందుగా కుక్కర్‌లో ఒక కప్పు బియ్యం వేసుకోండి. అందులో ఒకటి ముప్పావు కప్పు కొబ్బరి పాలు, పావు కప్పు నీళ్లు, అర టీస్పూన్ నూనె వేసి మూడు విజిల్స్ వచ్చే వరకు ఉడికించుకోవాలి.",
    "[00:00:36.000] స్టీమ్ అంతా పోయాక, అన్నం వేడిగా ఉన్నప్పుడే రుచికి సరిపడా ఉప్పు వేసి బాగా కలుపుకోండి.",
    "[00:00:49.000] ఇప్పుడు పాన్ లో మూడు టేబుల్ స్పూన్ల నూనె వేడి చేసి జీడిపప్పు, ఆవాలు, జీలకర్ర, పచ్చి శనగపప్పు, మినప్పప్పు వేసి వేయించాలి.",
    "[00:01:00.000] అందులోనే కరివేపాకు, పచ్చిమిర్చి చీలికలు వేసి ఎర్రగా వేయించుకోవాలి. కావాలనుకునే వారు ఇంగువ కూడా వేసుకోవచ్చు.",
    "[00:01:09.000] తాలింపు వేగాక అర చిప్ప పచ్చి కొబ్బరి తురుము వేసి ఒక 30 సెకన్లు రోస్ట్ చేసి స్టవ్ ఆపేయాలి.",
    "[00:01:16.000] ఈ తాలింపును అన్నంలో వేసి అట్లకాడతో మెల్లగా కలుపుకోండి. చివరగా కొద్దిగా కొత్తిమీర తరుగు చల్లుకుంటే ఎంతో రుచికరమైన కొబ్బరన్నం సిద్ధం."
  ],
  "transcription_english": [
    "[00:00:00.000] Hello Foodies, welcome to Vismai Food. Today's special is Coconut Rice. This is very tasty and a must-try recipe.",
    "[00:00:19.000] First, add one cup of rice to a pressure cooker. Add 1.75 cups of coconut milk, 1/4 cup water, and 1/2 tsp oil; cook for three whistles.",
    "[00:00:36.000] Once the steam is released, add salt to taste while the rice is still hot and mix well.",
    "[00:00:49.000] Heat 3 tbsp oil in a pan and sauté cashews, mustard seeds, cumin, chana dal, and urad dal.",
    "[00:01:00.000] Add curry leaves and slit green chillies; fry until golden. You can also add a pinch of hing if you like.",
    "[00:01:09.000] Add half a fresh coconut grating to the tempering and roast for just 30 seconds before turning off the heat.",
    "[00:01:16.000] Mix this tempering into the warm rice gently using a flat spatula. Finally, sprinkle some chopped coriander and your delicious Coconut Rice is ready."
  ]
}