{
  "metadata": {
    "title": "Hyderabadi FISH DUM BIRYANI|ఫిష్ బిరియాని|ఈ టిప్స్ ఫాలో అయితే వంటరాని వారు కూడా ఈసీ గా చేస్తారు",
    "channel_name": "Vismai Food",
    "publish_date": "2019-12-08",
    "view_count": 2179372,
    "like_count": 32441,
    "duration": "04:30",
    "language": "Telugu",
    "video_id": "cUaWIffx0ag",
    "url": "https://www.youtube.com/watch?v=cUaWIffx0ag",
    "description": "Flavorful Hyderabadi Fish Dum Biryani with step-by-step instructions. Perfect for special occasions and simple to make even for beginners.",
    "ingredients_detected": [
      "300gms Fish",
      "1.5 Cups Basmati Rice (soaked)",
      "1 tsp Ginger Garlic paste",
      "1/2 tsp Turmeric",
      "Chilli Powder",
      "Salt",
      "1/4 tsp Garam Masala",
      "1/2 Lemon juice",
      "Oil for frying",
      "2 tbsp Ghee",
      "Whole spices: Cloves, Green Cardamom, Cinnamon, Shahi Jeera, Black Cardamom, Star Anise",
      "1 Large Onion (sliced)",
      "2 Tomato Puree",
      "2 tbsp Pudina (Mint leaves)",
      "2 tbsp Coriander leaves",
      "1/4 Cup Whisked Curd",
      "Dried Rose petals",
      "Rice cooked water"
    ]
  },
  "transcription_telugu": [
    "[00:00:00.000] హలో ఫుడీస్, వెల్కమ్ టు విస్మయ్ ఫుడ్. ఇవాల్టి స్పెషల్ ఫిష్ దమ్ బిరియాని.",
    "[00:00:26.000] 300 గ్రాముల చేప ముక్కలలో అల్లం వెల్లుల్లి పేస్ట్, పసుపు, కారం, ఉప్పు, గరం మసాలా, నిమ్మరసం వేసి బాగా కలిపి మ్యారినేట్ చేయాలి.",
    "[00:00:44.000] ఈ ముక్కలను నూనెలో ఎర్రగా, క్రిస్పీగా వేయించి పక్కన పెట్టుకోవాలి.",
    "[00:01:08.000] ఒక మందపాటి గిన్నెలో నెయ్యి, చేపలు వేయించిన నూనె వేసి, బిరియాని దినుసులు, ఉల్లిపాయ ముక్కలు వేసి గోల్డెన్ బ్రౌన్ కలర్ వచ్చే వరకు వేయించాలి.",
    "[00:01:34.000] అల్లం వెల్లుల్లి పేస్ట్, టమాటో ప్యూరీ, మసాలా పొడులు వేసి నూనె పైకి తేలే వరకు ఉడికించాలి.",
    "[00:02:00.000] పుదీనా, కొత్తిమీర, పెరుగు వేసి కలిపి, వేయించిన చేప ముక్కలను సర్దాలి.",
    "[00:02:22.000] మరో పక్క నీళ్లలో దినుసులు, గులాబీ రేకులు వేసి మరిగించి, నానబెట్టిన బాస్మతీ బియ్యాన్ని 60-80% వరకు ఉడికించాలి.",
    "[00:02:59.000] ఉడికిన అన్నాన్ని పొరలు పొరలుగా చేపల మీద వేసి, పైన నూనె, గరం మసాలా చల్లి దమ్ చేయాలి.",
    "[00:03:43.000] 15 నిమిషాల దమ్ తర్వాత తీస్తే అదిరిపోయే ఫిష్ బిరియాని సిద్ధం. దీన్ని మిర్చి కా సలాన్ తో సర్వ్ చేయండి."
  ],
  "transcription_english": [
    "[00:00:00.000] Hello Foodies, welcome to Vismai Food. Today's special is the Hyderabadi Fish Dum Biryani.",
    "[00:00:26.000] Marinate 300g of fish pieces with ginger-garlic paste, turmeric, chilli powder, salt, garam masala, and lemon juice.",
    "[00:00:44.000] Fry these marinated fish pieces in hot oil until they are red and crispy, then set them aside.",
    "[00:01:08.000] In a heavy-bottomed pot, add ghee, fish-fried oil, biryani spices, and sliced onions; fry until golden brown.",
    "[00:01:34.000] Add ginger-garlic paste, tomato puree, and spice powders; cook until the oil starts to float on top.",
    "[00:02:00.000] Add mint, coriander, and whisked curd; mix well and arrange the fried fish pieces on top.",
    "[00:02:22.000] In another pot, boil water with whole spices and rose petals, then cook soaked Basmati rice to about 60-80%.",
    "[00:02:59.000] Layer the partially cooked rice over the fish, sprinkle some oil and garam masala, then seal for dum.",
    "[00:03:43.000] After 15 minutes of dum, the aromatic Fish Biryani is ready. Serve it with Mirchi ka Salan."
  ]
}