{
  "metadata": {
    "title": "PudinaChilliPowder|Aromatic Idli Dosa Podi|పుదినా కారం పొడి|కూర చేసే ఓపిక లేనప్పుడు ఇదుంటే చాలు",
    "channel_name": "Vismai Food",
    "publish_date": "2019-12-12",
    "view_count": 332117,
    "like_count": 5983,
    "duration": "01:52",
    "language": "Telugu",
    "video_id": "P7OqhP4ZBnI",
    "url": "https://www.youtube.com/watch?v=P7OqhP4ZBnI",
    "description": "Aromatic Pudina Chilli Powder (Mint Spice Mix) for Idli and Dosa. A perfect savior when you are not in the mood to cook a full meal.",
    "ingredients_detected": [
      "Dried Mint Leaves (Pudina)",
      "Urad Dal",
      "Chana Dal",
      "Dry Red Chillies",
      "Cumin Seeds (Jeera)",
      "Coriander Seeds (Dhaniyalu)",
      "Garlic Pods",
      "Salt (to taste)",
      "Oil (for roasting)",
      "Tamarind (small piece)"
    ]
  },
  "transcription_telugu": [
    "[00:00:00.000] హలో ఫుడీస్, వెల్కమ్ టు విస్మయ్ ఫుడ్. ఇవాల్టి స్పెషల్ అదిరిపోయే రుచితో ఉండే పుదినా కారం పొడి.",
    "[00:00:15.000] కూర చేసే ఓపిక లేనప్పుడు ఇడ్లీ, దోశల్లోకి ఈ పొడి ఉంటే చాలు.",
    "[00:00:25.000] ముందుగా పాన్ లో నూనె వేసి మినపప్పు, శనగపప్పు, ధనియాలు, జీలకర్ర వేసి లో ఫ్లేమ్ మీద దోరగా వేయించాలి.",
    "[00:00:45.000] ఇందులోనే ఎండుమిర్చి వేసి వేయించి పక్కన పెట్టుకోవాలి.",
    "[00:01:00.000] అదే పాన్ లో కడిగి ఆరబెట్టిన పుదీనా ఆకులను వేసి క్రిస్పీగా అయ్యే వరకు వేయించాలి.",
    "[00:01:20.000] మిక్సీ జార్ లో వేయించిన పప్పులు, పుదీనా, వెల్లుల్లి, చింతపండు, ఉప్పు వేసి మెత్తని పొడిలా గ్రైండ్ చేసుకోవాలి.",
    "[00:01:40.000] ఎంతో సువాసన భరితమైన పుదినా కారం పొడి సిద్ధం. ఇది వేడివేడి అన్నంలో నెయ్యి వేసుకున్నా బాగుంటుంది."
  ],
  "transcription_english": [
    "[00:00:00.000] Hello Foodies, welcome to Vismai Food. Today's special is the incredibly aromatic Pudina Chilli Powder.",
    "[00:00:15.000] This powder is the perfect savior for Idli or Dosa when you are not in the mood to cook a curry.",
    "[00:00:25.000] First, heat oil in a pan and roast urad dal, chana dal, coriander seeds, and cumin seeds on low flame until golden.",
    "[00:00:45.000] Add dry red chillies to this, roast well, and set aside.",
    "[00:01:00.000] In the same pan, add washed and dried mint leaves and fry until they turn crispy.",
    "[00:01:20.000] In a blender, add the roasted dals, mint leaves, garlic pods, tamarind, and salt; grind into a fine powder.",
    "[00:01:40.000] The highly aromatic Pudina Chilli Powder is ready. It also tastes great with hot rice and ghee."
  ]
}