{
  "metadata": {
    "title": "MILK MYSORE PAK|With Accurate Tips|మిల్క్ మైసూర్ పాక్|అచ్చం స్వీట్ షాప్ లోలా వస్తుంది!Vismaifood",
    "channel_name": "Vismai Food",
    "publish_date": "2019-12-14",
    "view_count": 6684859,
    "like_count": 83007,
    "duration": "03:51",
    "language": "Telugu",
    "video_id": "-UWGaIaTeyM",
    "url": "https://www.youtube.com/watch?v=-UWGaIaTeyM",
    "description": "Perfect sweet shop style Milk Mysore Pak recipe with accurate tips and tricks for a soft and juicy texture.",
    "ingredients_detected": [
      "200gms Milk Powder",
      "2 tbsps Maida",
      "2 tbsps Ghee (for initial mixing)",
      "800gms Sugar",
      "200ml Water",
      "1/4 tsp Lemon Juice",
      "200gms Ghee (for cooking)",
      "50gms Ghee (extra for finishing)"
    ]
  },
  "transcription_telugu": [
    "[00:00:00.000] హలో ఫుడీస్, వెల్కమ్ టు విస్మయ్ ఫుడ్. ఇవాల్టి స్పెషల్ అదిరిపోయే రుచితో ఉండే మిల్క్ మైసూర్ పాక్.",
    "[00:00:25.000] ముందుగా 200 గ్రాముల పాలపిండిలో మైదా, నెయ్యి వేసి బ్రెడ్ పొడిలా అయ్యే వరకు బాగా కలపాలి.",
    "[00:00:43.000] పాన్ లో 800 గ్రాముల పంచదార, 200 ఎంఎల్ నీళ్లు పోసి ఒక తీగ పాకం వచ్చే వరకు ఉడికించాలి.",
    "[00:01:14.000] పాకం వచ్చాక నిమ్మరసం వేయాలి. ఇది మైసూర్ పాక్ చల్లారాక రవ్వ రవ్వగా మారకుండా చేస్తుంది.",
    "[00:01:28.000] ఇప్పుడు కలిపి ఉంచుకున్న పాలపిండి మిశ్రమాన్ని వేసి ఉండలు లేకుండా మీడియం ఫ్లేమ్ మీద కలుపుతూ ఉండాలి.",
    "[00:01:40.000] కొద్దికొద్దిగా నెయ్యి వేస్తూ పాకం నెయ్యిని పీల్చుకునే వరకు కలుపుతూ ఉండాలి. ఈ ప్రక్రియకు 25-30 నిమిషాలు పడుతుంది.",
    "[00:02:30.000] పాకాన్ని చేత్తో ఉండ కట్టి చూస్తే ఉండలా అవ్వాలి. అప్పుడు పర్ఫెక్ట్ గా తయారైనట్టు.",
    "[00:02:40.000] స్టవ్ ఆపి మిగిలిన నెయ్యి వేసి మరో ఐదు నిమిషాలు కలిపి, నెయ్యి రాసిన ట్రేలో పోసి 4-5 గంటలు చల్లారనివ్వాలి.",
    "[00:03:00.000] పూర్తిగా చల్లారాక ముక్కలుగా కట్ చేసుకుంటే ఎంతో రుచికరమైన మిల్క్ మైసూర్ పాక్ సిద్ధం."
  ],
  "transcription_english": [
    "[00:00:00.000] Hello Foodies, welcome to Vismai Food. Today's special is the perfect sweet shop style Milk Mysore Pak.",
    "[00:00:25.000] First, mix 200g of milk powder with maida and ghee until it reaches a breadcrumb-like consistency.",
    "[00:00:43.000] In a pan, add 800g of sugar and 200ml of water. Boil until it reaches a one-string consistency.",
    "[00:01:14.000] Once the string consistency is reached, add lemon juice. This prevents the Mysore Pak from becoming grainy after cooling.",
    "[00:01:28.000] Now add the milk powder mixture and keep stirring on medium flame without any lumps.",
    "[00:01:40.000] Gradually add ghee and keep stirring until the mixture absorbs the ghee. This process takes about 25-30 minutes.",
    "[00:02:30.000] Take a small amount of the mixture and roll it with your fingers; it should form a ball. That's the perfect stage.",
    "[00:02:40.000] Turn off the flame, add the remaining ghee, mix for five minutes, and transfer to a greased tray. Let it cool for 4-5 hours.",
    "[00:03:00.000] Once completely cooled, demould and cut into desired shapes. The delicious Milk Mysore Pak is ready."
  ]
}