{
  "metadata": {
    "title": "Till Chikki|Perfect Crunchy Chikki|నువ్వుల పట్టి|ఇది కలిపితేనే ఎప్పుడు చేసినా పర్ఫెక్ట్ గా వస్తాయ్",
    "channel_name": "Vismai Food",
    "publish_date": "2019-12-16",
    "view_count": 949770,
    "like_count": 14895,
    "duration": "02:25",
    "language": "Telugu",
    "video_id": "aI8dXjg2WVU",
    "url": "https://www.youtube.com/watch?v=aI8dXjg2WVU",
    "description": "Learn how to make the perfect, crunchy Sesame Chikki (Nuvvula Patti) at home with simple tips to ensure it stays crisp for a long time.",
    "ingredients_detected": [
      "1 Cup Sesame Seeds (Nuvvulu)",
      "1 Cup Grated Jaggery (Bellam)",
      "1/4 tsp Baking Soda",
      "2 tsp Water (optional)",
      "Ghee (for greasing and finishing)"
    ]
  },
  "transcription_telugu": [
    "[00:00:00.000] హలో ఫుడీస్, వెల్కమ్ టు విస్మయ్ ఫుడ్. ఇవాల్టి స్పెషల్ వింటర్ ఇంకా సంక్రాంతి స్పెషల్ నువ్వుల చిక్కి లేదా నువ్వుల పట్టి.",
    "[00:00:22.000] ముందుగా ఒక కప్పు నువ్వులను లో ఫ్లేమ్ మీద చిటపటమనే వరకు నిదానంగా వేయించాలి.",
    "[00:00:33.000] ఇప్పుడు ఒక కప్పు బెల్లం తురుము తీసుకుని, అవసరమైతే రెండు స్పూన్ల నీళ్లు పోసి ముదురు పాకం వచ్చే వరకు ఉడికించాలి.",
    "[00:00:46.000] పాకాన్ని నీళ్లలో వేసి చూస్తే అది అప్పడంలా విరగాలి. అప్పుడే పర్ఫెక్ట్ పాకం వచ్చినట్టు.",
    "[00:01:00.000] ఇందులో పావు చెంచా వంట సోడా వేయాలి. ఇది చిక్కిని ఎక్కువ రోజులు క్రిస్పీగా ఉంచుతుంది.",
    "[00:01:12.000] ఇప్పుడు వేయించిన నువ్వులు వేసి మీడియం ఫ్లేమ్ మీద రెండు నిమిషాలు బాగా కలుపుకోవాలి.",
    "[00:01:21.000] దీన్ని అల్యూమినియం ఫాయిల్ లేదా నెయ్యి రాసిన ప్లేట్ లో వేసి సమానంగా పరవాలి.",
    "[00:01:34.000] నెయ్యి రాసిన చపాతీ కర్రతో పల్చగా ఒత్తుకుని, వేడి మీద ఉన్నప్పుడే నచ్చిన ఆకారంలో గాట్లు పెట్టుకోవాలి.",
    "[00:01:55.000] పూర్తిగా చల్లారాక ముక్కలుగా విడదీస్తే ఎంతో కరకరలాడే నువ్వుల చిక్కి సిద్ధం."
  ],
  "transcription_english": [
    "[00:00:00.000] Hello Foodies, welcome to Vismai Food. Today's special is the Winter and Sankranti special Sesame Chikki or Nuvvula Patti.",
    "[00:00:22.000] First, roast one cup of sesame seeds on low flame until they start spluttering.",
    "[00:00:33.000] Take one cup of grated jaggery, add two spoons of water if needed, and boil until it reaches a thick consistency.",
    "[00:00:46.000] Test the syrup by dropping it in water; it should break like a papad. That indicates the perfect stage.",
    "[00:01:00.000] Add 1/4 tsp of baking soda. This helps the chikki stay crisp for a longer time.",
    "[00:01:12.000] Now add the roasted sesame seeds and sauté for 2 minutes on medium flame.",
    "[00:01:21.000] Spread the mixture evenly on an aluminium foil or a greased tray.",
    "[00:01:34.000] Flatten it with a greased rolling pin and make cuts in desired shapes while it's still warm.",
    "[00:01:55.000] Let it cool down completely, then break it into pieces. The crunchy Sesame Chikki is ready."
  ]
}