{
  "metadata": {
    "title": "బెల్లం కొమ్ములు|Jaggery Murukulu|చలికాలం ప్రతీ ఒక్కరు తినాల్సిన తెలుగింటి పిండి వంట|Andhra Sweet",
    "channel_name": "Vismai Food",
    "publish_date": "2019-12-22",
    "view_count": 771623,
    "like_count": 8274,
    "duration": "02:32",
    "language": "Telugu",
    "video_id": "vtYLiQXK1dE",
    "url": "https://www.youtube.com/watch?v=vtYLiQXK1dE",
    "description": "Bellam Kommulu (Jaggery Murukulu) is a traditional Andhra sweet made with gram flour and jaggery. It is crispy, sweet, and a perfect snack for the winter season.",
    "ingredients_detected": [
      "1 Cup Besan (Senaga Pindi)",
      "2 tsp Rice Flour (Biyyam Pindi)",
      "2 tbsp Hot Oil",
      "Pinch of Salt",
      "Water (as needed)",
      "Oil (for deep frying)",
      "1 Cup Jaggery (Bellam)",
      "2 tsp Water (for syrup)",
      "1/2 tsp Cardamom Powder (Yalakala Pindi)",
      "1/2 tsp Dry Ginger Powder (Sonti Pindi)"
    ]
  },
  "transcription_telugu": [
    "[00:00:00.000] హలో ఫుడీస్, వెల్కమ్ టు విస్మయ్ ఫుడ్. ఇవాల్టి స్పెషల్ బెల్లం కొమ్ములు లేదా బెల్లం మురుకులు.",
    "[00:00:23.000] ఒక కప్పు శనగపిండిలో బియ్యం పిండి, వేడి వేడి నూనె, ఉప్పు వేసి బాగా కలుపుకోవాలి.",
    "[00:00:38.000] పిండి జిగురుగా వచ్చేలా తగినన్ని నీళ్లు పోసి కలుపుకోవాలి. మరీ గట్టిగా కలపకూడదు.",
    "[00:00:52.000] మురుకుల గొట్టంలో పెద్ద రంధ్రాలున్న మౌల్డ్ ని ఉంచి, వేడి నూనెలో మురుకుల్లా ఒత్తుకోవాలి.",
    "[00:01:12.000] రెండు వైపులా క్రిస్పీగా వేగాక తీసి పక్కన పెట్టుకోవాలి.",
    "[00:01:25.000] ఇప్పుడు ఒక కప్పు బెల్లం, కొద్దిగా నీళ్లు పోసి ఒక తీగ పాకం వచ్చే వరకు ఉడికించాలి.",
    "[00:01:40.000] పాకం వచ్చాక యాలకుల పొడి, శొంఠి పొడి వేసి కలపాలి. శొంఠి జీర్ణక్రియకు మరియు శరీరంలో కఫాన్ని తగ్గించడానికి ఉపయోగపడుతుంది.",
    "[00:01:52.000] స్టవ్ ఆపి మురుకులను పాకంలో వేసి 3-4 నిమిషాల పాటు బాగా కోట్ చేయాలి.",
    "[00:02:06.000] ఇవి గోరువెచ్చగా ఉన్నప్పుడే అంటుకున్న మురుకులను విడదీయాలి. చల్లారాక తీస్తే సరిగ్గా రావు.",
    "[00:02:15.000] ఎంతో రుచికరమైన బెల్లం కొమ్ములు సిద్ధం. ఇవి కనీసం 15 రోజులు నిల్వ ఉంటాయి."
  ],
  "transcription_english": [
    "[00:00:00.000] Hello Foodies, welcome to Vismai Food. Today's special is the traditional Andhra sweet, Bellam Kommulu or Jaggery Murukulu.",
    "[00:00:23.000] Mix one cup of gram flour with rice flour, hot oil, and a pinch of salt.",
    "[00:00:38.000] Add sufficient water to make a sticky dough. Do not knead it too hard.",
    "[00:00:52.000] Use a murukku mould with big holes and press the dough into hot oil to fry.",
    "[00:01:12.000] Fry on both sides until crispy and set them aside.",
    "[00:01:25.000] In a pan, add one cup of jaggery with a little water and boil until it reaches a one-string consistency.",
    "[00:01:40.000] Add cardamom powder and dry ginger powder once the syrup is ready. Ginger powder is good for digestion and reducing phlegm.",
    "[00:01:52.000] Turn off the flame, add the fried murukku to the syrup, and coat well for 3-4 minutes.",
    "[00:02:06.000] Separate the murukku while it is still lukewarm. If they cool completely, they might stick together.",
    "[00:02:15.000] The delicious Bellam Kommulu are ready. They can be preserved for at least 15 days."
  ]
}