{
  "metadata": {
    "title": "BestCoconutMilkPulav|కొబ్బరి పాల పులావ్|మా స్టైల్ లోని కొబ్బరిపాల పులావ్ ఎప్పుడు చేసినా సూపర్ హిట్",
    "channel_name": "Vismai Food",
    "publish_date": "2019-12-25",
    "view_count": 672212,
    "like_count": 8878,
    "duration": "02:02",
    "language": "Telugu",
    "video_id": "sO4RYLSkID8",
    "url": "https://www.youtube.com/watch?v=sO4RYLSkID8",
    "description": "A step-by-step guide to making the best Coconut Milk Pulav. This aromatic and flavorful rice dish is a consistent hit in the Vismai Food style.",
    "ingredients_detected": [
      "2 Cups Basmati Rice (Soaked for 30 mins)",
      "4 Cups Thin Coconut Milk",
      "2-3 tbsp Ghee",
      "1 tbsp Oil",
      "Whole Spices: Bay leaf, Cinnamon, Cardamom, Cloves, Shahi Jeera",
      "1 Large Onion (sliced)",
      "3-4 Green Chillies (slit)",
      "1 tbsp Ginger Garlic Paste",
      "1/2 Cup Mint Leaves (Pudina)",
      "1/2 Cup Coriander Leaves",
      "Salt (to taste)",
      "1/2 tsp Garam Masala"
    ]
  },
  "transcription_telugu": [
    "[00:00:00.000] హలో ఫుడీస్, వెల్కమ్ టు విస్మయ్ ఫుడ్. ఇవాల్టి స్పెషల్ కమ్మని రుచితో ఉండే కొబ్బరి పాల పులావ్.",
    "[00:00:15.000] ముందుగా ఒక మందపాటి గిన్నెలో నెయ్యి, నూనె వేసి వేడి అయ్యాక బిరియాని దినుసులు, ఉల్లిపాయ ముక్కలు, పచ్చిమిర్చి వేసి వేయించాలి.",
    "[00:00:40.000] ఉల్లిపాయలు మగ్గాక అల్లం వెల్లుల్లి పేస్ట్ వేసి పచ్చి వాసన పోయే వరకు వేయించి, పుదీనా, కొత్తిమీర ఆకులు కూడా వేసి కలపాలి.",
    "[00:01:00.000] ఇప్పుడు ఇందులో నాలుగు కప్పుల పల్చటి కొబ్బరి పాలను పోసి, రుచికి సరిపడా ఉప్పు, గరం మసాలా వేసి మరిగించాలి.",
    "[00:01:25.000] ఎసరు మరుగుతున్నప్పుడు నానబెట్టుకున్న బాస్మతీ బియ్యాన్ని వేసి ఒకసారి కలిపి మూత పెట్టి ఉడికించాలి.",
    "[00:01:45.000] నీరు సగానికి పైగా ఇగిరినప్పుడు మంటను సిమ్ లో పెట్టి 10 నిమిషాల పాటు దమ్ చేయాలి.",
    "[00:02:00.000] ఎంతో సువాసన భరితమైన కమ్మని కొబ్బరి పాల పులావ్ సిద్ధం. ఇది ఏదైనా మసాలా గ్రేవీతో చాలా బాగుంటుంది."
  ],
  "transcription_english": [
    "[00:00:00.000] Hello Foodies, welcome to Vismai Food. Today's special is the delicious and aromatic Coconut Milk Pulav.",
    "[00:00:15.000] First, heat ghee and oil in a heavy-bottomed pot. Add whole spices, sliced onions, and green chillies; sauté well.",
    "[00:00:40.000] Once onions are soft, add ginger-garlic paste and sauté until the raw smell goes away. Then add mint and coriander leaves.",
    "[00:01:00.000] Now pour four cups of thin coconut milk into the pot. Add salt to taste and garam masala, then bring it to a boil.",
    "[00:01:25.000] When the liquid starts boiling, add the soaked Basmati rice, stir gently, cover, and cook.",
    "[00:01:45.000] When the water is mostly absorbed, reduce the flame to low and let it dum for 10 minutes.",
    "[00:02:00.000] The fragrant and tasty Coconut Milk Pulav is ready. It pairs beautifully with any spicy gravy curry."
  ]
}