{
  "metadata": {
    "title": "Pumpkin Coconut Payasam|గుమ్మడి కొబ్బరి పాయసం|కొత్తగా హేల్తీగా ఓ స్వీట్ లేదా ప్రసాదం కోసం ఇది బెస్ట్",
    "channel_name": "Vismai Food",
    "publish_date": "2020-01-01",
    "view_count": 170198,
    "like_count": 3559,
    "duration": "03:20",
    "language": "Telugu",
    "video_id": "vFQBgkXC0-0",
    "url": "http://www.youtube.com/watch?v=vFQBgkXC0-0",
    "description": "Best healthy Pumpkin Coconut Payasam recipe from Vismai Food. A perfect sweet or prasadam option made with pumpkin, moong dal, and coconut milk.",
    "ingredients_detected": [
      "250gms Sweet Pumpkin (Peeled & Cubed)",
      "1/2 Cup Moong Dal (2 hour soaked)",
      "750ml Water",
      "250ml Coconut Milk (first extract)",
      "250gms Jaggery Syrup (boiled to 1 String consistency)",
      "2 tbsps Ghee",
      "2 tbsps Cashews",
      "2 tbsps Badam (Almonds)",
      "1/8 tsp Cinnamon Powder"
    ]
  },
  "transcription_telugu": [
    "[00:00:00.000] హలో ఫుడీస్, విస్మయ్ ఫుడ్ టీమ్ తరపున మీకు నూతన సంవత్సర శుభాకాంక్షలు. ఇవాల్టి స్పెషల్ బెస్ట్ హెల్తీ గుమ్మడి బెల్లం పాయసం.",
    "[00:00:30.000] ముందుగా ఒక వెసెల్ లో 750ml నీళ్లు మరిగించుకోండి.",
    "[00:00:37.000] నీళ్లు మరుగుతుండగా 1/2 కప్పు రెండు గంటల పాటు నానబెట్టిన పెసరపప్పు వేసి 50% మాత్రమే ఉడికించుకోవాలి.",
    "[00:00:58.000] పెసరపప్పు సగం ఉడికాక, పావు కిలో బాగా పండిన తీపి గుమ్మడి ముక్కలు వేసుకోండి.",
    "[00:01:05.000] మూత పెట్టి గుమ్మడికాయను సగం పైన (70%) ఉడికించుకోవాలి.",
    "[00:01:20.000] ఉడికించిన మిశ్రమాన్ని పప్పు గుత్తితో కచ్చాపచ్చాగా ఎనుపుకోవాలి. దీన్ని మరో 2 నిమిషాలు హై ఫ్లేమ్ మీద ఉడికించాలి.",
    "[00:01:30.000] ఇప్పుడు ఇందులో పావు లీటర్ చిక్కటి కొబ్బరి పాలు పోసి 5 నిమిషాల పాటు మరగనివ్వాలి.",
    "[00:01:54.000] ఇందులో పావు కిలో బెల్లంలో 2 టేబుల్ స్పూన్ల నీళ్లు వేసి తీగ పాకం పట్టిన బెల్లం పాకం పోసి లో ఫ్లేమ్ మీద 5 నిమిషాలు కలుపుతూ ఉడికించాలి.",
    "[00:02:25.000] తాలింపు కోసం 2 టేబుల్ స్పూన్ల నెయ్యిలో జీడిపప్పు, బాదం పప్పు వేసి ఎర్రగా వేయించుకోవాలి.",
    "[00:02:38.000] వేయించిన డ్రై ఫ్రూట్స్ ని పాయసంలో వేసి, చివరగా 1/8 టీస్పూన్ దాల్చిన చెక్క పొడి వేసి కలుపుకోవాలి.",
    "[00:03:00.000] ఎంతో రుచికరమైన, ఆరోగ్యకరమైన గుమ్మడి కొబ్బరి పాయసం సిద్ధం."
  ],
  "transcription_english": [
    "[00:00:00.000] Hello Foodies, Happy New Year from the Vismai Food team. Today's special is a healthy Pumpkin Jaggery Payasam.",
    "[00:00:30.000] First, boil 750ml of water in a vessel.",
    "[00:00:37.000] While water is boiling, add 1/2 cup of moong dal (soaked for 2 hours) and cook it until 50% done.",
    "[00:00:58.000] Once the dal is half-cooked, add 250g of well-ripened sweet pumpkin cubes.",
    "[00:01:05.000] Cover and cook until the pumpkin is about 70% done.",
    "[00:01:20.000] Mash the mixture coarsely. Then, boil it on high flame for another 2 minutes.",
    "[00:01:30.000] Now, add 250ml of thick coconut milk and let it boil for 5 minutes.",
    "[00:01:54.000] Add 250g of jaggery syrup (prepared with 2 tbsp water to 1-string consistency) and cook on low flame for 5 minutes while stirring.",
    "[00:02:25.000] For tempering, melt 2 tbsp ghee and fry cashews and almonds until golden red.",
    "[00:02:38.000] Add the fried nuts to the payasam along with 1/8 tsp of cinnamon powder and mix well.",
    "[00:03:00.000] The delicious and healthy Pumpkin Coconut Payasam is now ready."
  ]
}