{
  "metadata": {
    "title": "మినుములచెక్కలు|UradDalTattai|అస్సలు నూనె పీల్చవ్|బియ్యం పిండి చెక్కలకంటే రుచిగాను కరకరలాడుతూ ఉంటాయి",
    "channel_name": "Vismai Food",
    "publish_date": "2020-01-02",
    "view_count": 362357,
    "like_count": 6559,
    "duration": "02:52",
    "language": "Telugu",
    "video_id": "Q0czfW2qxy0",
    "url": "https://www.youtube.com/watch?v=Q0czfW2qxy0",
    "description": "These Urad Dal Chekkalu (Tattai) are extremely crunchy, flavorful, and absorb very little oil. They are even tastier than regular rice flour chekkalu, perfect for festivals like Sankranti.",
    "ingredients_detected": [
      "1 Cup Husked Urad Dal (1 hour soaked)",
      "1 Cup Rice Flour",
      "1 tbsp Coarsely Ground Black Pepper",
      "1/4 tsp Hing (Asafoetida) - Optional",
      "1 tsp Cumin Seeds",
      "2 Sprigs Curry Leaves (chopped)",
      "2 tbsps Chana Dal (1 hour soaked)",
      "1 tbsp Chilli Powder",
      "1 tbsp Butter",
      "1 tbsp Sesame Seeds",
      "2 tbsps Coriander (chopped)",
      "Salt (to taste)",
      "Oil (for deep frying)"
    ]
  },
  "transcription_telugu": [
    "[00:00:00.000] హలో ఫుడీస్, వెల్కమ్ టు విస్మయ్ ఫుడ్. ఇవాల్టి స్పెషల్ సంక్రాంతి స్పెషల్ మినుముల చెక్కలు.",
    "[00:00:25.000] ముందుగా గంట పాటు నానబెట్టిన మినప్పప్పుని మిక్సీ జార్ లో వేసి కచ్చాపచ్చాగా గ్రైండ్ చేసుకోవాలి.",
    "[00:00:55.000] ఈ పిండిలో మిరియాల పొడి, ఇంగువ, జీలకర్ర, కరివేపాకు, నానబెట్టిన శనగపప్పు, కారం, వెన్న, నువ్వులు, కొత్తిమీర, ఉప్పు వేసి కలపాలి.",
    "[00:01:20.000] ఇందులో బియ్యం పిండిని కొద్దికొద్దిగా వేస్తూ ముద్దలా కలుపుకోవాలి. మినప్పప్పు, బియ్యం పిండి సమానంగా ఉండాలి.",
    "[00:01:45.000] చిన్న చిన్న ఉండలుగా చేసి ఆయిల్ రాసిన కవర్ మీద పెట్టి పూరీ ప్రెస్ తో చెక్కల్లా ఒత్తుకోవాలి.",
    "[00:02:00.000] బాగా కాగుతున్న నూనెలో వేసి మీడియం టు హై ఫ్లేమ్ మీద గోల్డెన్ కలర్ వచ్చే వరకు వేయించాలి.",
    "[00:02:30.000] వేగిన చెక్కలను తీసి పూర్తిగా చల్లారనివ్వాలి. ఎంతో కరకరలాడే మినుముల చెక్కలు రెడీ."
  ],
  "transcription_english": [
    "[00:00:00.000] Hello Foodies, welcome to Vismai Food. Today's special is the Sankranti special Urad Dal Chekkalu.",
    "[00:00:25.000] First, take urad dal soaked for one hour and grind it into a semi-coarse paste in a blender.",
    "[00:00:55.000] To this paste, add black pepper powder, hing, cumin, curry leaves, soaked chana dal, chilli powder, butter, sesame seeds, coriander, and salt.",
    "[00:01:20.000] Gradually add rice flour and mix it into a dough. The ratio should be 1:1 for urad dal and rice flour.",
    "[00:01:45.000] Make small balls and press them into flat discs on a greased plastic sheet using a poori press.",
    "[00:02:00.000] Drop them in hot oil and fry on medium to high flame until they turn golden brown.",
    "[00:02:30.000] Once fried, let them cool completely. Crunchy Urad Dal Chekkalu are now ready."
  ]
}