{
  "metadata": {
    "title": "Healthy Peanut Poha Laddu|పల్లీ అటుకుల లడ్డు|ఆరోగ్యం కోరుకునే ప్రతీ ఒక్కరు తినాల్సిన లడ్డు",
    "channel_name": "Vismai Food",
    "publish_date": "2020-01-05",
    "view_count": 481029,
    "like_count": 8321,
    "duration": "02:21",
    "language": "Telugu",
    "video_id": "3-YjoYpjIC8",
    "url": "https://www.youtube.com/watch?v=3-YjoYpjIC8",
    "description": "Healthy Peanut Poha Laddu recipe from Vismai Food. These laddus are rich in calcium and iron, making them ideal for kids, pregnant women, and anyone looking for a nutritious sweet snack.",
    "ingredients_detected": [
      "1 Cup Peanuts",
      "1/2 Cup Thick Poha (Atukulu)",
      "1/2 Cup Sesame Seeds (Nuvvulu)",
      "1 tbsp Water",
      "1 Cup Finely Grated Jaggery",
      "1 tsp Cardamom Powder",
      "Ghee (Optional - 1 tbsp)"
    ]
  },
  "transcription_telugu": [
    "[00:00:00.000] హలో ఫుడీస్, వెల్కమ్ టు విస్మయ్ ఫుడ్. ఇవాల్టి స్పెషల్ హెల్తీ పల్లీ అటుకుల లడ్డు. ఇది అందరికీ చాలా ఉపయోగపడే లడ్డు.",
    "[00:00:20.000] ముందుగా ఒక కప్పు పల్లీలను కేవలం లో ఫ్లేమ్ మీద మాత్రమే దోరగా వేయించాలి. వేగిన తర్వాత పొట్టు తీసి పక్కన పెట్టుకోవాలి.",
    "[00:00:36.000] ఇప్పుడు అర కప్పు మందపాటి అటుకులను లో ఫ్లేమ్ మీద క్రిస్పీగా అయ్యే వరకు వేయించుకోవాలి.",
    "[00:00:48.000] ఆ తర్వాత అర కప్పు నువ్వులలో ఒక టేబుల్ స్పూన్ నీళ్లు చల్లుకుని లో ఫ్లేమ్ మీద వేయించాలి. నీళ్లు చల్లడం వల్ల నువ్వులు గుల్లగా వేగుతాయి.",
    "[00:01:08.000] వేయించిన అటుకులను మిక్సీ పట్టి పొడి చేసుకోవాలి.",
    "[00:01:13.000] మరో జార్ లో పల్లీలు, నువ్వులు వేసి పొడి చేసిన తర్వాత ఒక కప్పు సన్నగా తురిమిన బెల్లం వేసి మరోసారి గ్రైండ్ చేయాలి.",
    "[00:01:30.000] ఈ మిశ్రమాన్ని ఒక బౌల్ లోకి తీసుకుని అటుకుల పొడి, యాలకుల పొడి వేసి బాగా కలుపుకోవాలి.",
    "[00:01:45.000] ఇప్పుడు కొంచెం ఒత్తిడి ఇస్తూ ఉండలు చుట్టుకోవాలి. రాకపోతే చేతులకు కొంచెం నీటిని తడి చేసుకుని చుట్టవచ్చు లేదా నెయ్యి కూడా వాడవచ్చు.",
    "[00:02:00.000] ఈ లడ్డులు ఎయిర్ టైట్ కంటైనర్ లో 15 రోజుల వరకు నిల్వ ఉంటాయి. ఎంతో ఆరోగ్యకరమైన పల్లీ అటుకుల లడ్డు సిద్ధం."
  ],
  "transcription_english": [
    "[00:00:00.000] Hello Foodies, welcome to Vismai Food. Today's special is the healthy Peanut Poha Laddu. This is beneficial for everyone.",
    "[00:00:20.000] First, roast one cup of peanuts strictly on low flame until they are well-roasted. Once done, remove the skin and keep them aside.",
    "[00:00:36.000] Now, roast half a cup of thick poha on low flame until they turn crispy.",
    "[00:00:48.000] Next, take half a cup of sesame seeds, sprinkle one tablespoon of water, and roast them on low flame. The water helps them roast well.",
    "[00:01:08.000] Grind the roasted poha into a fine powder.",
    "[00:01:13.000] In another jar, grind the peanuts and sesame seeds. Then add one cup of finely grated jaggery and grind again.",
    "[00:01:30.000] Transfer this mixture to a bowl, add the poha powder and cardamom powder, and mix thoroughly.",
    "[00:01:45.000] Form small laddus by applying some pressure. If they don't hold shape, you can slightly dampen your palms with water or use ghee.",
    "[00:02:00.000] These laddus can be stored in an airtight container for up to 15 days. Healthy Peanut Poha Laddus are ready."
  ]
}