{
  "metadata": {
    "title": "ఇన్స్టంట్ గులాబ్ జామున్స్ పచ్చిగా , ఉండలు కడుతున్నయా? అయితే ఇవి కలిపి చేయండి|",
    "channel_name": "Vismai Food",
    "publish_date": "2020-01-09",
    "view_count": 2969576,
    "like_count": 33252,
    "duration": "02:55",
    "language": "Telugu",
    "video_id": "GsgpvgmYuNI",
    "url": "https://www.youtube.com/watch?v=GsgpvgmYuNI",
    "description": "Learn the secrets to making perfect Instant Gulab Jamuns without cracks or lumps inside. This recipe by Vismai Food includes professional tips for a soft and juicy texture.",
    "ingredients_detected": [
      "200gms Instant Gulab Jamun Mix",
      "800gms Sugar",
      "800ml Water",
      "1 tsp Cardamom Powder",
      "1 tbsp Rose Water",
      "1 tsp Corn Flour",
      "1 tsp Maida",
      "Oil/Ghee for deep frying"
    ]
  },
  "transcription_telugu": [
    "[00:00:00.000] హలో ఫుడీస్, వెల్కమ్ టు విస్మయ్ ఫుడ్. ఇవాల్టి స్పెషల్ అదిరిపోయే ఇన్స్టంట్ గులాబ్ జామున్ రెసిపీ.",
    "[00:00:30.000] ముందుగా 800 గ్రాముల పంచదారలో 800 మి.లీ నీళ్లు పోసి మరగనివ్వాలి. పాకం మరిగేటప్పుడు రోజ్ వాటర్, యాలకుల పొడి వేసి దించి పూర్తిగా చల్లారనివ్వాలి.",
    "[00:00:55.000] ఒక గిన్నెలో 200 గ్రాముల గులాబ్ జామున్ మిక్స్ తీసుకుని అందులో కార్న్ ఫ్లోర్, మైదా, యాలకుల పొడి వేసి కలపాలి.",
    "[00:01:05.000] కొద్దికొద్దిగా నీళ్లు పోస్తూ పిండిని సెమీ-సాఫ్ట్ గా కలుపుకోవాలి. మైదా, కార్న్ ఫ్లోర్ వల్ల జామున్స్ విడిపోకుండా వస్తాయి.",
    "[00:01:20.000] పిండిని చిన్న చిన్న ఉండలుగా చేసుకునేటప్పుడు కొంచెం ఒత్తిడి ఇస్తూ చేయాలి, అప్పుడే క్రాక్స్ రావు.",
    "[00:01:40.000] నూనె బాగా వేడయ్యాక స్టవ్ ఆపేసి జామున్స్ వేయాలి. అవి ఒక్కొక్కటిగా పైకి తేలాక మళ్ళీ స్టవ్ ఆన్ చేసి మీడియం ఫ్లేమ్ లో వేయించాలి.",
    "[00:02:10.000] గరిటెతో కలుపుతూ గోల్డెన్ బ్రౌన్ కలర్ వచ్చే వరకు వేయించుకోవాలి. వేయించిన జామున్స్ ని పూర్తిగా చల్లారిన పాకంలో వేసి 30 నిమిషాలు ఉంచాలి.",
    "[00:02:45.000] ఎంతో మెత్తని, జూసీ గులాబ్ జామున్స్ సిద్ధం."
  ],
  "transcription_english": [
    "[00:00:00.000] Hello Foodies, welcome to Vismai Food. Today's special is a perfect Instant Gulab Jamun recipe.",
    "[00:00:30.000] First, boil 800g of sugar with 800ml of water. Add rose water and cardamom powder, then let the syrup cool down completely.",
    "[00:00:55.000] In a bowl, take 200g of Gulab Jamun mix and add corn flour, maida, and cardamom powder.",
    "[00:01:05.000] Gradually add water and mix it into a semi-soft dough. Corn flour and maida prevent the jamuns from breaking.",
    "[00:01:20.000] While making balls, apply a little pressure to ensure they are crack-free.",
    "[00:01:40.000] Heat oil well, turn off the flame, and drop the jamuns. Once they float to the top, turn on the flame and fry on medium heat.",
    "[00:02:10.000] Fry until they turn golden brown, stirring constantly. Add the hot jamuns to the completely cooled syrup and let them soak for 30 minutes.",
    "[00:02:45.000] Soft and juicy Gulab Jamuns are now ready to enjoy."
  ]
}