{
  "metadata": {
    "title": "Instant Sabudana Dosa | సగ్గుబియ్యం అట్లు | Saggubiyyam dosa|Sabudana dosa recipe by vismai food",
    "channel_name": "Vismai Food",
    "publish_date": "2018-12-02",
    "view_count": 2553268,
    "like_count": 22081,
    "duration": "02:01",
    "language": "Telugu",
    "video_id": "IgD_-iv0M6g",
    "url": "https://www.youtube.com/watch?v=IgD_-iv0M6g",
    "description": "Healthy and tasty Instant Sabudana Dosa (Saggubiyyam Atlu) recipe by Vismai Food, perfect for breakfast.",
    "ingredients_detected": [
      "1 Cup Sabudana (110gms) - soaked for 2-3 hours",
      "1 Cup Rice - soaked for 2 hours",
      "1 Inch Ginger piece",
      "2 Green Chillies",
      "1/4 Cup Sour Curd (or Fresh Curd)",
      "1 Large Onion (chopped)",
      "3 tbsps Coriander (chopped)",
      "2 Sprigs Curry leaves (chopped)",
      "Sufficient Water",
      "Oil (for frying)",
      "Salt (to taste)"
    ]
  },
  "transcription_telugu": [
    "[00:00:00.000] హలో ఫుడీస్, వెల్కమ్ టు విస్మయ్ ఫుడ్. ఇవాల్టి స్పెషల్ ఇన్స్టంట్ సగ్గుబియ్యం దోశ లేదా సగ్గుబియ్యం అట్లు.",
    "[00:00:10.000] ఇవి చాలా హెల్తీ, బాడీకి చలవ చేస్తాయి. వేడి వేడిగా తింటే అద్భుతంగా ఉంటాయి.",
    "[00:00:19.000] ముందుగా ఒక కప్పు (110 గ్రాములు) సగ్గుబియ్యాన్ని రెండు మూడు గంటలు నానబెట్టుకోవాలి.",
    "[00:00:25.000] అలాగే ఒక కప్పు బియ్యాన్ని కూడా రెండు గంటలు నానబెట్టి సిద్ధం చేసుకోవాలి.",
    "[00:00:31.000] నానిన సగ్గుబియ్యాన్ని మిక్సీ జార్ లో వేసి కొద్దిగా నీళ్లు పోసి మెత్తగా కాటుకలా గ్రైండ్ చేసి పక్కన పెట్టుకోండి.",
    "[00:00:40.000] ఆ తర్వాత బియ్యాన్ని కూడా అదే విధంగా మెత్తగా రుబ్బి సిద్ధం చేయాలి.",
    "[00:00:45.000] ఒక చిన్న జార్ లో అల్లం ముక్క, పచ్చిమిర్చి వేసి కొద్దిగా నీళ్లు పోసి ఫైన్ పేస్ట్ లా గ్రైండ్ చేయండి.",
    "[00:00:52.000] మిక్సింగ్ బౌల్ లో సగ్గుబియ్యం పిండి, బియ్యం పిండి, పావు కప్పు పెరుగు వేసి కలపండి.",
    "[00:01:03.000] ఇందులో ఉల్లిపాయ తరుగు, కొత్తిమీర తరుగు, కరివేపాకు తరుగు, అల్లం-పచ్చిమిర్చి పేస్ట్, ఉప్పు వేసి బాగా కలుపుకోవాలి.",
    "[00:01:18.000] దోశ పిండి కన్సిస్టెన్సీ వచ్చే వరకు అవసరమైతే కొన్ని నీళ్లు పోసి కలుపుకోండి.",
    "[00:01:25.000] వేడి పెనం మీద దోశలు వేసుకోవాలి. ఇవి చక్కటి షేప్ రావు కానీ టేస్ట్ బాగుంటుంది.",
    "[00:01:33.000] మీడియం ఫ్లేమ్ మీద కొద్దిగా ఆయిల్ వేసి రెండు వైపులా గోల్డెన్ బ్రౌన్ కలర్ వచ్చే వరకు కాల్చుకోవాలి.",
    "[00:01:47.000] వీటికి కొబ్బరి పచ్చడి కంటే అల్లం పచ్చడి బెస్ట్ కాంబినేషన్. సగ్గుబియ్యం అట్లు రెడీ!"
  ],
  "transcription_english": [
    "[00:00:00.000] Hello Foodies, welcome to Vismai Food. Today's special is Instant Sabudana Dosa or Saggubiyyam Atlu.",
    "[00:00:10.000] They are very healthy and have a cooling effect on the body. They taste amazing when eaten hot.",
    "[00:00:19.000] First, soak 1 cup (110g) of sabudana for two to three hours.",
    "[00:00:25.000] Also, soak 1 cup of rice for two hours and keep it ready.",
    "[00:00:31.000] Grind the soaked sabudana in a mixer jar with a little water until it's a very smooth paste.",
    "[00:00:40.000] Similarly, grind the soaked rice into a smooth batter and set it aside.",
    "[00:00:45.000] In a small jar, add ginger pieces and green chillies; grind into a fine paste using some water.",
    "[00:00:52.000] In a mixing bowl, combine the sabudana batter, rice batter, and 1/4 cup of curd.",
    "[00:01:03.000] Add chopped onions, coriander leaves, curry leaves, ginger-chilli paste, and salt; mix thoroughly.",
    "[00:01:18.000] Adjust the consistency with water if needed to get a proper dosa batter texture.",
    "[00:01:25.000] Ladle the batter onto a hot pan; they might not have a perfect shape but will taste great.",
    "[00:01:33.000] Drizzle oil and roast on medium flame until both sides turn golden brown.",
    "[00:01:47.000] Ginger chutney is the best combination for these sabudana dosas. Enjoy!"
  ]
}