{
  "metadata": {
    "title": "బోటి చారు|బోటి బెండకాయ పులుసు|బోటీ మీరు ఈ తీరు లో చేస్తే మాంచి సువాసనా రుచి||",
    "channel_name": "Vismai Food",
    "publish_date": "2020-01-10",
    "view_count": 143060,
    "like_count": 2472,
    "duration": "02:29",
    "language": "Telugu",
    "video_id": "NU8aU_1m34I",
    "url": "https://www.youtube.com/watch?v=NU8aU_1m34I",
    "description": "A traditional and flavorful Boti Bhindi (Lamb Tripe with Ladyfinger) curry recipe. This method ensures a great aroma and taste, making it a perfect side dish for rice or rotis.",
    "ingredients_detected": [
      "500gms Boti (cleaned and boiled)",
      "250gms Bhindi (Ladyfinger/Bendakaya)",
      "2 Large Onions (chopped)",
      "2-3 Green Chillies",
      "1 tbsp Ginger Garlic Paste",
      "1/2 tsp Turmeric Powder",
      "2 tsps Chilli Powder",
      "1 tsp Coriander Powder",
      "1/2 tsp Garam Masala",
      "Marble-sized Tamarind (soaked for juice)",
      "3 tbsps Oil",
      "Salt (to taste)",
      "Coriander leaves (for garnish)"
    ]
  },
  "transcription_telugu": [
    "[00:00:00.000] హలో ఫుడీస్, వెల్కమ్ టు విస్మయ్ ఫుడ్. ఇవాల్టి స్పెషల్ మాంచి సువాసనతో ఉండే బోటి బెండకాయ పులుసు లేదా బోటి చారు.",
    "[00:00:20.000] ముందుగా శుభ్రం చేసి ఉడికించి పెట్టుకున్న బోటిని సిద్ధం చేసుకోవాలి. ఒక కుక్కర్ లో నూనె వేసి ఉల్లిపాయ ముక్కలు, పచ్చిమిర్చి వేసి వేయించాలి.",
    "[00:00:45.000] ఉల్లిపాయలు వేగాక అల్లం వెల్లుల్లి పేస్ట్, పసుపు వేసి పచ్చి వాసన పోయే వరకు వేయించాలి.",
    "[00:01:00.000] ఇప్పుడు ఇందులో ఉడికించిన బోటి ముక్కలు వేసి 5 నిమిషాల పాటు నూనెలో మగ్గనివ్వాలి.",
    "[00:01:15.000] ఆ తర్వాత కారం, ఉప్పు, ధనియాల పొడి వేసి కలపాలి. ఇందులో తగినన్ని నీళ్లు పోసి 3-4 విజిల్స్ వచ్చే వరకు ఉడికించాలి.",
    "[00:01:40.000] కుక్కర్ మూత తీశాక, కట్ చేసిన బెండకాయ ముక్కలు మరియు చింతపండు పులుసు పోసి మరిగించాలి.",
    "[00:02:00.000] బెండకాయలు ఉడికిన తర్వాత గరం మసాలా, కొత్తిమీర వేసి దించుకోవాలి.",
    "[00:02:20.000] ఎంతో రుచికరమైన బోటి బెండకాయ పులుసు సిద్ధం. ఇది వేడి వేడి అన్నంలోకి చాలా బాగుంటుంది."
  ],
  "transcription_english": [
    "[00:00:00.000] Hello Foodies, welcome to Vismai Food. Today's special is the aromatic Boti Bhindi Pulusu (Boti Charu).",
    "[00:00:20.000] First, prepare cleaned and boiled boti. In a pressure cooker, heat oil and sauté onions and green chillies.",
    "[00:00:45.000] Once onions are fried, add ginger-garlic paste and turmeric; sauté until the raw smell disappears.",
    "[00:01:00.000] Now add the boiled boti pieces and let them fry in oil for 5 minutes.",
    "[00:01:15.000] Add chilli powder, salt, and coriander powder. Pour sufficient water and pressure cook for 3-4 whistles.",
    "[00:01:40.000] Open the lid, add chopped bhindi (ladyfinger) pieces and tamarind juice, then let it simmer.",
    "[00:02:00.000] Once the ladyfingers are cooked, add garam masala and coriander leaves; turn off the heat.",
    "[00:02:20.000] Delicious Boti Bhindi curry is ready. It pairs excellently with hot rice."
  ]
}