{
  "metadata": {
    "title": "మీ పాత పద్ధతలు అన్నీ వదిలేసి మా సీక్రెట్ కొలతలతో చేయండి. ఇక ఎప్పుడు ఇవే కావాలంటారు| Butter Muruku",
    "channel_name": "Vismai Food",
    "publish_date": "2020-01-12",
    "view_count": 238028,
    "like_count": 3741,
    "duration": "02:18",
    "language": "Telugu",
    "video_id": "L5sNj-XIPvY",
    "url": "https://www.youtube.com/watch?v=L5sNj-XIPvY",
    "description": "Butter Muruku is a crunchy, flavorful, and easy-to-make South Indian snack. This recipe by Vismai Food uses secret proportions for a perfect texture that's extra crispy and addictive.",
    "ingredients_detected": [
      "2 tbsps Urad Dal (1 hour soaked)",
      "2 tbsps Chana Dal (1 hour soaked)",
      "4-5 Green Chillies (adjust to taste)",
      "1 Cup Rice Flour",
      "1 tsp Cumin Seeds",
      "2 tsps Butter (or hot ghee/oil)",
      "Salt (to taste)",
      "Oil (for deep frying)",
      "Water (as needed)"
    ]
  },
  "transcription_telugu": [
    "[00:00:00.000] హలో ఫుడీస్, వెల్కమ్ టు విస్మయ్ ఫుడ్. ఇవాల్టి స్పెషల్ వెన్న మురుకులు. ఇది మా సీక్రెట్ రెసిపీ, చాలా కరకరలాడుతూ భలే ఉంటాయి.",
    "[00:00:29.000] ముందుగా జార్ లో 2 టేబుల్ స్పూన్ల గంట పాటు నానబెట్టిన మినప్పప్పు, 2 టేబుల్ స్పూన్ల నానబెట్టిన పచ్చి శనగపప్పు వేసుకోవాలి.",
    "[00:00:39.000] ఇందులో 4-5 పచ్చిమిర్చి వేసి, కొద్దిగా నీళ్లు పోసి మెత్తని పేస్ట్ లా గ్రైండ్ చేయాలి. అస్సలు బరక ఉండకూడదు.",
    "[00:00:48.000] ఒక బౌల్ లో కప్పు బియ్యం పిండి తీసుకుని అందులో ఉప్పు, టీస్పూన్ జీలకర్ర, 2 టీస్పూన్ల వెన్న వేసుకోవాలి. వెన్న లేకపోతే వేడి నూనె లేదా నెయ్యి వాడవచ్చు.",
    "[00:00:59.000] ఇప్పుడు గ్రైండ్ చేసిన పేస్ట్ వేసి బాగా కలపాలి. ఆ తర్వాత కొద్దికొద్దిగా నీళ్లు పోస్తూ పిండిని సెమీ-సాఫ్ట్ గా కలుపుకోవాలి.",
    "[00:01:20.000] నూనె రాసిన మురుకుల గిద్దలో స్టార్ ప్లేట్ పెట్టి, పిండి ముద్దను నింపాలి. దీన్ని సలసల కాగుతున్న నూనెలో ఒత్తుకోవాలి.",
    "[00:01:30.000] మీడియం టు హై ఫ్లేమ్ మీద ఎర్రగా వేయించి తీసుకోవాలి. పిండి మరీ గట్టిగా ఉంటే ముక్కలైపోతాయి, జారుగా ఉంటే నూనె లాగేస్తాయి.",
    "[00:01:50.000] నూనెలో బుడగలు తగ్గిపోయి కరకరలాడుతుంటే వేగినట్లు అర్థం. వీటిని పూర్తిగా చల్లార్చి డబ్బాలో భద్రపరుచుకోవాలి."
  ],
  "transcription_english": [
    "[00:00:00.000] Hello Foodies, welcome to Vismai Food. Today's special is Butter Muruku. This is our secret recipe, and they are extra crispy and delicious.",
    "[00:00:29.000] First, in a blender, add 2 tbsp of urad dal (soaked for 1 hour) and 2 tbsp of chana dal (soaked for 1 hour).",
    "[00:00:39.000] Add 4-5 green chillies and a little water, then grind into a super fine paste without any grit.",
    "[00:00:48.000] In a bowl, take 1 cup of rice flour and add salt, 1 tsp cumin, and 2 tsp butter. You can use hot oil or ghee instead of butter.",
    "[00:00:59.000] Add the ground paste and mix well. Then gradually add water to form a semi-soft dough.",
    "[00:01:20.000] Use a star-shaped plate in a greased mould and fill it with dough. Press the muruku directly into very hot oil.",
    "[00:01:30.000] Fry on medium to high flame until golden red. If the dough is too tight, they will break; if too loose, they will absorb oil.",
    "[00:01:50.000] When bubbles reduce and they become crispy, they are done. Cool them completely and store in a container."
  ]
}