{
  "metadata": {
    "title": "Misri Paramannam|పాలు పటికబెల్లం కలిపి చేసే అరుదైన ప్రసాదం!పటికబెల్లం పరమాన్నం|దీని ప్రయోజనాలు ఎన్నో",
    "channel_name": "Vismai Food",
    "publish_date": "2020-01-13",
    "view_count": 159932,
    "like_count": 3060,
    "duration": "02:25",
    "language": "Telugu",
    "video_id": "kY4ckXdu0z8",
    "url": "https://www.youtube.com/watch?v=kY4ckXdu0z8",
    "description": "Misri Paramannam (Rock Sugar Rice Pudding) is a rare and traditional prasadam offered in Vaishnava temples. It is especially beneficial for pregnant women, kids, and those with body heat issues.",
    "ingredients_detected": [
      "1/2 Cup Rice",
      "1.5 Cups Water",
      "2 Cups Milk",
      "1 Cup Crushed Misri (Rock Sugar/Patika Bellam)",
      "3-4 Cardamom Seeds",
      "1 tbsp Ghee",
      "2 tbsps Cashews",
      "Pinch of Edible Camphor (Pachha Karpooram) - Optional",
      "Pinch of Saffron - Optional"
    ]
  },
  "transcription_telugu": [
    "[00:00:00.000] హలో ఫుడీస్, వెల్కమ్ టు విస్మయ్ ఫుడ్. ఇవాల్టి స్పెషల్ పటిక బెల్లం పరమాన్నం. దీనినే మిస్రీ పరమాన్నం అని కూడా అంటారు.",
    "[00:00:41.000] ముందుగా అర కప్పు కడిగిన బియ్యం తీసుకుని దానికి ఒకటిన్నర కప్పుల నీళ్లు పోసి, కుక్కర్లో మూడు విజిల్స్ వచ్చే వరకు ఉడికించాలి.",
    "[00:01:03.000] ఇప్పుడు అర కప్పు బియ్యానికి రెండు కప్పుల పాలు పోసి ఒక పొంగు రానివ్వాలి. పాలు మరిగాక ఉడికించిన అన్నం వేసి మీడియం ఫ్లేమ్ లో 15 నిమిషాలు ఉడికించాలి.",
    "[00:01:23.000] పాలు ఇగిరిన తర్వాత ఒక కప్పు దంచిన పటిక బెల్లం వేసి బాగా కలుపుకోవాలి. బియ్యం తీసుకున్న కప్పుకి రెండింతల పటిక బెల్లం తీసుకోవాలి.",
    "[00:01:36.000] ఇందులో యాలకుల గింజలు, పచ్చ కర్పూరం లేదా కుంకుమ పువ్వు (నచ్చితే) వేసి కలుపుకోవాలి.",
    "[00:01:47.000] ఒక టేబుల్ స్పూన్ నెయ్యిలో జీడిపప్పు వేసి ఎర్రగా వేయించి పరమాన్నంలో కలుపుకోవాలి.",
    "[00:02:04.000] ఈ పరమాన్నం పసిపిల్లలకు, గర్భిణీలకు మరియు అతివేడితో బాధపడే వారికి చాలా మంచిది.",
    "[00:02:20.000] ఎంతో రుచికరమైన పటిక బెల్లం పరమాన్నం సిద్ధం."
  ],
  "transcription_english": [
    "[00:00:00.000] Hello Foodies, welcome to Vismai Food. Today's special is Patika Bellam Paramannam, also known as Misri Paramannam.",
    "[00:00:41.000] First, take half a cup of washed rice, add 1.5 cups of water, and pressure cook for three whistles.",
    "[00:01:03.000] Boil 2 cups of milk for every half cup of rice. Once it boils, add the cooked rice and cook on medium flame for 15 minutes.",
    "[00:01:23.000] When the milk reduces, add 1 cup of crushed rock sugar (Misri) and mix well. The ratio of rice to Misri should be 1:2.",
    "[00:01:36.000] Add cardamom seeds, and optionally, a pinch of edible camphor or saffron.",
    "[00:01:47.000] Fry cashews in 1 tbsp ghee until golden and mix into the pudding.",
    "[00:02:04.000] This pudding is very beneficial for toddlers, pregnant women, and those suffering from excessive body heat.",
    "[00:02:20.000] The delicious Misri Paramannam is now ready."
  ]
}