{
  "metadata": {
    "title": "Chanadal Pulav|పప్పు బియ్యం|సంక్రాంతికి త్వరగా అయిపోయే బెస్ట్ రైస్|అందరికి నచ్చే సింపుల్ బెస్ట్ రైస్",
    "channel_name": "Vismai Food",
    "publish_date": "2020-01-14",
    "view_count": 447576,
    "like_count": 6776,
    "duration": "03:09",
    "language": "Telugu",
    "video_id": "ikHQHy8OGaE",
    "url": "https://www.youtube.com/watch?v=ikHQHy8OGaE",
    "description": "Chanadal Pulav, also known as Pappu Biyyam or Ponni Biyyam, is a popular and quick rice dish made in Telangana during festivals like Sankranti. It pairs perfectly with non-veg curries or tomato chutney.",
    "ingredients_detected": [
      "1 Cup Rice",
      "1/4 Cup Chana Dal",
      "1/4 Cup Oil",
      "1 Inch Cinnamon",
      "5 Cloves",
      "5 Cardamom",
      "2 Bay Leaves",
      "5 Green Chillies",
      "2 Sprigs Curry Leaves",
      "1 tsp Ginger Garlic Paste",
      "1 Large Potato",
      "1 Carrot",
      "1 Tomato",
      "1/4 tsp Turmeric",
      "Small Bunch Mint",
      "1 Bunch Coriander",
      "Salt (to taste)",
      "2 Cups Water"
    ]
  },
  "transcription_telugu": [
    "[00:00:00.000] హలో ఫుడీస్, వెల్కమ్ టు విస్మయ్ ఫుడ్. ఇవాల్టి స్పెషల్ సంక్రాంతి స్పెషల్ పప్పు బియ్యం.",
    "[00:00:30.000] ఒక బౌల్ లో ఒక కప్పు బియ్యం, పావు కప్పు పచ్చి శనగపప్పు వేసి కడిగి 10 నిమిషాలు నానబెట్టండి.",
    "[00:00:45.000] కుక్కర్ లో నూనె వేసి దాల్చిన చెక్క, లవంగాలు, యాలకులు, బిర్యానీ ఆకులు వేసి వేయించండి.",
    "[00:00:55.000] ఇందులో పచ్చిమిర్చి, కరివేపాకు, అల్లం వెల్లుల్లి పేస్ట్ వేసి వేయించాలి.",
    "[00:01:15.000] ఆ తర్వాత బంగాళదుంప, క్యారెట్, టమాటో ముక్కలు వేసి 2 నిమిషాలు వేయించాలి.",
    "[00:01:30.000] పసుపు, ఉప్పు వేసి టమాటోలు మెత్తబడే వరకు మగ్గించాలి.",
    "[00:01:40.000] ఇప్పుడు పుదీనా, కొత్తిమీర తురుము వేసి కలపాలి.",
    "[00:01:52.000] నానబెట్టిన బియ్యం, పప్పు వేసి నీరు ఇగిరిపోయే వరకు 2 నిమిషాలు వేయించాలి.",
    "[00:02:03.000] ఇందులో 2 కప్పుల నీళ్లు పోసి, కుక్కర్ మూత పెట్టి హై ఫ్లేమ్ మీద 2 విజిల్స్ రానివ్వాలి. 20 నిమిషాల తర్వాత మూత తీయాలి.",
    "[00:02:20.000] ఎంతో రుచికరమైన పప్పు బియ్యం సిద్ధం. ఇది టమాటో పచ్చడితో చాలా బాగుంటుంది."
  ],
  "transcription_english": [
    "[00:00:00.000] Hello Foodies, welcome to Vismai Food. Today's special is the Sankranti special Pappu Biyyam (Chana Dal Pulav).",
    "[00:00:30.000] In a bowl, take 1 cup of rice and 1/4 cup of chana dal, wash them well, and soak for 10 minutes.",
    "[00:00:45.000] In a pressure cooker, heat oil and roast cinnamon, cloves, cardamom, and bay leaves.",
    "[00:00:55.000] Add green chillies, curry leaves, and ginger-garlic paste and sauté.",
    "[00:01:15.000] Add potato, carrot, and tomato pieces and sauté for 2 minutes.",
    "[00:01:30.000] Add turmeric and salt, then sauté until the tomatoes turn soft.",
    "[00:01:40.000] Now add chopped mint and coriander leaves and mix well.",
    "[00:01:52.000] Add the soaked rice and dal, then sauté for 2 minutes until the water evaporates.",
    "[00:02:03.000] Pour in 2 cups of water, cover the lid, and cook for 2 whistles on high flame. Let it rest for 20 minutes before opening.",
    "[00:02:20.000] The delicious Pappu Biyyam is ready. It pairs perfectly with tomato chutney."
  ]
}