{
  "metadata": {
    "title": "InstantRAVA ADAI|Crispy Crunchy Tamilnadu Special Breakfast|రవ్వ అడై|30 నిమిషాల్లో తయారయ్యే టిఫిన్",
    "channel_name": "Vismai Food",
    "publish_date": "2020-01-17",
    "view_count": 651899,
    "like_count": 8781,
    "duration": "02:43",
    "language": "Telugu",
    "video_id": "yQ8gvnjUNTc",
    "url": "https://www.youtube.com/watch?v=yQ8gvnjUNTc",
    "description": "Rava Adai is a quick and delicious South Indian breakfast dish. Unlike traditional Adai which requires soaking and grinding, this instant version can be prepared in just 30 minutes, making it a perfect alternative to regular Idli and Dosa.",
    "ingredients_detected": [
      "1 Cup Bombay Rava (Semolina/Suji)",
      "2 tbsps Rice Flour",
      "1/2 Cup Sour Curd (or fresh curd)",
      "1/2 Cup Water (+ extra for batter adjustment)",
      "2 tbsps Fresh Coconut (grated)",
      "2 Green Chillies (finely chopped)",
      "1 Sprig Curry Leaves (chopped)",
      "1 tbsp Coriander Leaves (chopped)",
      "2 tbsps Onion (finely chopped)",
      "2 tbsps Carrot (grated)",
      "Salt (to taste)",
      "Oil (for frying)"
    ]
  },
  "transcription_telugu": [
    "[00:00:00.000] హలో ఫుడీస్, వెల్కమ్ టు విస్మయ్ ఫుడ్. ఇవాల్టి స్పెషల్ తమిళనాడు స్పెషల్ రవ్వ అడై.",
    "[00:00:36.000] ముందుగా ఒక కప్పు బొంబాయి రవ్వను మీడియం ఫ్లేమ్ మీద లైట్ గోల్డెన్ బ్రౌన్ కలర్ వచ్చే వరకు వేయించి పూర్తిగా చల్లారనివ్వాలి.",
    "[00:00:48.000] ఒక బౌల్ లో వేయించిన రవ్వ, 2 టేబుల్ స్పూన్ల బియ్యం పిండి, ఉప్పు, అర కప్పు పుల్లటి పెరుగు వేసుకోవాలి.",
    "[00:01:04.000] ఇందులో అర కప్పు నీళ్లు పోసి బాగా కలిపి 30 నిమిషాల పాటు నానబెట్టాలి.",
    "[00:01:13.000] 30 నిమిషాల తర్వాత పిండి గట్టిగా ఉంటుంది. ఇప్పుడు ఇందులో పచ్చి కొబ్బరి, పచ్చిమిర్చి, కరివేపాకు, కొత్తిమీర, ఉల్లిపాయ ముక్కలు, క్యారెట్ తురుము వేసి కలపాలి.",
    "[00:01:30.000] కొద్దిగా నీళ్లు పోసి పిండిని కాస్త గట్టిగా (సెమీ-థిక్) కలుపుకోవాలి. పిండి జారైతే అడైలు విరిగిపోతాయి.",
    "[00:01:42.000] పెనం మీద నూనె వేసి వేడయ్యాక, పిండిని ఊతప్పంలా కాస్త మందంగా వేసి మీడియం ఫ్లేమ్ మీద కాల్చాలి.",
    "[00:02:11.000] ఒకవైపు ఎర్రగా కాలాక రెండో వైపు తిప్పి మరో రెండు నిమిషాలు కాల్చుకోవాలి.",
    "[00:02:22.000] వేడి వేడి రవ్వ అడై టమాటో చట్నీ లేదా వేరుశనగ చట్నీతో తింటే చాలా బాగుంటుంది."
  ],
  "transcription_english": [
    "[00:00:00.000] Hello Foodies, welcome to Vismai Food. Today's special is the Tamil Nadu special Rava Adai.",
    "[00:00:36.000] First, roast one cup of Bombay Rava on medium flame until light golden brown and let it cool completely.",
    "[00:00:48.000] In a bowl, take the roasted rava, add 2 tbsp rice flour, salt, and half a cup of sour curd.",
    "[00:01:04.000] Add half a cup of water, mix well, and let it soak for 30 minutes.",
    "[00:01:13.000] After 30 minutes, the dough will be tight. Now add fresh coconut, green chillies, curry leaves, coriander, onion pieces, and grated carrot.",
    "[00:01:30.000] Add a little water to maintain a semi-thick consistency. If the batter is too thin, the adai might break.",
    "[00:01:42.000] Heat a pan with oil, spread the batter slightly thick like an uthappam, and roast on medium flame.",
    "[00:02:11.000] Once one side is golden red, flip it and roast the other side for another two minutes.",
    "[00:02:22.000] Serve the hot Rava Adai with tomato chutney or peanut chutney for the best taste."
  ]
}