{
  "metadata": {
    "title": "SharavanaBhavan RAVA KESARI|మీ కొలతలు వదిలేసిఈ కొలతలతో చేస్తే రియల్ రవ్వ కేసరి అంటే ఏంటో తెలుస్తుంది",
    "channel_name": "Vismai Food",
    "publish_date": "2020-01-20",
    "view_count": 4539480,
    "like_count": 49728,
    "duration": "02:45",
    "language": "Telugu",
    "video_id": "fMvCRVvdQd0",
    "url": "https://www.youtube.com/watch?v=fMvCRVvdQd0",
    "description": "Learn how to make the authentic Saravana Bhavan style Rava Kesari with precise measurements and secret tips from Vismai Food. This recipe ensures a perfect, non-sticky texture every time.",
    "ingredients_detected": [
      "1 Cup Semolina/Bombay Ravva",
      "1.5 Cups Sugar",
      "1 Cup Ghee (or 3/4 cup for slightly less rich version)",
      "3 Cups Hot Water",
      "2 tbsps Cashews",
      "2 tbsps Raisins",
      "1 tsp Cardamom Powder",
      "1 pinch Yellow Food Color",
      "Pinch of Edible Camphor (for Prasadam style)"
    ]
  },
  "transcription_telugu": [
    "[00:00:00.000] హలో ఫుడీస్, వెల్కమ్ టు విస్మయ్ ఫుడ్. ఇవాల్టి స్పెషల్ చెన్నై శరవణ భవన్ స్పెషల్ రవ్వ కేసరి.",
    "[00:00:30.000] ముందుగా పాన్ లో అర కప్పు నెయ్యి కరిగించి, అందులో జీడిపప్పు, ఎండు ద్రాక్ష వేసి వెంటనే ఒక కప్పు బొంబాయి రవ్వ వేయాలి.",
    "[00:00:43.000] రవ్వను లో ఫ్లేమ్ మీద గోల్డెన్ బ్రౌన్ కలర్ వచ్చే వరకు ఓపికగా వేయించాలి. ఇలా వేపితేనే కేసరి చల్లారాక కూడా రుచిగా ఉంటుంది.",
    "[00:01:09.000] రవ్వ బాగా వేగాక అందులో మూడు కప్పుల వేడి నీళ్లు పోయాలి. వేడి నీళ్లు పోస్తేనే రవ్వ సాఫ్ట్ గా ఉడుకుతుంది.",
    "[00:01:21.000] కొలతలు గుర్తుంచుకోండి: 1 కప్పు రవ్వకి 1.5 కప్పుల పంచదార, 1 కప్పు నెయ్యి, 3 కప్పుల నీళ్లు.",
    "[00:01:35.000] రవ్వ ముద్దగా ఉడికిన తర్వాత 1.5 కప్పుల పంచదార వేసి బాగా కలపాలి.",
    "[00:01:48.000] పంచదార కరిగాక కొద్దిగా నీళ్లలో కలిపిన ఎల్లో ఫుడ్ కలర్ మరియు ఒక టీస్పూన్ యాలకుల పొడి వేయాలి.",
    "[00:02:03.000] చివరగా మిగిలిన పావు కప్పు నెయ్యి వేసి నెయ్యి పైకి తేలే వరకు లో ఫ్లేమ్ మీద కలుపుతూ ఉడికించాలి.",
    "[00:02:15.000] ప్రసాదంగా చేసే వారు చిటికెడు పచ్చ కర్పూరం వేసి దించుకోవాలి. ఎంతో రుచికరమైన రవ్వ కేసరి సిద్ధం."
  ],
  "transcription_english": [
    "[00:00:00.000] Hello Foodies, welcome to Vismai Food. Today's special is the Chennai Saravana Bhavan special Rava Kesari.",
    "[00:00:30.000] First, melt 1/2 cup of ghee in a pan. Add cashews and raisins, then immediately add 1 cup of Bombay Ravva.",
    "[00:00:43.000] Patiently roast the ravva on low flame until it turns golden brown. This ensures the kesari stays tasty even after cooling.",
    "[00:01:09.000] Once roasted, pour in 3 cups of hot water. Using hot water makes the ravva cook softly.",
    "[00:01:21.000] Remember the ratios: 1 cup ravva, 1.5 cups sugar, 1 cup ghee, and 3 cups water.",
    "[00:01:35.000] After the ravva is cooked thick, add 1.5 cups of sugar and mix well.",
    "[00:01:48.000] Once the sugar dissolves, add a pinch of yellow food color (mixed in water) and 1 tsp of cardamom powder.",
    "[00:02:03.000] Finally, add the remaining 1/4 cup of ghee and cook on low flame until the ghee floats on top.",
    "[00:02:15.000] If making it as an offering (Prasadam), add a pinch of edible camphor. The delicious Rava Kesari is ready."
  ]
}