{
  "metadata": {
    "title": "CHICKEN MIRCHI MASALA|Must try ChickenMasala |చికెన్ మిర్చి మసాలా|కారం గా చికెన్ తినాలంటే ఇది బెస్ట్",
    "channel_name": "Vismai Food",
    "publish_date": "2020-01-26",
    "view_count": 247235,
    "like_count": 5788,
    "duration": "02:53",
    "language": "Telugu",
    "video_id": "iBGZ5rMB4PY",
    "url": "https://www.youtube.com/watch?v=iBGZ5rMB4PY",
    "description": "Chicken Mirchi Masala is a spicy and flavorful chicken curry that features fried green chillies as a key ingredient. It is a perfect dish for those who enjoy a spicy kick and pairs well with rice, roti, or pulav.",
    "ingredients_detected": [
      "500gms Chicken (soaked in salt water)",
      "6-8 Bajji Mirchi (large green chillies)",
      "2 Large Onions (finely chopped)",
      "1 tbsp Ginger-Garlic Paste",
      "1.5 tbsps Chilli Powder",
      "1/2 tsp Black Pepper Powder",
      "1 tsp Garam Masala",
      "1 tsp Roasted Cumin Powder",
      "1 tbsp Coriander Powder",
      "2 Large Tomatoes (pureed)",
      "1/4 Cup Oil",
      "Salt (to taste)",
      "Coriander leaves (chopped)",
      "1 tsp Cumin Seeds"
    ]
  },
  "transcription_telugu": [
    "[00:00:00.000] హలో ఫుడీస్, వెల్కమ్ టు విస్మయ్ ఫుడ్. ఇవాల్టి స్పెషల్ స్పైసీ చికెన్ మిర్చి మసాలా. కారంగా తినాలనుకునే వారికి ఇది బెస్ట్ చాయిస్.",
    "[00:00:25.000] ముందుగా పాన్ లో నూనె వేసి బజ్జీ మిర్చిని గాట్లు పెట్టి వేయించాలి. ఇవి మెత్తబడే వరకు వేయించి పక్కన పెట్టుకోవాలి.",
    "[00:00:47.000] అదే నూనెలో జీలకర్ర, ఉల్లిపాయ ముక్కలు వేసి గోల్డెన్ బ్రౌన్ కలర్ వచ్చే వరకు వేయించాలి.",
    "[00:01:06.000] ఉల్లిపాయలు వేగాక అల్లం వెల్లుల్లి పేస్ట్, ఉప్పు, కారం, మిరియాల పొడి, గరం మసాలా, జీలకర్ర పొడి, ధనియాల పొడి వేసి నూనె తేలే వరకు వేయించాలి.",
    "[00:01:23.000] ఇప్పుడు ఉప్పు నీళ్లలో నానబెట్టిన చికెన్ ముక్కలు వేసి మసాలా పట్టేలా 5 నిమిషాలు వేయించాలి.",
    "[00:01:36.000] ఇందులో టమాటో ప్యూరీ వేసి పచ్చి వాసన పోయే వరకు ఉడికించాలి. ఆ తర్వాత తగినన్ని నీళ్లు పోసి చికెన్ ని మెత్తగా ఉడికించాలి.",
    "[00:02:07.000] చికెన్ ఉడికాక ముందుగా వేయించిన మిర్చిని వేసి లో ఫ్లేమ్ మీద 5 నిమిషాలు మగ్గనివ్వాలి.",
    "[00:02:18.000] చివరగా కొత్తిమీర చల్లి దించుకోవాలి. ఎంతో స్పైసీ చికెన్ మిర్చి మసాలా సిద్ధం."
  ],
  "transcription_english": [
    "[00:00:00.000] Hello Foodies, welcome to Vismai Food. Today's special is the spicy Chicken Mirchi Masala, perfect for those who love heat.",
    "[00:00:25.000] First, heat oil in a pan and fry slit bajji mirchis until they are soft. Remove and set them aside.",
    "[00:00:47.000] In the same oil, add cumin seeds and finely chopped onions; fry until they turn golden brown.",
    "[00:01:06.000] Add ginger-garlic paste, salt, chilli powder, black pepper powder, garam masala, cumin powder, and coriander powder. Sauté until oil separates.",
    "[00:01:23.000] Add chicken pieces (soaked in salt water) and fry for 5 minutes until the masala coats the chicken.",
    "[00:01:36.000] Add tomato puree and cook until the raw smell is gone. Then pour water and cook the chicken until tender.",
    "[00:02:07.000] Once the chicken is cooked, add the fried chillies back and simmer on low flame for 5 minutes.",
    "[00:02:18.000] Garnish with coriander leaves and turn off the heat. Spicy Chicken Mirchi Masala is ready."
  ]
}