{
  "metadata": {
    "title": "Tomato Sesame Chutney|Best Chutney For Rice, Idli & Dosa|| Tomato nuvvula pacchadi| vismai food",
    "channel_name": "Vismai Food",
    "publish_date": "2020-01-27",
    "view_count": 680729,
    "like_count": 9734,
    "duration": "02:36",
    "language": "Telugu",
    "video_id": "6-DK-pqiKA4",
    "url": "https://www.youtube.com/watch?v=6-DK-pqiKA4",
    "description": "Tomato Sesame Chutney is a popular South Indian side dish, particularly in Telangana. It is savory and slightly nutty, making it an excellent pairing for ghee rice, idli, dosa, and vada. It can be stored for up to 3-4 days in winters.",
    "ingredients_detected": [
      "1/4 tsp Fenugreek Seeds (Menthulu)",
      "1 tbsp Coriander Seeds (Dhaniyalu)",
      "1 tsp Cumin Seeds (Jeelakarra)",
      "2 tbsps Sesame Seeds (Nuvvulu)",
      "3 tbsps Oil",
      "6-7 Green Chillies (adjust to taste)",
      "500gms Ripe Tomatoes (chopped)",
      "Tamarind (optional, based on tomato sourness)",
      "1/2 tsp Turmeric (Pasupu)",
      "4 Garlic Pods (Vellulli)",
      "Salt (to taste)",
      "For Tempering: 1 tbsp Oil, 1/2 tsp Mustard Seeds, 1/2 tsp Cumin, 1 Sprig Curry Leaves"
    ]
  },
  "transcription_telugu": [
    "[00:00:25.000] ముందుగా పాన్ లో పావు చెంచా మెంతులు వేసి ఎర్రగా వేయించాలి. మెంతులు బాగా వేగితేనే రుచిగా ఉంటాయి.",
    "[00:00:33.000] మెంతులు వేగిన తర్వాత ఒక టేబుల్ స్పూన్ ధనియాలు, ఒక టీస్పూన్ జీలకర్ర వేసి వేయించుకోవాలి.",
    "[00:00:43.000] ధనియాలు వేగిన తర్వాత రెండు టేబుల్ స్పూన్ల నువ్వులు వేసి చిటపటలాడే వరకు వేయించి మిక్సీ జార్ లో వేసి పొడి చేసుకోవాలి.",
    "[00:00:55.000] అదే పాన్ లో మూడు టేబుల్ స్పూన్ల నూనె వేడి చేసి పచ్చని పచ్చిమిర్చి వేసి మగ్గనివ్వాలి.",
    "[00:01:04.000] పచ్చిమిర్చి మగ్గాక అర కిలో టమాటో ముక్కలు, పసుపు వేసి మెత్తగా ఉడికించుకోవాలి. అవసరమైతే కొంచెం చింతపండు వేసుకోవచ్చు.",
    "[00:01:52.000] ఉడికించిన టమాటో మిశ్రమాన్ని నువ్వుల పొడి ఉన్న జార్ లో వేసి వెల్లుల్లి రెబ్బలు, ఉప్పు వేసి నీళ్లు పోయకుండా మెత్తగా గ్రైండ్ చేయాలి.",
    "[00:02:01.000] ఒక టేబుల్ స్పూన్ నూనెలో ఆవాలు, జీలకర్ర, కరివేపాకు వేసి తాలింపు పెట్టుకుని పచ్చడిలో కలుపుకోవాలి.",
    "[00:02:20.000] ఈ పచ్చడి నెయ్యి అన్నం, ఇడ్లీ, దోశ మరియు వడల్లోకి చాలా రుచిగా ఉంటుంది."
  ],
  "transcription_english": [
    "[00:00:25.000] First, roast 1/4 tsp fenugreek seeds in a pan until golden. Proper roasting is key to avoiding bitterness.",
    "[00:00:33.000] Once the fenugreek is roasted, add 1 tbsp coriander seeds and 1 tsp cumin seeds and sauté.",
    "[00:00:43.000] Add 2 tbsp sesame seeds and roast until they splutter. Then, transfer to a blender and grind into a fine powder.",
    "[00:00:55.000] In the same pan, heat 3 tbsp oil and sauté green chillies until they soften.",
    "[00:01:04.000] Add 500g ripe tomatoes and turmeric. Cook until the tomatoes are soft. Add a bit of tamarind if the tomatoes aren't sour enough.",
    "[00:01:52.000] Add the cooked tomato mixture to the sesame powder, along with garlic pods and salt. Grind into a fine paste without adding water.",
    "[00:02:01.000] Prepare a tempering with 1 tbsp oil, mustard seeds, cumin, and curry leaves. Add this to the chutney.",
    "[00:02:20.000] This chutney goes perfectly with ghee rice, idli, dosa, and vada."
  ]
}