{
  "metadata": {
    "title": "BEETROOT PURI|Fluffy Beetroot Puri|బీట్రూట్ పూరి",
    "channel_name": "Vismai Food",
    "publish_date": "2020-01-28",
    "view_count": 171327,
    "like_count": 3466,
    "duration": "01:59",
    "language": "Telugu",
    "video_id": "C5SzryPfnSE",
    "url": "https://www.youtube.com/watch?v=C5SzryPfnSE",
    "description": "Beetroot Puri is a healthy and vibrant twist on traditional puris. Packed with the goodness of beetroots, it's a great way to include vegetables in your breakfast. These puris are fluffy, delicious, and kids will love their bright color.",
    "ingredients_detected": [
      "3/4 Cup Beetroot (peeled and cubed)",
      "1 tsp Fennel Seeds (Saunf)",
      "1 tsp Ginger (chopped)",
      "1 Green Chilli (optional)",
      "1 Cup Wheat Flour (Atta)",
      "1 tsp Semolina (Bombay Rava)",
      "Salt (to taste)",
      "Oil (for deep frying)",
      "Water (as needed)"
    ]
  },
  "transcription_telugu": [
    "[00:00:00.000] హలో ఫుడీస్, వెల్కమ్ టు విస్మయ్ ఫుడ్. ఇవాల్టి స్పెషల్ హెల్తీ బీట్రూట్ పూరి. రెగ్యులర్ పూరీ కంటే భిన్నంగా, హెల్తీగా ఉంటుంది.",
    "[00:00:22.000] ముందుగా మిక్సీ జార్ లో ముప్పావు కప్పు చెక్కు తీసిన బీట్రూట్ ముక్కలు వేసుకోవాలి.",
    "[00:00:27.000] ఇందులో ఒక టీస్పూన్ సోంపు, ఒక టీస్పూన్ అల్లం తరుగు వేసి మెత్తని పేస్ట్ లా గ్రైండ్ చేయాలి. అవసరమైతే పచ్చిమిర్చి కూడా వేయవచ్చు.",
    "[00:00:40.000] ఒక బౌల్ లో ఒక కప్పు గోధుమ పిండి, ఉప్పు, ఒక టీస్పూన్ బొంబాయి రవ్వ వేసుకోవాలి.",
    "[00:00:47.000] ఇప్పుడు బీట్రూట్ పేస్ట్ వేసి బాగా కలపాలి. కొద్దికొద్దిగా నీళ్లు పోస్తూ పూరీ పిండిలా కలుపుకోవాలి. మరీ ఎక్కువ సేపు కలపనక్కర్లేదు.",
    "[00:01:04.000] పిండిని సమానమైన ఉండలుగా చేసి, నూనె రాసి నిదానంగా పూరీల్లా ఒత్తుకోవాలి.",
    "[00:01:21.000] బాగా వేడెక్కిన నూనెలో పూరీలను వేసి హై ఫ్లేమ్ మీద వేయించాలి. ఇలా చేస్తేనే పూరీలు బాగా పొంగుతాయి.",
    "[00:01:40.000] ఎంతో అందంగా, రుచిగా ఉండే బీట్రూట్ పూరీలు సిద్ధం. ఇవి ఆలూ కుర్మా లేదా రైతాతో చాలా బాగుంటాయి."
  ],
  "transcription_english": [
    "[00:00:00.000] Hello Foodies, welcome to Vismai Food. Today's special is healthy Beetroot Puri. It's a healthy twist to the regular puri.",
    "[00:00:22.000] First, add 3/4 cup of peeled and cubed beetroot to a blender.",
    "[00:00:27.000] Add 1 tsp fennel seeds and 1 tsp chopped ginger; grind into a smooth paste. You can add a green chilli if you like.",
    "[00:00:40.000] In a bowl, take 1 cup of wheat flour, salt, and 1 tsp of semolina (bombay rava).",
    "[00:00:47.000] Add the beetroot paste and mix well. Gradually add water to knead into a puri dough. No need to knead for too long.",
    "[00:01:04.000] Divide the dough into equal balls, grease with oil, and gently roll them into discs.",
    "[00:01:21.000] Fry the puris in piping hot oil on high flame. This is essential for them to fluff up perfectly.",
    "[00:01:40.000] Beautiful and tasty Beetroot Puris are ready. They pair well with aloo kurma or raitha."
  ]
}