{
  "metadata": {
    "title": "Peanut Curry | పల్లీల కూర | ఇంట్లో కూరగాయలే లేనప్పుడు ఘుమఘుమ లాడే వేరుసేనక్కాయల కూర | Palli Sabji",
    "channel_name": "Vismai Food",
    "publish_date": "2018-12-03",
    "view_count": 397036,
    "like_count": 5720,
    "duration": "02:20",
    "language": "Telugu",
    "video_id": "WLkjCPvYYhA",
    "url": "https://www.youtube.com/watch?v=WLkjCPvYYhA",
    "description": "Flavorful and protein-rich Peanut Curry (Palli Sabji) recipe by Vismai Food, an excellent alternative when you run out of vegetables.",
    "ingredients_detected": [
      "1 Cup Raw Peanuts (soaked for 4-6 hours)",
      "1/2 Cup Fresh Coconut pieces",
      "1 tsp Poppy seeds (optional)",
      "2-3 tbsps Oil",
      "1 tsp Mustard seeds",
      "1 tsp Cumin seeds",
      "2 Dry Red chillies",
      "2 Sprigs Curry leaves",
      "2 Large Onions (chopped)",
      "2 tsps Ginger garlic paste",
      "1/2 tsp Turmeric powder",
      "2 tsps Chilli powder",
      "1 tsp Coriander powder",
      "1/2 tsp Garam masala",
      "Salt (to taste)",
      "Coriander leaves (for garnish)"
    ]
  },
  "transcription_telugu": [
    "[00:00:00.000] హలో ఫుడీస్, వెల్కమ్ టు విస్మయ్ ఫుడ్. ఇంట్లో కూరగాయలు లేనప్పుడు అద్భుతంగా పనికొచ్చే రెసిపీ పల్లీల కూర.",
    "[00:00:12.000] ఇది చాలా రుచిగా, కమ్మగా ఉంటుంది. అన్నం లేదా చపాతీల్లోకి చాలా బాగుంటుంది.",
    "[00:00:20.000] ముందుగా ఒక కప్పు పల్లీలను 4-6 గంటల పాటు నానబెట్టుకోవాలి.",
    "[00:00:30.000] మిక్సీ జార్ లో పచ్చి కొబ్బరి ముక్కలు, గసగసాలు వేసి మెత్తగా పేస్ట్ చేసి పక్కన పెట్టుకోండి.",
    "[00:00:45.000] కుక్కర్ లో లేదా బాణలిలో నూనె వేడి చేసి ఆవాలు, జీలకర్ర, ఎండుమిర్చి, కరివేపాకు వేసి వేయించండి.",
    "[00:01:00.000] ఉల్లిపాయ ముక్కలు వేసి గోల్డెన్ బ్రౌన్ కలర్ వచ్చే వరకు వేపుకోవాలి.",
    "[00:01:15.000] ఇందులో అల్లం వెల్లుల్లి పేస్ట్, పసుపు, ఉప్పు వేసి పచ్చి వాసన పోయే వరకు వేయించండి.",
    "[00:01:25.000] ఇప్పుడు కారం, ధనియాల పొడి, కొబ్బరి పేస్ట్ వేసి నూనె పైకి తేలే వరకు వేపుకోవాలి.",
    "[00:01:40.000] నానబెట్టిన పల్లీలను వేసి బాగా కలిపి, తగినన్ని నీళ్లు పోయాలి.",
    "[00:01:50.000] కుక్కర్ అయితే 3 విజిల్స్ వచ్చే వరకు ఉడికించాలి. సాధారణ గిన్నెలో అయితే పల్లీలు మెత్తబడే వరకు ఉడికించాలి.",
    "[00:02:05.000] చివరగా గరం మసాలా, కొత్తిమీర తరుగు వేసి కలిపి దింపేయాలి. కమ్మటి పల్లీల కూర రెడీ!"
  ],
  "transcription_english": [
    "[00:00:00.000] Hello Foodies, welcome to Vismai Food. Peanut Curry is a perfect recipe when you don't have vegetables at home.",
    "[00:00:12.000] It is very tasty and creamy. It pairs exceptionally well with rice or chapati.",
    "[00:00:20.000] First, soak 1 cup of raw peanuts for 4-6 hours.",
    "[00:00:30.000] In a mixer jar, add fresh coconut pieces and poppy seeds; grind into a smooth paste and set aside.",
    "[00:00:45.000] Heat oil in a pressure cooker or pan; add mustard seeds, cumin, red chillies, and curry leaves.",
    "[00:01:00.000] Add chopped onions and sauté until they turn golden brown.",
    "[00:01:15.000] Add ginger garlic paste, turmeric, and salt; sauté until the raw smell disappears.",
    "[00:01:25.000] Now add chilli powder, coriander powder, and the coconut paste; fry until the oil separates.",
    "[00:01:40.000] Add the soaked peanuts, mix well, and pour in sufficient water.",
    "[00:01:50.000] Pressure cook for 3 whistles or cook in a pan until the peanuts are tender.",
    "[00:02:05.000] Finally, add garam masala and freshly chopped coriander leaves. Delicious Peanut Curry is ready!"
  ]
}