{
  "metadata": {
    "title": "PANEER 65|Best Hyderabad'sSpecial Starter|పనీర్ 65|అందరికి ఎంతో ఇష్టమైన బెస్ట్ స్నాక్ ఈసీగా ఇంట్లోనే",
    "channel_name": "Vismai Food",
    "publish_date": "2020-01-30",
    "view_count": 881122,
    "like_count": 11849,
    "duration": "02:49",
    "language": "Telugu",
    "video_id": "JGyX3Fi-Ul4",
    "url": "https://www.youtube.com/watch?v=JGyX3Fi-Ul4",
    "description": "Paneer 65 is a popular Hyderabadi snack and starter. It's crispy on the outside, soft on the inside, and packed with spicy flavors. Perfect for parties or as a tea-time snack.",
    "ingredients_detected": [
      "300gms Paneer Cubes (soaked in warm water)",
      "1/4 Cup Corn Flour",
      "2 tbsps Maida",
      "3 tbsps Oil",
      "4-5 Garlic (chopped)",
      "2 Dry Chillies",
      "2 Green Chillies (chopped)",
      "2 tbsps Onion (chopped)",
      "2 Sprigs Curry Leaves",
      "3/4 tsp Coriander Powder",
      "1 tsp Chilli Powder",
      "1/2 tsp Cumin Powder (roasted)",
      "1/2 tsp Garam Masala",
      "1/2 Cup Whisked Curd",
      "4-5 drops Red Food Color",
      "Salt (to taste)",
      "Coriander (chopped)"
    ]
  },
  "transcription_telugu": [
    "[00:00:00.000] హలో ఫుడీస్, వెల్కమ్ టు విస్మయ్ ఫుడ్. ఇవాల్టి స్పెషల్ రెస్టారెంట్ స్టైల్ పనీర్ 65.",
    "[00:00:21.000] ముందుగా 300 గ్రాముల పనీర్ ని 10 నిమిషాల పాటు గోరువెచ్చని నీళ్లలో నానబెట్టి క్యూబ్స్ లా కట్ చేయాలి.",
    "[00:00:28.000] ఇందులో పావు కప్పు కార్న్ ఫ్లోర్, 2 టేబుల్ స్పూన్ల మైదా, ఉప్పు వేసి పనీర్ కి కోట్ చేయాలి. కొద్దిగా నీళ్లు చల్లి పిండి బాగా పట్టించాలి.",
    "[00:00:43.000] వేడి నూనెలో పనీర్ ముక్కలు వేసి గోల్డెన్ బ్రౌన్ కలర్ వచ్చే వరకు క్రిస్పీగా వేయించి పక్కన పెట్టుకోవాలి.",
    "[00:01:02.000] మరో పాన్ లో 3 టేబుల్ స్పూన్ల నూనె వేసి వెల్లుల్లి, ఎండుమిర్చి, పచ్చిమిర్చి వేసి వేయించాలి.",
    "[00:01:16.000] ఇందులో ఉల్లిపాయ ముక్కలు, కరివేపాకు వేసి మగ్గనివ్వాలి.",
    "[00:01:28.000] ఉల్లిపాయలు మగ్గాక ధనియాల పొడి, కారం, ఉప్పు, జీలకర్ర పొడి, గరం మసాలా వేసి వేయించి స్టవ్ ఆపేయాలి.",
    "[00:01:40.000] ఇప్పుడు అర కప్పు పెరుగు, రెడ్ ఫుడ్ కలర్ వేసి బాగా కలపాలి. ఆ తర్వాత స్టవ్ ఆన్ చేసి పెరుగులోని నీరు ఎగిరిపోయే వరకు ఉడికించాలి.",
    "[00:01:53.000] పెరుగు ఉడికాక వేయించిన పనీర్ ముక్కలు, కొత్తిమీర వేసి హై ఫ్లేమ్ మీద టాస్ చేయాలి.",
    "[00:02:08.000] పనీర్ మరీ మెత్తబడకుండా జాగ్రత్తగా టాస్ చేసి దించుకోవాలి. ఎంతో రుచికరమైన పనీర్ 65 సిద్ధం."
  ],
  "transcription_english": [
    "[00:00:00.000] Hello Foodies, welcome to Vismai Food. Today's special is Restaurant style Paneer 65.",
    "[00:00:21.000] First, soak 300g of paneer in lukewarm water for 10 minutes and cut into cubes.",
    "[00:00:28.000] Add 1/4 cup corn flour, 2 tbsp maida, and salt to coat the paneer. Sprinkle a little water for a better coating.",
    "[00:00:43.000] Fry the paneer cubes in hot oil on medium flame until golden brown and crispy, then set aside.",
    "[00:01:02.000] In another pan, heat 3 tbsp oil and sauté garlic, dry chillies, and green chillies.",
    "[00:01:16.000] Add chopped onions and curry leaves; sauté until soft.",
    "[00:01:28.000] Add coriander powder, chilli powder, salt, cumin powder, and garam masala. Sauté well and turn off the flame.",
    "[00:01:40.000] Add 1/2 cup whisked curd and red food color; mix thoroughly. Then turn on the flame and let the water in the curd reduce.",
    "[00:01:53.000] Add the fried paneer cubes and coriander. Toss on high flame until the sauce coats the paneer.",
    "[00:02:08.000] Ensure you toss only on high flame to keep the paneer crispy. Delicious Hyderabadi Paneer 65 is ready."
  ]
}