{
  "metadata": {
    "title": "|This is Made According to Shastras|రథసప్తమి పరమాన్నం|ఆగమ శాస్త్రాల పాయసం",
    "channel_name": "Vismai Food",
    "publish_date": "2020-01-31",
    "view_count": 493778,
    "like_count": 9615,
    "duration": "04:37",
    "language": "Telugu",
    "video_id": "I6lKivzTYyc",
    "url": "https://www.youtube.com/watch?v=I6lKivzTYyc",
    "description": "Ratha Saptami Special Paramannam (Rice Pudding) prepared according to Agama Shastras. This traditional recipe details the specific rituals and ingredients required for this sacred offering to the Sun God.",
    "ingredients_detected": [
      "New Rice (3 fists per family member)",
      "Organic Jaggery (equal to rice)",
      "Desi Cow Ghee (1/2 tsp)",
      "Desi Cow Milk (4 times the quantity of rice)",
      "3-4 Cardamoms (powdered)",
      "Cleaned Sugar Cane (used as a spoon)",
      "Broad Bean Leaves (for offering)"
    ]
  },
  "transcription_telugu": [
    "[00:00:00.000] హలో ఫుడీస్, వెల్కమ్ టు విస్మయ్ ఫుడ్. అందరికీ రథసప్తమి శుభాకాంక్షలు. ఇవాల్టి స్పెషల్ శాస్త్రోక్తంగా చేసే రథసప్తమి పరమాన్నం.",
    "[00:00:34.000] ముందుగా పాయసం కోసం కొత్త బియ్యం తీసుకోండి. ఇంట్లో ఎంతమంది ఉంటే అంతమంది ఒక్కొక్కరూ మూడు పిడికిళ్ల బియ్యం వేయాలి.",
    "[00:00:48.000] ఈ బియ్యంలో అర టీస్పూన్ ఆవు నెయ్యి వేసి కలపాలి. బియ్యాన్ని కడగకూడదు, నెయ్యితోనే శుద్ధి చేయాలి.",
    "[00:01:10.000] స్టౌ కి నాలుగు వైపులా ముగ్గు వేసి, పసుపు కుంకుమతో బొట్లు పెట్టాలి.",
    "[00:01:23.000] కొత్త ఇత్తడి లేదా రాగి పాత్రకు పసుపు రాసి, గంధం కుంకుమతో అలంకరించాలి.",
    "[00:01:46.000] పాత్రలో బియ్యానికి నాలుగు రెట్లు ఆవు పాలు పోయాలి. ప్యాకెట్ పాలు వాడకూడదు.",
    "[00:02:08.000] పాలు పొంగనివ్వాలి. పొంగేటప్పుడు ఊదడం లేదా మంట తగ్గించడం చేయకూడదు.",
    "[00:02:18.000] పాలు పొంగాక నెయ్యి కలిపిన బియ్యాన్ని వేయాలి. ఈ ప్రసాదాన్ని కలపడానికి చెరకు గడనే వాడాలి.",
    "[00:03:00.000] బియ్యం మెత్తగా ఉడికాక, దానికి సమానంగా బెల్లం తురుము వేసి కరిగించుకోవాలి.",
    "[00:03:40.000] చివరగా యాలకుల పొడి వేసి దించాలి. ఇందులో జీడిపప్పు, నెయ్యి వేయకూడదు.",
    "[00:03:52.000] ప్రసాదాన్ని మొదట చిక్కుడు ఆకులో పెట్టి అగ్ని దేవునికి, ఆపై సూర్య భగవానునికి నివేదించాలి."
  ],
  "transcription_english": [
    "[00:00:00.000] Hello Foodies, welcome to Vismai Food. Happy Ratha Saptami to everyone. Today's special is the traditionally prepared Ratha Saptami Paramannam.",
    "[00:00:34.000] First, take new rice for the pudding. Each family member should add three fists full of rice.",
    "[00:00:48.000] Add 1/2 tsp of cow ghee to the rice. Do not wash the rice; purify it only with ghee.",
    "[00:01:10.000] Draw rangoli on four sides of the stove and decorate it with turmeric and kumkum.",
    "[00:01:23.000] Take a new brass or copper vessel, apply turmeric paste, and decorate with sandalwood and kumkum.",
    "[00:01:46.000] Pour cow milk into the vessel, four times the quantity of the rice. Do not use packet milk.",
    "[00:02:08.000] Let the milk boil over. Do not blow on the foam or reduce the flame; let it overflow naturally.",
    "[00:02:18.000] Once the milk overflows, add the ghee-mixed rice. Use only a sugar cane stick to stir this offering.",
    "[00:03:00.000] When the rice is softly cooked, add an equal amount of grated jaggery and let it dissolve.",
    "[00:03:40.000] Finally, add cardamom powder and turn off the heat. Do not add cashews or extra ghee.",
    "[00:03:52.000] First, offer the pudding to Agni (the Fire God) on a broad bean leaf, then to the Sun God."
  ]
}