{
  "metadata": {
    "title": "ఘాటుగా యమా టేస్టీ వెల్లుల్లి కోడి వేపుడు | Best Garlic Chicken Fry Starter",
    "channel_name": "Vismai Food",
    "publish_date": "2020-02-02",
    "view_count": 1000000,
    "like_count": 15000,
    "duration": "03:15",
    "language": "Telugu",
    "video_id": "baR0SWrX3rE",
    "url": "https://www.youtube.com/watch?v=baR0SWrX3rE",
    "description": "Garlic Chicken Fry, also known as Velluli Kodi Vepudu, is a spicy and aromatic South Indian starter. This recipe involves marinating chicken in a coarse garlic-green chilli paste and deep frying it to perfection before a final toss with cashews and curry leaves.",
    "ingredients_detected": [
      "400gms Boneless Chicken Pieces",
      "25-30 Garlic Cloves",
      "6-8 Green Chillies",
      "1 Small Onion",
      "2 Sprigs Curry Leaves (for paste)",
      "1 tsp Garam Masala",
      "1 tsp Roasted Coriander Powder",
      "1 tsp Roasted Cumin Powder",
      "3-4 drops Red Food Colour (optional)",
      "1/2 tbsp Vinegar",
      "3 tbsps Corn Flour",
      "Salt (to taste)",
      "Turmeric (a pinch)",
      "Oil (for deep frying)",
      "For Tossing: 2 tbsp Oil, 3 tbsp Cashews, 2 Slit Green Chillies, 1 tbsp Chopped Garlic, 2 Sprigs Curry Leaves, 1/2 tsp Garlic Powder or Chat Masala"
    ]
  },
  "transcription_telugu": [
    "[00:00:00.000] హలో ఫుడీస్, వెల్కమ్ టు విస్మయ్ ఫుడ్. ఇవాల్టి స్పెషల్ ఘాటుగా ఉండే వెల్లుల్లి కోడి వేపుడు.",
    "[00:00:25.000] ముందుగా వెల్లుల్లి మసాలా కోసం వెల్లుల్లి రెబ్బలు, పచ్చిమిర్చి, ఉల్లిపాయ, కరివేపాకు వేసి కచ్చాపచ్చాగా గ్రైండ్ చేసుకోవాలి.",
    "[00:00:45.000] ఒక బౌల్ లో 400 గ్రాముల బోన్ లెస్ చికెన్ తీసుకుని అందులో గ్రైండ్ చేసిన మసాలా పేస్ట్, ఉప్పు, పసుపు, గరం మసాలా, ధనియాల పొడి, జీలకర్ర పొడి వేయాలి.",
    "[00:01:05.000] ఇందులో వెనిగర్, ఫుడ్ కలర్ వేసి ముక్కలకు మసాలా బాగా పట్టించాలి. చివరగా కార్న్ ఫ్లోర్ వేసి కోట్ చేసి గంట సేపు ఫ్రిజ్ లో ఉంచాలి.",
    "[00:01:30.000] గంట తర్వాత బాణలిలో నూనె వేడి చేసి చికెన్ ముక్కలను మీడియం ఫ్లేమ్ మీద గోల్డెన్ బ్రౌన్ కలర్ వచ్చే వరకు వేయించాలి.",
    "[00:01:55.000] తాలింపు కోసం మరో పాన్ లో నూనె వేసి జీడిపప్పు, పచ్చిమిర్చి, వెల్లుల్లి తరుగు, కరివేపాకు వేసి ఎర్రగా వేయించాలి.",
    "[00:02:15.000] ఇందులో వేయించిన చికెన్ ముక్కలు, వెల్లుల్లి పొడి లేదా చాట్ మసాలా వేసి హై ఫ్లేమ్ మీద టాస్ చేయాలి.",
    "[00:02:40.000] ఎంతో రుచికరమైన వెల్లుల్లి కోడి వేపుడు సిద్ధం. ఇది వేడి వేడి అన్నంలోకి లేదా స్టార్టర్ గా చాలా బాగుంటుంది."
  ],
  "transcription_english": [
    "[00:00:00.000] Hello Foodies, welcome to Vismai Food. Today's special is the aromatic and spicy Garlic Chicken Fry.",
    "[00:00:25.000] First, grind garlic cloves, green chillies, a small onion, and curry leaves into a coarse paste for the masala.",
    "[00:00:45.000] In a bowl, take 400g of boneless chicken and add the ground masala paste, salt, turmeric, garam masala, coriander powder, and cumin powder.",
    "[00:01:05.000] Add vinegar and food color, rub the spices into the chicken. Finally, add corn flour to coat and refrigerate for one hour.",
    "[00:01:30.000] After one hour, heat oil and fry the chicken pieces on medium flame until they turn rich brown.",
    "[00:01:55.000] For the final toss, heat oil in another pan and fry cashews, green chillies, chopped garlic, and curry leaves until golden.",
    "[00:02:15.000] Add the fried chicken and garlic powder (or chat masala); toss well on high flame.",
    "[00:02:40.000] The delicious Garlic Chicken Fry is ready. It serves perfectly as a starter or with hot rice."
  ]
}