{
  "metadata": {
    "title": "Raw Banana Jaggery Pulusu|అరటికాయ బెల్లం పులుసు|తిన్నకొద్దీ తినాలనిపించే పులుసు",
    "channel_name": "Vismai Food",
    "publish_date": "2020-02-03",
    "view_count": 300051,
    "like_count": 3644,
    "duration": "02:35",
    "language": "Telugu",
    "video_id": "zvzXEvU2hdA",
    "url": "https://www.youtube.com/watch?v=zvzXEvU2hdA",
    "description": "Raw Banana Jaggery Pulusu is a traditional Telugu dish known for its unique blend of sweet, sour, and spicy flavors. It pairs beautifully with rice, dosa, or idli.",
    "ingredients_detected": [
      "2 Raw Bananas (Aratikaya)",
      "1/4 tsp Turmeric (for boiling)",
      "2 tbsp Oil",
      "1/2 tsp Mustard Seeds",
      "1/2 tsp Fenugreek Seeds (Menthulu)",
      "1 Dry Red Chili",
      "1 tsp Chana Dal",
      "1 tsp Urad Dal",
      "3/4 tsp Cumin Seeds",
      "2 Green Chilies",
      "4-5 Garlic Cloves (crushed)",
      "1 Sprig Curry Leaves",
      "1 pinch Hing (Asafoetida)",
      "2 Onions (as paste)",
      "1/4 tsp Turmeric (for masala)",
      "Salt (to taste)",
      "1 tbsp Chili Powder",
      "500ml Tamarind Juice (from a lemon-sized piece)",
      "2-3 tbsp Jaggery (grated)",
      "1 tsp Rice Flour (mixed with water for thickening)",
      "2 tbsp Coriander Leaves (chopped)"
    ]
  },
  "transcription_telugu": [
    "[00:00:18] ముందుగా రెండు అరటికాయలను పొడవుగా ముక్కలుగా కోసి, ఒకటిన్నర కప్పుల నీళ్లు, పావు టీస్పూన్ పసుపు వేసి 80% ఉడికించి పక్కన పెట్టుకోవాలి.",
    "[00:00:39] ఒక బాణలిలో 2 టేబుల్ స్పూన్ల నూనె వేడి చేసి ఆవాలు, మెంతులు వేసి ఎర్రగా వేయించాలి.",
    "[00:00:52] ఇందులో ఎండుమిర్చి, శనగపప్పు, మినప్పప్పు వేసి వేగాక జీలకర్ర, పచ్చిమిర్చి, వెల్లుల్లి రెబ్బలు, కరివేపాకు, ఇంగువ వేసి వెల్లుల్లి ఎర్రబడే వరకు వేయించాలి.",
    "[00:01:13] ఇప్పుడు ఇందులో ఉల్లిపాయ పేస్ట్, పసుపు, ఉప్పు, కారం వేసి పచ్చి వాసన పోయే వరకు వేయించాలి.",
    "[00:01:29] నిమ్మకాయ సైజు చింతపండు నుండి తీసిన 500ml చింతపండు పులుసు పోసి మీడియం ఫ్లేమ్ మీద మరగనివ్వాలి.",
    "[00:01:41] పులుసు మరుగుతున్నప్పుడు తురిమిన బెల్లం, ముందుగా ఉడికించిన అరటికాయ ముక్కలు వేసి కలపాలి.",
    "[00:01:54] లో ఫ్లేమ్ మీద 4-5 నిమిషాల పాటు పులుసును మరగనివ్వాలి.",
    "[00:02:04] పులుసు చిక్కదనం కోసం ఒక టీస్పూన్ బియ్యం పిండిని కొద్దిగా నీళ్లలో కలిపి పోసి మరిగించాలి.",
    "[00:02:20] చివరగా కొత్తిమీర చల్లి దించుకోవాలి. ఎంతో రుచికరమైన అరటికాయ బెల్లం పులుసు సిద్ధం."
  ],
  "transcription_english": [
    "[00:00:18] First, cut 2 raw bananas into lengthwise pieces and boil them in water with 1/4 tsp turmeric until 80% cooked.",
    "[00:00:39] Heat 2 tbsp oil in a pan, add mustard seeds and fenugreek seeds; fry until the fenugreek is golden.",
    "[00:00:52] Add dry chili, chana dal, and urad dal. Once golden, add cumin, green chilies, crushed garlic, curry leaves, and hing. Fry until the garlic is golden.",
    "[00:01:13] Add onion paste, turmeric, salt, and chili powder; sauté until the raw smell disappears.",
    "[00:01:29] Pour in 500ml of tamarind juice (extracted from a lemon-sized tamarind) and bring to a boil on medium flame.",
    "[00:01:41] When the gravy boils, add grated jaggery and the boiled banana pieces; mix well.",
    "[00:01:54] Let the pulusu simmer on low flame for 4-5 minutes.",
    "[00:02:04] To thicken the gravy, stir in a slurry of 1 tsp rice flour mixed with a little water and bring to a boil.",
    "[00:02:20] Finally, garnish with chopped coriander and remove from heat. The delicious Raw Banana Jaggery Pulusu is ready."
  ]
}