{
  "metadata": {
    "title": "JonnaMudde|Healthyrecipe With Jowar In Just10mins|జొన్నముద్ద|తక్కువ టైం లో చేసుకునే హేల్తీ రెసిపీ",
    "channel_name": "Vismai Food",
    "publish_date": "2020-02-04",
    "view_count": 222690,
    "like_count": 3808,
    "duration": "02:01",
    "language": "Telugu",
    "video_id": "ny_q52z5gtA",
    "url": "https://www.youtube.com/watch?v=ny_q52z5gtA",
    "description": "Jonna Mudde (Jowar Balls) is a healthy and traditional dish from the Rayalaseema and North Karnataka regions. It's a great alternative to Ragi Sangati and is very easy to prepare.",
    "ingredients_detected": [
      "1 Cup Jowar Flour (Jonna Pindi)",
      "2 Cups Water",
      "1/2 tsp Oil",
      "Salt (to taste)",
      "Ghee or Water (for rolling balls)"
    ]
  },
  "transcription_telugu": [
    "[00:00:00.000] హలో ఫుడీస్, వెల్కమ్ టు విస్మయ్ ఫుడ్. ఇవాల్టి స్పెషల్ రాయలసీమ స్పెషల్ జొన్నముద్ద. ఇది రాయలసీమ మరియు నార్త్ కర్ణాటకలో చాలా ఫేమస్.",
    "[00:00:20.000] ముందుగా ఒక బౌల్ లో రెండు కప్పుల నీళ్లు పోసుకోండి.",
    "[00:00:26.000] ఈ నీళ్లలో అర టీస్పూన్ నూనె, ఉప్పు వేసి నీటిని బాగా తెర్లకాగనివ్వాలి.",
    "[00:00:40.000] నీళ్లు బాగా మరుగుతున్నప్పుడు ఒక కప్పు జొన్నపిండి వేసి బాగా కలపాలి.",
    "[00:00:46.000] పిండి వేసి కలిపిన తర్వాత మంట తగ్గించి గడ్డలు లేకుండా కలుపుతూనే ఉండాలి. 1:2 నిష్పత్తిలో పిండి మరియు నీళ్లు ఉండాలి.",
    "[00:01:08.000] 5 నిమిషాల తర్వాత పిండి దగ్గరపడి ముద్దలా అవుతుంది. అప్పుడు స్టవ్ ఆపేసి మూత పెట్టి మరో 5 నిమిషాలు రెస్ట్ ఇవ్వాలి.",
    "[00:01:21.000] పిండి గోరువెచ్చగా ఉన్నప్పుడే చేతులకు నెయ్యి లేదా నీళ్లు రాసుకుని ఉండలుగా చుట్టుకోవాలి.",
    "[00:01:40.000] ఈ జొన్నముద్దలు పప్పు, సాంబార్, పల్లి చట్నీ లేదా ఏదైనా నాన్ వెజ్ కర్రీతో చాలా బాగుంటాయి.",
    "[00:01:55.000] ఎంతో ఆరోగ్యకరమైన జొన్నముద్ద సిద్ధం."
  ],
  "transcription_english": [
    "[00:00:00.000] Hello Foodies, welcome to Vismai Food. Today's special is Rayalaseema special Jonna Mudde. It's very famous in Rayalaseema and North Karnataka.",
    "[00:00:20.000] First, pour two cups of water into a bowl.",
    "[00:00:26.000] Add 1/2 tsp oil and salt to the water and let it come to a rolling boil.",
    "[00:00:40.000] When the water is boiling well, add one cup of jowar flour and mix well.",
    "[00:00:46.000] After adding the flour, reduce the flame and keep stirring to ensure there are no lumps. The ratio of flour to water is 1:2.",
    "[00:01:08.000] After 5 minutes, the mixture will thicken into a dough. Turn off the flame, cover, and let it rest for another 5 minutes.",
    "[00:01:21.000] While the dough is still lukewarm, grease your palms with ghee or water and roll it into balls.",
    "[00:01:40.000] These jowar balls pair perfectly with dal, sambar, peanut chutney, or any spicy non-veg curry.",
    "[00:01:55.000] The healthy Jonna Mudde is now ready."
  ]
}