{
  "metadata": {
    "title": "CHICKEN TIKKA DUM BIRYANI|Best Chicken Biryani|చికెన్ టిక్కా బిర్యానీ|వంటరాని వారు కూడా చేసెయ్యొచ్చు",
    "channel_name": "Vismai Food",
    "publish_date": "2020-02-07",
    "view_count": 861386,
    "like_count": 17961,
    "duration": "06:22",
    "language": "Telugu",
    "video_id": "mG3emdMgB-o",
    "url": "https://www.youtube.com/watch?v=mG3emdMgB-o",
    "description": "Best Chicken Tikka Dum Biryani recipe for a unique and smoky flavor at home.",
    "ingredients_detected": [
      "2 Cups Basmati Rice",
      "500gms Boneless chicken cubes",
      "1/2 Lemon Juice",
      "Ginger garlic paste",
      "500gms Curd (2 cups)",
      "1 tsp Kasuri Methi",
      "1 tbsp Mustard oil/Sunflower oil",
      "1 tbsp Chilli powder",
      "1 tsp Garam masala",
      "1 tsp Roasted Cumin powder",
      "1/2 tsp Cardamom powder",
      "1 tsp Dry Ginger powder",
      "1 tsp Coriander powder",
      "1 tsp Kashmiri Chilli Powder",
      "1/4 tsp Red food color",
      "1/3 cup Ghee",
      "Chopped Pudina & Coriander",
      "1/2 cup Fried Onion",
      "Whole Biryani Spices (Cloves, Bay leaf, Cardamom, Cinnamon, Marathi Mogga, Shahi jeera, Star anise, Javitri, Black Cardamom)",
      "Green Chillies",
      "1 tsp Saffron water",
      "1/2 cup Warm milk"
    ]
  },
  "transcription_telugu": [
    "[00:00:00.000] హలో ఫుడీస్, వెల్కమ్ టు విస్మయ్ ఫుడ్. ఇవాల్టి స్పెషల్ చికెన్ టిక్కా దమ్ బిర్యానీ.",
    "[00:00:52.000] రెండు కప్పుల బాస్మతి రైస్ ని కడిగి ఒక గంట పాటు నానబెట్టుకోవాలి.",
    "[00:00:59.000] మిక్సింగ్ బౌల్ లో అర కిలో బోన్ లెస్ చికెన్ ముక్కలు తీసుకుని అందులో నిమ్మరసం, ఉప్పు, అల్లం వెల్లుల్లి పేస్ట్ వేసి బాగా మసాజ్ చేసి 30 నిమిషాలు నాననివ్వాలి.",
    "[00:01:17.000] తర్వాత పెరుగు, కసూరి మేతి, ఆవ నూనె మరియు ఇతర మసాలా పొడులన్నీ వేసి బాగా కలిపి ఒక గంట ఫ్రిజ్ లో ఉంచాలి.",
    "[00:02:05.000] అడుగు మందంగా ఉన్న పాన్ లో నెయ్యి పోసి మ్యారినేట్ చేసిన చికెన్ వేసి మీడియం ఫ్లేమ్ మీద ఉడికించాలి.",
    "[00:02:52.000] ఉడికిన చికెన్ ముక్కలను గ్రిల్ మీద కాల్చుకోవాలి, దీనివల్ల టిక్కాకి మంచి స్మోకీ ఫ్లేవర్ వస్తుంది.",
    "[00:03:21.000] ఎసరు కోసం నీటిని మరిగించి అందులో బిర్యానీ దినుసులు, ఉప్పు, అల్లం వెల్లుల్లి పేస్ట్ వేసి 60% వరకు రైస్ ని ఉడికించుకోవాలి.",
    "[00:04:16.000] మసాలా గ్రేవీ పైన ఉడికించిన అన్నాన్ని లేయర్లుగా వేసుకోవాలి.",
    "[00:04:53.000] పైన నెయ్యి, యాలకుల పొడి, కుంకుమపువ్వు నీళ్లు, ఫ్రైడ్ ఆనియన్స్, కొత్తిమీర, పుదీనా మరియు పాలు పోయాలి.",
    "[00:05:19.000] చివరగా గ్రిల్ చేసిన టిక్కా ముక్కలను పైన ఉంచి మూత పెట్టి పిండితో సీల్ చేసి దమ్ చేయాలి.",
    "[00:05:49.000] 30 నిమిషాల తర్వాత ఎంతో రుచికరమైన చికెన్ టిక్కా దమ్ బిర్యానీ సిద్ధం."
  ],
  "transcription_english": [
    "[00:00:00.000] Hello Foodies, welcome to Vismai Food. Today's special is Chicken Tikka Dum Biryani.",
    "[00:00:52.000] Soak 2 cups of Basmati rice for one hour after washing.",
    "[00:00:59.000] Take 500g boneless chicken, add lemon juice, salt, ginger-garlic paste, massage well and rest for 30 mins.",
    "[00:01:17.000] Add curd, kasuri methi, mustard oil, and all spice powders, mix well and refrigerate for one hour.",
    "[00:02:05.000] Cook the marinated chicken in a thick-bottomed pan with ghee on medium flame.",
    "[00:02:52.000] Grill the cooked chicken pieces to get that authentic smoky tikka flavor.",
    "[00:03:21.000] Boil water with biryani spices, salt, ginger-garlic paste and cook the rice up to 60%.",
    "[00:04:16.000] Layer the cooked rice over the prepared masala gravy.",
    "[00:04:53.000] Add ghee, cardamom powder, saffron water, fried onions, coriander, mint, and milk on top.",
    "[00:05:19.000] Place the grilled tikka pieces on top, seal with dough, and cook on dum.",
    "[00:05:49.000] After 30 minutes, the delicious Chicken Tikka Dum Biryani is ready."
  ]
}