{
  "metadata": {
    "title": "BANANA BUNS|Mangalore Fried Banana Buns|బనానా బన్స్|ఇవి బెకేడ్ కాదు ఫ్రైడ్|చెప్పలేనంత బాగుంటాయ్",
    "channel_name": "Vismai Food",
    "publish_date": "2020-02-08",
    "view_count": 335615,
    "like_count": 5753,
    "duration": "02:27",
    "language": "Telugu",
    "video_id": "8pouJrm2n9E",
    "url": "https://www.youtube.com/watch?v=8pouJrm2n9E",
    "description": "Mangalore special Fried Banana Buns recipe - a perfect tea-time snack made with ripe bananas and flour.",
    "ingredients_detected": [
      "1 Ripe Banana (బాగా పండిన అరటిపండు)",
      "3 tbsps Sugar (పంచదార)",
      "3 tbsps Curd (పెరుగు)",
      "1 Cup (150gms) Maida (మైదా)",
      "Salt (to taste - రుచికి సరిపడా ఉప్పు)",
      "1/8 tsp Baking Soda (వంట సోడా)",
      "1/2 tsp Cumin (జీలకర్ర)",
      "1 tbsp Ghee (నెయ్యి)",
      "Oil for deep fry (వేయించడానికి సరిపడా నూనె)"
    ]
  },
  "transcription_telugu": [
    "[00:00:00] హలో ఫుడీస్, వెల్కమ్ టు విస్మయ్ ఫుడ్. ఈరోజు మనం మంగళూరు స్పెషల్ బనానా బన్స్ ఎలా చేయాలో చూద్దాం.",
    "[00:00:15] ముందుగా ఒక మిక్సింగ్ బౌల్ లో బాగా పండిన ఒక అరటిపండును తీసుకుని మెత్తగా మాష్ చేసుకోవాలి.",
    "[00:00:25] ఇందులో 3 టేబుల్ స్పూన్ల పంచదార వేసి, పంచదార కరిగే వరకు బాగా కలుపుకోవాలి.",
    "[00:00:35] ఆ తర్వాత 3 టేబుల్ స్పూన్ల పెరుగు వేసి ఉండలు లేకుండా బాగా విస్క్ చేయాలి.",
    "[00:00:45] ఇప్పుడు ఇందులో ఒక కప్పు మైదా పిండి, చిటికెడు ఉప్పు, 1/8 టీస్పూన్ వంట సోడా, అర టీస్పూన్ జీలకర్ర వేయాలి.",
    "[00:01:00] చివరగా ఒక టేబుల్ స్పూన్ నెయ్యి వేసి, నీళ్లు పోయకుండా మెత్తని పిండిలాగా కలుపుకోవాలి.",
    "[00:01:15] ఈ పిండిని కనీసం 5 నుండి 6 గంటల పాటు లేదా రాత్రంతా నాననివ్వాలి.",
    "[00:01:30] నానిన పిండిని చిన్న చిన్న ఉండలుగా చేసుకుని, కొద్దిగా మందంగా పూరీల్లా ఒత్తుకోవాలి.",
    "[00:01:50] స్టవ్ మీద నూనె వేడి చేసి, హై ఫ్లేమ్ మీద బన్స్‌ను రెండు వైపులా బంగారు రంగు వచ్చే వరకు వేయించుకోవాలి.",
    "[00:02:10] వేడి వేడి బనానా బన్స్ సిద్ధం. ఇవి చట్నీతో లేదా సాంబార్‌తో చాలా బాగుంటాయి."
  ],
  "transcription_english": [
    "[00:00:00] Hello foodies, welcome to Vismai Food. Today we will see how to make Mangalore special Banana Buns.",
    "[00:00:15] First, take one overripe banana in a mixing bowl and mash it thoroughly.",
    "[00:00:25] Add 3 tablespoons of sugar and mix well until the sugar dissolves.",
    "[00:00:35] Then add 3 tablespoons of curd and whisk well without any lumps.",
    "[00:00:45] Now add one cup of Maida (all-purpose flour), a pinch of salt, 1/8 tsp baking soda, and 1/2 tsp cumin seeds.",
    "[00:01:00] Finally, add one tablespoon of ghee and knead into a soft dough without adding any water.",
    "[00:01:15] Let this dough rest for at least 5 to 6 hours or overnight.",
    "[00:01:30] Make small balls of the dough and roll them into slightly thick discs like puris.",
    "[00:01:50] Heat oil and deep fry the buns on high flame until they puff up and turn golden brown on both sides.",
    "[00:02:10] Delicious Banana Buns are ready. They taste great with chutney or sambar."
  ]
}