{
  "metadata": {
    "title": "Spicy Onion Masala Kurma|For Rice Roti&Puri|ఉల్లిపాయ మసాలా కుర్మా|పూరి,చపాతీ, అట్లతో రుచిగా ఉంటుంది",
    "channel_name": "Vismai Food",
    "publish_date": "2020-02-11",
    "view_count": 156738,
    "like_count": 3399,
    "duration": "03:07",
    "language": "Telugu",
    "video_id": "WPUdtMC2rAE",
    "url": "https://www.youtube.com/watch?v=WPUdtMC2rAE",
    "description": "Delicious and spicy Onion Masala Kurma recipe that pairs perfectly with Rice, Roti, and Puri.",
    "ingredients_detected": [
      "3 Large Onions (పెద్ద ఉల్లిపాయలు)",
      "2-3 Green Chillies (పచ్చిమిర్చి)",
      "1/2 Cup Fresh Curd (తాజా పెరుగు)",
      "1 tsp Ginger Garlic Paste (అల్లం వెల్లుల్లి పేస్ట్)",
      "1/4 tsp Turmeric Powder (పసుపు)",
      "1-2 tsp Red Chilli Powder (కారం)",
      "1 tsp Coriander Powder (ధనియాల పొడి)",
      "1/2 tsp Garam Masala (గరం మసాలా)",
      "2 tbsps Oil (నూనె)",
      "Whole Spices (Cinnamon, Cardamom, Cloves - మసాలా దినుసులు)",
      "Salt (to taste - రుచికి సరిపడా ఉప్పు)",
      "Coriander Leaves (కొత్తిమీర)"
    ]
  },
  "transcription_telugu": [
    "[00:00:00] హలో ఫుడీస్, వెల్కమ్ టు విస్మయ్ ఫుడ్. ఇవాళ మనం ఎంతో రుచికరమైన ఉల్లిపాయ మసాలా కుర్మా ఎలా చేయాలో చూద్దాం.",
    "[00:00:20] ముందుగా మూడు పెద్ద ఉల్లిపాయలను తీసుకుని ఇలా పొడవుగా ముక్కలు కోసి పక్కన పెట్టుకోవాలి.",
    "[00:00:40] ఒక పాన్ లో రెండు టేబుల్ స్పూన్ల నూనె వేడి చేసి, అందులో దాల్చిన చెక్క, ఇలాచీ, లవంగాలు వేసి వేయించాలి.",
    "[00:01:00] ఇప్పుడు కోసి పెట్టుకున్న ఉల్లిపాయ ముక్కలు, పచ్చిమిర్చి వేసి ఉల్లిపాయలు మెత్తబడే వరకు వేపుకోవాలి.",
    "[00:01:20] ఇందులో ఒక టీస్పూన్ అల్లం వెల్లుల్లి పేస్ట్ వేసి పచ్చి వాసన పోయే వరకు వేయించాలి.",
    "[00:01:45] తర్వాత పసుపు, కారం, ధనియాల పొడి, రుచికి సరిపడా ఉప్పు వేసి బాగా కలుపుకోవాలి.",
    "[00:02:05] మంట తగ్గించి, అర కప్పు పెరుగు వేసి నూనె పైకి తేలే వరకు ఉడికించాలి.",
    "[00:02:30] గ్రేవీకి సరిపడా నీళ్లు పోసి, కొద్దిగా గరం మసాలా చల్లి ఐదు నిమిషాల పాటు మూత పెట్టి ఉడికించాలి.",
    "[00:02:50] చివరగా సన్నగా తరిగిన కొత్తిమీర చల్లుకుంటే ఎంతో రుచికరమైన ఉల్లిపాయ కుర్మా రెడీ.",
    "[00:03:00] ఇది పూరి, చపాతీ లేదా అన్నంలోకి చాలా అద్భుతంగా ఉంటుంది."
  ],
  "transcription_english": [
    "[00:00:00] Hello foodies, welcome to Vismai Food. Today we will see how to make a delicious Onion Masala Kurma.",
    "[00:00:20] First, take three large onions and slice them lengthwise and keep them aside.",
    "[00:00:40] Heat two tablespoons of oil in a pan, add cinnamon, cardamom, and cloves, and sauté them.",
    "[00:01:00] Now add the sliced onions and green chillies, and sauté until the onions become soft.",
    "[00:01:20] Add one teaspoon of ginger-garlic paste and sauté until the raw smell disappears.",
    "[00:01:45] Then add turmeric powder, red chilli powder, coriander powder, and salt to taste, and mix well.",
    "[00:02:05] Reduce the flame, add half a cup of curd, and cook until the oil starts separating.",
    "[00:02:30] Pour enough water for the gravy, sprinkle some garam masala, cover with a lid, and cook for five minutes.",
    "[00:02:50] Finally, sprinkle finely chopped coriander leaves; the delicious Onion Kurma is ready.",
    "[00:03:00] This pairs wonderfully with Puri, Chapati, or Rice."
  ]
}