{
  "metadata": {
    "title": "MuslimStyle MuttonKhichidi|ముస్లిమ్స్ చేసే మటన్ ఖిచిడి|నీచు వాసనే రాకుండా రుచిగా ఉండాలంటే ఇది పద్ధతి",
    "channel_name": "Vismai Food",
    "publish_date": "2020-02-12",
    "view_count": 107415,
    "like_count": 2635,
    "duration": "03:04",
    "language": "Telugu",
    "video_id": "vAPG1O_oGXw",
    "url": "https://www.youtube.com/watch?v=vAPG1O_oGXw",
    "description": "Authentic Muslim style Mutton Khichidi recipe with tips to make it flavorful and without any raw smell.",
    "ingredients_detected": [
      "300gms Mutton (with bone)",
      "1 Cup Sona Masoori Rice (soaked for 1 hour)",
      "3 tbsps Moong Dal (soaked for 30 mins)",
      "1 Onion (sliced)",
      "1 tbsp Ginger-Garlic Paste",
      "2 tbsps Ghee",
      "1 tbsp Oil",
      "Whole Spices: 1 Bay Leaf, 3-4 Cloves, 2 Cardamom, 1-inch Cinnamon, 1 tsp Cumin",
      "1/2 tsp Garam Masala",
      "1/4 tsp Turmeric Powder",
      "1 tsp Red Chilli Powder",
      "4 Green Chillies",
      "2 tbsps Coriander Leaves",
      "2 tbsps Mint Leaves",
      "Salt (to taste)"
    ]
  },
  "transcription_telugu": [
    "[00:00:00.000] హలో ఫుడీస్, వెల్కమ్ టు విస్మయ్ ఫుడ్. ఇవాల్టి స్పెషల్ ముస్లిం స్టైల్ మటన్ ఖిచిడి. ఇది చాలా రుచిగా, ఫ్లేవర్‌ఫుల్ గా ఉంటుంది.",
    "[00:00:23.000] ముందుగా కుక్కర్‌లో 2 టేబుల్ స్పూన్ల నెయ్యి, 1 టేబుల్ స్పూన్ నూనె వేడి చేయాలి.",
    "[00:00:28.000] ఇందులో బిర్యానీ ఆకు, లవంగాలు, యాలకులు, దాల్చిన చెక్క, జీలకర్ర మరియు ఉల్లిపాయ ముక్కలు వేసి గోల్డెన్ బ్రౌన్ కలర్ వచ్చే వరకు వేయించాలి.",
    "[00:00:45.000] ఉల్లిపాయలు వేగాక 1 టేబుల్ స్పూన్ అల్లం వెల్లుల్లి పేస్ట్, 300 గ్రాముల మటన్ వేసి బాగా ఫ్రై చేయాలి.",
    "[00:00:55.000] మటన్‌ను ఉప్పు నీళ్లలో 30 నిమిషాలు నానబెడితే త్వరగా ఉడుకుతుంది. నీరంతా పోయి డ్రై అయ్యే వరకు వేయించాలి.",
    "[00:01:10.000] ఇప్పుడు అర టీస్పూన్ గరం మసాలా, పావు టీస్పూన్ పసుపు, తగినంత ఉప్పు, 1 టీస్పూన్ కారం వేసి మరో 2-3 నిమిషాలు వేయించాలి.",
    "[00:01:25.000] ఇందులో 400ml నీళ్లు పోసి, కుక్కర్ మూత పెట్టి మీడియం ఫ్లేమ్ మీద 4 విజిల్స్ రానివ్వాలి.",
    "[00:01:40.000] మటన్ ఉడికాక, 30 నిమిషాలు నానబెట్టిన 3 టేబుల్ స్పూన్ల పెసరపప్పు వేసి నీరు సగం అయ్యే వరకు ఉడికించాలి.",
    "[00:01:52.000] ఇప్పుడు గంట పాటు నానబెట్టిన ఒక కప్పు సోనా మసూరి బియ్యం, పచ్చిమిర్చి, కొత్తిమీర, పుదీనా వేసి బాగా కలపాలి.",
    "[00:02:15.000] నీరు ఇగిరిపోయాక 1.3/4 కప్పుల వేడి నీళ్లు పోసి, మూత పెట్టి హై ఫ్లేమ్ మీద ఒక విజిల్, మీడియం ఫ్లేమ్ మీద రెండు విజిల్స్ రానివ్వాలి.",
    "[00:02:30.000] స్టవ్ ఆపి 20 నిమిషాల పాటు అలాగే ఉంచితే ఎంతో రుచికరమైన మటన్ ఖిచిడి సిద్ధం. ఇది గోంగూర పచ్చడి లేదా రైతాతో చాలా బాగుంటుంది."
  ],
  "transcription_english": [
    "[00:00:00.000] Hello foodies, welcome to Vismai Food. Today's special is Muslim style Mutton Khichidi. It is very tasty and flavorful.",
    "[00:00:23.000] First, heat 2 tablespoons of ghee and 1 tablespoon of oil in a pressure cooker.",
    "[00:00:28.000] Add bay leaf, cloves, cardamom, cinnamon, cumin, and sliced onions; fry until golden brown.",
    "[00:00:45.000] Once onions are fried, add 1 tablespoon of ginger-garlic paste and 300g mutton; sauté well.",
    "[00:00:55.000] Soaking mutton in salt water for 30 mins helps it cook faster. Sauté until the water evaporates and it becomes dry.",
    "[00:01:10.000] Now add 1/2 tsp garam masala, 1/4 tsp turmeric, salt, and 1 tsp chilli powder; fry for 2-3 minutes.",
    "[00:01:25.000] Pour 400ml water, cover the lid, and cook for 4 whistles on medium flame.",
    "[00:01:40.000] After the mutton is cooked, add 3 tablespoons of soaked moong dal and cook until water reduces to half.",
    "[00:01:52.000] Add one cup of Sona Masoori rice (soaked for 1 hour), green chillies, coriander, and mint leaves; mix well.",
    "[00:02:15.000] Once the water evaporates, pour 1.3/4 cups of hot water, cover, and cook for 1 whistle on high and 2 on medium flame.",
    "[00:02:30.000] Turn off the heat and let it rest for 20 mins. Delicious Mutton Khichidi is ready. It pairs well with Gongura chutney or Raitha."
  ]
}