{
  "metadata": {
    "title": "JALEBI|Jilebi In Telugu|With Secret Tips|జిలేబి|స్వీట్ షాప్ స్టైల్ సీక్రెట్ రెసిపీ|పక్కా రెసిపీ",
    "channel_name": "Vismai Food",
    "publish_date": "2020-02-13",
    "view_count": 5771510,
    "like_count": 59364,
    "duration": "04:37",
    "language": "Telugu",
    "video_id": "_LIQ1Lubjts",
    "url": "https://www.youtube.com/watch?v=_LIQ1Lubjts",
    "description": "Authentic Sweet Shop Style Jalebi recipe with secret tips for perfect, crispy, and juicy jalebis at home.",
    "ingredients_detected": [
      "1 Cup Maida (మైదా)",
      "1 tbsp Corn Flour (మొక్కజొన్న పిండి)",
      "1/4 Cup Curd (పెరుగు)",
      "1/2 tsp Baking Powder (బేకింగ్ పౌడర్)",
      "Food Color (Orange/Yellow - ఆప్షనల్)",
      "1.5 Cups Sugar (పంచదార)",
      "1 Cup Water (నీళ్లు)",
      "1/2 tsp Cardamom Powder (యాలకుల పొడి)",
      "1 tsp Lemon Juice (నిమ్మరసం)",
      "Ghee or Oil for frying (నెయ్యి లేదా నూనె)"
    ]
  },
  "transcription_telugu": [
    "[00:00:00.000] హలో ఫుడీస్, వెల్కమ్ టు విస్మయ్ ఫుడ్. ఇవాళ మనం స్వీట్ షాప్ స్టైల్ జ్యూసీ జిలేబిని ఇంట్లోనే పక్కా కొలతలతో ఎలా చేయాలో చూద్దాం.",
    "[00:00:30.000] ముందుగా ఒక బౌల్ లో ఒక కప్పు మైదా, ఒక టేబుల్ స్పూన్ కార్న్ ఫ్లోర్, పావు కప్పు పెరుగు వేసి బాగా కలపాలి.",
    "[00:01:00.000] ఇందులో కొద్ది కొద్దిగా నీళ్లు పోస్తూ ఉండలు లేకుండా దోస పిండి కంటే కొంచెం గట్టిగా కలుపుకోవాలి. ఈ పిండిని రాత్రంతా లేదా కనీసం 8 గంటలు నానబెట్టాలి.",
    "[00:01:45.000] ఇప్పుడు పాకం కోసం ఒక గిన్నెలో ఒకటిన్నర కప్పుల పంచదార, ఒక కప్పు నీళ్లు పోసి తీగ పాకం వచ్చే వరకు మరిగించాలి.",
    "[00:02:15.000] పాకంలో యాలకుల పొడి, నిమ్మరసం (పాకం గడ్డకట్టకుండా ఉండటానికి) వేసి పక్కన పెట్టుకోండి.",
    "[00:02:40.000] నానిన పిండిలో అర టీస్పూన్ బేకింగ్ పౌడర్, చిటికెడు ఫుడ్ కలర్ వేసి బాగా విస్క్ చేయాలి.",
    "[00:03:00.000] ఈ పిండిని ఒక సాస్ బాటిల్ లేదా పాల కవర్‌లో వేసి చిన్న రంధ్రం చేసుకోవాలి.",
    "[00:03:20.000] వెడల్పాటి పాన్ లో నూనె లేదా నెయ్యిని మీడియం హీట్ చేసి, జిలేబీలను గుండ్రంగా చుట్టాలి.",
    "[00:03:50.000] జిలేబీలు రెండు వైపులా కరకరలాడే వరకు వేయించి, వెంటనే గోరువెచ్చని పాకంలో వేయాలి.",
    "[00:04:15.000] పాకంలో ఒక నిమిషం ఉంచి తీసేస్తే ఎంతో రుచికరమైన జ్యూసీ జిలేబీలు రెడీ."
  ],
  "transcription_english": [
    "[00:00:00.000] Hello foodies, welcome to Vismai Food. Today we will see how to make sweet shop style juicy Jalebi at home with perfect measurements.",
    "[00:00:30.000] First, in a bowl, add 1 cup of Maida, 1 tbsp Corn flour, and 1/4 cup of Curd; mix well.",
    "[00:01:00.000] Add water gradually and mix into a smooth batter, slightly thicker than dosa batter. Ferment this for at least 8 hours or overnight.",
    "[00:01:45.000] For the syrup, add 1.5 cups of sugar and 1 cup of water in a bowl; boil until it reaches a one-string consistency.",
    "[00:02:15.000] Add cardamom powder and lemon juice (to prevent crystallization) to the syrup and keep aside.",
    "[00:02:40.000] In the fermented batter, add 1/2 tsp baking powder and a pinch of food color; whisk thoroughly.",
    "[00:03:00.000] Pour the batter into a sauce bottle or a milk packet with a small hole.",
    "[00:03:20.000] Heat oil or ghee in a flat pan on medium heat and squeeze the batter in circular motions to form jalebis.",
    "[00:03:50.000] Fry until they become crispy on both sides, then immediately drop them into the warm sugar syrup.",
    "[00:04:15.000] Let them soak for a minute, then remove. Delicious juicy Jalebis are ready."
  ]
}