{
  "metadata": {
    "title": "Masala Puri | మసాలా పూరి | హోటల్ లో లాగా పూరీలు పొంగాలంటే ఈ వీడియో చూడాల్సిందే! Perfect Puri Recipe!",
    "channel_name": "Vismai Food",
    "publish_date": "2018-12-04",
    "view_count": 1331788,
    "like_count": 12954,
    "duration": "02:24",
    "language": "Telugu",
    "video_id": "wxIhe23A_eU",
    "url": "https://www.youtube.com/watch?v=wxIhe23A_eU",
    "description": "Learn how to make perfectly puffed and spicy Masala Puri like in a hotel with tips from Vismai Food.",
    "ingredients_detected": [
      "1 Cup Wheat Flour (110gms)",
      "Salt (to taste)",
      "1/4 tsp Carom seeds (Vamu) - crushed",
      "1/4 tsp Turmeric powder",
      "1/2 tsp Chilli powder",
      "1 Pinch Garam masala",
      "1 tbsp Coriander or Mint leaves - chopped",
      "Little Oil",
      "Sufficient Water (for semi-soft dough)",
      "Oil (for deep frying)"
    ]
  },
  "transcription_telugu": [
    "[00:00:00.000] హలో ఫుడీస్, వెల్కమ్ టు విస్మయ్ ఫుడ్. ఇవాల్టి యమ్మీ రెసిపీ మసాలా పూరి.",
    "[00:00:10.000] ఈ పూరీ హోటల్ స్టైల్ లో రావాలంటే కొన్ని చిట్కాలు ఉన్నాయి, వీడియోని చివరి వరకు చూడండి.",
    "[00:00:20.000] బౌల్ లో ఒక కప్పు (110 గ్రాములు) గోధుమ పిండి, నలిపిన వాము, ఉప్పు, పసుపు, కారం, గరం మసాలా వేయండి.",
    "[00:00:32.000] కొద్దిగా నూనె, కొత్తిమీర లేదా పుదీనా తరుగు వేసి ఒకసారి బాగా కలుపుకోవాలి.",
    "[00:00:40.000] కొద్ది కొద్దిగా నీళ్లు పోస్తూ పిండిని గట్టిగా (సెమీ సాఫ్ట్) కలుపుకోవాలి. పిండి ఎంత బాగా వత్తితే పూరీలు అంత సాఫ్ట్ గా వస్తాయి.",
    "[00:00:55.000] తడి గుడ్డ కప్పి 15-20 నిమిషాల పాటు పిండిని నాననివ్వాలి.",
    "[00:01:05.000] పిండిని మళ్ళీ ఒకసారి వత్తి సమాన భాగాలుగా చేసుకుని ఉండలు చుట్టుకోవాలి.",
    "[00:01:15.000] మరీ పలచగా కాకుండా, మరీ మందంగా కాకుండా పూరీల్లా వత్తుకోవాలి. ఎక్కడా హోల్స్ ఉండకుండా చూసుకోవాలి.",
    "[00:01:32.000] సలసల కాగుతున్న నూనెలో హై ఫ్లేమ్ మీద మాత్రమే పూరీలు వేపుకోవాలి.",
    "[00:01:42.000] పూరీ పైకి తేలినప్పుడు గరిటెతో నూనెను పూరీ పైకి చిలకరిస్తుంటే చక్కగా పొంగుతాయి.",
    "[00:02:00.000] ఈ మసాలా పూరీని ఏ కూర లేకుండా ఒట్టిగా కూడా తినేయవచ్చు. పుదీనా లేదా కుకుంబర్ రైతాతో బాగుంటుంది."
  ],
  "transcription_english": [
    "[00:00:00.000] Hello Foodies, welcome to Vismai Food. Today's yummy recipe is Masala Puri.",
    "[00:00:10.000] There are a few tips to get hotel-style puris; watch the video until the end.",
    "[00:00:20.000] In a bowl, add 1 cup (110g) wheat flour, crushed carom seeds, salt, turmeric, chilli powder, and garam masala.",
    "[00:00:32.000] Add a little oil, chopped coriander or mint leaves, and mix everything well.",
    "[00:00:40.000] Add water gradually and knead into a firm (semi-soft) dough. The more you knead, the softer the puris.",
    "[00:00:55.000] Cover with a damp cloth and let the dough rest for 15-20 minutes.",
    "[00:01:05.000] Knead again and divide into equal portions to make small balls.",
    "[00:01:15.000] Roll them into puris, neither too thin nor too thick. Ensure there are no holes.",
    "[00:01:32.000] Deep fry the puris only on high flame in very hot oil.",
    "[00:01:42.000] When the puri floats, splash oil over it with a ladle to help it puff up perfectly.",
    "[00:02:00.000] You can eat these masala puris plain or with mint/cucumber raitha."
  ]
}