{
  "metadata": {
    "title": "Peanut Stuffed Brinjal Fry|పల్లీ గుత్తి వంకాయ|మా స్పెషల్ రెసిపీ|గుత్తి వంకాయ ఇలా చేస్తే ఇక వదలరు",
    "channel_name": "Vismai Food",
    "publish_date": "2020-02-15",
    "view_count": 564420,
    "like_count": 9664,
    "duration": "03:05",
    "language": "Telugu",
    "video_id": "NomR_3FrH9Q",
    "url": "https://www.youtube.com/watch?v=NomR_3FrH9Q",
    "description": "Unique and tasty Peanut Stuffed Brinjal Fry recipe. A special way to make Gutti Vankaya that you'll love!",
    "ingredients_detected": [
      "1/2 kg Tender Brinjals (లేత గుత్తి వంకాయలు)",
      "1/3 Cup Peanuts (వేరుశనగ పప్పు)",
      "1 tbsp Chana Dal (పచ్చి శనగపప్పు)",
      "1 tbsp Urad Dal (మినప్పప్పు)",
      "1/2 tsp Fenugreek seeds (మెంతులు)",
      "1 tbsp Sesame seeds (నువ్వులు)",
      "6-7 Garlic pods (వెల్లుల్లి రెబ్బలు)",
      "1 tsp Cumin (జీలకర్ర)",
      "2 Petals Tamarind (చింతపండు)",
      "1 tbsp Red Chilli Powder (కారం)",
      "Salt (to taste - రుచికి సరిపడా ఉప్పు)",
      "Oil for frying (వేయించడానికి సరిపడా నూనె)"
    ]
  },
  "transcription_telugu": [
    "[00:00:00.000] హలో ఫుడీస్, వెల్కమ్ టు విస్మయ్ ఫుడ్. ఇవాల్టి స్పెషల్ పల్లీ మసాలా గుత్తి వంకాయ వేపుడు. ఇది చాలా రుచిగా ఉంటుంది, ఒక్కసారి తింటే మళ్ళీ మళ్ళీ చేస్తారు.",
    "[00:00:21.000] ముందుగా అరకిలో లేత వంకాయలను తీసుకుని, ముచ్చిక వైపు నుండి నాలుగు గాట్లు పెట్టుకోవాలి. వంకాయ విడిపోకుండా సగం వరకు మాత్రమే కోయాలి.",
    "[00:00:40.000] బాణలిలో నూనె వేడి చేసి, వంకాయలను వేసి మెత్తబడే వరకు వేయించి పక్కన పెట్టుకోవాలి.",
    "[00:00:57.000] అదే నూనెలో 1/3 కప్పు వేరుశనగ పప్పు వేసి ఎర్రగా వేయించి తీసుకోవాలి.",
    "[00:01:05.000] ఇప్పుడు మరో పాన్ లో పచ్చి శనగపప్పు, మినప్పప్పు, మెంతులు వేసి దోరగా వేయించాలి. మెంతులు ఎర్రగా వేగితేనే రుచి బాగుంటుంది.",
    "[00:01:17.000] ఇందులో నువ్వులు, వెల్లుల్లి, జీలకర్ర వేసి చిటపటలాడే వరకు వేయించి, చివరగా కొద్దిగా చింతపండు వేసి దించాలి.",
    "[00:01:30.000] వేయించిన దినుసులన్నీ మిక్సీ జార్ లో వేసి, అందులో ఉప్పు, కారం కలిపి మెత్తని పొడిలా గ్రైండ్ చేయాలి.",
    "[00:01:40.000] వేయించి చల్లారిన వంకాయల్లోని గుజ్జును జాగ్రత్తగా తీసి, దానికి తయారు చేసిన పొడి మరియు వేయించిన పల్లీలను కలిపి స్టఫ్ చేయాలి.",
    "[00:02:15.000] వంకాయలు విడిపోకుండా మళ్ళీ యధావిధిగా సెట్ చేసి సర్వ్ చేయాలి.",
    "[00:02:40.000] ఇది వేడి వేడి నెయ్యి అన్నంలోకి చాలా అద్భుతంగా ఉంటుంది."
  ],
  "transcription_english": [
    "[00:00:00.000] Hello foodies, welcome to Vismai Food. Today's special is Peanut Masala Stuffed Brinjal Fry. It's incredibly delicious!",
    "[00:00:21.000] Take 1/2 kg tender brinjals and make four slits from the stalk side, cutting only halfway to keep them intact.",
    "[00:00:40.000] Heat oil in a pan, add brinjals, and fry until they become soft and change color.",
    "[00:00:57.000] In the same oil, fry 1/3 cup of peanuts until golden brown and keep aside.",
    "[00:01:05.000] In another pan, roast chana dal, urad dal, and fenugreek seeds. Roasting fenugreek well is key to the flavor.",
    "[00:01:17.000] Add sesame seeds, garlic, and cumin; sauté until sesame splutters, then add tamarind and turn off the heat.",
    "[00:01:30.000] Grind all roasted ingredients with salt and red chilli powder into a fine powder.",
    "[00:01:40.000] Gently remove the pulp from fried brinjals, mix it with the ground powder and fried peanuts, then stuff it back into the brinjals.",
    "[00:02:15.000] Reshape the brinjals carefully without breaking them and serve.",
    "[00:02:40.000] This pairs perfectly with hot rice and ghee."
  ]
}