{
  "metadata": {
    "title": "Street Style Veg Fried Rice|వెజ్ ఫ్రైడ్ రైస్|ప్రతీ వీధి చివర బండి మీద చేసే రుచికరమైన ఫ్రైడ్ రైస్",
    "channel_name": "Vismai Food",
    "publish_date": "2020-02-16",
    "view_count": 2321264,
    "like_count": 33746,
    "duration": "02:26",
    "language": "Telugu",
    "video_id": "6B_OhTrsCBE",
    "url": "https://www.youtube.com/watch?v=6B_OhTrsCBE",
    "description": "Quick and easy Street Style Veg Fried Rice recipe made with simple ingredients for an authentic taste.",
    "ingredients_detected": [
      "2 Cups Cooked Rice (ఉడికించిన అన్నం)",
      "2-3 tbsps Oil (నూనె)",
      "1 tbsp Chopped Garlic (వెల్లుల్లి తరుగు)",
      "1/2 Cup Chopped Cabbage (కోసిన క్యాబేజీ)",
      "1/4 Cup Chopped Carrots (క్యారెట్ ముక్కలు)",
      "1/4 Cup Chopped French Beans (బీన్స్ ముక్కలు)",
      "1/4 Cup Chopped Capsicum (క్యాప్సికమ్ ముక్కలు)",
      "1 tbsp Soy Sauce (సోయా సాస్)",
      "1 tbsp Vinegar (వినేగర్)",
      "1 tsp Green Chilli Sauce (పచ్చిమిర్చి సాస్)",
      "1/2 tsp Black Pepper Powder (మిరియాల పొడి)",
      "Salt (to taste - రుచికి సరిపడా ఉప్పు)",
      "Spring Onions (ఉల్లికాడలు)"
    ]
  },
  "transcription_telugu": [
    "[00:00:00.000] హలో ఫుడీస్, వెల్కమ్ టు విస్మయ్ ఫుడ్. ఈరోజు మనం రోడ్ సైడ్ బండి మీద దొరికే స్ట్రీట్ స్టైల్ వెజ్ ఫ్రైడ్ రైస్ ఎలా చేయాలో చూద్దాం.",
    "[00:00:38.000] ముందుగా ఒక పాన్ లేదా వొక్ లో నూనె వేడి చేసి, అందులో వెల్లుల్లి తరుగు వేసి హై ఫ్లేమ్ మీద వేయించాలి.",
    "[00:00:50.000] ఇప్పుడు క్యాబేజీ, క్యారెట్, బీన్స్ మరియు క్యాప్సికమ్ ముక్కలు వేసి నిమిషం పాటు హై ఫ్లేమ్ మీద టాస్ చేయాలి. కూరగాయలు పూర్తిగా ఉడకకూడదు, కొంచెం క్రంచీగా ఉండాలి.",
    "[00:01:10.000] ఇప్పుడు ఇందులో ఉడికించి చల్లార్చిన అన్నం వేయాలి. అన్నం పొడిపొడిగా ఉండటం ముఖ్యం.",
    "[00:01:21.000] అన్నం వేసిన తర్వాత సోయా సాస్, వినేగర్, గ్రీన్ చిల్లీ సాస్, మిరియాల పొడి మరియు తగినంత ఉప్పు వేయాలి.",
    "[00:01:45.000] వీటన్నింటినీ హై ఫ్లేమ్ మీద రెండు నిమిషాల పాటు బాగా టాస్ చేయాలి. అప్పుడే ఆ స్మోకీ ఫ్లేవర్ వస్తుంది.",
    "[00:02:10.000] చివరగా సన్నగా తరిగిన ఉల్లికాడలు (Spring Onions) చల్లుకుని సర్వ్ చేసుకోవాలి.",
    "[00:02:25.000] అంతే, ఎంతో రుచికరమైన స్ట్రీట్ స్టైల్ వెజ్ ఫ్రైడ్ రైస్ సిద్ధం."
  ],
  "transcription_english": [
    "[00:00:00.000] Hello foodies, welcome to Vismai Food. Today we will see how to make street-style Veg Fried Rice often found at roadside stalls.",
    "[00:00:38.000] Heat oil in a pan or wok, add chopped garlic, and sauté on high flame.",
    "[00:00:50.000] Add cabbage, carrots, beans, and capsicum. Toss them on high flame for a minute. The vegetables should remain crunchy and not be overcooked.",
    "[00:01:10.000] Now add cooked and cooled rice. It's important that the rice is grainy and not mushy.",
    "[00:01:21.000] After adding the rice, add soy sauce, vinegar, green chilli sauce, black pepper powder, and salt to taste.",
    "[00:01:45.000] Toss everything together on a very high flame for two minutes to get that signature smoky flavor.",
    "[00:02:10.000] Finally, sprinkle finely chopped spring onions and serve.",
    "[00:02:25.000] That's it! Delicious street-style Veg Fried Rice is ready."
  ]
}