{
  "metadata": {
    "title": "Mysore Masala Vada|Tasty Mysore Style Vada|మైసూరు మసాలా వడ|మామూలు మసాలా వడ కంటే ఎంతో రుచి ఆరోగ్యం",
    "channel_name": "Vismai Food",
    "publish_date": "2020-02-17",
    "view_count": 234775,
    "like_count": 4275,
    "duration": "02:17",
    "language": "Telugu",
    "video_id": "Gyfj1iYcCM8",
    "url": "https://www.youtube.com/watch?v=Gyfj1iYcCM8",
    "description": "Authentic Mysore style Masala Vada recipe. These are more flavorful and healthier compared to regular masala vadas.",
    "ingredients_detected": [
      "1 Cup Chana Dal (పచ్చి శనగపప్పు - soaked for 2-3 hours)",
      "1/4 Cup Toor Dal (కందిపప్పు - soaked for 2-3 hours)",
      "1/4 Cup Moong Dal (పెసరపప్పు - soaked for 2-3 hours)",
      "2-3 Green Chillies (పచ్చిమిర్చి)",
      "1 inch Ginger (అల్లం ముక్క)",
      "1 tsp Cumin (జీలకర్ర)",
      "1 Onion (sliced - ఉల్లిపాయ తరుగు)",
      "Handful of Dill Leaves (సమక్షం/సోయా కూర)",
      "Coriander Leaves (కొత్తిమీర)",
      "Curry Leaves (కరివేపాకు)",
      "Salt (to taste - రుచికి సరిపడా ఉప్పు)",
      "Oil for deep fry (వేయించడానికి సరిపడా నూనె)"
    ]
  },
  "transcription_telugu": [
    "[00:00:00.000] హలో ఫుడీస్, వెల్కమ్ టు విస్మయ్ ఫుడ్. ఇవాళ మనం ఎంతో రుచికరమైన, ఆరోగ్యకరమైన మైసూరు మసాలా వడ ఎలా చేయాలో చూద్దాం.",
    "[00:00:20.000] ముందుగా మూడు రకాల పప్పులను (శనగపప్పు, కందిపప్పు, పెసరపప్పు) కడిగి రెండు మూడు గంటల పాటు నానబెట్టుకోవాలి.",
    "[00:00:35.000] నానిన పప్పుల నుండి నీటిని పూర్తిగా వడకట్టి, అందులో కొద్దిగా పక్కన పెట్టుకుని మిగిలిన పప్పును మిక్సీ జార్ లో వేయాలి.",
    "[00:00:45.000] ఇందులో పచ్చిమిర్చి, అల్లం, జీలకర్ర వేసి నీళ్లు పోయకుండా కచ్చాపచ్చాగా (కోర్స్ గా) గ్రైండ్ చేసుకోవాలి.",
    "[00:01:00.000] ఈ పిండిని ఒక బౌల్ లోకి తీసుకుని, అందులో మనం పక్కన పెట్టుకున్న పప్పులు, ఉల్లిపాయ తరుగు, సోయా కూర (Dill leaves), కొత్తిమీర, కరివేపాకు మరియు ఉప్పు వేయాలి.",
    "[00:01:20.000] వీటన్నింటినీ బాగా కలిపి, చిన్న చిన్న ఉండలుగా చేసుకుని వడల్లా ఒత్తుకోవాలి.",
    "[00:01:40.000] బాణలిలో నూనె వేడి చేసి, వడలను మీడియం ఫ్లేమ్ మీద రెండు వైపులా బంగారు రంగు వచ్చే వరకు వేయించాలి.",
    "[00:02:00.000] వేడి వేడి మైసూరు మసాలా వడలు సిద్ధం. ఇవి అల్లం చట్నీ లేదా కొబ్బరి చట్నీతో చాలా బాగుంటాయి."
  ],
  "transcription_english": [
    "[00:00:00.000] Hello foodies, welcome to Vismai Food. Today we will see how to make delicious and healthy Mysore Masala Vada.",
    "[00:00:20.000] First, wash and soak three types of lentils (Chana dal, Toor dal, Moong dal) for two to three hours.",
    "[00:00:35.000] Drain the water completely, set aside a small portion of lentils, and put the rest in a mixer jar.",
    "[00:00:45.000] Add green chillies, ginger, and cumin; grind into a coarse paste without adding any water.",
    "[00:01:00.000] Transfer the batter to a bowl, add the reserved lentils, chopped onions, dill leaves, coriander, curry leaves, and salt.",
    "[00:01:20.000] Mix everything well, make small balls, and flatten them into vadas.",
    "[00:01:40.000] Heat oil in a pan and fry the vadas on medium flame until they turn golden brown on both sides.",
    "[00:02:00.000] Hot Mysore Masala Vadas are ready. They pair perfectly with ginger chutney or coconut chutney."
  ]
}