{
  "metadata": {
    "title": "Chitrannam|Mahashivarathri Special Prasadam|చిత్రాన్నం|శివాలయాల్లో ప్రేత్యేకంగా ఇచ్చే కమ్మని ప్రసాదం",
    "channel_name": "Vismai Food",
    "publish_date": "2020-02-20",
    "view_count": 823697,
    "like_count": 11343,
    "duration": "02:30",
    "language": "Telugu",
    "video_id": "fQxoGBk3IHU",
    "url": "https://www.youtube.com/watch?v=fQxoGBk3IHU",
    "description": "Authentic Temple Style Chitrannam recipe, specially prepared as Prasadam during Mahashivarathri. A flavorful lemon rice variant with a unique preparation style.",
    "ingredients_detected": [
      "1/2 Cup Rice (బియ్యం)",
      "1.5 Cups Water (నీళ్లు)",
      "2-3 tbsp Oil (నూనె)",
      "1 tsp Mustard Seeds (ఆవాలు)",
      "1 tsp Chana Dal (శనగపప్పు)",
      "1 tsp Urad Dal (మినపప్పు)",
      "2 tbsp Peanuts (పల్లీలు)",
      "2-3 Green Chillies (పచ్చిమిర్చి)",
      "2 Dried Red Chillies (ఎండుమిర్చి)",
      "1/4 tsp Turmeric Powder (పసుపు)",
      "Curry Leaves (కరివేపాకు)",
      "Salt (to taste - రుచికి సరిపడా ఉప్పు)",
      "1 Lemon (నిమ్మరసం)",
      "Coriander Leaves (కొత్తిమీర)"
    ]
  },
  "transcription_telugu": [
    "[00:00:00.000] హలో ఫుడీస్, వెల్కమ్ టు విస్మయ్ ఫుడ్. ఇవాళ మనం శివాలయాల్లో ప్రసాదంగా ఇచ్చే కమ్మని చిత్రాన్నం ఎలా చేయాలో చూద్దాం.",
    "[00:00:15.000] ముందుగా అర కప్పు బియ్యాన్ని తీసుకుని శుభ్రంగా కడిగి పక్కన పెట్టుకోవాలి.",
    "[00:00:30.000] ఒక పాన్ లో బియ్యాన్ని వేసి లో ఫ్లేమ్ మీద దోరగా వేయించాలి. ఇలా వేయించడం వల్ల ప్రసాదం చాలా రుచిగా వస్తుంది.",
    "[00:00:45.000] వేయించిన బియ్యంలో ఒకటిన్నర కప్పుల నీళ్లు పోసి, అన్నాన్ని పొడిపొడిగా వండుకోవాలి.",
    "[00:01:05.000] ఇప్పుడు పోపు కోసం ఒక బాణలిలో నూనె వేడి చేసి ఆవాలు, శనగపప్పు, మినపప్పు మరియు పల్లీలు వేసి వేయించాలి.",
    "[00:01:25.000] ఇందులో పచ్చిమిర్చి, ఎండుమిర్చి, కరివేపాకు మరియు పసుపు వేసి బాగా కలుపుకోవాలి.",
    "[00:01:45.000] వండి పెట్టుకున్న అన్నంలో ఈ పోపును, రుచికి సరిపడా ఉప్పును వేసి బాగా కలపాలి.",
    "[00:02:05.000] చివరగా నిమ్మరసం మరియు కొత్తిమీర తరుగు వేసి కలిపితే ఎంతో రుచికరమైన చిత్రాన్నం సిద్ధం."
  ],
  "transcription_english": [
    "[00:00:00.000] Hello foodies, welcome to Vismai Food. Today we will see how to make the delicious Chitrannam served as Prasadam in Shiva temples.",
    "[00:00:15.000] First, take half a cup of rice, wash it thoroughly and set it aside.",
    "[00:00:30.000] Roast the rice in a pan on low flame until slightly golden. Roasting the rice adds a unique taste to the Prasadam.",
    "[00:00:45.000] Add 1.5 cups of water to the roasted rice and cook it until the grains are separate and firm.",
    "[00:01:05.000] For the tempering, heat oil in a pan and fry mustard seeds, chana dal, urad dal, and peanuts.",
    "[00:01:25.000] Add green chillies, dried red chillies, curry leaves, and turmeric powder, then mix well.",
    "[00:01:45.000] Add this tempering and the required amount of salt to the cooked rice and mix thoroughly.",
    "[00:02:05.000] Finally, add lemon juice and chopped coriander leaves. Delicious Chitrannam is now ready."
  ]
}