{
  "metadata": {
    "title": "ChettinaduMasala Egg Fry|Spicy Egg Fry|చెట్టినాడు మసాలాఎగ్ ఫ్రై|దీని రుచి, సువాసన కి ఎవ్వరైనా ఫిదా",
    "channel_name": "Vismai Food",
    "publish_date": "2020-02-22",
    "view_count": 762777,
    "like_count": 12924,
    "duration": "02:36",
    "language": "Telugu",
    "video_id": "Gn-YA9O3HYk",
    "url": "https://www.youtube.com/watch?v=Gn-YA9O3HYk",
    "description": "Authentic and spicy Chettinadu style Egg Fry recipe. The aroma and taste of this special masala will make everyone a fan!",
    "ingredients_detected": [
      "4-5 Boiled Eggs (ఉడికించిన కోడిగుడ్లు)",
      "2 tbsps Oil (నూనె)",
      "1 tsp Fennel Seeds (సోంపు)",
      "1 sprig Curry Leaves (కరివేపాకు)",
      "2 Onions (chopped - ఉల్లిపాయ తరుగు)",
      "1 tsp Ginger Garlic Paste (అల్లం వెల్లుల్లి పేస్ట్)",
      "2 Dry Red Chillies (ఎండుమిర్చి)",
      "1 tbsp Coriander Seeds (ధనియాలు)",
      "1 tsp Cumin Seeds (జీలకర్ర)",
      "1/2 tsp Black Pepper (మిరియాలు)",
      "2-3 Cloves (లవంగాలు)",
      "1 inch Cinnamon (దాల్చిన చెక్క)",
      "1/4 tsp Turmeric Powder (పసుపు)",
      "Salt (to taste - రుచికి సరిపడా ఉప్పు)",
      "Coriander Leaves (కొత్తిమీర తరుగు)"
    ]
  },
  "transcription_telugu": [
    "[00:00:00.000] హలో ఫుడీస్, వెల్కమ్ టు విస్మయ్ ఫుడ్. ఇవాళ మనం ఎంతో రుచికరమైన, స్పైసీ చెట్టినాడు మసాలా ఎగ్ ఫ్రై ఎలా చేయాలో చూద్దాం.",
    "[00:00:25.000] ముందుగా ఒక పాన్ లో ధనియాలు, జీలకర్ర, మిరియాలు, లవంగాలు, దాల్చిన చెక్క మరియు ఎండుమిర్చి వేసి లో ఫ్లేమ్ మీద దోరగా వేయించాలి.",
    "[00:00:45.000] ఈ మసాలా దినుసులు చల్లారాక మిక్సీ పట్టి మెత్తని పొడిలా చేసి పక్కన పెట్టుకోవాలి.",
    "[00:01:00.000] ఇప్పుడు అదే పాన్ లో నూనె వేడి చేసి సోంపు, కరివేపాకు వేసి చిటపటలాడించాలి.",
    "[00:01:15.000] ఇందులో ఉల్లిపాయ ముక్కలు వేసి గోల్డెన్ బ్రౌన్ కలర్ వచ్చే వరకు వేయించి, అల్లం వెల్లుల్లి పేస్ట్ వేసి పచ్చి వాసన పోయే వరకు వేపాలి.",
    "[00:01:35.000] ఇప్పుడు పసుపు, ఉప్పు మరియు మనం తయారు చేసుకున్న చెట్టినాడు మసాలా పొడి వేసి బాగా కలపాలి.",
    "[00:01:50.000] ఉడికించి గాట్లు పెట్టిన కోడిగుడ్లను ఇందులో వేసి మసాలా అంతా గుడ్లకు పట్టేలా ఐదు నిమిషాల పాటు తక్కువ మంట మీద ఫ్రై చేయాలి.",
    "[00:02:15.000] చివరగా కొత్తిమీర చల్లుకుంటే ఘుమఘుమలాడే చెట్టినాడు ఎగ్ ఫ్రై రెడీ. ఇది అన్నం లేదా రోటీలోకి చాలా బాగుంటుంది."
  ],
  "transcription_english": [
    "[00:00:00.000] Hello foodies, welcome to Vismai Food. Today we'll see how to make the delicious and spicy Chettinadu Masala Egg Fry.",
    "[00:00:25.000] First, roast coriander seeds, cumin, black pepper, cloves, cinnamon, and dry red chillies in a pan on low flame.",
    "[00:00:45.000] Once cooled, grind these spices into a fine powder and keep it aside.",
    "[00:01:00.000] In the same pan, heat oil and add fennel seeds and curry leaves.",
    "[00:01:15.000] Add chopped onions and fry until golden brown, then add ginger-garlic paste and sauté until the raw smell goes away.",
    "[00:01:35.000] Now add turmeric, salt, and the prepared Chettinadu masala powder; mix well.",
    "[00:01:50.000] Add boiled eggs with small slits and fry on low flame for five minutes so the masala coats the eggs perfectly.",
    "[00:02:15.000] Finally, sprinkle coriander leaves; the aromatic Chettinadu Egg Fry is ready. It pairs great with rice or roti."
  ]
}