{
  "metadata": {
    "title": "ONION CHAPATI | Easy Soft Chapati | Best recipe for Lunch box | ఉల్లిపాయ చపాతీ | Onion Parata | VismaiFood",
    "channel_name": "Vismai Food",
    "publish_date": "2020-02-23",
    "view_count": 1988798,
    "like_count": 20357,
    "duration": "02:48",
    "language": "Telugu",
    "video_id": "Ip-aOdj-PIo",
    "url": "https://www.youtube.com/watch?v=Ip-aOdj-PIo",
    "description": "Easy and soft Onion Chapati (Onion Paratha) recipe. Perfect for lunch boxes and quick meals. No side dish required, tastes great with curd or chutney.",
    "ingredients_detected": [
      "2 Cups Wheat Flour (గోధుమ పిండి)",
      "1-2 Green Chillies (finely chopped - పచ్చిమిర్చి తరుగు)",
      "1/2 Cup Finely Chopped Onions (ఉల్లిపాయ తరుగు)",
      "1/2 Cup Spring Onion Greens (ఉల్లికాడల తరుగు)",
      "Salt (to taste - రుచికి సరిపడా ఉప్పు)",
      "1 tsp Garam Masala (గరం మసాలా)",
      "1 tsp Chilli Powder (కారం)",
      "Water (as needed - తగినంత నీళ్లు)",
      "Oil (for roasting - కాల్చడానికి నూనె)"
    ]
  },
  "transcription_telugu": [
    "[00:00:00.000] హలో ఫుడీస్, వెల్కమ్ టు విస్మయ్ ఫుడ్. ఇవాళ మనం ఎంతో రుచికరమైన, మెత్తని ఉల్లిపాయ చపాతీ ఎలా చేయాలో చూద్దాం.",
    "[00:00:15.000] ఇవి లంచ్ బాక్స్ లకి చాలా బాగుంటాయి, గంటల తరబడి మెత్తగా ఉంటాయి. వీటికి విడిగా కూర కూడా అవసరం లేదు.",
    "[00:00:30.000] ముందుగా రెండు కప్పుల గోధుమ పిండి తీసుకుని, అందులో పచ్చిమిర్చి తరుగు, ఉల్లిపాయ తరుగు మరియు ఉల్లికాడల తరుగు వేయాలి.",
    "[00:00:45.000] ఇందులో ఉప్పు, గరం మసాలా, కారం వేసి ఉల్లిపాయలని పిండుతూ పిండిని బాగా కలపాలి.",
    "[00:01:00.000] కొద్ది కొద్దిగా నీళ్లు పోస్తూ పిండిని సాఫ్ట్ గా కలుపుకోవాలి. ఉల్లిపాయల్లో నీరు ఉంటుంది కాబట్టి నీళ్లు చూసి పోసుకోవాలి.",
    "[00:01:15.000] పిండిని 30 నిమిషాల పాటు నాననివ్వాలి. ఆ తర్వాత సమాన భాగాలుగా చేసుకుని పల్చగా ఒత్తుకోవాలి.",
    "[00:01:35.000] వేడి పెనం మీద చపాతీని వేసి, రెండు వైపులా కొద్దిగా కాలాక నూనె రాస్తూ కాల్చుకోవాలి.",
    "[00:02:00.000] వేడి వేడి ఉల్లిపాయ చపాతీలు సిద్ధం. ఇవి రైతాతో లేదా ఏదైనా చట్నీతో చాలా రుచిగా ఉంటాయి."
  ],
  "transcription_english": [
    "[00:00:00.000] Hello foodies, welcome to Vismai Food. Today we will see how to make delicious and soft Onion Chapatis.",
    "[00:00:15.000] These are perfect for lunch boxes as they stay soft for hours. You don't even need a separate curry for these.",
    "[00:00:30.000] First, take two cups of wheat flour and add chopped green chillies, onions, and spring onion greens.",
    "[00:00:45.000] Add salt, garam masala, and chilli powder. Mix well by pressing the onions into the flour.",
    "[00:01:00.000] Gradually add water and knead into a soft dough. Be careful with water as onions also release moisture.",
    "[00:01:15.000] Let the dough rest for 30 minutes. Then divide into equal balls and roll them out thinly.",
    "[00:01:35.000] Place on a hot tawa, roast slightly on both sides, then apply oil and fry until golden brown.",
    "[00:02:00.000] Hot Onion Chapatis are ready. They pair perfectly with raitha or any chutney."
  ]
}