{
  "metadata": {
    "title": "Jaggery Dosai| Instant Sweet Dosa|బెల్లం అట్లు|అప్పటికప్పుడు చేసుకునే కమ్మటి అట్లు. In just 5 mins",
    "channel_name": "Vismai Food",
    "publish_date": "2020-02-25",
    "view_count": 463518,
    "like_count": 7264,
    "duration": "02:25",
    "language": "Telugu",
    "video_id": "9vpqlMnHbYg",
    "url": "https://www.youtube.com/watch?v=9vpqlMnHbYg",
    "description": "Sweet and healthy Jaggery Dosa (Bellam Atlu) recipe that can be made instantly in just 5 minutes.",
    "ingredients_detected": [
      "1 Cup Wheat Flour (గోధుమ పిండి)",
      "1/2 Cup Jaggery (తురిమిన బెల్లం)",
      "1/4 tsp Cardamom Powder (యాలకుల పొడి)",
      "A pinch of Salt (చిటికెడు ఉప్పు)",
      "Water as needed (తగినన్ని నీళ్లు)",
      "Ghee or Oil for frying (నెయ్యి లేదా నూనె)"
    ]
  },
  "transcription_telugu": [
    "[00:00:00.000] హలో ఫుడీస్, వెల్కమ్ టు విస్మయ్ ఫుడ్. ఈరోజు మనం అప్పటికప్పుడు కేవలం 5 నిమిషాల్లో చేసుకునే కమ్మటి బెల్లం అట్లు ఎలా చేయాలో చూద్దాం.",
    "[00:00:25.000] ముందుగా ఒక గిన్నెలో అర కప్పు తురిమిన బెల్లం తీసుకుని, అందులో కొద్దిగా నీళ్లు పోసి బెల్లం కరిగే వరకు కలపాలి.",
    "[00:00:45.000] బెల్లం కరిగిన తర్వాత ఆ నీటిని వడకట్టి వేరొక బౌల్ లోకి తీసుకోవాలి.",
    "[00:00:55.000] ఇప్పుడు అందులో ఒక కప్పు గోధుమ పిండి, యాలకుల పొడి మరియు చిటికెడు ఉప్పు వేయాలి.",
    "[00:01:10.000] ఉండలు లేకుండా దోస పిండిలా జారుడుగా కలుపుకోవాలి. అవసరమైతే మరికొన్ని నీళ్లు పోసుకోవచ్చు.",
    "[00:01:35.000] స్టవ్ మీద పెనం వేడి చేసి, కొద్దిగా నెయ్యి రాసి, పిండిని దోసలా పోసుకోవాలి.",
    "[00:01:55.000] మంటను మీడియం ఫ్లేమ్ లో ఉంచి, రెండు వైపులా ఎర్రగా కాలే వరకు కాల్చుకోవాలి.",
    "[00:02:15.000] అంతే, ఎంతో రుచికరమైన బెల్లం అట్లు సిద్ధం. ఇవి పిల్లలకు స్నాక్ గా లేదా బ్రేక్ ఫాస్ట్ గా చాలా బాగుంటాయి."
  ],
  "transcription_english": [
    "[00:00:00.000] Hello foodies, welcome to Vismai Food. Today we will see how to make delicious Jaggery Dosa in just 5 minutes.",
    "[00:00:25.000] First, take half a cup of grated jaggery in a bowl, add some water, and mix until the jaggery dissolves.",
    "[00:00:45.000] Once the jaggery has dissolved, strain the water into another bowl.",
    "[00:00:55.000] Now add one cup of wheat flour, cardamom powder, and a pinch of salt.",
    "[00:01:10.000] Mix it into a smooth, pourable batter like dosa batter, ensuring there are no lumps.",
    "[00:01:35.000] Heat a tawa, apply some ghee, and pour the batter to make a dosa.",
    "[00:01:55.000] Cook on medium flame until both sides turn golden brown.",
    "[00:02:15.000] That's it! Tasty Jaggery Dosa is ready. These are great as a snack or breakfast for kids."
  ]
}