{
  "metadata": {
    "title": "Coconut Payasam|Rich Creamy Payasam|కొబ్బరి పాయసం|ఎంత తిన్నా తనివి తీరని గొప్ప పాయసం|సమ్మర్ స్పెషల్",
    "channel_name": "Vismai Food",
    "publish_date": "2020-02-26",
    "view_count": 1263744,
    "like_count": 18607,
    "duration": "02:51",
    "language": "Telugu",
    "video_id": "uMcGNCqdtyY",
    "url": "https://www.youtube.com/watch?v=uMcGNCqdtyY",
    "description": "Rich and creamy Coconut Payasam (Kobbari Payasam) recipe. A refreshing and delicious dessert perfect for summers and special occasions.",
    "ingredients_detected": [
      "1 Fresh Coconut (పచ్చి కొబ్బరి - grated or pieces)",
      "1/2 Cup Sago (సగ్గుబియ్యం - soaked for 1 hour)",
      "1/2 Cup Sugar or Jaggery (చక్కెర లేదా బెల్లం)",
      "2-3 Cups Milk (పాలు)",
      "1/2 tsp Cardamom Powder (యాలకుల పొడి)",
      "2 tbsp Ghee (నెయ్యి)",
      "Handful of Cashews and Raisins (జీడిపప్పు, కిస్మిస్)",
      "Small piece of Ginger or Dry Ginger (optional - అల్లం/శొంఠి)"
    ]
  },
  "transcription_telugu": [
    "[00:00:00.000] హలో ఫుడీస్, వెల్కమ్ టు విస్మయ్ ఫుడ్. ఇవాళ మనం ఎంతో కమ్మని, రిచ్ గా ఉండే కొబ్బరి పాయసం ఎలా చేయాలో చూద్దాం.",
    "[00:00:20.000] ముందుగా పచ్చి కొబ్బరిని ముక్కలుగా కోసి, కొద్దిగా నీళ్లు పోసి మెత్తని పేస్ట్ లా గ్రైండ్ చేసుకోవాలి.",
    "[00:00:40.000] ఒక గంట పాటు నానబెట్టిన సగ్గుబియ్యాన్ని నీళ్లలో వేసి మెత్తగా ఉడికించుకోవాలి.",
    "[00:01:00.000] సగ్గుబియ్యం ఉడికాక, అందులో మనం గ్రైండ్ చేసి పెట్టుకున్న కొబ్బరి పాలు లేదా కొబ్బరి పేస్ట్ వేసి కలపాలి.",
    "[00:01:20.000] ఇందులో పాలు మరియు చక్కెర వేసి మరిగించాలి. పాయసం చిక్కబడే వరకు కలుపుతూ ఉండాలి.",
    "[00:01:45.000] పాయసం చిక్కబడ్డాక యాలకుల పొడి వేసి స్టవ్ ఆఫ్ చేసుకోవాలి.",
    "[00:02:10.000] వేరే పాన్ లో నెయ్యి వేడి చేసి జీడిపప్పు, కిస్మిస్ బంగారు రంగు వచ్చేవరకు వేయించి పాయసంలో కలపాలి.",
    "[00:02:30.000] ఎంతో రుచికరమైన కొబ్బరి పాయసం సిద్ధం. ఇది వేడిగా లేదా చల్లగా సర్వ్ చేసుకున్నా చాలా బాగుంటుంది."
  ],
  "transcription_english": [
    "[00:00:00.000] Hello foodies, welcome to Vismai Food. Today we will see how to make a very delicious and rich Coconut Payasam.",
    "[00:00:20.000] First, cut fresh coconut into pieces and grind them into a smooth paste by adding a little water.",
    "[00:00:40.000] Boil the sago (sabudana), which has been soaked for an hour, in water until it becomes soft and transparent.",
    "[00:01:00.000] Once the sago is cooked, add the ground coconut paste or coconut milk to it and mix well.",
    "[00:01:20.000] Add milk and sugar, and bring it to a boil. Keep stirring until the payasam thickens.",
    "[00:01:45.000] After the payasam reaches the desired consistency, add cardamom powder and turn off the stove.",
    "[00:02:10.000] In a separate pan, heat ghee and fry cashews and raisins until golden brown, then add them to the payasam.",
    "[00:02:30.000] Delicious Coconut Payasam is ready. It tastes great whether served hot or chilled."
  ]
}