{
  "metadata": {
    "title": "Brinjal Peas Fry|Best Spicy Fry For Rice|వంకాయ బటాని ఫ్రై|గుంటూరు, ప్రకాశం జిల్లా పెళ్ళిళ్ళ స్పెషల్",
    "channel_name": "Vismai Food",
    "publish_date": "2020-02-28",
    "view_count": 255039,
    "like_count": 4124,
    "duration": "03:23",
    "language": "Telugu",
    "video_id": "Oe22wHsZWuU",
    "url": "https://www.youtube.com/watch?v=Oe22wHsZWuU",
    "description": "Guntur and Prakasam district wedding special Brinjal Peas Fry recipe. A perfect spicy side dish for rice.",
    "ingredients_detected": [
      "250gms Brinjals (వంకాయలు)",
      "1/2 Cup Fresh or Frozen Peas (బఠానీలు)",
      "3 tbsps Oil (నూనె)",
      "1 tsp Mustard Seeds (ఆవాలు)",
      "1 tsp Cumin Seeds (జీలకర్ర)",
      "1 tbsp Chana Dal (పచ్చి శనగపప్పు)",
      "1 tbsp Urad Dal (మినప్పప్పు)",
      "2 Dry Red Chillies (ఎండుమిర్చి)",
      "1 sprig Curry Leaves (కరివేపాకు)",
      "1 Onion (chopped - ఉల్లిపాయ తరుగు)",
      "1/2 tsp Turmeric Powder (పసుపు)",
      "1 tbsp Ginger-Garlic Paste (అల్లం వెల్లుల్లి పేస్ట్)",
      "1 tbsp Roasted Peanut Powder (పల్లీల పొడి)",
      "1 tsp Red Chilli Powder (కారం)",
      "Salt (to taste - రుచికి సరిపడా ఉప్పు)"
    ]
  },
  "transcription_telugu": [
    "[00:00:00.000] హలో ఫుడీస్, వెల్కమ్ టు విస్మయ్ ఫుడ్. ఇవాళ మనం గుంటూరు, ప్రకాశం జిల్లాల్లో పెళ్లిళ్లలో చేసే స్పెషల్ వంకాయ బఠానీ ఫ్రై ఎలా చేయాలో చూద్దాం.",
    "[00:00:25.000] ముందుగా వంకాయలను చిన్న ముక్కలుగా కోసి ఉప్పు నీళ్లలో వేయాలి. ఇలా చేయడం వల్ల వంకాయలు నల్లబడవు.",
    "[00:00:45.000] బాణలిలో నూనె వేడి చేసి ఆవాలు, జీలకర్ర, పచ్చి శనగపప్పు, మినప్పప్పు, ఎండుమిర్చి మరియు కరివేపాకు వేసి పోపు వేయించాలి.",
    "[00:01:05.000] పోపు వేగాక ఉల్లిపాయ ముక్కలు, పసుపు వేసి ఉల్లిపాయలు మెత్తబడే వరకు వేయించాలి.",
    "[00:01:25.000] ఇప్పుడు అల్లం వెల్లుల్లి పేస్ట్ వేసి పచ్చి వాసన పోయే వరకు వేపి, వంకాయ ముక్కలు మరియు బఠానీలు వేయాలి.",
    "[00:01:45.000] తగినంత ఉప్పు వేసి మూత పెట్టి ఐదు నిమిషాల పాటు తక్కువ మంట మీద వంకాయలు మెత్తబడే వరకు ఉడికించాలి.",
    "[00:02:10.000] వంకాయలు ఉడికిన తర్వాత కారం, వేయించిన పల్లీల పొడి వేసి బాగా కలపాలి. ఈ పల్లీల పొడి వల్ల కూరకు మంచి రుచి వస్తుంది.",
    "[00:02:40.000] రెండు నిమిషాల పాటు వేయించి స్టవ్ ఆపేయాలి. ఎంతో రుచికరమైన వంకాయ బఠానీ ఫ్రై రెడీ."
  ],
  "transcription_english": [
    "[00:00:00.000] Hello foodies, welcome to Vismai Food. Today we will see how to make the special Brinjal Peas Fry often served at weddings in Guntur and Prakasam districts.",
    "[00:00:25.000] First, cut the brinjals into small pieces and soak them in salt water to prevent discoloration.",
    "[00:00:45.000] Heat oil in a pan and add mustard seeds, cumin, chana dal, urad dal, dry red chillies, and curry leaves for tempering.",
    "[00:01:05.000] Once the tempering is fried, add chopped onions and turmeric; sauté until onions become soft.",
    "[00:01:25.000] Add ginger-garlic paste, sauté until the raw smell goes, then add the brinjal pieces and peas.",
    "[00:01:45.000] Add salt, cover with a lid, and cook on low flame for five minutes until the brinjals are tender.",
    "[00:02:10.000] Once cooked, add red chilli powder and roasted peanut powder; mix well. The peanut powder gives a great taste to the fry.",
    "[00:02:40.000] Fry for two more minutes and turn off the heat. Delicious Brinjal Peas Fry is ready."
  ]
}