{
  "metadata": {
    "title": "Andhra Style Potato Curry|Best Spicy Curry|బంగాళదుంప పిడుపు|పాతకాలం తెలుగు వంట|ఈ కూరతో తృప్తి గారంటీ",
    "channel_name": "Vismai Food",
    "publish_date": "2020-03-02",
    "view_count": 420360,
    "like_count": 6852,
    "duration": "02:51",
    "language": "Telugu",
    "video_id": "e7ddz2xuhx0",
    "url": "https://www.youtube.com/watch?v=e7ddz2xuhx0",
    "description": "Traditional Andhra style Potato Curry (Bangaladumpa Pidupu). A spicy, old-fashioned Telugu recipe that is both satisfying and flavorful.",
    "ingredients_detected": [
      "500g Potatoes (బంగాళదుంపలు - boiled and mashed)",
      "2-3 tbsp Oil (నూనె)",
      "2 Medium Onions (chopped - ఉల్లిపాయ తరుగు)",
      "2-3 Green Chillies (పచ్చిమిర్చి)",
      "Curry Leaves (కరివేపాకు)",
      "1 tsp Turmeric Powder (పసుపు)",
      "Salt (to taste - రుచికి సరిపడా ఉప్పు)",
      "For Spice Paste (మసాలా ముద్ద):",
      "1 tbsp Coriander Seeds (ధనియాలు)",
      "1 inch Cinnamon (దాల్చిన చెక్క)",
      "3-4 Cloves (లవంగాలు)",
      "2 Cardamoms (యాలకులు)",
      "1 tsp Poppy Seeds (గసగసాలు)",
      "5-6 Garlic Cloves (వెల్లుల్లి)",
      "1 inch Ginger (అల్లం)",
      "2 tbsp Fresh Coconut pieces (పచ్చి కొబ్బరి ముక్కలు)"
    ]
  },
  "transcription_telugu": [
    "[00:00:00.000] హలో ఫుడీస్, వెల్కమ్ టు విస్మయ్ ఫుడ్. ఇవాళ మనం పాతకాలపు పద్ధతిలో చేసే బంగాళదుంప పిడుపు ఎలా చేయాలో చూద్దాం.",
    "[00:00:25.000] ముందుగా మసాలా కోసం ధనియాలు, దాల్చిన చెక్క, లవంగాలు, యాలకులు, గసగసాలు, వెల్లుల్లి, అల్లం మరియు పచ్చి కొబ్బరి వేసి కొద్దిగా నీళ్లు పోసి మెత్తని పేస్ట్ లా గ్రైండ్ చేయాలి.",
    "[00:00:47.000] బంగాళదుంపలను ప్రెషర్ కుక్కర్ లో వేసి తగినంత నీరు పోసి మూడు విజిల్స్ వచ్చే వరకు ఉడికించాలి.",
    "[00:00:55.000] ఉడికిన దుంపల పొట్టు తీసి, వాటిని చేత్తో మరీ మెత్తగా కాకుండా కచ్చాపచ్చాగా (పిడుపులా) మెదుపుకోవాలి.",
    "[00:01:05.000] బాణలిలో నూనె వేడి చేసి, ఉల్లిపాయ తరుగు, పచ్చిమిర్చి మరియు కరివేపాకు వేసి వేయించాలి.",
    "[00:01:28.000] ఉల్లిపాయలు వేగాక, మనం సిద్ధం చేసుకున్న మసాలా పేస్ట్ వేసి పచ్చి వాసన పోయే వరకు వేయించాలి.",
    "[00:01:40.000] ఇందులో పసుపు, ఉప్పు మరియు మనం మెదిపి పెట్టుకున్న బంగాళదుంప మిశ్రమాన్ని వేసి బాగా కలపాలి.",
    "[00:02:10.000] మసాలా అంతా దుంపలకు పట్టేలా ఐదు నిమిషాలు మగ్గనిచ్చి, చివరగా కొత్తిమీర చల్లుకుని దించుకోవాలి."
  ],
  "transcription_english": [
    "[00:00:00.000] Hello foodies, welcome to Vismai Food. Today we will see how to make 'Bangaladumpa Pidupu', an old-fashioned potato curry.",
    "[00:00:25.000] For the masala paste, grind coriander seeds, cinnamon, cloves, cardamoms, poppy seeds, garlic, ginger, and fresh coconut into a smooth paste using a little water.",
    "[00:00:47.000] Place the potatoes in a pressure cooker with enough water and cook for about three whistles.",
    "[00:00:55.000] Peel the boiled potatoes and mash them roughly with your hands (crumbling style) instead of making a fine paste.",
    "[00:01:05.000] Heat oil in a pan and sauté chopped onions, green chillies, and curry leaves.",
    "[00:01:28.000] Once onions are fried, add the prepared masala paste and sauté until the raw smell disappears.",
    "[00:01:40.000] Add turmeric powder, salt, and the mashed potato mixture, and mix everything thoroughly.",
    "[00:02:10.000] Let it cook for five minutes so the spices coat the potatoes well. Finally, garnish with coriander leaves and turn off the heat."
  ]
}