{
  "metadata": {
    "title": "Restaurant Style Curd Rice | రెస్టారంట్ స్టైల్ కర్డ్ రైస్ | వెన్నలా కరిగిపోయే పెరుగన్నం",
    "channel_name": "Vismai Food",
    "publish_date": "2018-12-06",
    "view_count": 3635211,
    "like_count": 48886,
    "duration": "02:40",
    "language": "Telugu",
    "video_id": "akwa_B3DFus",
    "url": "https://www.youtube.com/watch?v=akwa_B3DFus",
    "description": "Learn the secret behind smooth and creamy Restaurant Style Curd Rice with tips from Vismai Food.",
    "ingredients_detected": [
      "1/2 Cup Rice (soaked for 30 mins)",
      "1 Litre Water",
      "2 tbsps Milk",
      "1/2 Inch Ginger (chopped)",
      "1 Green Chilli (finely chopped)",
      "500gms Fresh Curd",
      "1/4 Cup Cream",
      "3 tbsps Oil",
      "1 tsp Chana dal",
      "4 Dry Red chillies",
      "1 tsp Mustard seeds",
      "1 tsp Cumin seeds",
      "10-15 Cashews",
      "2 Sprigs Curry leaves",
      "Grated Carrot (for garnish)",
      "Pomegranate seeds (optional)",
      "Salt (to taste)"
    ]
  },
  "transcription_telugu": [
    "[00:00:00.000] హలో ఫుడీస్, వెల్కమ్ టు విస్మయ్ ఫుడ్. ఇవాల్టి స్పెషల్ రెస్టారెంట్ స్టైల్ కర్డ్ రైస్.",
    "[00:00:10.000] ఇది వెన్నలా కరిగిపోయేలా చాలా క్రీమీగా ఉంటుంది. దీని తయారీలో ఒక సీక్రెట్ ఇంగ్రీడియంట్ ఉంది.",
    "[00:00:30.000] అర కప్పు బియ్యాన్ని (అరగంట నానబెట్టినవి) కుక్కర్ లో వేసి ఒక లీటర్ నీళ్లు, రెండు స్పూన్ల పాలు పోసి ఉడికించాలి.",
    "[00:00:45.000] అన్నం మెత్తగా, సంగటిలా ఉడికిన తర్వాత గరిటెతో బాగా మెదపాలి.",
    "[00:00:58.000] ఇందులో అల్లం తరుగు, పచ్చిమిర్చి తరుగు, ఉప్పు వేసి కలిపి పూర్తిగా చల్లారనివ్వాలి.",
    "[00:01:10.000] అన్నం చల్లారిన తర్వాత 500 గ్రాముల కమ్మని పెరుగు వేసి కలపాలి. పెరుగు పుల్లగా ఉండకూడదు.",
    "[00:01:23.000] సీక్రెట్ ఇంగ్రీడియంట్: పావు కప్పు ఫ్రెష్ క్రీమ్ వేసి బాగా కలపండి. దీనివల్ల పెరుగన్నం చాలా కమ్మగా వస్తుంది.",
    "[00:01:35.000] పోపు కోసం నూనె వేడి చేసి శనగపప్పు, ఎండుమిర్చి, ఆవాలు, జీలకర్ర, జీడిపప్పు, కరివేపాకు వేసి వేయించండి.",
    "[00:01:55.000] తాలింపును వడకట్టి ఆ ఆయిల్ తో కూడిన పోపును పెరుగన్నంలో కలిపి గంట సేపు ఫ్రిజ్ లో ఉంచండి.",
    "[00:02:10.000] సర్వ్ చేసే ముందు క్యారెట్ తురుము, తాలింపు, నచ్చితే దానిమ్మ గింజలతో గార్నిష్ చేయండి."
  ],
  "transcription_english": [
    "[00:00:00.000] Hello Foodies, welcome to Vismai Food. Today's special is Restaurant Style Curd Rice.",
    "[00:00:10.000] It's incredibly creamy and melts in the mouth. There's a secret ingredient in its preparation.",
    "[00:00:30.000] In a cooker, take 1/2 cup rice (soaked for 30 mins), add 1 litre water and 2 tbsps milk; cook until soft.",
    "[00:00:45.000] Once the rice is cooked into a mushy consistency, mash it well with a ladle.",
    "[00:00:58.000] Add chopped ginger, green chillies, and salt; mix and let it cool down completely.",
    "[00:01:10.000] After it cools, add 500g fresh curd; ensure the curd is not sour.",
    "[00:01:23.000] Secret Ingredient: Add 1/4 cup fresh cream and mix well for that restaurant-style richness.",
    "[00:01:35.000] For tempering, heat oil and fry chana dal, red chillies, mustard, cumin, cashews, and curry leaves.",
    "[00:01:55.000] Strain the tempering and mix it into the curd rice; refrigerate for an hour before serving.",
    "[00:02:10.000] Before serving, garnish with grated carrots, some tempering, and pomegranate seeds if you like."
  ]
}