{
  "metadata": {
    "title": "Andhra Special Mix veg Pulusu|ముక్కల పులుసు|జుర్రుకుంటూ తాగేంత రుచిగా ఉంటుంది, ఇలాగాని పులుసు పెడితే",
    "channel_name": "Vismai Food",
    "publish_date": "2020-03-06",
    "view_count": 458966,
    "like_count": 7552,
    "duration": "04:01",
    "language": "Telugu",
    "video_id": "wX6BYZG_UfU",
    "url": "https://www.youtube.com/watch?v=wX6BYZG_UfU",
    "description": "Authentic Andhra style Mixed Vegetable Pulusu (Mukkala Pulusu) recipe. A comforting and flavorful tamarind-based stew.",
    "ingredients_detected": [
      "Tamarind (చింతపండు - Large lemon size)",
      "Drumsticks (మునక్కాయలు)",
      "Bottle Gourd (ఆనపకాయ/సొరకాయ ముక్కలు)",
      "Sweet Potato (చిలగడదుంప ముక్కలు)",
      "Yellow Cucumber (దోసకాయ ముక్కలు)",
      "Lady's Finger (బెండకాయలు)",
      "Red Pumpkin (గుమ్మడికాయ ముక్కలు)",
      "Green Chillies (పచ్చిమిర్చి)",
      "Onion (ఉల్లిపాయ)",
      "Tomato (టొమాటో)",
      "Turmeric Powder (పసుపు)",
      "Red Chilli Powder (కారం)",
      "Jaggery (బెల్లం)",
      "Salt (ఉప్పు)",
      "Rice Flour (బియ్యం పిండి - for thickening)",
      "For Tempering: Oil, Mustard seeds, Cumin seeds, Fenugreek seeds, Dry Red Chillies, Curry leaves, Hing."
    ]
  },
  "transcription_telugu": [
    "[00:00:00.000] హలో ఫుడీస్, వెల్కమ్ టు విస్మయ్ ఫుడ్. ఇవాళ మనం ఆంధ్రా వారి స్పెషల్ ముక్కల పులుసు ఎలా చేయాలో చూద్దాం.",
    "[00:00:30.000] ముందుగా ఒక పెద్ద నిమ్మకాయ సైజు చింతపండును నానబెట్టి రసం తీసి పక్కన పెట్టుకోవాలి.",
    "[00:00:45.000] ఒక వెడల్పాటి గిన్నెలో మునక్కాయలు, సొరకాయ, దోసకాయ, చిలగడదుంప, బెండకాయ ముక్కలు మరియు పచ్చిమిర్చి వేయాలి.",
    "[00:01:10.000] ఇందులో తగినంత నీరు పోసి, పసుపు మరియు ఉప్పు వేసి ముక్కలను ముప్పావు వంతు ఉడికించాలి.",
    "[00:01:45.000] ముక్కలు ఉడికాక అందులో తీసి పెట్టుకున్న చింతపండు పులుసు, కారం మరియు కొద్దిగా బెల్లం వేయాలి. పులుసుకి బెల్లం మంచి రుచిని ఇస్తుంది.",
    "[00:02:20.000] పులుసు మరిగేటప్పుడు రెండు చెంచాల బియ్యం పిండిని నీళ్లలో కలిపి అందులో పోయాలి, దీనివల్ల పులుసు చిక్కబడుతుంది.",
    "[00:03:00.000] వేరొక పాన్ లో నూనె వేడి చేసి ఆవాలు, జీలకర్ర, మెంతులు, ఎండుమిర్చి, కరివేపాకు మరియు ఇంగువతో పోపు వేసి పులుసులో కలపాలి.",
    "[00:03:45.000] చివరగా కొత్తిమీర చల్లుకుని దించేస్తే కమ్మని ముక్కల పులుసు రెడీ."
  ],
  "transcription_english": [
    "[00:00:00.000] Hello foodies, welcome to Vismai Food. Today we will see how to make Andhra special Mukkala Pulusu.",
    "[00:00:30.000] First, soak a large lemon-sized tamarind and extract its juice.",
    "[00:00:45.000] In a large pot, add chopped drumsticks, bottle gourd, cucumber, sweet potato, lady's finger, and green chillies.",
    "[00:01:10.000] Pour enough water, add turmeric and salt, and cook the vegetables until they are 75% done.",
    "[00:01:45.000] Once the vegetables are cooked, add the tamarind extract, red chilli powder, and a piece of jaggery. Jaggery balances the tanginess perfectly.",
    "[00:02:20.000] While the stew is boiling, mix two spoons of rice flour with water and add it to thicken the consistency.",
    "[00:03:00.000] In a separate pan, prepare the tempering with oil, mustard seeds, cumin, fenugreek seeds, dry red chillies, curry leaves, and hing.",
    "[00:03:45.000] Pour the tempering into the pulusu, garnish with coriander leaves, and serve hot."
  ]
}