{
  "metadata": {
    "title": "Cucumber Pickle|Andhra Style Spicy Pickle|దోస ఆవకాయ|ఈ పక్కా కొలతలతో చేయండి కంచాలు కంచాలు లాగించేస్తారు",
    "channel_name": "Vismai Food",
    "publish_date": "2020-03-09",
    "view_count": 582701,
    "like_count": 8806,
    "duration": "02:33",
    "language": "Telugu",
    "video_id": "TWkK7T_Uf3Q",
    "url": "https://www.youtube.com/watch?v=TWkK7T_Uf3Q",
    "description": "Authentic Andhra Style Dosa Avakaya (Cucumber Pickle). Made with precise measurements for the perfect spicy and tangy taste that lasts.",
    "ingredients_detected": [
      "2 Cups Yellow Cucumber pieces (దోసకాయ ముక్కలు - chopped with skin)",
      "1/2 Cup Mustard Powder (ఆవపిండి)",
      "1/2 Cup Red Chilli Powder (కారం)",
      "1/4 Cup Salt (ఉప్పు - adjust to taste)",
      "1/4 tsp Turmeric Powder (పసుపు)",
      "1/2 Cup Sesame Oil or Groundnut Oil (నువ్వుల నూనె లేదా వేరుశనగ నూనె)",
      "1/4 tsp Fenugreek Powder (మెంతి పిండి)",
      "1 tsp Mustard Seeds (ఆవాలు - for tempering)",
      "2-3 Dried Red Chillies (ఎండుమిర్చి)",
      "A pinch of Hing (ఇంగువ)",
      "Small lemon sized Tamarind pulp (optional for tanginess)"
    ]
  },
  "transcription_telugu": [
    "[00:00:00.000] హలో ఫుడీస్, వెల్కమ్ టు విస్మయ్ ఫుడ్. ఇవాళ మనం ఆంధ్ర స్పెషల్ దోస ఆవకాయ పక్కా కొలతలతో ఎలా చేయాలో చూద్దాం.",
    "[00:00:20.000] ముందుగా గట్టిగా ఉన్న దోసకాయను తీసుకుని, లోపల గింజలు తీసేసి చిన్న చిన్న ముక్కలుగా కోసుకోవాలి. ముక్కలు తడి లేకుండా చూసుకోవాలి.",
    "[00:00:45.000] ఒక బౌల్ లో దోసకాయ ముక్కలు తీసుకుని అందులో ఆవపిండి, కారం, ఉప్పు, మెంతి పిండి మరియు పసుపు వేయాలి.",
    "[00:01:05.000] ఈ పొడులన్నీ ముక్కలకు బాగా పట్టేలా పొడిగా ఉన్న చెంచాతో కలుపుకోవాలి.",
    "[00:01:25.000] ఇప్పుడు పోపు కోసం నూనె వేడి చేసి అందులో ఆవాలు, ఎండుమిర్చి మరియు ఇంగువ వేసి చిటపటలాడించాలి.",
    "[00:01:45.000] పోపు పూర్తిగా చల్లారిన తర్వాత మాత్రమే పచ్చడిలో వేసి కలుపుకోవాలి. వేడి మీద వేస్తే ముక్క మెత్తబడిపోతుంది.",
    "[00:02:10.000] ఇలా కలిపిన పచ్చడిని ఒక రోజంతా ఊరనిస్తే నూనె పైకి తేలి రుచి అద్భుతంగా ఉంటుంది.",
    "[00:02:25.000] ఈ దోస ఆవకాయ వేడి వేడి అన్నంలో నెయ్యి వేసుకుని తింటే చాలా బాగుంటుంది."
  ],
  "transcription_english": [
    "[00:00:00.000] Hello foodies, welcome to Vismai Food. Today we will see how to make Andhra special Dosa Avakaya with perfect measurements.",
    "[00:00:20.000] First, take a firm yellow cucumber, remove the seeds, and chop it into small pieces. Ensure the pieces are completely dry.",
    "[00:00:45.000] In a bowl, take the cucumber pieces and add mustard powder, red chilli powder, salt, fenugreek powder, and turmeric.",
    "[00:01:05.000] Mix all the powders thoroughly with the cucumber pieces using a dry spoon.",
    "[00:01:25.000] For tempering, heat oil and add mustard seeds, dried red chillies, and a pinch of hing.",
    "[00:01:45.000] Let the tempering cool down completely before adding it to the pickle. Adding it while hot will make the cucumber soft.",
    "[00:02:10.000] Let the pickle rest for a day; the oil will separate, and the flavors will develop perfectly.",
    "[00:02:25.000] This Dosa Avakaya tastes amazing with hot rice and a dollop of ghee."
  ]
}