{
  "metadata": {
    "title": "Raw Mango Green Chili Chutney|No Cooking No frying|పచ్చిమామిడికాయ పచ్చిమిర్చి పచ్చడి|దీని రుచి సూపర్",
    "channel_name": "Vismai Food",
    "publish_date": "2020-03-11",
    "view_count": 562127,
    "like_count": 9663,
    "duration": "02:01",
    "language": "Telugu",
    "video_id": "Beft7jlkkaw",
    "url": "https://www.youtube.com/watch?v=Beft7jlkkaw",
    "description": "A unique and tasty Raw Mango Green Chili Chutney recipe by Vismai Food. This is a no-cook, no-fry version that pairs perfectly with rice and breakfast items.",
    "ingredients_detected": [
      "Peanuts (వేరుశనగ పప్పు - 1/2 Cup)",
      "Green Chillies (పచ్చిమిర్చి - 15)",
      "Raw Sour Mango (పుల్లని పచ్చి మామిడికాయ ముక్కలు - 100g)",
      "Salt (ఉప్పు - రుచికి సరిపడా)",
      "Water (నీళ్లు - 1 tsp)",
      "Oil (నూనె - 1 tbsp)",
      "Mustard seeds (ఆవాలు - 1/2 tsp)",
      "Urad dal (మినప్పప్పు - 1/2 tsp)",
      "Dry Red Chilli (ఎండుమిర్చి - 1)",
      "Cumin seeds (జీలకర్ర - 1/2 tsp)",
      "Curry leaves (కరివేపాకు - 1 రెబ్బ)"
    ]
  },
  "transcription_telugu": [
    "[00:00:00.000] హలో ఫుడీస్, వెల్కమ్ టు విస్మయ్ ఫుడ్. ఇవాళ స్పెషల్ పచ్చి మామిడికాయ పచ్చి పచ్చిమిర్చి పచ్చడి.",
    "[00:00:30.000] ముందుగా అర కప్పు వేరుశనగ పప్పును నీళ్లలో రెండు గంటల పాటు కచ్చితంగా నానబెట్టుకోవాలి.",
    "[00:00:40.000] మిక్సీ జార్‌లో నానిన వేరుశనగ పప్పు, 15 పచ్చిమిర్చి, మరియు 100 గ్రాముల పుల్లని పచ్చి మామిడికాయ ముక్కలు వేయాలి.",
    "[00:01:00.000] ఇందులో రుచికి సరిపడా ఉప్పు వేసి, అవసరమైతే ఒక టీస్పూన్ నీళ్లు పోసి మెత్తని పేస్ట్‌లా గ్రైండ్ చేసుకోవాలి.",
    "[00:01:10.000] తాలింపు కోసం పాన్‌లో నూనె వేడి చేసి ఆవాలు, మినప్పప్పు, ఎండుమిర్చి ముక్కలు వేసి వేయించాలి.",
    "[00:01:25.000] ఆ తర్వాత జీలకర్ర, కరివేపాకు వేసి బాగా వేపుకుని పచ్చడిలో కలుపుకోవాలి.",
    "[00:01:40.000] ఈ పచ్చడి వేడి వేడి అన్నం, ఇడ్లీ, దోశ మరియు వడలోకి చాలా రుచిగా ఉంటుంది."
  ],
  "transcription_english": [
    "[00:00:00.000] Hello foodies, welcome to Vismai Food. Today's special is Raw Mango Green Chili Chutney.",
    "[00:00:30.000] First, soak half a cup of peanuts in water for exactly two hours.",
    "[00:00:40.000] In a mixer jar, add the soaked peanuts, 15 green chillies, and 100g of raw sour mango pieces.",
    "[00:01:00.000] Add salt to taste and grind into a smooth paste using one teaspoon of water if needed.",
    "[00:01:10.000] For tempering, heat oil in a pan and sauté mustard seeds, urad dal, and dry red chilli pieces.",
    "[00:01:25.000] Then add cumin seeds and curry leaves, fry well, and mix it into the chutney.",
    "[00:01:40.000] This chutney goes very well with hot rice, idli, dosa, and vada."
  ]
}