{
  "metadata": {
    "title": "MANCHURIAN NOODLES|Hyderabad Street Style Manchurian|మంచూరియా నూడుల్స్|నూడుల్స్ తో పర్ఫెక్ట్ మంచూరియా",
    "channel_name": "Vismai Food",
    "publish_date": "2020-03-12",
    "view_count": 205089,
    "like_count": 4676,
    "duration": "04:05",
    "language": "Telugu",
    "video_id": "kEbTCC9dpmA",
    "url": "https://www.youtube.com/watch?v=kEbTCC9dpmA",
    "description": "Perfect Hyderabad Street Style Manchurian Noodles recipe. Learn how to make crispy manchurian balls using noodles and a spicy, flavorful toss.",
    "ingredients_detected": [
      "1 packet Noodles (boiled - ఉడికించిన నూడుల్స్)",
      "1/2 cup Cabbage (finely chopped - క్యాబేజీ తరుగు)",
      "1/4 cup Carrot (grated - క్యారెట్ తురుము)",
      "2-3 tbsp Maida (All-purpose flour - మైదా)",
      "2 tbsp Corn Flour (మొక్కజొన్న పిండి)",
      "1 tsp Ginger-Garlic Paste (అల్లం వెల్లుల్లి పేస్ట్)",
      "1 tsp Soy Sauce (సోయా సాస్)",
      "1 tsp Red Chilli Sauce (రెడ్ చిల్లీ సాస్)",
      "Salt (to taste - రుచికి సరిపడా ఉప్పు)",
      "Oil (for deep frying - వేయించడానికి నూనె)",
      "For Sauce/Toss:",
      "1 tbsp Garlic (finely chopped - వెల్లుల్లి తరుగు)",
      "1 tbsp Ginger (finely chopped - అల్లం తరుగు)",
      "Spring Onions (ఉల్లికాడలు)",
      "Capsicum (capsicum ముక్కలు)",
      "Vinegar (వెనిగర్)"
    ]
  },
  "transcription_telugu": [
    "[00:00:00] హలో ఫుడీస్, వెల్కమ్ టు విస్మయ్ ఫుడ్. ఇవాళ మనం హైదరాబాద్ స్ట్రీట్ స్టైల్ మంచూరియా నూడుల్స్ ఎలా చేయాలో చూద్దాం.",
    "[00:00:45] ముందుగా నూడుల్స్ ని ఉడికించి పక్కన పెట్టుకోవాలి. ఒక బౌల్ లో ఉడికించిన నూడుల్స్, క్యాబేజీ తరుగు, క్యారెట్ తురుము వేయాలి.",
    "[00:01:15] అందులో మైదా, కార్న్ ఫ్లోర్, అల్లం వెల్లుల్లి పేస్ట్, ఉప్పు మరియు కొంచెం సాస్ లు వేసి బాగా కలుపుకోవాలి.",
    "[00:01:40] ఈ మిశ్రమాన్ని చిన్న చిన్న ఉండలుగా (Manchurian balls) చేసుకుని కాగుతున్న నూనెలో గోల్డెన్ కలర్ వచ్చే వరకు వేయించాలి.",
    "[00:02:15] ఇప్పుడు ఒక పాన్ లో కొద్దిగా నూనె వేసి సన్నగా తరిగిన అల్లం, వెల్లుల్లి, పచ్చిమిర్చి మరియు ఉల్లికాడలు వేసి హై ఫ్లేమ్ మీద వేయించాలి.",
    "[00:02:45] ఇందులో క్యాప్సికమ్ ముక్కలు, సోయా సాస్, చిల్లీ సాస్, టొమాటో కెచప్ మరియు వెనిగర్ వేసి బాగా కలపాలి.",
    "[00:03:10] చివరగా వేయించి పెట్టుకున్న నూడుల్స్ మంచూరియా బాల్స్ ని వేసి సాస్ లన్నీ పట్టేలా బాగా టాస్ చేసుకోవాలి.",
    "[00:03:45] ఎంతో రుచికరమైన స్ట్రీట్ స్టైల్ మంచూరియా నూడుల్స్ సిద్ధం. వేడి వేడిగా సర్వ్ చేస్తే చాలా బాగుంటుంది."
  ],
  "transcription_english": [
    "[00:00:00] Hello foodies, welcome to Vismai Food. Today we will see how to make Hyderabad Street Style Manchurian Noodles.",
    "[00:00:45] First, boil the noodles and set them aside. In a bowl, add the boiled noodles, chopped cabbage, and grated carrots.",
    "[00:01:15] Add maida, corn flour, ginger-garlic paste, salt, and some sauces, and mix everything well.",
    "[00:01:40] Shape the mixture into small balls and deep fry them in hot oil until they turn golden brown.",
    "[00:02:15] Now, in a pan, heat a little oil and sauté finely chopped ginger, garlic, green chillies, and spring onions on high flame.",
    "[00:02:45] Add capsicum pieces, soy sauce, chilli sauce, tomato ketchup, and vinegar, and mix well.",
    "[00:03:10] Finally, add the fried noodles manchurian balls and toss them well so they are coated with the sauces.",
    "[00:03:45] Delicious Street Style Manchurian Noodles are ready. Serve them hot for the best taste."
  ]
}