{
  "metadata": {
    "title": "Mango Mutton Curry|Spicy Andhra Style Mutton Curry|మామిడికాయ మాంసం|పుల్లగా కారంగా ఉండే సూపర్ కర్రీ",
    "channel_name": "Vismai Food",
    "publish_date": "2020-03-14",
    "view_count": 166212,
    "like_count": 3174,
    "duration": "03:09",
    "language": "Telugu",
    "video_id": "P1-p9yBfkaw",
    "url": "https://www.youtube.com/watch?v=P1-p9yBfkaw",
    "description": "Andhra style Mango Mutton Curry recipe. A spicy and tangy combination of tender mutton and raw mango.",
    "ingredients_detected": [
      "Mutton (మాంసం - 500g)",
      "Raw Mango (పచ్చి మామిడికాయ - 1 small)",
      "Onions (ఉల్లిపాయలు - 2 medium)",
      "Ginger Garlic Paste (అల్లం వెల్లుల్లి పేస్ట్ - 1 tbsp)",
      "Green Chillies (పచ్చిమిర్చి - 2)",
      "Turmeric Powder (పసుపు - 1/2 tsp)",
      "Red Chilli Powder (కారం - 2 tsp total)",
      "Salt (ఉప్పు - తగినంత)",
      "Oil (నూనె - 1/3 cup)",
      "Whole Spices: Cinnamon (దాల్చిన చెక్క), Cardamom (యాలకులు), Cloves (లవంగాలు)",
      "Curry leaves (కరివేపాకు)",
      "Coriander leaves (కొత్తిమీర)",
      "Garam Masala (గరం మసాలా - optional)"
    ]
  },
  "transcription_telugu": [
    "[00:00:00] హలో ఫుడీస్, వెల్కమ్ టు విస్మయ్ ఫుడ్. ఇవాళ మనం ఎంతో రుచికరమైన మామిడికాయ మాంసం ఎలా చేయాలో చూద్దాం.",
    "[00:00:20] ముందుగా కుక్కర్‌లో 500 గ్రాముల మటన్, పసుపు, ఉప్పు, 1.5 చెంచాల కారం, అల్లం వెల్లుల్లి పేస్ట్ మరియు ఒక ఉల్లిపాయ ముక్కలు వేయాలి.",
    "[00:00:45] ఇందులో 750ml నీళ్లు పోసి, మూత పెట్టి మీడియం ఫ్లేమ్ మీద 6 విజిల్స్ వచ్చే వరకు మటన్‌ను మెత్తగా ఉడికించుకోవాలి.",
    "[00:01:15] ఒక చిన్న గిన్నెలో మామిడికాయ ముక్కలు, కొంచెం ఉప్పు, కారం మరియు 2 చెంచాల నీళ్లు పోసి ముక్కలు మెత్తబడే వరకు ఉడికించి పక్కన పెట్టుకోవాలి.",
    "[00:01:40] వేరొక పాన్‌లో నూనె వేడి చేసి దాల్చిన చెక్క, యాలకులు, లవంగాలు వేసి వేయించాలి. ఆపై ఉల్లిపాయ ముక్కలు, పచ్చిమిర్చి, కరివేపాకు వేసి వేయించాలి.",
    "[00:02:10] ఉల్లిపాయలు వేగాక, ఉడికించి పెట్టుకున్న మటన్ (నీళ్లతో సహా) మరియు ఉడికించిన మామిడికాయ ముక్కలను వేసి కలపాలి.",
    "[00:02:40] మూత పెట్టి మీడియం ఫ్లేమ్ మీద పులుసు చిక్కబడే వరకు (సుమారు 15 నిమిషాలు) ఉడికించాలి.",
    "[00:03:00] చివరగా కొత్తిమీర మరియు గరం మసాలా చల్లుకుంటే వేడివేడి మామిడికాయ మాంసం సిద్ధం."
  ],
  "transcription_english": [
    "[00:00:00] Hello foodies, welcome to Vismai Food. Today we will see how to make delicious Mango Mutton Curry.",
    "[00:00:20] In a pressure cooker, add 500g mutton, turmeric, salt, 1.5 tsp chilli powder, ginger-garlic paste, and one chopped onion.",
    "[00:00:45] Pour 750ml water and pressure cook for 6 whistles on medium flame until the mutton is tender.",
    "[00:01:15] In a small bowl, cook raw mango cubes with a pinch of salt, chilli powder, and 2 tbsp water until soft.",
    "[00:01:40] Heat oil in a pan, sauté whole spices (cinnamon, cardamom, cloves), then add chopped onions, green chillies, and curry leaves.",
    "[00:02:10] Once onions are fried, add the cooked mutton (with broth) and the cooked mango pieces. Mix well.",
    "[00:02:40] Cover and simmer on medium flame for 15 minutes until the gravy reaches the desired consistency.",
    "[00:03:00] Garnish with coriander leaves and optional garam masala. Serve hot."
  ]
}