{
  "metadata": {
    "title": "Curry Leaves Rice|Qucik&Tasty Lunch Box Recipe|కరివేపాకు అన్నం|మా బెస్ట్ కరివేపాకు అన్నం రుచికి ఫిదా",
    "channel_name": "Vismai Food",
    "publish_date": "2020-03-15",
    "view_count": 2283189,
    "like_count": 31857,
    "duration": "02:34",
    "language": "Telugu",
    "video_id": "qhZbrozlX7k",
    "url": "https://www.youtube.com/watch?v=qhZbrozlX7k",
    "description": "Quick and healthy Curry Leaves Rice recipe by Vismai Food. A perfect lunch box recipe made with aromatic curry leaves powder and spices.",
    "ingredients_detected": [
      "1 Cup Fresh Curry Leaves (కరివేపాకు)",
      "1/4 Cup Peanuts (వేరుశనగ పప్పులు)",
      "10 Spicy Dry Red Chillies (ఎండుమిర్చి)",
      "2 tbsps Chana Dal (శనగ పప్పు)",
      "2 tbsps Toor Dal (కంది పప్పు)",
      "2 tbsps Urad Dal (మినప పప్పు)",
      "1 tbsp Coriander Seeds (ధనియాలు)",
      "Small gooseberry size Tamarind (చింతపండు)",
      "2 pinches Hing (ఇంగువ)",
      "1/2 tsp Mustard Seeds (ఆవాలు)",
      "1 tsp Cumin Seeds (జీలకర్ర)",
      "1 Cup Cooked Rice (ఉడికించిన అన్నం)",
      "4 tbsps Oil (నూనె)",
      "Salt to taste (రుచికి సరిపడా ఉప్పు)"
    ]
  },
  "transcription_telugu": [
    "[00:00:24] ముందుగా బాండీలో పావు కప్పు వేరుశనగ పప్పులు వేసి తక్కువ మంట మీద వేయించి పొట్టు తీసి పక్కన పెట్టుకోవాలి.",
    "[00:00:36] అదే బాండీలో రెండు టేబుల్ స్పూన్ల నూనె వేడి చేసి 10 ఎండుమిర్చి వేయించాలి.",
    "[00:00:42] అందులోనే శనగ పప్పు, కంది పప్పు, మినప పప్పు వేసి ఎర్రగా వేయించుకోవాలి.",
    "[00:00:58] ధనియాలు మరియు చిన్న చింతపండు ముక్క వేసి వేయించాలి.",
    "[00:01:08] ఇప్పుడు ఒక కప్పు శుభ్రం చేసిన కరివేపాకు వేసి కరకరలాడే వరకు వేయించుకోవాలి.",
    "[00:01:27] చివరగా ఇంగువ వేసి, చల్లారిన తర్వాత వీటన్నింటినీ కలిపి మెత్తని పొడిలా గ్రైండ్ చేసుకోవాలి.",
    "[00:01:34] పోపు కోసం నూనె వేడి చేసి ఆవాలు, జీలకర్ర వేసి చిటపటలాడించాలి.",
    "[00:01:43] వేయించి పెట్టుకున్న వేరుశనగ పప్పులు వేసి 30 సెకన్లు వేయించి స్టవ్ ఆపేయాలి.",
    "[00:01:51] ఇప్పుడు ఉడికించిన అన్నం, తయారు చేసుకున్న కరివేపాకు పొడి మరియు ఉప్పు వేసి బాగా కలుపుకోవాలి."
  ],
  "transcription_english": [
    "[00:00:24] First, roast 1/4 cup of peanuts on low flame, remove the skin, and set aside.",
    "[00:00:36] Heat 2 tablespoons of oil in the same pan and fry 10 dry red chillies.",
    "[00:00:42] Add chana dal, toor dal, and urad dal; fry until they turn golden brown.",
    "[00:00:58] Add coriander seeds and a small piece of tamarind and roast well.",
    "[00:01:08] Now add one cup of fresh curry leaves and fry until they become crisp.",
    "[00:01:27] Add hing, let the mixture cool, and grind it into a fine powder.",
    "[00:01:34] For tempering, heat oil and add mustard seeds and cumin seeds.",
    "[00:01:43] Add the roasted peanuts, fry for 30 seconds, and turn off the flame.",
    "[00:01:51] Add cooked rice, the prepared curry leaf powder, and salt; mix everything thoroughly."
  ]
}