{
  "metadata": {
    "title": "Mango Dal|MamidikayaPappu In Telugu|మామిడికాయ పప్పు|ఈ టిప్స్ కొలతలతో చేస్తేనే పప్పు రుచి బాగుంటుంది",
    "channel_name": "Vismai Food",
    "publish_date": "2020-03-16",
    "view_count": 1724349,
    "like_count": 18060,
    "duration": "03:10",
    "language": "Telugu",
    "video_id": "IR6iVzQWn2Q",
    "url": "https://www.youtube.com/watch?v=IR6iVzQWn2Q",
    "description": "Authentic and flavorful Andhra style Mango Dal (Mamidikaya Pappu) recipe. A perfect blend of sourness from raw mangoes and creaminess of lentils.",
    "ingredients_detected": [
      "Toor Dal (కందిపప్పు - 1/2 cup)",
      "Raw Sour Mango (పచ్చి పుల్లని మామిడికాయ ముక్కలు)",
      "Water (నీళ్లు - 1.5 cups or more as per consistency)",
      "Turmeric Powder (పసుపు - 1/2 tsp)",
      "Oil (నూనె - 2 tbsp)",
      "Mustard Seeds (ఆవాలు - 1 tsp)",
      "Urad Dal (మినప్పప్పు - 1 tsp)",
      "Dry Red Chillies (ఎండుమిర్చి - 4)",
      "Green Chillies (పచ్చిమిర్చి - 4)",
      "Cumin Seeds (జీలకర్ర - 1 tsp)",
      "Asafoetida (ఇంగువ - 2 pinches)",
      "Curry Leaves (కరివేపాకు - 1 sprig)",
      "Salt (ఉప్పు - as per taste)"
    ]
  },
  "transcription_telugu": [
    "[00:00:00.000] హలో ఫుడీస్, వెల్కమ్ టు విస్మయ్ ఫుడ్. ఇవాళ మనం ఎంతో రుచికరమైన మామిడికాయ పప్పు ఎలా చేయాలో చూద్దాం.",
    "[00:00:25.000] ముందుగా అర కప్పు కందిపప్పును లో ఫ్లేమ్ మీద మంచి వాసన వచ్చే వరకు వేయించుకోవాలి.",
    "[00:00:45.000] వేయించుకున్న పప్పును బాగా కడిగి కుక్కర్‌లో వేయాలి.",
    "[00:00:55.000] ఇందులో పైన పొట్టు తీసి, సన్నగా తరిగిన పచ్చి పుల్లని మామిడికాయ ముక్కలను వేయాలి.",
    "[00:01:10.000] ఆ తర్వాత ఒకటిన్నర కప్పుల నీరు మరియు అర టీస్పూన్ పసుపు వేసి, ఐదు నుంచి ఆరు విజిల్స్ వచ్చే వరకు ఉడికించాలి.",
    "[00:01:30.000] పప్పు ఉడికాక పప్పుగుత్తితో మెత్తగా ఎనుపుకోవాలి.",
    "[00:01:55.000] తాలింపు కోసం పాన్‌లో నూనె వేడి చేసి ఆవాలు, మినప్పప్పు, ఎండుమిర్చి, పచ్చిమిర్చి, జీలకర్ర, ఇంగువ మరియు కరివేపాకు వేసి వేయించాలి.",
    "[00:02:25.000] తాలింపు వేగాక ఉడికించిన పప్పును అందులో వేసి, రుచికి సరిపడా ఉప్పు కలుపుకోవాలి.",
    "[00:02:50.000] చివరగా ఒక నిమిషం పాటు మరిగించి వేడి వేడి అన్నంలోకి సర్వ్ చేసుకోవాలి."
  ],
  "transcription_english": [
    "[00:00:00.000] Hello foodies, welcome to Vismai Food. Today we will see how to make delicious Mango Dal.",
    "[00:00:25.000] First, roast half a cup of toor dal on low flame until it becomes aromatic.",
    "[00:00:45.000] Wash the roasted dal thoroughly and put it in a pressure cooker.",
    "[00:00:55.000] Add peeled and finely sliced raw sour mango pieces to it.",
    "[00:01:10.000] Then add 1.5 cups of water and half a teaspoon of turmeric, and cook for 5 to 6 whistles.",
    "[00:01:30.000] Once the dal is cooked, mash it well with a wooden masher.",
    "[00:01:55.000] For tempering, heat oil in a pan and sauté mustard seeds, urad dal, dry red chillies, green chillies, cumin, hing, and curry leaves.",
    "[00:02:25.000] Add the mashed dal to the tempering and add salt as per taste.",
    "[00:02:50.000] Finally, simmer for a minute and serve hot with steamed rice."
  ]
}