{
  "metadata": {
    "title": "Raw Banana Bajji|Crispy & Tasty Snack|అరటికాయ బజ్జి|వంట సోడా వాడకుండా తక్కువ నూనె పీల్చేలా టిప్స్ తో",
    "channel_name": "Vismai Food",
    "publish_date": "2020-03-17",
    "view_count": 1548854,
    "like_count": 18763,
    "duration": "02:24",
    "language": "Telugu",
    "video_id": "Y2PsBNQINME",
    "url": "https://www.youtube.com/watch?v=Y2PsBNQINME",
    "description": "Crispy and tasty Raw Banana Bajji recipe by Vismai Food. Tips for making it crispy without using baking soda and techniques to absorb less oil.",
    "ingredients_detected": [
      "1-2 Raw Bananas (అరటికాయలు)",
      "1.5 Cups Gram Flour/Besan (శనగపిండి)",
      "2 tbsps Rice Flour (బియ్యం పిండి)",
      "1/4 tsp Turmeric (పసుపు)",
      "3/4 tsp Red Chili Powder (కారం)",
      "1 tsp Cumin Seeds (జీలకర్ర)",
      "2 tsps Hot Oil (వేడి నూనె)",
      "Salt to taste (రుచికి సరిపడా ఉప్పు)",
      "Water as needed (తగినన్ని నీళ్లు)",
      "Oil for deep frying (డీప్ ఫ్రైకి సరిపడా నూనె)"
    ]
  },
  "transcription_telugu": [
    "[00:00:15] అరటికాయలకి రెండు వైపులా అంచులు కట్ చేసి, పైన తొక్కను లైట్‌గా గీరాలి. మరీ లోతుగా తీయకూడదు.",
    "[00:00:25] అరటికాయలను పావు ఇంచు మందం ఉండేలా ముక్కలుగా కట్ చేసి పక్కన పెట్టుకోవాలి.",
    "[00:00:40] ఒక గిన్నెలో ఒకటిన్నర కప్పుల శనగపిండి, రెండు టేబుల్ స్పూన్ల బియ్యం పిండి వేసుకోవాలి.",
    "[00:00:48] అందులో పసుపు, రుచికి సరిపడా ఉప్పు, ముప్పావు టీస్పూన్ కారం, ఒక టీస్పూన్ జీలకర్ర వేసి కలపాలి.",
    "[00:00:58] ఇందులో రెండు టీస్పూన్ల వేడి నూనె వేసి బాగా కలిపితే, వంట సోడా లేకుండానే బజ్జీలు కరకరలాడుతూ వస్తాయి.",
    "[00:01:08] తగినన్ని నీళ్లు పోస్తూ పిండిని జారుగా (flowing consistency) కలుపుకోవాలి. వేలితో చెక్ చేస్తే పిండి వేలికి అంటుకోవాలి.",
    "[00:01:30] బాండీలో నూనె వేడి చేసి, అరటికాయ ముక్కలను పిండిలో ముంచి నూనెలో వేయాలి.",
    "[00:01:45] బజ్జీలను మీడియం ఫ్లేమ్ మీద లేత బంగారు రంగు వచ్చే వరకు వేయించాలి.",
    "[00:02:00] చివరగా హై ఫ్లేమ్ మీద మంచి రంగు, క్రిస్పీనెస్ వచ్చే వరకు వేయించి తీసేయాలి."
  ],
  "transcription_english": [
    "[00:00:15] Trim the edges of the raw bananas and peel the skin slightly; do not peel too deep.",
    "[00:00:25] Cut the bananas into 1/4 inch thick slices and keep them aside.",
    "[00:00:40] In a mixing bowl, add 1.5 cups of gram flour and 2 tablespoons of rice flour.",
    "[00:00:48] Add turmeric, salt to taste, 3/4 teaspoon of red chili powder, and 1 teaspoon of cumin seeds.",
    "[00:00:58] Add 2 teaspoons of hot oil and mix well; this ensures crispiness without using baking soda.",
    "[00:01:08] Gradually add water and mix to a thick, flowing consistency. The batter should coat your finger well.",
    "[00:01:30] Heat oil in a pan, dip the banana slices into the batter, and drop them into the oil.",
    "[00:01:45] Fry the bajjis on a medium flame until they turn a light golden color.",
    "[00:02:00] Finally, fry on a high flame until they become golden brown and crispy before taking them out."
  ]
}