{
  "metadata": {
    "title": "నేతి బొబ్బట్లు || PuranPoli || How to make perfect Bobbatlu at Home in Telugu by Vismai Food",
    "channel_name": "Vismai Food",
    "publish_date": "2020-03-19",
    "view_count": 9804622,
    "like_count": 105732,
    "duration": "05:20",
    "language": "Telugu",
    "video_id": "B9uoOqAP1dY",
    "url": "https://www.youtube.com/watch?v=B9uoOqAP1dY",
    "description": "Perfect traditional South Indian sweet Bobbatlu (Puran Poli) recipe with tips for soft and oily texture.",
    "ingredients_detected": [
      "Chana Dal (శనగపప్పు - 1 cup)",
      "Jaggery (బెల్లం - 1 cup)",
      "Maida (మైదా - 1 cup)",
      "Ghee (నెయ్యి - తగినంత)",
      "Oil (నూనె - 1/4 cup)",
      "Cardamom Powder (యాలకుల పొడి - 1/2 tsp)",
      "Turmeric (పసుపు - చిటికెడు)",
      "Salt (ఉప్పు - చిటికెడు)"
    ]
  },
  "transcription_telugu": [
    "[00:00:00] హలో ఫుడీస్, వెల్కమ్ టు విస్మయ్ ఫుడ్. పండుగ స్పెషల్ నేతి బొబ్బట్లు ఎలా చేయాలో చూద్దాం.",
    "[00:00:30] ముందుగా ఒక కప్పు మైదాలో చిటికెడు పసుపు, ఉప్పు, మరియు నూనె వేసి మెత్తగా కలుపుకోవాలి. దీనిపై నూనె వేసి కనీసం 2 గంటలు నాననివ్వాలి.",
    "[00:01:15] శనగపప్పును కుక్కర్‌లో మెత్తగా ఉడికించి, నీరు వడకట్టి పెట్టుకోవాలి.",
    "[00:02:00] ఉడికించిన పప్పులో బెల్లం కలిపి దగ్గరపడే వరకు ఉడికించాలి. ఆపై యాలకుల పొడి వేసి చల్లార్చుకోవాలి.",
    "[00:03:00] ఈ మిశ్రమాన్ని మిక్సీ పట్టి మెత్తని పూర్ణంలా సిద్ధం చేసుకోవాలి.",
    "[00:03:45] నానిన పిండిని చిన్న ఉండలుగా తీసుకుని, మధ్యలో పూర్ణం పెట్టి మూసివేసి పల్చగా ఒత్తుకోవాలి.",
    "[00:04:30] పెనంపై నెయ్యి వేసి రెండు వైపులా ఎర్రగా కాల్చుకుంటే రుచికరమైన నేతి బొబ్బట్లు సిద్ధం."
  ],
  "transcription_english": [
    "[00:00:00] Hello foodies, welcome to Vismai Food. Let's see how to make festival special Ghee Bobbatlu.",
    "[00:00:30] First, mix 1 cup maida with a pinch of turmeric, salt, and oil. Cover with oil and soak for at least 2 hours.",
    "[00:01:15] Pressure cook chana dal until soft and drain the excess water completely.",
    "[00:02:00] Add jaggery to the cooked dal and cook until it thickens. Then add cardamom powder and let it cool.",
    "[00:03:00] Grind this mixture into a smooth paste (Purnam).",
    "[00:03:45] Take small portions of the dough, stuff them with Purnam, seal them, and roll them out thinly.",
    "[00:04:30] Roast on a tawa with plenty of ghee on both sides until golden brown."
  ]
}