{
  "metadata": {
    "title": "Kandi Podi-2|Podi For Idli Dosa & Rice|కంది పొడి-2|అందరికి తెలిసిన రెసిపీ కానీ మా స్టైల్ థీ బెస్ట్",
    "channel_name": "Vismai Food",
    "publish_date": "2020-03-20",
    "view_count": 1915650,
    "like_count": 28705,
    "duration": "02:24",
    "language": "Telugu",
    "video_id": "2M_7QcOnNQA",
    "url": "https://www.youtube.com/watch?v=2M_7QcOnNQA",
    "description": "Traditional Andhra style Kandi Podi recipe for Idli, Dosa, and Rice. A flavorful lentil powder made with roasted dals and spices.",
    "ingredients_detected": [
      "Toor Dal (కందిపప్పు - 1/2 cup)",
      "Chana Dal (శనగపప్పు - 1/4 cup)",
      "Moong Dal (పెసరపప్పు - 1/4 cup)",
      "Cumin Seeds (జీలకర్ర - 1 tsp)",
      "Dry Red Chillies (ఎండుమిర్చి - 10-15)",
      "Asafoetida (ఇంగువ - 1/4 tsp)",
      "Salt (ఉప్పు - తగినంత)"
    ]
  },
  "transcription_telugu": [
    "[00:00:00] హలో ఫుడీస్, వెల్కమ్ టు విస్మయ్ ఫుడ్. ఇవాళ మనం అన్నం, ఇడ్లీ, దోసెల్లోకి ఎంతో రుచిగా ఉండే కందిపొడి ఎలా చేయాలో చూద్దాం.",
    "[00:00:25] ముందుగా స్టవ్ మీద పాన్ పెట్టుకుని అర కప్పు కందిపప్పు వేసి లో ఫ్లేమ్ మీద 8-10 నిమిషాల పాటు దోరగా వేయించుకోవాలి.",
    "[00:00:50] కందిపప్పు వేగాక తీసి పక్కన పెట్టుకుని, అదే పాన్‌లో పావు కప్పు శనగపప్పు వేసి మంచి రంగు వచ్చే వరకు వేయించాలి.",
    "[00:01:10] ఆ తర్వాత పావు కప్పు పెసరపప్పు వేసి 5-6 నిమిషాలు వేయించుకోవాలి. పప్పులు మాడకుండా జాగ్రత్తగా వేయించుకోవడం ముఖ్యం.",
    "[00:01:30] పప్పులు వేగాక స్టవ్ ఆపేసి, ఆ వేడి మీదనే జీలకర్ర మరియు ఎండుమిర్చి వేసి కొద్దిసేపు కలపాలి.",
    "[00:01:50] ఈ మిశ్రమాన్ని పూర్తిగా చల్లారనివ్వాలి. చల్లారిన తర్వాత మిక్సీ జార్‌లోకి తీసుకుని అందులో ఇంగువ మరియు తగినంత ఉప్పు వేయాలి.",
    "[00:02:10] వీటన్నింటినీ కలిపి మెత్తని పొడిలా గ్రైండ్ చేసుకోవాలి.",
    "[00:02:20] అంతే ఎంతో కమ్మని వాసన వచ్చే కందిపొడి సిద్ధం. దీనిని నెయ్యితో కలిపి తీసుకుంటే చాలా రుచిగా ఉంటుంది."
  ],
  "transcription_english": [
    "[00:00:00] Hello foodies, welcome to Vismai Food. Today we will see how to make delicious Kandi Podi for rice, idli, and dosa.",
    "[00:00:25] First, heat a pan and add 1/2 cup toor dal. Roast it on low flame for 8-10 minutes until aromatic.",
    "[00:00:50] Once the toor dal is roasted, set it aside. In the same pan, add 1/4 cup chana dal and roast until it changes color.",
    "[00:01:10] Then, add 1/4 cup moong dal and roast for 5-6 minutes. It is important to roast the dals evenly without burning.",
    "[00:01:30] After roasting the dals, turn off the flame and add cumin seeds and dry red chillies to the pan's residual heat.",
    "[00:01:50] Let the mixture cool down completely. Once cooled, transfer it to a mixer jar and add asafoetida and required salt.",
    "[00:02:10] Grind everything into a fine powder.",
    "[00:02:20] Delicious and aromatic Kandi Podi is ready. It tastes best when served with hot rice and ghee."
  ]
}