{
  "metadata": {
    "title": "Tomato Masala Oats in Just 5 mins | టమాటో మసాల ఓట్స్ | ఆరోగ్యకరమైన బ్రేక్ఫాస్ట్",
    "channel_name": "Vismai Food",
    "publish_date": "2018-12-08",
    "view_count": 2839975,
    "like_count": 44371,
    "duration": "02:09",
    "language": "Telugu",
    "video_id": "Jyvxrpu2pRM",
    "url": "https://www.youtube.com/watch?v=Jyvxrpu2pRM",
    "description": "Quick and healthy Tomato Masala Oats recipe by Vismai Food, perfect for a 5-minute breakfast.",
    "ingredients_detected": [
      "1 Cup Oats (110gms)",
      "2 tbsps Oil",
      "1 Onion (chopped)",
      "1 Sprig Curry leaves",
      "1 tsp Ginger garlic paste",
      "1/4 tsp Turmeric",
      "200gms Desi Tomatoes (chopped)",
      "250ml Water",
      "1 tsp Chilli Powder",
      "1/4 tsp Black pepper powder",
      "1/4 tsp Garam masala",
      "1/2 bunch Coriander (chopped)",
      "1/4 tsp Sambar powder (optional)",
      "Salt (to taste)"
    ]
  },
  "transcription_telugu": [
    "[00:00:00.000] హలో ఫుడీస్, వెల్కమ్ టు విస్మయ్ ఫుడ్. ఇవాల్టి సింపుల్ అండ్ టేస్టీ రెసిపీ టొమాటో మసాలా ఓట్స్.",
    "[00:00:10.000] ఇది చాలా ఈజీ, హెల్తీ మరియు టేస్టీ బ్రేక్ ఫాస్ట్. డైటింగ్ లో ఉన్నవారికి కూడా బాగా హెల్ప్ అవుతుంది.",
    "[00:00:18.000] ముందుగా ఒక పాన్ లో రెండు టేబుల్ స్పూన్ల నూనె వేడి చేసి, అందులో ఉల్లిపాయ తరుగు వేసి రెండు నిమిషాలు మగ్గించుకోవాలి.",
    "[00:00:25.000] ఉల్లిపాయలు మగ్గాక ఒక రెబ్బ కరివేపాకు వేసి పచ్చి వాసన పోయే వరకు వేయించాలి.",
    "[00:00:35.000] ఇందులో ఉప్పు, ఒక టీస్పూన్ అల్లం వెల్లుల్లి పేస్ట్, పావు చెంచా పసుపు వేసి బాగా కలుపుకోవాలి.",
    "[00:00:44.000] ఇప్పుడు 200 గ్రాముల నాటు టొమాటో ముక్కలు వేసి, మూత పెట్టి మీడియం ఫ్లేమ్ మీద మెత్తగా అయ్యే వరకు మగ్గించుకోవాలి.",
    "[00:00:56.000] టొమాటోలు మగ్గాక పావు లీటర్ నీళ్లు పోసి మూత పెట్టి ఎసరు మరగనివ్వాలి.",
    "[00:01:05.000] ఎసరు మరుగుతున్నప్పుడు ఒక టీస్పూన్ కారం వేసి కలుపుకోవాలి.",
    "[00:01:11.000] ఇందులో 110 గ్రాముల ఓట్స్ వేసి ఉండలు లేకుండా బాగా కలిపి, మీడియం ఫ్లేమ్ మీద ఉడికించాలి.",
    "[00:01:25.000] ఓట్స్ ఉడికాక పావు చెంచా మిరియాల పొడి, పావు చెంచా గరం మసాలా వేసి కలపాలి.",
    "[00:01:36.000] చివరగా అర కట్ట కొత్తిమీర తరుగు వేసి కలిపి దింపేయాలి. నచ్చితే సాంబార్ పొడి కూడా వేసుకోవచ్చు."
  ],
  "transcription_english": [
    "[00:00:00.000] Hello Foodies, welcome to Vismai Food. Today's simple and tasty recipe is Tomato Masala Oats.",
    "[00:00:10.000] This is a very easy, healthy, and tasty breakfast. It's especially helpful for those on a diet.",
    "[00:00:18.000] Heat 2 tbsps of oil in a pan, add chopped onions, and sauté for 2 minutes.",
    "[00:00:25.000] Once the onions are soft, add a sprint of curry leaves and sauté until the raw smell goes away.",
    "[00:00:35.000] Add salt, 1 tsp ginger-garlic paste, and 1/4 tsp turmeric; mix well.",
    "[00:00:44.000] Add 200g of chopped desi tomatoes, cover, and cook on medium flame until soft and mushy.",
    "[00:00:56.000] Add 250ml water, cover, and let it come to a boil.",
    "[00:01:05.000] When the water boils, add 1 tsp of chilli powder and mix.",
    "[00:01:11.000] Add 110g of oats and mix well without any lumps; cook on medium flame.",
    "[00:01:25.000] When the oats are almost cooked, add 1/4 tsp black pepper powder and 1/4 tsp garam masala.",
    "[00:01:36.000] Finally, add half a bunch of chopped coriander leaves and turn off the heat. You can also add sambar powder for extra flavor."
  ]
}