{
  "metadata": {
    "title": "SatyanarayanaSwamy Vrat Prashad| Ugadi Special |సత్యనారాయణ స్వామి వ్రత ప్రసాదం|శాస్త్రీయమైన విధానం",
    "channel_name": "Vismai Food",
    "publish_date": "2020-03-24",
    "view_count": 358070,
    "like_count": 5004,
    "duration": "03:24",
    "language": "Telugu",
    "video_id": "igDjfVTBELc",
    "url": "https://www.youtube.com/watch?v=igDjfVTBELc",
    "description": "Authentic and traditional Satyanarayana Swamy Vratam Prasadam recipe. A sacred offering made with wheat ravva, sugar, and ghee, perfect for Ugadi and other auspicious occasions.",
    "ingredients_detected": [
      "Wheat Ravva / Bansi Ravva (గోధుమ రవ్వ - 1 cup)",
      "Wheat Flour (గోధుమ పిండి - 1/2 cup)",
      "Sugar (చక్కెర - as needed)",
      "Cardamom (యాలకులు)",
      "Ghee / Cow Ghee (ఆవు నెయ్యి - 1/4 cup + for frying)",
      "Cashews (జీడిపప్పు)",
      "Almonds (బాదం పప్పు)"
    ]
  },
  "transcription_telugu": [
    "[00:00:00] హలో ఫుడీస్, వెల్కమ్ టు విస్మయ్ ఫుడ్. ఉగాది మరియు నవరాత్రుల సందర్భంగా సత్యనారాయణ స్వామి వ్రత ప్రసాదం ఎలా చేయాలో చూద్దాం.",
    "[00:01:05] ముందుగా ఒక కప్పు గోధుమ రవ్వ (బన్సీ రవ్వ) తీసుకుని లో ఫ్లేమ్ మీద 15 నిమిషాల పాటు సువాసన వచ్చే వరకు వేయించాలి.",
    "[00:01:30] రవ్వ వేగాక అర కప్పు గోధుమ పిండి కలిపి మరికొద్ది సేపు వేయించాలి.",
    "[00:01:53] మిక్సీ జార్‌లో చక్కెర మరియు యాలకులు వేసి మెత్తని పొడిలా చేసుకోవాలి.",
    "[00:02:02] పాన్‌లో నెయ్యి వేడి చేసి జీడిపప్పులను గోల్డెన్ బ్రౌన్ కలర్ వచ్చే వరకు వేయించి, అందులో సగం పొడి చేసుకోవాలి.",
    "[00:02:20] మరికొంత నెయ్యి వేసి బాదం పప్పు ముక్కలను కూడా దోరగా వేయించాలి.",
    "[00:02:32] ఇప్పుడు వేయించిన రవ్వ, గోధుమ పిండి, బాదం, జీడిపప్పు పొడి మరియు చక్కెర పొడిని ఒక గిన్నెలో వేసి బాగా కలపాలి.",
    "[00:03:00] చివరగా పావు కప్పు ఆవు నెయ్యి పోసి కలిపితే ఎంతో పవిత్రమైన సత్యనారాయణ స్వామి వ్రత ప్రసాదం సిద్ధం."
  ],
  "transcription_english": [
    "[00:00:00] Hello foodies, welcome to Vismai Food. On the occasion of Ugadi and Navaratri, let's see how to prepare the traditional Satyanarayana Swamy Vratam Prasadam.",
    "[00:01:05] First, take one cup of wheat ravva (Bansi ravva) and roast it on a low flame for about 15 minutes until aromatic.",
    "[00:01:30] Once the ravva is roasted, add half a cup of wheat flour and roast for a few more minutes.",
    "[00:01:53] Blend sugar and cardamom into a fine powder in a mixer jar.",
    "[00:02:02] Heat ghee in a pan, fry cashews until golden brown, and grind half of them into a coarse powder.",
    "[00:02:20] Heat more ghee and fry chopped almonds until they become crisp.",
    "[00:02:32] In a bowl, combine the roasted ravva, wheat flour, almonds, cashew powder, and sugar-cardamom powder.",
    "[00:03:00] Finally, add a quarter cup of cow ghee and mix thoroughly. The sacred Prasadam is now ready."
  ]
}