{
  "metadata": {
    "title": "నెల రోజులు పైన నిలవుండే గుంటూరు స్పెషల్ టిఫిన్స్ అల్లం పచ్చడి | Guntur Ginger chutney @VismaiFood",
    "channel_name": "Vismai Food",
    "publish_date": "2018-12-09",
    "view_count": 5506314,
    "like_count": 61849,
    "duration": "02:00",
    "language": "Telugu",
    "video_id": "7D92jfHvYxs",
    "url": "https://www.youtube.com/watch?v=7D92jfHvYxs",
    "description": "Guntur, Krishna, and Prakasam district special Ginger Chutney recipe for South Indian breakfasts.",
    "ingredients_detected": [
      "3 tbsps Oil",
      "1 tbsp Coriander (dhaniyalu)",
      "1 tbsp Chana Dal (senagapappu)",
      "1 tbsp Urad dal (minappappu)",
      "50gms Dry Chillies",
      "50gms Ginger (chopped)",
      "100gms Jaggery",
      "50gms Tamarind Pulp",
      "1 tbsp Cumin",
      "6 Garlic pods",
      "Salt (to taste)",
      "Hot Water (for grinding)"
    ]
  },
  "transcription_telugu": [
    "[00:00:00.000] హలో ఫుడీస్, వెల్కమ్ టు విస్మయ్ ఫుడ్. ఇవాళ మీకు ది బెస్ట్ అల్లం పచ్చడి చెప్పబోతున్నాను.",
    "[00:00:05.000] ఇది గుంటూరు, కృష్ణా, ప్రకాశం జిల్లాల్లో చాలా ఫేమస్ పచ్చడి.",
    "[00:00:17.000] కడాయిలో మూడు టేబుల్ స్పూన్ల ఆయిల్ హీట్ చేసుకొని అందులో ఒక టేబుల్ స్పూన్ ధనియాలు, ఒక టేబుల్ స్పూన్ శనగపప్పు, ఒక టేబుల్ స్పూన్ మినప్పప్పు వేసి లో ఫ్లేమ్ మీద వేపుకోండి.",
    "[00:00:32.000] ఆ తర్వాత 50 గ్రాముల ఎండుమిర్చి వేసి లో ఫ్లేమ్ మీద చక్కగా వేపుకోండి.",
    "[00:00:43.000] ఇవి వేగాక 50 గ్రాముల అల్లం తరుగు వేసి పచ్చి వాసన పోయేంత వరకు వేపుకోండి.",
    "[00:00:55.000] వీటిని పూర్తిగా చల్లార్చుకుని మిక్సీ జార్ లో వేసుకోండి.",
    "[00:01:01.000] ఇప్పుడు 100 గ్రాముల బెల్లం తరుగు, 50 గ్రాముల చింతపండు గుజ్జు, ఒక టేబుల్ స్పూన్ జీలకర్ర వేయండి.",
    "[00:01:10.000] ఆరు ఏడు వెల్లుల్లి, సాల్ట్ వేసి వేడి నీళ్లు పోసి మెత్తగా పేస్ట్ చేసుకోండి.",
    "[00:01:15.000] వేడి నీళ్లు పోయడం వల్ల పచ్చడి నెల రోజుల వరకు నిల్వ ఉంటుంది.",
    "[00:01:23.000] ఇంకా ఎక్కువ రోజులు ఉండాలంటే కాచి చల్లార్చిన నూనె పైన పోసి ఫ్రిజ్ లో పెట్టుకుంటే మూడు నాలుగు నెలల వరకు ఉంటుంది."
  ],
  "transcription_english": [
    "[00:00:00.000] Hello foodies, welcome to Vismai Food. Today I am going to show you the best ginger chutney.",
    "[00:00:05.000] This is a very famous chutney in Guntur, Krishna, and Prakasam districts.",
    "[00:00:17.000] Heat 3 tbsps oil in a pan, add 1 tbsp coriander seeds, 1 tbsp chana dal, and 1 tbsp urad dal; fry on low flame.",
    "[00:00:32.000] Then add 50g dry red chillies and roast them well on a low flame.",
    "[00:00:43.000] Once roasted, add 50g chopped ginger and fry until the raw smell disappears.",
    "[00:00:55.000] Let the mixture cool completely and then transfer it to a mixer jar.",
    "[00:01:01.000] Now add 100g jaggery, 50g thick tamarind pulp, and 1 tbsp cumin.",
    "[00:01:10.000] Add 6-7 garlic cloves, salt, and pour hot water to grind it into a fine paste.",
    "[00:01:15.000] Using hot water preserves the chutney for almost a month.",
    "[00:01:23.000] To store it longer, add heated and cooled oil on top and refrigerate to keep it fresh for 3-4 months."
  ]
}