{
  "metadata": {
    "title": " | చలిమిడి | ఈ టిప్స్ పాటిస్తే ఈసీ గా మీరు అమ్మమ్మలలా వెన్నలా కరిగిప్పోయే చలిమిడి చేస్తారు",
    "channel_name": "Vismai Food",
    "publish_date": "2018-12-10",
    "view_count": 2230137,
    "like_count": 23173,
    "duration": "02:52",
    "language": "Telugu",
    "video_id": "TbijCvjEZrc",
    "url": "https://www.youtube.com/watch?v=TbijCvjEZrc",
    "description": "Chalimidi recipe by Vismai Food. Traditional Telugu sweet recipe.",
    "ingredients_detected": [
      "250g Jaggery",
      "2 tbsp Sugar",
      "1 tsp Ghee (for syrup)",
      "350g Wet Rice Flour (approx.)",
      "2 tbsp Ghee (for nuts)",
      "1/4 cup Cashews",
      "2-3 tbsp Dry Coconut chunks",
      "1 tbsp Poppy Seeds",
      "1 tsp Cardamom powder"
    ]
  },
  "transcription_telugu": [
    "[00:00:00.000] హలో ఫుడీస్, వెల్కమ్ టు విస్మయ్ ఫుడ్. ఇవాల్టి స్పెషల్ తెలుగువాళ్ళ వారసత్వ రెసిపీ చలిమిడి.",
    "[00:00:21.000] ముందుగా మందపాటి బౌల్ లో 250 గ్రాముల బెల్లం తరుగు, రెండు టేబుల్ స్పూన్ల పంచదార వేసుకోండి.",
    "[00:00:29.000] బెల్లం మునిగేంత వరకు నీళ్లు పోసి బెల్లాన్ని కరగనివ్వండి.",
    "[00:00:36.000] పాకం పొంగొస్తున్నప్పుడు ఒక టీస్పూన్ నెయ్యి వేయండి, దీనివల్ల చలిమిడికి మంచి కలర్ వస్తుంది.",
    "[00:00:46.000] పాకం కాస్త తీసుకుని నీళ్లలో వేస్తే ఇలా ఉండ కట్టాలి.",
    "[00:00:54.000] ఇప్పుడు తడి బియ్యం పిండిని కొద్దికొద్దిగా వేస్తూ ఉండలు లేకుండా కలుపుకోవాలి.",
    "[00:01:15.000] నాకు మొత్తం 350 గ్రాముల తడి బియ్యం పిండి పట్టింది. బియ్యం పిండి నాణ్యతను బట్టి ఇది మారుతుంది.",
    "[00:01:23.000] పిండి బిరుసెక్కాక పక్కన పెట్టుకోండి, మరీ ఎక్కువ సేపు ఉడికించకండి.",
    "[00:01:36.000] మరో కడాయిలో రెండు టేబుల్ స్పూన్ల నెయ్యి కరిగించి జీడిపప్పు, కొబ్బరి ముక్కలు ఎర్రగా వేయించుకోండి.",
    "[00:02:09.000] ఇందులో ఒక టేబుల్ స్పూన్ గసగసాలు కూడా వేసి వేయించి చలిమిడిలో కలపండి.",
    "[00:02:20.000] చివరగా యాలకుల పొడి వేసి బాగా కలుపుకుంటే చలిమిడి రెడీ."
  ],
  "transcription_english": [
    "[00:00:00.000] Hello Foodies, welcome to Vismai Food. Today's special is a traditional Telugu recipe, Chalimidi.",
    "[00:00:21.000] In a thick bowl, add 250g jaggery and 2 tbsp sugar.",
    "[00:00:29.000] Add water until the jaggery is covered and let it dissolve.",
    "[00:00:36.000] When the syrup starts boiling, add 1 tsp ghee for a beautiful color.",
    "[00:00:46.000] Test the syrup by dropping a bit in water; it should form a soft lump.",
    "[00:00:54.000] Gradually add wet rice flour while stirring to avoid lumps.",
    "[00:01:15.000] I used around 350g of wet rice flour, but the amount depends on the quality of the rice and jaggery.",
    "[00:01:23.000] Once it thickens into a lump, remove from heat. Do not overcook as it might lose its softness.",
    "[00:01:36.000] In another pan, heat 2 tbsp ghee and fry cashews and dry coconut chunks until golden.",
    "[00:02:09.000] Add 1 tbsp poppy seeds, fry them, and then add everything to the Chalimidi mixture.",
    "[00:02:20.000] Finally, add 1 tsp cardamom powder and mix well. Your perfect Chalimidi is ready."
  ]
}