{
  "metadata": {
    "title": "#CurryleavesChicken| కర్వేపాకు కోడి మసాలా | The Best Curry Leaves Chicken | The Best Chicken Chicken",
    "channel_name": "Vismai Food",
    "publish_date": "2018-09-09",
    "view_count": 197792,
    "like_count": 2970,
    "duration": "02:06",
    "language": "Telugu",
    "video_id": "Q3GULDqVX1c",
    "url": "https://www.youtube.com/watch?v=Q3GULDqVX1c",
    "description": "Rayalaseema style aromatic Curry Leaves Chicken recipe.",
    "ingredients_detected": [
      "500gms Chicken",
      "1tbsp Ginger Garlic Paste",
      "4 Green Chillies",
      "2tbsps Coriander Chopped",
      "3 Sprigs Curry Leaves Chopped",
      "1tsp Coriander Powder",
      "1tbsp Red Chilli Powder",
      "1/2tsp Garam Masala",
      "Salt (to taste)",
      "1/2tsp Turmeric",
      "1/2tsp Black Pepper Powder",
      "1/2tsp Roasted Cumin Powder",
      "1/2 Cup Curd",
      "1 Small Onion Chopped",
      "1 Lemon (juice)",
      "3tbsps Oil"
    ]
  },
  "transcription_telugu": [
    "[00:00:00] హలో ఫుడీస్, వెల్కమ్ టు విస్మయ్ ఫుడ్. ఇవాళ స్పెషల్ కరివేపాకు కోడి మసాలా కూర.",
    "[00:00:10] ఎప్పుడూ చేసుకునే చికెన్ కర్రీలకు బదులు ఒకసారి ఈ రెసిపీ ట్రై చేయండి, అందరికీ నచ్చుతుంది.",
    "[00:00:20] ముందుగా 500 గ్రాముల చికెన్ తీసుకుని అందులో అల్లం వెల్లుల్లి పేస్ట్, పచ్చిమిర్చి, కొత్తిమీర, కరివేపాకు తరుగు వేయండి.",
    "[00:00:33] ధనియాల పొడి, కారం, గరం మసాలా, ఉప్పు, పసుపు, మిరియాల పొడి మరియు జీలకర్ర పొడి కూడా చేర్చండి.",
    "[00:00:47] పెరుగు, ఉల్లిపాయ తరుగు మరియు నిమ్మరసం పిండి ముక్కలకి మసాలాలని బాగా పట్టించాలి.",
    "[00:01:00] ఈ మసాలా పట్టించిన చికెన్‌ను ఒక గంట పాటు ఫ్రిజ్‌లో ఉంచండి.",
    "[00:01:10] కడాయిలో నూనె వేడి చేసి, నానబెట్టిన చికెన్‌ను హై ఫ్లేమ్ మీద 3 నిమిషాలు టాస్ చేయండి.",
    "[00:01:31] మూత పెట్టి మీడియం ఫ్లేమ్ మీద 20 నిమిషాల పాటు ఉడికించండి.",
    "[00:01:48] నూనె పైకి తేలి కూర దగ్గర పడ్డాక స్టవ్ ఆపేయండి. కరివేపాకు చికెన్ రెడీ."
  ],
  "transcription_english": [
    "[00:00:00] Hello Foodies, welcome to Vismai Food. Today's special is Curry Leaves Chicken Masala.",
    "[00:00:10] Instead of regular chicken curries, try this recipe once; everyone will love it.",
    "[00:00:20] First, take 500g chicken and add ginger-garlic paste, green chillies, coriander, and chopped curry leaves.",
    "[00:00:33] Add coriander powder, chili powder, garam masala, salt, turmeric, pepper powder, and cumin powder.",
    "[00:00:47] Add curd, chopped onions, and lemon juice; massage the spices well into the chicken.",
    "[00:01:00] Place the marinated chicken in the refrigerator for 1 hour.",
    "[00:01:10] Heat oil in a pan and toss the marinated chicken on high flame for 3 minutes.",
    "[00:01:31] Cover and cook on medium flame for 20 minutes.",
    "[00:01:48] Once the oil floats to the top and the curry thickens, it is ready to serve."
  ]
}