{
  "metadata": {
    "title": "Pineapple Ravva Kesari | పైన్ ఆపిల్ రవ్వ కేసరి | ఓ సారి ఇది తిన్నారంటే మామూలు కేసరి మర్చిపోతారు!",
    "channel_name": "Vismai Food",
    "publish_date": "2018-12-11",
    "view_count": 368281,
    "like_count": 4575,
    "duration": "02:46",
    "language": "Telugu",
    "video_id": "ioUZLWy_osw",
    "url": "https://www.youtube.com/watch?v=ioUZLWy_osw",
    "description": "Authentic Pineapple Ravva Kesari recipe with perfect measurements explained by Vismai Food.",
    "ingredients_detected": [
      "400ml Water",
      "150gms Sugar (1.4 Cups)",
      "100gms Ghee (for roasting & frying)",
      "1 Fistful Cashews",
      "3 tbsps Raisins",
      "200gms Semolina/Bombay Ravva (1.3/4 Cup)",
      "1 tsp Cardamom Powder",
      "1 pinch Saffron (soaked in milk)",
      "150gms Ripe Pineapple cubes",
      "4 tbsps Ghee (added in batches during cooking)"
    ]
  },
  "transcription_telugu": [
    "[00:00:00] హలో ఫుడీస్, వెల్కమ్ టు విస్మయ్ ఫుడ్. ఇవాల్టి యమ్మీ స్వీట్ పైన్ ఆపిల్ రవ్వ కేసరి.",
    "[00:00:25] ముందుగా ఓ బౌల్ లో 400ml వాటర్ బాయిల్ చేసుకోండి. నీళ్లు మరిగాక 150 గ్రాముల పంచదార వేయండి.",
    "[00:00:35] పంచదార కరిగాక నీళ్లు రెండు మూడు నిమిషాలు తెర్లనిచ్చి పక్కన ఉంచుకోండి.",
    "[00:00:41] ఇప్పుడు కడాయిలో ఒక కప్పు (110 గ్రాములు) నెయ్యి వేసి అందులో జీడిపప్పు, ఎండుద్రాక్ష వేసి ఎర్రగా వేపుకొని పక్కన ఉంచుకోండి.",
    "[00:00:58] ఇప్పుడు ఈ వేడి నెయ్యిలో 200 గ్రాముల బొంబాయి రవ్వ వేసి లో ఫ్లేమ్ మీద మంచి సువాసన వచ్చే వరకు వేపుకోవాలి.",
    "[00:01:21] రవ్వ వేగాక వేడి వేడి పంచదార పాకం నీళ్లు పోసుకొని హై ఫ్లేమ్ మీద ఉండలు లేకుండా బాగా కలుపుకోండి.",
    "[00:01:29] ఇప్పుడు ఒక టీస్పూన్ యాలకుల పొడి, చిటికెడు పాలల్లో నానేసిన కుంకుమపువ్వు వేసి రవ్వ దగ్గర పడే వరకు ఉడికించుకోండి.",
    "[00:01:43] దగ్గర పడ్డాక 150 గ్రాముల పండిన పైన్ ఆపిల్ ముక్కలు వేసి కలుపుకోండి.",
    "[00:01:49] ఆ తర్వాత రెండు టేబుల్ స్పూన్ల నెయ్యి వేసి బాగా కలుపుకొని మూత పెట్టి ఐదు నిమిషాలు లో ఫ్లేమ్ మీద మగ్గనివ్వండి.",
    "[00:02:02] ఇప్పుడు మళ్ళీ మరో రెండు టేబుల్ స్పూన్ల నెయ్యి, వేయించుకున్న జీడిపప్పు, కిస్మిస్ వేసి నెయ్యి వేరుపడేదాకా ఉడికించుకోండి.",
    "[00:02:13] నెయ్యి సెపరేట్ అయ్యాక యమ్మీ పైన్ ఆపిల్ కేసరి రెడీ."
  ],
  "transcription_english": [
    "[00:00:00] Hello Foodies, welcome to Vismai Food. Today's yummy sweet is Pineapple Ravva Kesari.",
    "[00:00:25] First, boil 400ml water in a bowl. Once boiling, add 150gms of sugar.",
    "[00:00:35] After the sugar dissolves, let the water boil for 2-3 minutes and set it aside.",
    "[00:00:41] Now, heat one cup (110gms) of ghee in a pan and fry cashews and raisins until golden brown; set aside.",
    "[00:00:58] In the same hot ghee, add 200gms of semolina (Bombay Ravva) and roast on low flame until aromatic and light golden.",
    "[00:01:21] Once roasted, pour the hot sugar syrup water and stir well on high flame to avoid lumps.",
    "[00:01:29] Now add one teaspoon of cardamom powder and a pinch of saffron soaked in milk; cook until it thickens.",
    "[00:01:43] Once thickened, add 150gms of ripe pineapple cubes and mix well.",
    "[00:01:49] Then add two tablespoons of ghee, mix, cover and cook on low flame for five minutes until the pineapple softens.",
    "[00:02:02] Now add another two tablespoons of ghee and the fried cashews and raisins; cook until the ghee separates.",
    "[00:02:13] Once the ghee separates, the yummy pineapple kesari is ready."
  ]
}