{
  "metadata": {
    "title": "Kandi Podi | కంది పొడి | ఈ సారి కంది పొడి ఇది కలిపి ఈ కొలతల్లో ట్రై చేయండి ఎంత బావుంటుందో!",
    "channel_name": "Vismai Food",
    "publish_date": "2018-12-14",
    "view_count": 561616,
    "like_count": 7341,
    "duration": "01:52",
    "language": "Telugu",
    "video_id": "GqdYlWLHutI",
    "url": "https://www.youtube.com/watch?v=GqdYlWLHutI",
    "description": "Authentic Kandi Podi recipe with a secret ingredient (dry ginger) for enhanced flavor.",
    "ingredients_detected": [
      "1.4 Cups Toor Dal (Kandi Pappu)",
      "1 Cup Chana Dal (Pachishenagapappu)",
      "1 Cup Moong Dal (Pesarappu)",
      "1/2 Cup Urad Dal (Minapappu)",
      "50gms Dry Red Chillies",
      "2 tbsps Cumin (Jeelakarra)",
      "3 tbsps Dry Ginger Powder (Shonti)",
      "Salt (to taste)"
    ]
  },
  "transcription_telugu": [
    "[00:00:00.000] హలో ఫుడీస్, వెల్కమ్ టు విస్మయ్ ఫుడ్. ఇవాల్టి స్పెషల్ కంది పొడి. ఇది వేడి వేడి అన్నంలో నెయ్యి వేసుకుని తింటే చాలా అద్భుతంగా ఉంటుంది.",
    "[00:00:23.000] ముందుగా ఒక పాన్ లో 1.4 కప్పుల కందిపప్పు వేసి లో ఫ్లేమ్ మీద మంచి సువాసన వచ్చే వరకు వేపుకోవాలి.",
    "[00:00:33.000] ఆ తర్వాత ఒక కప్పు పచ్చి శనగపప్పు వేసి లో ఫ్లేమ్ లో ఎర్రగా వేపుకుని పక్కన పెట్టుకోండి.",
    "[00:00:41.000] ఇప్పుడు ఒక కప్పు పెసరపప్పు వేసి లో ఫ్లేమ్ లో కరకరలాడే వరకు వేపుకోవాలి.",
    "[00:00:50.000] అర కప్పు మినప్పప్పు కూడా వేసి దోరగా వేపుకుని బౌల్ లోకి తీసుకోండి.",
    "[00:01:00.000] ఇప్పుడు 50 గ్రాముల ఎండుమిర్చి, రెండు టేబుల్ స్పూన్ల జీలకర్ర వేసి లో ఫ్లేమ్ లో వేపుకోవాలి.",
    "[00:01:15.000] వేయించుకున్న వాటన్నింటినీ పూర్తిగా చల్లారనివ్వాలి.",
    "[00:01:17.000] ముందుగా ఎండుమిరపకాయలను మిక్సీ జార్ లో వేసి గ్రైండ్ చేసుకోండి.",
    "[00:01:21.000] ఇప్పుడు అందులో మూడు టేబుల్ స్పూన్ల శొంఠి పొడి, రుచికి సరిపడా ఉప్పు, వేయించి పెట్టుకున్న పప్పులన్నీ వేయాలి.",
    "[00:01:31.000] వీటన్నింటినీ కలిపి మెత్తని పొడిలాగా గ్రైండ్ చేసుకోవాలి.",
    "[00:01:40.000] అంతే ఎంతో రుచికరమైన కంది పొడి రెడీ."
  ],
  "transcription_english": [
    "[00:00:00.000] Hello Foodies, welcome to Vismai Food. Today's special is Kandi Podi. It tastes amazing with hot rice and ghee.",
    "[00:00:23.000] First, roast 1.4 cups of Toor Dal in a pan on low flame until aromatic.",
    "[00:00:33.000] Then, add 1 cup of Chana Dal and roast on low flame until golden brown and keep aside.",
    "[00:00:41.000] Now add 1 cup of Moong Dal and roast on low flame until it becomes crunchy.",
    "[00:00:50.000] Roast 1/2 cup of Urad Dal until aromatic and take it into a bowl.",
    "[00:01:00.000] Now roast 50g of dry red chillies and 2 tablespoons of cumin on low flame.",
    "[00:01:15.000] Allow all roasted ingredients to cool down completely.",
    "[00:01:17.000] First, grind the dry red chillies in a mixer jar.",
    "[00:01:21.000] Now add 3 tablespoons of dry ginger powder, salt to taste, and all roasted lentils.",
    "[00:01:31.000] Grind everything together into a fine powder.",
    "[00:01:40.000] That's it, the delicious Kandi Podi is ready."
  ]
}