{
  "metadata": {
    "title": "Sprouts Curry | మొలకల కూర | బటాని కుర్మా | ఈ కూర చపాతీల్లోకి తిని చూడండి మళ్ళీ మళ్ళీ ఇదే కావాలంటారు!",
    "channel_name": "Vismai Food",
    "publish_date": "2018-12-14",
    "view_count": 396837,
    "like_count": 4869,
    "duration": "02:35",
    "language": "Telugu",
    "video_id": "jlF6RjMXfz8",
    "url": "https://www.youtube.com/watch?v=jlF6RjMXfz8",
    "description": "Delicious and healthy Sprouts Curry, perfect for chapati, roti, or rice.",
    "ingredients_detected": [
      "100gms Sprouted Peas",
      "2 tbsps Peanuts",
      "2 tbsps Melon Seeds",
      "1 tbsp Sesame Seeds",
      "2 tsps Dry Coconut Powder",
      "3 tbsps Oil",
      "0.5 tsp Cumin Seeds",
      "2 Green Chillies (chopped)",
      "1 Large Onion (chopped)",
      "1 tsp Ginger Garlic Paste",
      "1 tbsp Chilli Powder",
      "0.25 tsp Turmeric Powder",
      "0.5 tsp Roasted Cumin Powder",
      "0.5 tsp Coriander Powder",
      "Tomato Puree (from 2 tomatoes)",
      "75ml Water",
      "2 tbsps Coriander leaves (chopped)",
      "Salt (to taste)"
    ]
  },
  "transcription_telugu": [
    "[00:00:00.000] హలో ఫుడీస్, వెల్కమ్ టు విస్మయ్ ఫుడ్. ఇవాల్టి స్పెషల్ మొలకల కూర లేదా బటాని కుర్మా. ఇది చపాతీల్లోకి చాలా రుచిగా ఉంటుంది.",
    "[00:00:20.000] ముందుగా 100 గ్రాముల మొలకెత్తిన బటానీలను తగినన్ని నీళ్లలో మెత్తగా ఉడికించుకోవాలి.",
    "[00:00:33.000] ఒక పాన్ లో పల్లీలు, పుచ్చ గింజలు, నువ్వులు, కొబ్బరి పొడి వేసి వేపుకుని, చల్లారాక నీళ్లు పోసి మెత్తని పేస్ట్ లా గ్రైండ్ చేసుకోండి.",
    "[00:01:00.000] కడాయిలో ఆయిల్ వేసి జీలకర్ర, పచ్చిమిర్చి, ఉల్లిపాయ ముక్కలు వేసి గోల్డెన్ బ్రౌన్ కలర్ వచ్చే వరకు వేపుకోవాలి.",
    "[00:01:12.000] అల్లం వెల్లుల్లి పేస్ట్ వేసి పచ్చి వాసన పోయాక కారం, ఉప్పు, పసుపు, జీలకర్ర పొడి, ధనియాల పొడి వేసి వేపుకోండి.",
    "[00:01:31.000] ఇందులో టమాటో ప్యూరీ వేసి నూనె పైకి తేలే వరకు ఉడికించి, తర్వాత సిద్ధం చేసుకున్న పల్లీల పేస్ట్ వేసి కలపాలి.",
    "[00:01:50.000] ఇప్పుడు ఉడికించిన మొలకలు, 75ml నీళ్లు పోసి నూనె పైకి తేలే వరకు సిమ్ లో ఉడికించుకోండి.",
    "[00:02:14.000] చివరగా కొత్తిమీర చల్లుకుంటే ఎంతో రుచికరమైన మొలకల కూర రెడీ."
  ],
  "transcription_english": [
    "[00:00:00.000] Hello Foodies, welcome to Vismai Food. Today's special is Sprouts Curry or Peas Kurma. It pairs perfectly with chapati.",
    "[00:00:20.000] First, boil 100g of sprouted peas in sufficient water until soft.",
    "[00:00:33.000] Roast peanuts, melon seeds, sesame seeds, and coconut powder; once cooled, add water and blend into a fine paste.",
    "[00:01:00.000] Heat oil in a pan, add cumin, green chillies, and onions; sauté until they turn golden brown.",
    "[00:01:12.000] Add ginger-garlic paste, then add chilli powder, salt, turmeric, cumin powder, and coriander powder; sauté well.",
    "[00:01:31.000] Add tomato puree and cook until oil separates, then mix in the prepared peanut paste.",
    "[00:01:50.000] Add the boiled sprouts and 75ml of water; simmer on low flame until the oil floats on top.",
    "[00:02:14.000] Garnish with coriander leaves; the delicious Sprouts Curry is now ready."
  ]
}