{
  "metadata": {
    "title": "Semiya Pulao in 15 mins | సేమియా పులావు | ఇలా సేమియా పులావు చేస్తే అందరు అడిగి మరి చేయించుకుంటారు",
    "channel_name": "Vismai Food",
    "publish_date": "2018-12-16",
    "view_count": 1547824,
    "like_count": 15529,
    "duration": "02:14",
    "language": "Telugu",
    "video_id": "sp6xKqUe7G0",
    "url": "https://www.youtube.com/watch?v=sp6xKqUe7G0",
    "description": "Quick and tasty Semiya Pulao recipe in Telugu by Vismai Food.",
    "ingredients_detected": [
      "1 tbsp Ghee",
      "1 Cup Semiya (110 grams)",
      "2 tbsps Oil",
      "4 Cloves",
      "1 inch Cinnamon",
      "4 Cardamom",
      "1 bay leaf",
      "1 tsp shah jeera",
      "1 Onion sliced",
      "3 green chillies",
      "1/4 cup Fresh green peas",
      "1 Carrot Cubes",
      "1/2 Capsicum Cubes",
      "Salt (to taste)",
      "1/2 tsp garam masala",
      "1/4 tsp Turmeric",
      "1 tsp Ginger garlic paste",
      "2 Cups water",
      "1 Tomato chopped",
      "1/2 Bunch Coriander Chopped",
      "1/2 Bunch mint Chopped",
      "1 Lemon juice"
    ]
  },
  "transcription_telugu": [
    "[00:00:01.000] పాన్‌లో ఒక టేబుల్ స్పూన్ నెయ్యి కరిగించుకుని, అందులో ఒక కప్పు సేమియా వేసి లో ఫ్లేమ్ మీద మంచి రంగు వచ్చేవరకు ఫ్రై చేసుకోండి.",
    "[00:00:17.000] ఇప్పుడు రెండు టేబుల్ స్పూన్ల ఆయిల్ హీట్ చేసి, అందులో లవంగాలు, దాల్చిన చెక్క, యాలకులు, బిర్యానీ ఆకు, షాజీరా వేయండి.",
    "[00:00:27.000] ఒక ఉల్లిపాయ చీలికలు వేసి మీడియం ఫ్లేమ్ మీద మంచి రంగు వచ్చేవరకు ఫ్రై చేసుకోండి.",
    "[00:00:34.000] ఉల్లిపాయలు వేగాక మూడు పచ్చిమిర్చి చీలికలు వేసి వేపుకోండి.",
    "[00:00:41.000] ఇప్పుడు పావు కప్పు పచ్చి బఠాణీ, క్యారెట్ ముక్కలు, క్యాప్సికమ్ ముక్కలు వేసి 60-70% వరకు కుక్ చేసుకోండి.",
    "[00:00:57.000] రుచికి సరిపడా ఉప్పు, అర చెంచా గరం మసాలా, పావు చెంచా పసుపు వేసి కలుపుకోండి.",
    "[00:01:05.000] ఒక టీస్పూన్ అల్లం వెల్లుల్లి పేస్ట్ వేసి పచ్చి వాసన పోయే వరకు ఫ్రై చేయండి.",
    "[00:01:10.000] సేమియాకు రెట్టింపు అంటే రెండు కప్పుల నీళ్లు పోసి నీటిని మసలకాగనివ్వండి.",
    "[00:01:21.000] మరుగుతున్న నీళ్లలో వేయించిన సేమియా వేసి బాగా కలుపుకోండి.",
    "[00:01:28.000] టమాటో ముక్కలు, కొత్తిమీర తరుగు, పుదీనా తరుగు వేసి జాగ్రత్తగా కలుపుకొని మూత పెట్టేయండి.",
    "[00:01:39.000] మూత పెట్టి ఏడు ఎనిమిది నిమిషాల పాటు మీడియం ఫ్లేమ్ మీద ఉడికించుకోండి.",
    "[00:01:50.000] దించే ముందు నిమ్మరసం పిండి, నెమ్మదిగా కలుపుకొని 15 నిమిషాల పాటు వదిలేయండి."
  ],
  "transcription_english": [
    "[00:00:01.000] Melt 1 tbsp ghee in a pan, add 1 cup semiya and roast on low flame until golden brown.",
    "[00:00:17.000] Heat 2 tbsps oil and add cloves, cinnamon, cardamom, bay leaf, and shah jeera.",
    "[00:00:27.000] Add sliced onions and fry on medium flame until they change color.",
    "[00:00:34.000] Add 3 green chillies and fry well.",
    "[00:00:41.000] Add 1/4 cup green peas, carrot cubes, and capsicum cubes; cook until 60-70% done.",
    "[00:00:57.000] Add salt to taste, 1/2 tsp garam masala, and 1/4 tsp turmeric.",
    "[00:01:05.000] Add 1 tsp ginger garlic paste and sauté until the raw smell disappears.",
    "[00:01:10.000] Pour 2 cups of water (double the amount of semiya) and let it come to a boil.",
    "[00:01:21.000] Add the roasted semiya to the boiling water and mix well.",
    "[00:01:28.000] Add chopped tomatoes, coriander, and mint leaves; mix gently and cover with a lid.",
    "[00:01:39.000] Cover and cook on medium flame for 7-8 minutes.",
    "[00:01:50.000] Before serving, squeeze lemon juice, mix gently, and let it rest for 15 minutes."
  ]
}