{
  "metadata": {
    "title": "Instant Semiya Idli | సేమియా ఇడ్లి | అప్పటికప్పుడే చేసుకునే సేమియా ఇడ్లి | వెన్నలా కరిగిపోతాయి.",
    "channel_name": "Vismai Food",
    "publish_date": "2018-12-19",
    "view_count": 85528,
    "like_count": 1114,
    "duration": "02:12",
    "language": "Telugu",
    "video_id": "8fUFqWS5fes",
    "url": "https://www.youtube.com/watch?v=8fUFqWS5fes",
    "description": "Instant Semiya Idli recipe explained in detail.",
    "ingredients_detected": [
      "1 tbsp Oil",
      "1/2 tsp Mustard seeds",
      "1 tsp Chana Dal",
      "1 Cup Semiya (110 grams)",
      "1/2 cup Curd",
      "1/2 cup Grated Carrots",
      "2 tbsps Semolina(rava)",
      "Sufficient water (for idli batter consistency)",
      "1/2 inch Ginger chopped",
      "1 Green Chilli Chopped",
      "Salt (to taste)",
      "2 tbsps Coriander chopped"
    ]
  },
  "transcription_telugu": [
    "[00:00:00.000] హే ఫుడీస్, వెల్కమ్ టు విస్మయ్ ఫుడ్. ఇవాళ్టి సింపుల్ టేస్టీ బ్రేక్ ఫాస్ట్ ఇన్స్టంట్ సేమియా ఇడ్లీ.",
    "[00:00:20.000] కడాయిలో ఓ టేబుల్ స్పూన్ ఆయిల్ హీట్ చేసుకొని అందులో అర టీస్పూన్ ఆవాలు, ఓ టీస్పూన్ శనగపప్పు వేసి ఎర్రగా వేపుకోండి.",
    "[00:00:33.000] ఇదే కడాయిలో ఓ కప్పు అంటే 110 గ్రాముల సేమియా వేసి లో ఫ్లేమ్ మీద ఎర్రగా వేపుకోండి.",
    "[00:00:46.000] ఇప్పుడు మిక్సింగ్ బౌల్ లో అర కప్పు కమ్మటి పెరుగు, అర కప్పు క్యారెట్ తురుము, రెండు టేబుల్ స్పూన్ల బొంబాయి రవ్వ వేసి బాగా కలుపుకోండి.",
    "[00:00:57.000] ఇందులో అర కప్పు నీళ్లు పోసుకొని వేయించుకున్న సేమియా వేసి బాగా కలుపుకోండి.",
    "[00:01:08.000] ఇందులో చిన్న అల్లం తరుగు, ఓ పచ్చిమిర్చి తరుగు, సాల్ట్, రెండు టేబుల్ స్పూన్ల కొత్తిమీర తరుగు వేసి బాగా కలుపుకొని 30 నిమిషాలు నానబెట్టుకోండి.",
    "[00:01:28.000] ఇప్పుడు ఇడ్లీ ప్లేట్స్ కి నెయ్యి రాసుకొని పల్చగా ఇడ్లీలు వేసుకోండి.",
    "[00:01:45.000] ఇప్పుడు ఇడ్లీ కుక్కర్ లో పెట్టి ఎనిమిది నిమిషాలు మీడియం ఫ్లేమ్ మీద, నాలుగు నిమిషాలు లో ఫ్లేమ్ మీద స్టీమ్ కుక్ చేసుకోండి.",
    "[00:01:55.000] అల్లం చట్నీతో సర్వ్ చేస్తే చాలా బాగుంటుంది."
  ],
  "transcription_english": [
    "[00:00:00.000] Hey Foodies, welcome to Vismai Food. Today's simple tasty breakfast is Instant Semiya Idli.",
    "[00:00:20.000] Heat 1 tbsp oil in a pan and fry 1/2 tsp mustard seeds and 1 tsp chana dal until golden.",
    "[00:00:33.000] In the same pan, add 1 cup (110 grams) of semiya and roast on low flame until golden.",
    "[00:00:46.000] In a mixing bowl, combine 1/2 cup curd, 1/2 cup grated carrots, and 2 tbsp semolina (rava); mix well.",
    "[00:00:57.000] Pour 1/2 cup water and add the roasted semiya; mix thoroughly.",
    "[00:01:08.000] Add chopped ginger, 1 chopped green chilli, salt, and 2 tbsp chopped coriander; mix well and let it soak for 30 minutes.",
    "[00:01:28.000] Grease idli plates with ghee and pour thin idlis.",
    "[00:01:45.000] Steam cook in an idli cooker for 8 minutes on medium flame and 4 minutes on low flame.",
    "[00:01:55.000] It tastes great when served with ginger (allam) chutney."
  ]
}