{
  "metadata": {
    "title": "Nalla Karam | నల్ల కారం | ఇడ్లి లోకి అట్లలోకి ఈ పొడి ఓ సారి ట్రై చేసి చుడండి వదిలితే ఒట్టు",
    "channel_name": "Vismai Food",
    "publish_date": "2018-12-22",
    "view_count": 2153410,
    "like_count": 29998,
    "duration": "02:21",
    "language": "Telugu",
    "video_id": "Epx_huzIxJk",
    "url": "https://www.youtube.com/watch?v=Epx_huzIxJk",
    "description": "Traditional South Indian Nalla Karam (Spicy Lentil Powder) recipe for Idli and Dosa.",
    "ingredients_detected": [
      "2 tbsps Oil",
      "1/2 cup Urad Dal (Minapappu)",
      "1/4 cup Chana Dal (Senagapappu)",
      "1/4 cup Coriander Seeds (Dhaniyalu)",
      "1 tbsp Cumin Seeds (Jeelakarra)",
      "25-30 Dry Red Chillies (Endumirapa)",
      "1/2 cup Curry Leaves (Karivepaku)",
      "Small lemon-sized Tamarind (Chintapandu)",
      "10-12 Garlic Pods (Vellulli)",
      "Salt (to taste)"
    ]
  },
  "transcription_telugu": [
    "[00:00:01.000] పాన్‌లో ఒక టేబుల్ స్పూన్ నూనె వేడి చేసి, అందులో అర కప్పు మినపప్పు, పావు కప్పు శనగపప్పు వేసి తక్కువ మంట మీద దోరగా వేయించుకోండి.",
    "[00:00:25.000] పప్పులు సగం వేగాక, అందులో పావు కప్పు ధనియాలు, ఒక టేబుల్ స్పూన్ జీలకర్ర వేసి మరికాసేపు వేపుకోండి.",
    "[00:00:45.000] ఇప్పుడు 25 నుండి 30 ఎండుమిరపకాయలు వేసి అవి క్రిస్పీగా అయ్యేవరకు వేయించి ఒక ప్లేట్లోకి తీసుకోండి.",
    "[00:01:05.000] అదే పాన్‌లో మరికొంచెం నూనె వేసి అర కప్పు కరివేపాకు వేసి పటపటలాడే వరకు వేయించుకోండి.",
    "[00:01:20.000] చల్లారిన పప్పులు, మిరపకాయల మిశ్రమాన్ని మిక్సీ జార్లోకి తీసుకోండి.",
    "[00:01:28.000] అందులో రుచికి సరిపడా ఉప్పు, చిన్న నిమ్మకాయంత చింతపండు వేసి మెత్తగా గ్రైండ్ చేసుకోండి.",
    "[00:01:40.000] చివరగా 10-12 వెల్లుల్లి రెబ్బలు వేసి ఒక్కసారి పల్స్ చేయండి.",
    "[00:01:50.000] ఎంతో రుచికరమైన నల్ల కారం రెడీ. ఇది ఇడ్లీ, దోశల్లోకి చాలా బాగుంటుంది."
  ],
  "transcription_english": [
    "[00:00:01.000] Heat a tablespoon of oil in a pan, add 1/2 cup urad dal and 1/4 cup chana dal; roast on low flame until golden brown.",
    "[00:00:25.000] When the lentils are half-roasted, add 1/4 cup coriander seeds and 1 tbsp cumin seeds; sauté for a while longer.",
    "[00:00:45.000] Now add 25 to 30 dry red chillies and fry until they turn crispy, then transfer to a plate.",
    "[00:01:05.000] In the same pan, add more oil and 1/2 cup curry leaves; fry until they are crisp.",
    "[00:01:20.000] Once the roasted ingredients have cooled, transfer them into a mixer jar.",
    "[00:01:28.000] Add salt to taste and a small lemon-sized piece of tamarind; grind into a fine powder.",
    "[00:01:40.000] Finally, add 10-12 garlic pods and pulse it once.",
    "[00:01:50.000] Delicious Nalla Karam is ready; it pairs perfectly with Idli and Dosa."
  ]
}