{
  "metadata": {
    "title": "Avakai Pulihora | ఆవకాయ పులిహోర | Spicy Pulihora in just 5mins | ఆవకాయ పచ్చడి పులిహోర",
    "channel_name": "Vismai Food",
    "publish_date": "2018-12-26",
    "view_count": 665016,
    "like_count": 10755,
    "duration": "02:18",
    "language": "Telugu",
    "video_id": "4g0U50OSJ6A",
    "url": "https://www.youtube.com/watch?v=4g0U50OSJ6A",
    "description": "Spicy and tangy Avakai Pulihora recipe made with mango pickle.",
    "ingredients_detected": [
      "1/4 Cup Oil",
      "1 tbsp Mustard seeds",
      "3 tbsps Peanuts",
      "1 tbsp Husked urad dal",
      "1 tbsp Chana dal",
      "5-6 Garlic cloves (crushed)",
      "2 sprigs Curry leaves",
      "2 Dry Red Chillies (chopped)",
      "2 Green chillies (chopped)",
      "2 pinches Asafetida (Hing)",
      "2 Large Tomatoes (chopped)",
      "1/4 tsp Turmeric",
      "1 handful Coriander leaves (chopped)",
      "Salt (to taste)",
      "1/2 Cup Mango Pickle (10-12 pieces)",
      "250g Cooked Rice (1 Cup)",
      "1 tbsp Ghee"
    ]
  },
  "transcription_telugu": [
    "[00:00:00.000] హేయ్ ఫుడీస్, వెల్కమ్ టు విస్మయ్ ఫుడ్. ఇవాల్టి యమ్మీ స్పైసీ రెసిపీ ఆవకాయ పులిహోర.",
    "[00:00:07.000] అవును, ఇది ఆవకాయ పచ్చడితో చేసేటువంటి పులిహోర. అబ్బబ్బబ్బా.. అదర్స్ అనాల్సిందే తిన్న తర్వాత.",
    "[00:00:15.000] ఒక్కసారి దీన్ని తిన్నారంటే మళ్ళీ మళ్ళీ ఇదే రెసిపీ.. అన్నం మిగిలినా ఇదే చేస్తారు, ఏ కూర చేయాలో తెలియనప్పుడు కూడా ఇదే చేసి పెట్టేస్తారు.",
    "[00:00:25.000] కడాయిలో మూడు టేబుల్ స్పూన్ల ఆయిల్ హీట్ చేసుకొని అందులో ఒక టేబుల్ స్పూన్ ఆవాలు, మూడు టేబుల్ స్పూన్ల పల్లీలు వేసి రెండు మూడు నిమిషాలు బాగా వేపుకోండి.",
    "[00:00:35.000] రెండు మూడు నిమిషాల తర్వాత ఒక టేబుల్ స్పూన్ పొట్టు మినప్పప్పు వేసుకోండి చాలా బాగుంటుంది. ఒక టేబుల్ స్పూన్ శనగపప్పు, ఐదు ఆరు నలక్కొట్టినటువంటి వెల్లుల్లి, రెండు రెబ్బల కరివేపాకు, రెండు ఎండుమిర్చి ముక్కలు కూడా వేసి ఎర్రగా వేపుకోండి.",
    "[00:00:52.000] తాలింపులు బాగా వేగాక రెండు పచ్చిమిర్చి తరుగు, రెండు చిటికెల ఇంగువ వేసి రెండు పెద్ద టమాటోల తరుగు, పావు చెంచా పసుపు కూడా వేసి బాగా కలుపుకోండి.",
    "[00:01:03.000] మూత పెట్టి టమాటోస్ మెత్తగా మగ్గేంత వరకు మీడియం ఫ్లేమ్ మీద మగ్గించుకోండి.",
    "[00:01:10.000] టమాటోస్ బాగా మగ్గాక ఒక పిడికెడు కాడలతో సహా కొత్తిమీర తరుగు వేసుకోండి. చాలా కొద్దిగా సాల్ట్, ఎక్కువగా సాల్ట్ పడదు ఇందులో.",
    "[00:01:22.000] ఇవన్నీ వేసి బాగా వేపుకొని అర కప్పు మామిడికాయ పచ్చడి అంటే సుమారుగా 10 నుంచి 12 మామిడికాయ ముక్కలతో ఉన్నటువంటి పచ్చడి.",
    "[00:01:30.000] ఇది వేసి బాగా కలుపుకొని ఒక కప్పు (250 గ్రాముల) బియ్యాన్ని వండుకున్నటువంటి రైస్. ఇది వేసి బాగా కలుపుకొని తాలింపునంతా బాగా పట్టించండి.",
    "[00:01:44.000] ఒక టేబుల్ స్పూన్ నెయ్యి వేసి వేడి వేడిగా తిన్నారంటే ఆహా.. అనాల్సిందే. ఏం కావాలి జీవితానికి ఇంతకు మించి అనిపించక మానదు.",
    "[00:01:57.000] మీకు దొరికితే పచ్చి మామిడికాయ తురుము కూడా వేసుకోవచ్చు పులుపు కావాలనుకున్నప్పుడు మాత్రమే.",
    "[00:02:01.000] ఏంటి నచ్చిందా? అయితే మీరు ట్రై చేసి మీకు ఎలా కుదిరిందో ఖచ్చితంగా ఆ పిక్ ని విస్మయ్ ఫుడ్ ఇన్ స్టా గ్రామ్ లో పోస్ట్ చేయండి."
  ],
  "transcription_english": [
    "[00:00:00.000] Hey foodies, welcome to Vismai Food. Today's yummy spicy recipe is Avakai Pulihora.",
    "[00:00:07.000] Yes, this is pulihora made with mango pickle. You'll definitely say 'awesome' after eating it.",
    "[00:00:15.000] Once you eat this, you'll make it again and again, whether you have leftover rice or don't know what curry to cook.",
    "[00:00:25.000] Heat three tablespoons of oil in a pan and fry one tablespoon of mustard seeds and three tablespoons of peanuts for 2-3 minutes.",
    "[00:00:35.000] After 2-3 minutes, add one tablespoon of split black gram (husked urad dal). It tastes great. Add one tablespoon of chana dal, 5-6 crushed garlic cloves, two sprigs of curry leaves, and two dry red chilli pieces; fry until golden.",
    "[00:00:52.000] After the tempering is well fried, add two chopped green chillies, two pinches of asafetida, two large chopped tomatoes, and 1/4 teaspoon of turmeric; mix well.",
    "[00:01:03.000] Cover and cook on medium flame until the tomatoes become soft.",
    "[00:01:10.000] After the tomatoes are well cooked, add a handful of chopped coriander leaves along with the stems. Add a very little salt; it doesn't need much salt.",
    "[00:01:22.000] Fry these well and add half a cup of mango pickle (approximately 10 to 12 mango pieces).",
    "[00:01:30.000] Mix this well and add one cup (250 grams) of cooked rice. Mix it thoroughly so the tempering coats the rice well.",
    "[00:01:44.000] Add one tablespoon of ghee and eat it hot. You'll say 'aha'. You'll feel what else is needed in life beyond this.",
    "[00:01:57.000] If available, you can also add grated raw mango if you want more sourness.",
    "[00:02:01.000] Did you like it? Then try it and post a picture of how it turned out on Vismai Food's Instagram."
  ]
}