{
  "metadata": {
    "title": "#MasalaWada | మసాలా వడ | Perfect Crispy Masala Wada | How to Make Masala Vada",
    "channel_name": "Vismai Food",
    "publish_date": "2018-09-10",
    "view_count": 2935363,
    "like_count": 24445,
    "duration": "02:00",
    "language": "Telugu",
    "video_id": "cggKsHYBfWU",
    "url": "https://www.youtube.com/watch?v=cggKsHYBfWU",
    "description": "Perfect crispy Masala Wada recipe by Vismai Food.",
    "ingredients_detected": [
      "1 Cup Chana Dal (soaked for 4 hours)",
      "1 tsp Ginger Garlic Paste",
      "1 inch Ginger (chopped)",
      "1 Sprig Curry Leaves (chopped)",
      "1 tsp Cumin",
      "3 Garlic cloves (chopped)",
      "2 Green Chillies (chopped)",
      "Salt (to taste)",
      "2 tbsps Soya Leaves (Dill)",
      "1 Small Onion (chopped)",
      "Oil (for deep frying)"
    ]
  },
  "transcription_telugu": [
    "[00:00:00.000] హలో ఫుడీస్, వెల్కమ్ టు విస్మయ్ ఫుడ్. ఈరోజు స్పెషల్ క్రంచీ మసాలా వడ.",
    "[00:00:05.000] చాలా ఈజీ, మంచి హెల్తీ ఈవెనింగ్ స్నాక్ ఇది. ఆ ట్విస్ట్ తో టేస్టీ క్రంచీ మసాలా వడ ఎలా తయారు చేయాలో చూద్దాం.",
    "[00:00:14.000] దీనికి ఒక కప్పు శనగపప్పుని నీళ్లు పోసి నాలుగు గంటలు నానబెట్టుకోవాలి.",
    "[00:00:20.000] నానబెట్టుకున్న శనగపప్పులోని నీళ్లన్నీ బాగా వడకట్టుకోవాలి. ఇందులో నుంచి రెండు పిడికిళ్ల శనగపప్పు తీసి పక్కన పెట్టుకోండి.",
    "[00:00:30.000] మిగిలిన శనగపప్పుని నీళ్లు కలపకుండా కాస్త బరకగా గ్రైండ్ చేసుకోండి.",
    "[00:00:37.000] ఈ పిండిని ఒక బౌల్ లోకి తీసుకుని, పక్కన పెట్టుకున్న శనగపప్పు, ఒక టీస్పూన్ అల్లం వెల్లుల్లి పేస్ట్, ఒక ఇంచు అల్లం తరుగు వేయండి.",
    "[00:00:47.000] అలాగే కరివేపాకు తరుగు, ఒక టీస్పూన్ జీలకర్ర, మూడు వెల్లుల్లి తరుగు, రెండు పచ్చిమిర్చి తరుగు, ఉప్పు వేయండి.",
    "[00:00:58.000] ఇప్పుడు ట్విస్ట్ - రెండు టేబుల్ స్పూన్ల సోయకూర. దీనివల్ల వడ రుచి మారిపోతుంది.",
    "[00:01:07.000] ఒక చిన్న ఉల్లిపాయ తరుగు వేసి నీళ్లు లేకుండా బాగా కలుపుకోండి.",
    "[00:01:20.000] ఇప్పుడు చిన్న ముద్దను తీసుకుని వడలా తట్టుకుని మీడియం ఫ్లేమ్ లో వేపుకోండి.",
    "[00:01:30.000] గోల్డెన్ బ్రౌన్ కలర్ వచ్చేంత వరకు మీడియం ఫ్లేమ్ లో ఫ్రై చేసుకోవాలి.",
    "[00:01:42.000] వేడివేడిగా ఈ మసాలా వడ రుచి చాలా బాగుంటుంది."
  ],
  "transcription_english": [
    "[00:00:00.000] Hello Foodies, welcome to Vismai Food. Today's special is crunchy Masala Wada.",
    "[00:00:05.000] It's a very easy and healthy evening snack. Let's see how to make it with a twist.",
    "[00:00:14.000] Soak one cup of chana dal in water for four hours.",
    "[00:00:20.000] Drain the water completely. Reserve two handfuls of dal and set aside.",
    "[00:00:30.000] Grind the remaining dal coarsely without adding any water.",
    "[00:00:37.000] Take this paste into a bowl, add the reserved dal, one tsp ginger-garlic paste, and one inch chopped ginger.",
    "[00:00:47.000] Add chopped curry leaves, one tsp cumin, three chopped garlic cloves, two chopped green chillies, and salt.",
    "[00:01:08.000] Now the twist - add 2 tablespoons of soya leaves (dill). It changes the taste completely.",
    "[00:01:07.000] Add one small chopped onion and combine well without water.",
    "[00:01:20.000] Take a small portion, shape it like a vada, and drop it in hot oil.",
    "[00:01:30.000] Fry on medium flame until they turn golden brown.",
    "[00:01:42.000] These hot masala vadas taste wonderful."
  ]
}