{
  "metadata": {
    "title": "Amla Pickle | 1000 Years Old Style AMLA PICKLE | ఉసిరికాయ పచ్చడి | వేల సంవత్సరాల పురాతన పద్ధతి",
    "channel_name": "Vismai Food",
    "publish_date": "2018-12-27",
    "view_count": 172906,
    "like_count": 2845,
    "duration": "02:54",
    "language": "Telugu",
    "video_id": "NE0OmIMXtqw",
    "url": "https://www.youtube.com/watch?v=NE0OmIMXtqw",
    "description": "Ancient style Amla pickle recipe, a very healthy and immune-boosting traditional pickle.",
    "ingredients_detected": [
      "1 tbsp Cumin seeds",
      "1/2 tsp Fenugreek seeds (Methi)",
      "1/2 tsp Black pepper",
      "250g Grated Amla (Indian Gooseberry)",
      "2 tbsps Oil (for initial saute)",
      "1 tsp Turmeric powder",
      "2 tsps Himalayan Salt (Saindhava Lavanam)",
      "2 tsps Oil (for tempering)",
      "1 tsp Mustard seeds",
      "2 Dry Red Chillies",
      "1/4 tsp Asafoetida (Hing)"
    ]
  },
  "transcription_telugu": [
    "[00:00:00.000] హలో ఫుడీస్, వెల్కమ్ టు విస్మయ్ ఫుడ్. ఇవాల్టి స్పెషల్ మనం మర్చిపోయినటువంటి వేల సంవత్సరాల పురాతన పద్ధతిలో ఉసిరికాయ పచ్చడి.",
    "[00:00:23.000] ముందుగా ఒక పాన్ లో ఒక టేబుల్ స్పూన్ జీలకర్ర, అర టీస్పూన్ మెంతులు, అర టీస్పూన్ మిరియాలు వేసి లో ఫ్లేమ్ లో మంచి సువాసన వచ్చే వరకు వేపుకోండి.",
    "[00:00:48.000] ఇప్పుడు రెండు టేబుల్ స్పూన్ల నూనె వేడి చేసి అందులో 250 గ్రాముల ఉసిరికాయల తురుము వేసి రెండు మూడు నిమిషాల పాటు వేయించుకోండి. పచ్చి వాసన పోతే చాలు.",
    "[00:01:29.000] ఇందులో ఒక టీస్పూన్ పసుపు, రెండు టీస్పూన్ల సైంధవ లవణం (Himalayan salt) వేసి కలుపుకొని పూర్తిగా చల్లారనివ్వండి.",
    "[00:01:42.000] వేయించి పెట్టుకున్న జీలకర్ర, మిరియాలను ఫైన్ పౌడర్ లా చేసుకోండి. అందులో చల్లారిన ఉసిరికాయ మిశ్రమం వేసి అస్సలు నీళ్లు వేయకుండా పేస్ట్ చేసుకోండి.",
    "[00:01:54.000] దీన్ని ఒక ఎయిర్ టైట్ జార్ లో పెట్టుకోండి. ఇది ఊరడానికి రెండు రోజుల టైమ్ పడుతుంది.",
    "[00:02:04.000] రెండు రోజుల తర్వాత మీకు ఎంత కావాలంటే అంత పచ్చడి తీసుకొని తాలింపు పెట్టుకోండి.",
    "[00:02:05.000] తాలింపు కోసం రెండు టీస్పూన్ల నూనెలో ఆవాలు, ఎండుమిరపకాయలు, ఇంగువ వేసి వేపుకొని ఉసిరికాయ పచ్చడిని అందులో వేసి బాగా కలుపుకోండి.",
    "[00:02:22.000] హెల్తీ అండ్ టేస్టీ ఉసిరికాయ పచ్చడి రెడీ. ఇది వేడి వేడి నెయ్యి అన్నంలోకి చాలా బాగుంటుంది."
  ],
  "transcription_english": [
    "[00:00:00.000] Hello foodies, welcome to Vismai Food. Today's special is a thousands-of-years-old style Amla pickle that we have almost forgotten.",
    "[00:00:23.000] First, in a pan, roast 1 tbsp cumin seeds, 1/2 tsp fenugreek seeds, and 1/2 tsp black pepper on low flame until aromatic.",
    "[00:00:48.000] Now heat 2 tbsps of oil and add 250g of grated amla; sauté for 2-3 minutes until the raw smell goes away.",
    "[00:01:29.000] Add 1 tsp turmeric powder and 2 tsps Himalayan salt (Saindhava Lavanam); mix well and let it cool completely.",
    "[00:01:42.000] Grind the roasted cumin and pepper into a fine powder. Add the cooled amla mixture and grind into a paste without adding any water.",
    "[00:01:54.000] Store this in an airtight jar. It takes about two days to soak properly.",
    "[00:02:04.000] After two days, take the required amount of pickle and prepare the tempering.",
    "[00:02:05.000] For tempering, heat 2 tsps oil and fry mustard seeds, dry red chillies, and asafoetida. Add the amla paste and mix thoroughly.",
    "[00:02:22.000] Healthy and tasty amla pickle is ready. It pairs excellently with hot rice and ghee."
  ]
}