{
  "metadata": {
    "title": "Tawa Chicken | తవా చికెన్ ఫ్రై | హైదరాబాద్ స్పెషల్ చికెన్ ఫ్రై | Chicken Fry Recipe in Telugu",
    "channel_name": "Vismai Food",
    "publish_date": "2018-12-27",
    "view_count": 945588,
    "like_count": 14962,
    "duration": "02:56",
    "language": "Telugu",
    "video_id": "OfDpRnj9VKQ",
    "url": "https://www.youtube.com/watch?v=OfDpRnj9VKQ",
    "description": "Hyderabad special Tawa Chicken recipe, perfect as a snack or a side dish.",
    "ingredients_detected": [
      "10-12 Dry Red Chillies",
      "1 tsp Cumin seeds",
      "1 tsp Black pepper",
      "1 tbsp Coriander seeds",
      "1 inch Cinnamon stick",
      "5-6 Cloves",
      "5-6 Green Cardamom",
      "3 tbsps Oil",
      "1 Small Onion (finely chopped)",
      "500g Chicken (soaked in salt water for 1 hour)",
      "1 tbsp Ginger garlic paste",
      "Salt (to taste)",
      "1 Tomato (pureed)",
      "100ml Water (added in parts)",
      "1/2 Lemon (juice)",
      "2 tbsps Coriander leaves (chopped)",
      "Fried Curry Leaves (for garnish)",
      "Fried Green Chillies (for garnish)"
    ]
  },
  "transcription_telugu": [
    "[00:00:00.000] హే ఫుడీస్, వెల్కమ్ టు విస్మయ్ ఫుడ్. ఇవాల్టి స్పెషల్ హైదరాబాద్ స్పెషల్ తవా చికెన్ ఫ్రై.",
    "[00:00:22.000] పాన్ లో 10-12 ఎండుమిర్చి, టీస్పూన్ జీలకర్ర, టీస్పూన్ మిరియాలు, టేబుల్ స్పూన్ ధనియాలు, ఇంచు దాల్చిన చెక్క, లవంగాలు, యాలకులు వేసి లో ఫ్లేమ్ లో వేపుకోండి.",
    "[00:00:40.000] వీటిని మిక్సీ పట్టి ఫైన్ పౌడర్ లా చేసుకోండి.",
    "[00:00:46.000] ఐరన్ తవా మీద 3 టేబుల్ స్పూన్ల నూనె వేడి చేసి చిన్న ఉల్లిపాయ తరుగు వేసి గోల్డెన్ బ్రౌన్ అయ్యేదాకా ఫ్రై చేయండి.",
    "[00:00:57.000] గంట సేపు ఉప్పు నీటిలో నానబెట్టిన అర కిలో చికెన్ ముక్కలను వేసి కలపండి. ఉప్పు నీటిలో నానబెట్టడం వల్ల చికెన్ జ్యూసీగా ఉంటుంది.",
    "[00:01:06.000] ఒక టేబుల్ స్పూన్ అల్లం వెల్లుల్లి పేస్ట్, తగినంత ఉప్పు వేసి బాగా మగ్గనివ్వండి.",
    "[00:01:14.000] ముక్కలు మగ్గాక టమాటో ప్యూరీ, మనం ముందుగా తయారు చేసుకున్న మసాలా పొడి వేసి బాగా కలపండి.",
    "[00:01:28.000] 50ml నీళ్లు చిలకరించి మూత పెట్టి 7-8 నిమిషాలు మీడియం ఫ్లేమ్ లో ఉడికించండి.",
    "[00:01:36.000] మళ్ళీ 3-4 నిమిషాలు ఫ్రై చేశాక మరో 50ml నీళ్లు చిలకరించి 5-6 నిమిషాలు సిమ్ లో మగ్గనివ్వండి. ఇలా చేయడం వల్ల మసాలాలు ముక్కలకి బాగా పడతాయి.",
    "[00:02:23.000] చివరగా నిమ్మరసం, కొత్తిమీర తరుగు చల్లి దింపేయండి.",
    "[00:02:37.000] సర్వ్ చేసే ముందు వేయించిన కరివేపాకు, పచ్చిమిర్చి తరుగు వేసుకోండి. టేస్టీ తవా చికెన్ ఫ్రై రెడీ."
  ],
  "transcription_english": [
    "[00:00:00.000] Hey foodies, welcome to Vismai Food. Today's special is Hyderabad Special Tawa Chicken Fry.",
    "[00:00:22.000] In a pan, roast 10-12 dry red chillies, 1 tsp cumin, 1 tsp pepper, 1 tbsp coriander seeds, 1 inch cinnamon, cloves, and cardamom on low flame.",
    "[00:00:40.000] Grind these roasted spices into a fine powder.",
    "[00:00:46.000] Heat 3 tbsps of oil on an iron tawa and fry chopped onion until golden brown.",
    "[00:00:57.000] Add 500g chicken (soaked in salt water for 1 hour) and mix. Soaking makes the chicken juicy.",
    "[00:01:06.000] Add 1 tbsp ginger-garlic paste and salt to taste; let it cook well.",
    "[00:01:14.000] Once the chicken is slightly cooked, add tomato puree and the ground masala powder; mix thoroughly.",
    "[00:01:28.000] Sprinkle 50ml of water, cover, and cook for 7-8 minutes on medium flame.",
    "[00:01:36.000] Fry for another 3-4 minutes, then sprinkle another 50ml of water and cook on low flame for 5-6 minutes. This helps the masala penetrate the chicken pieces.",
    "[00:02:23.000] Finally, add lemon juice and chopped coriander leaves.",
    "[00:02:37.000] Garnish with fried curry leaves and green chillies before serving. Tasty Tawa Chicken Fry is ready."
  ]
}