{
  "metadata": {
    "title": "Kakarakaya Pulusu | Karela Sabzi | చేదు లేని కమ్మటి కాకరయకాయ పులుసు | అమ్మల కాలం నాటి స్టైల్",
    "channel_name": "Vismai Food",
    "publish_date": "2018-12-28",
    "view_count": 1152147,
    "like_count": 9986,
    "duration": "02:41",
    "language": "Telugu",
    "video_id": "Rd1d4SgoZzc",
    "url": "https://www.youtube.com/watch?v=Rd1d4SgoZzc",
    "description": "Traditional Amma's style Bitter Gourd Stew with a perfect balance of tangy and sweet flavors.",
    "ingredients_detected": [
      "400ml Water (for boiling)",
      "250g peeled and 1/4 inch chopped Bitter gourd",
      "1/4 tsp Turmeric (for boiling)",
      "2 tbsps Oil",
      "1 tsp Mustard seeds",
      "1/2 tsp Fenugreek seeds",
      "1 tsp Cumin seeds",
      "2 Dry Red Chillies",
      "5 Crushed Garlic pods",
      "2 sprigs Curry leaves",
      "1/4 tsp Asafetida (hing)",
      "1 Onion, grated",
      "2 slit Green chillies",
      "1/2 tsp Chilli powder",
      "Salt (to taste)",
      "1/4 tsp Turmeric (for curry)",
      "1/4 cup Thick Tamarind juice",
      "1/4 cup Grated Jaggery (50g)",
      "2 tsps Besan (gram flour) for slurry",
      "100ml Water (added with slurry)"
    ]
  },
  "transcription_telugu": [
    "[00:00:00] హాయ్ ఫూడీస్, వెల్కమ్ టు విస్మయ్ ఫుడ్. ఇవాల్టి స్పెషల్ చేదు లేని కమ్మటి కాకరకాయ పులుసు ఎంత బాగుంటుందో!.",
    "[00:00:07] ఈ కూరకి మీకు అమ్మమ్మల కాలం నాటి టేస్ట్ వస్తుంది. మా స్టైల్లో కాకరకాయ పులుసు చేస్తే వదిలితే ఒట్టు, అంత బాగుంటుంది. లెట్స్ స్టార్ట్.",
    "[00:00:15] ముందుగా ఒక బౌల్‌లో నీళ్లు పోసుకొని, చెక్కు తీసుకున్నవి అర అంగుళం పెద్ద సైజు ముక్కలు 250 గ్రాములు వేసుకోండి.",
    "[00:00:23] పావు టీస్పూన్ పసుపు కూడా వేసుకొని బాగా కలుపుకొని మూత పెట్టి మూడు నాలుగు నిమిషాలు బాగా ఉడికించుకోండి.",
    "[00:00:30] దీనివల్ల చేదు అంతా నీళ్లలోకి దిగుతుంది. మరీ మెత్తగా ఉడికించుకోనక్కర్లేదు.",
    "[00:00:34] ఇప్పుడు కాకరకాయల్లోని నీళ్లన్నీ వంపేయండి. ఏ మాత్రం చేదు వద్దు అనుకుంటే కాకరకాయల్ని గట్టిగా పిండేస్తే ఆ ఉన్న చేదు కూడా దిగిపోతుంది.",
    "[00:00:43] ఇప్పుడు కడాయిలో రెండు టేబుల్ స్పూన్ల నూనె వేడి చేసుకొని అందులో ఆవాలు, మెంతులు, జీలకర్ర, ఎండుమిర్చి, వెల్లుల్లి, కరివేపాకు మరియు ఇంగువ వేసి తాలింపు వేపుకోవాలి.",
    "[00:01:00] ఇప్పుడు ఒక ఉల్లిపాయ తురుము, పచ్చిమిర్చి, కారం, ఉప్పు మరియు పసుపు వేసి ఉల్లిపాయల్ని మీడియం ఫ్లేమ్ మీద ఎర్రగా వేపుకోండి.",
    "[00:01:14] ఇప్పుడు ఉడికించుకున్న కాకరకాయ ముక్కలు వేసి బాగా కలుపుకొని మూడు నాలుగు నిమిషాలు మగ్గించుకోవాలి.",
    "[00:01:30] ఆ తర్వాత పావు కప్పు చిక్కటి చింతపండు పులుసు, పావు కప్పు బెల్లం మరియు 75ml నీళ్లు పోసి 20 నిమిషాల పాటు ఉడికించుకోవాలి.",
    "[00:01:52] 20 నిమిషాల తర్వాత కూర దగ్గర పడుతుంది. అప్పుడు రెండు టీస్పూన్ల శెనగపిండిలో నీళ్లు కలిపి పులుసులో పోయాలి.",
    "[00:02:08] ఒక కప్పు నీళ్లు పోసి బాగా కలుపుకొని మూత పెట్టి 10 నుంచి 12 నిమిషాలు లో ఫ్లేమ్ మీద మగ్గించుకుంటే కమ్మటి కాకరకాయ పులుసు రెడీ."
  ],
  "transcription_english": [
    "[00:00:00] Hi foodies, welcome to Vismai Food. Today's special is a delicious bitter gourd stew without any bitterness; it tastes amazing!.",
    "[00:00:07] This curry will give you that traditional taste from our grandmothers' time. If you make it our way, you won't leave a single bite. Let's start.",
    "[00:00:15] First, pour water into a bowl and add 250g of peeled bitter gourd cut into half-inch pieces.",
    "[00:00:23] Add 1/4 tsp turmeric, mix well, cover, and cook thoroughly for 3-4 minutes.",
    "[00:00:30] This process releases all the bitterness into the water. You don't need to cook them until they are too soft.",
    "[00:00:34] Now drain all the water. If you want absolutely no bitterness, squeeze the bitter gourd pieces tightly to remove any remaining bitterness.",
    "[00:00:43] Heat 2 tbsps of oil in a pan and add mustard, fenugreek, cumin, dry chillies, garlic, curry leaves, and asafetida; fry the tempering.",
    "[00:01:00] Add one grated onion, green chillies, chilli powder, salt, and turmeric; fry the onions on medium flame until golden brown.",
    "[00:01:14] Add the par-boiled bitter gourd pieces, mix well, and sauté for 3-4 minutes.",
    "[00:01:30] Then add 1/4 cup thick tamarind juice, 1/4 cup jaggery, and 75ml water; cook for 20 minutes.",
    "[00:01:52] After 20 minutes the curry will thicken. Then mix 2 tsps of besan with water and add it to the stew.",
    "[00:02:08] Add one cup of water, mix well, cover, and simmer on low flame for 10-12 minutes until the delicious Kakarakaya Pulusu is ready."
  ]
}