{
  "metadata": {
    "title": "Cabbage Pickle | క్యాబేజీ నిలవ పచ్చడి | క్యాబేజీ ఆవకాయ | ఈ పచ్చడి ఓ సారి తిన్నారంటే వదిలితే వొట్టు",
    "channel_name": "Vismai Food",
    "publish_date": "2018-12-30",
    "view_count": 558881,
    "like_count": 6499,
    "duration": "02:12",
    "language": "Telugu",
    "video_id": "IQb9faqoO5I",
    "url": "https://www.youtube.com/watch?v=IQb9faqoO5I",
    "description": "A unique and long-lasting cabbage pickle (Avakaya) recipe that stays fresh for up to 2-4 months.",
    "ingredients_detected": [
      "100g Mustard Seeds (Avalu)",
      "1/2 tsp Turmeric (Pasupu)",
      "1/2 tsp Salt (for powdering)",
      "100g Chilli Powder (Karam)",
      "100g Salt (for the pickle)",
      "2 tsps Fenugreek Powder (Menthi podi)",
      "1 tbsp Turmeric (for the pickle)",
      "500g Cabbage, unwashed and chopped lengthwise",
      "300g Sesame Seeds Oil (Nuvvula nune)",
      "1/2 tsp Lemon Salt or Citric Acid",
      "Optional: 2 tbsps Lemon Juice"
    ]
  },
  "transcription_telugu": [
    "[00:00:00] హాయ్ ఫూడీస్, వెల్కమ్ టు విస్మయ్ ఫుడ్. ఇవాల్టి స్పెషల్ క్యాబేజీ నిలవ పచ్చడి. ఇది కనీసం రెండు నెలల పాటు నిలవ ఉంటుంది.",
    "[00:00:07] మీరు పెట్టే తీరును బట్టి ఇది మూడు నాలుగు నెలల పైన కూడా నిలవ ఉంటుంది. లెట్స్ స్టార్ట్ ది బెస్ట్ క్యాబేజీ పచ్చడి.",
    "[00:00:15] ముందుగా 100 గ్రాముల ఆవాలు, అర చెంచా పసుపు, కాస్త ఉప్పు వేసి ఫైన్ పౌడర్ లా గ్రైండ్ చేసుకోండి.",
    "[00:00:27] ఈ ఆవపిండిని ఒక మిక్సింగ్ బౌల్ లో వేసి అందులో 100 గ్రాముల కారం, 100 గ్రాముల ఉప్పు వేసి బాగా కలుపుకోవాలి.",
    "[00:00:41] మీకు నచ్చితే ఇందులోనే రెండు టేబుల్ స్పూన్ల మెంతిపిండి, ఒక టేబుల్ స్పూన్ పసుపు కూడా వేసుకోవచ్చు.",
    "[00:00:50] ఇప్పుడు 500 గ్రాముల క్యాబేజీని నిలువుగా కట్ చేసుకొని వేసుకోండి. ఈ క్యాబేజీని అస్సలు కడగకూడదు, కడిగితే పచ్చడి పాడవుతుంది.",
    "[00:01:06] ఇందులో 300 గ్రాముల నువ్వుల నూనెను పోసుకుంటూ పచ్చడిని బాగా కలుపుకోవాలి. నువ్వుల నూనె పచ్చడి ఎక్కువ కాలం నిలవ ఉండేలా చేస్తుంది.",
    "[00:01:27] చివరగా అర టీస్పూన్ నిమ్మ ఉప్పు (Citric acid) లేదా రెండు మూడు టేబుల్ స్పూన్ల నిమ్మరసం వేసి బాగా కలుపుకోవాలి.",
    "[00:01:44] ఈ పచ్చడిని ఒక ఎయిర్ టైట్ జార్ లో పెట్టి రెండు రోజులు వదిలేయాలి. ఆ తర్వాత వేడి వేడి అన్నంలో నెయ్యి వేసుకొని తింటే చాలా బాగుంటుంది."
  ],
  "transcription_english": [
    "[00:00:00] Hi foodies, welcome to Vismai Food. Today's special is Cabbage Pickle (Cabbage Avakaya). It stays fresh for at least two months.",
    "[00:00:07] Depending on the preparation, it can last for more than three to four months. Let's start making the best cabbage pickle.",
    "[00:00:15] First, grind 100g of mustard seeds, 1/2 tsp turmeric, and a little salt into a fine powder.",
    "[00:00:27] Place this mustard powder in a mixing bowl and add 100g chilli powder and 100g salt; mix thoroughly.",
    "[00:00:41] If you like, you can also add 2 tbsps of fenugreek powder and 1 tbsp of turmeric at this stage.",
    "[00:00:50] Now add 500g of lengthwise chopped cabbage. Do not wash the cabbage, as washing it will cause the pickle to spoil.",
    "[00:01:06] Gradually pour 300g of sesame seeds oil and mix the pickle well. Sesame oil helps the pickle stay fresh longer.",
    "[00:01:27] Finally, add 1/2 tsp lemon salt (citric acid) or 2-3 tbsps of lemon juice and mix well.",
    "[00:01:44] Store this pickle in an airtight jar and let it sit for two days. After that, it tastes great with hot rice and ghee."
  ]
}