{
  "metadata": {
    "title": "Chakkera Pongali Telugu | Chakkera Pongali Recipe in Telugu by Vismai Food | Sweet Pongal Recipe",
    "channel_name": "Vismai Food",
    "publish_date": "2019-01-01",
    "view_count": 6845372,
    "like_count": 78800,
    "duration": "02:41",
    "language": "Telugu",
    "video_id": "EmcJiDu9mJI",
    "url": "https://www.youtube.com/watch?v=EmcJiDu9mJI",
    "description": "Traditional Chakkera Pongali recipe from Vismai Food. A sweet dish made with rice, moong dal, sugar, and jaggery.",
    "ingredients_detected": [
      "1/4 Cup Moong Dal (pesara pappu) [00:00:21]",
      "3/4 Cup Rice (washed) [00:00:30]",
      "2 Cups Water [00:00:39]",
      "1/2 Cup Grated Jaggery [00:00:53]",
      "3/4 Cup Sugar [00:00:54]",
      "A little water [00:00:56]",
      "3 tbsps Ghee (for frying dry fruits) [00:01:21]",
      "1/4 Cup Dry Coconut Cubes [00:01:22]",
      "10-15 Cashews [00:01:26]",
      "10-15 Raisins [00:01:28]",
      "3 tbsps Ghee (added at the end) [00:01:42]",
      "1/2 tsp Cardamom Powder [00:01:59]",
      "1 pinch Edible Camphor (pacha karpuram) [00:02:00]",
      "3 tbsps Ghee (final addition) [00:02:07]"
    ]
  },
  "transcription_telugu": [
    "[00:00:00] హాయ్ ఫూడీస్, వెల్కమ్ టు విస్మయ్ ఫుడ్. అందరికీ హ్యాపీ న్యూ ఇయర్ [00:00:00].",
    "[00:00:05] ఈ ఇయర్ అంతా మీకు హ్యాపీగా, స్వీట్ గా సాగిపోవాలని మా విస్మయ్ ఫుడ్ టీమ్ అంతా కోరుకుంటుంది [00:00:09].",
    "[00:00:10] అందుకే ఒక ట్రెడిషనల్ రెసిపీ తో మీ ముందుకు వచ్చాం, అదే చక్కెర పొంగలి. ఇది మా స్టైల్లో ఒకసారి చూసి మీ కామెంట్ పెడతారా? [00:00:19].",
    "[00:00:21] పాన్ లో పావు కప్పు పెసరపప్పు వేసి లో ఫ్లేమ్ మీద మంచి సువాసన వచ్చేంత వరకు వేపుకోండి. దీనికి కనీసం 10 నిమిషాలు టైమ్ పడుతుంది [00:00:28].",
    "[00:00:30] ఇప్పుడు కుక్కర్ లో ముప్పావు కప్పు కడిగిన బియ్యం వేసుకోండి. ఇవి నానబెట్టాల్సిన అవసరం అస్సలు లేనే లేదు [00:00:33].",
    "[00:00:35] వేయించుకున్న పెసరపప్పుని కడిగి బియ్యంలో వేయండి. దీనికి రెండు కప్పుల నీళ్లు పోసి హై ఫ్లేమ్ మీద మూడు విజిల్స్ వచ్చే వరకు ఉడికించుకోండి [00:00:46].",
    "[00:00:52] ఇప్పుడు పాకం కోసం అర కప్పు బెల్లం తరుగు, ముప్పావు కప్పు పంచదార వేసి కొంచెం నీళ్లు పోసి తీగ పాకం వచ్చే వరకు ఉడికించాలి [00:01:00].",
    "[00:01:05] పలుకుగా వండుకున్న అన్నంలో పాకాన్ని జల్లెడతో వడకట్టుకోండి [00:01:10].",
    "[00:01:13] ఈ పాకాన్ని అన్నానికి పట్టించి మీడియం ఫ్లేమ్ మీద పాకం పీల్చుకునేదాకా కుక్ చేయండి [00:01:18].",
    "[00:01:20] జీడిపప్పును వేపుకోవడానికి మూడు టేబుల్ స్పూన్ల నెయ్యిలో ఎండు కొబ్బరి పలుకులు, జీడిపప్పు, కిస్మిస్ వేసి ఎర్రగా వేపుకొని అన్నంలో కలుపుకోవాలి [00:01:36].",
    "[00:01:42] మరో మూడు టేబుల్ స్పూన్ల నెయ్యి వేసి బాగా కలుపుకోండి. నెయ్యి ఎక్కువగా ఉంటేనే కమ్మగా ఉంటుంది [00:01:49].",
    "[00:01:58] అన్నం దగ్గరపడ్డాక అర టీస్పూన్ యాలకుల పొడి, చిటికెడు పచ్చ కర్పూరం వేసి బాగా కలుపుకోవాలి [00:02:05].",
    "[00:02:07] చివరగా మరో రెండు మూడు చెంచాల నెయ్యి వేసి దింపేయండి. కమ్మటి చక్కెర పొంగలి రెడీ [00:02:12]."
  ],
  "transcription_english": [
    "[00:00:00] Hi foodies, welcome to Vismai Food. Happy New Year to everyone [00:00:00].",
    "[00:00:05] Our team wishes that this year remains happy and sweet for you all [00:00:09].",
    "[00:00:10] That's why we've come with a traditional recipe: Chakkera Pongali. Do watch it in our style and leave your comments [00:00:19].",
    "[00:00:21] Add 1/4 cup of moong dal to a pan and roast it on a low flame until aromatic. This will take about 10 minutes [00:00:28].",
    "[00:00:30] Add 3/4 cup of washed rice to a pressure cooker. There's no need to soak the rice beforehand [00:00:33].",
    "[00:00:35] Wash the roasted moong dal and add it to the rice. Add two cups of water and cook on high flame for three whistles [00:00:46].",
    "[00:00:52] For the syrup, add 1/2 cup grated jaggery and 3/4 cup sugar with a little water and boil to a single-string consistency [00:01:00].",
    "[00:01:05] Strain the syrup into the cooked rice using a sieve to remove any impurities [00:01:10].",
    "[00:01:13] Cook the rice on medium flame until it absorbs the syrup completely [00:01:18].",
    "[00:01:20] Heat 3 tbsps of ghee and fry dry coconut pieces, cashews, and raisins until golden brown, then mix them into the rice [00:01:36].",
    "[00:01:42] Add another 3 tbsps of ghee; it tastes better with more ghee [00:01:49].",
    "[00:01:58] Once the rice thickens, add 1/2 tsp of cardamom powder and a pinch of edible camphor; mix well [00:02:05].",
    "[00:02:07] Finally, add a few more spoons of ghee and turn off the heat. Delicious Chakkera Pongali is ready [00:02:12]."
  ]
}