{
  "metadata": {
    "title": "Instant Rice Idli | Spongy Idli Recipe | స్పాంజి రైస్ ఇడ్లి | 30 నిమిషాల్లో స్పాంజి బియ్యం ఇడ్లి",
    "channel_name": "Vismai Food",
    "publish_date": "2019-01-02",
    "view_count": 1497835,
    "like_count": 12542,
    "duration": "01:47",
    "language": "Telugu",
    "video_id": "5xq8ItUDeR0",
    "url": "https://www.youtube.com/watch?v=5xq8ItUDeR0",
    "description": "Instant and spongy rice idli recipe that can be made in just 30 minutes without any fermentation.",
    "ingredients_detected": [
      "1 Cup Thin Poha (palsati atukulu)",
      "1 Cup Sour Butter Milk (majiga)",
      "1.5 Cups Rice Rawa (biyyapu rava)",
      "Salt (to taste)",
      "1/4 tsp Cooking Soda",
      "Additional Sour Butter Milk (to adjust consistency)",
      "Ghee (for greasing plates)"
    ]
  },
  "transcription_telugu": [
    "[00:00:00] హాయ్ ఫూడీస్, వెల్కమ్ టు విస్మయ్ ఫుడ్. ఇవాల్టి స్పెషల్ ఇన్స్టెంట్ రైస్ ఇడ్లీ, కేవలం 30 నిమిషాల్లో.",
    "[00:00:06] అచ్చం మామూలు ఇడ్లీ లాగే చాలా స్పాంజిగా, రుచిగా ఉంటాయి. ఒకసారి ట్రై చేస్తే మీరే పదే పదే చేసుకుంటారు.",
    "[00:00:22] ఒక బౌల్ లో ఒక కప్పు పల్చటి అటుకులు వేసి అందులో ఒక కప్పు పుల్లటి మజ్జిగ పోసి 15 నిమిషాలు నాననివ్వాలి.",
    "[00:00:29] 15 నిమిషాల తర్వాత వీటిని మెత్తగా గ్రైండ్ చేసుకోవాలి లేదా మెదపాలి.",
    "[00:00:36] ఇందులో ఒకటిన్నర కప్పుల బియ్యపు రవ్వను వేసుకోవాలి. దీనికి కేవలం మార్కెట్లో దొరికే స్టీమ్డ్ బియ్యపు రవ్వ మాత్రమే వాడాలి.",
    "[00:00:54] ఇప్పుడు రుచికి సరిపడా ఉప్పు, పావు చెంచా సోడా వేసి పుల్లటి మజ్జిగతో ఇడ్లీ పిండిలా కలుపుకోవాలి.",
    "[00:01:01] ఈ పిండిని 30 నిమిషాల పాటు పక్కన పెట్టేయాలి.",
    "[00:01:04] 30 నిమిషాల తర్వాత పిండి గట్టిపడితే మరికాస్త మజ్జిగ పోసి పిండిని అడ్జస్ట్ చేసుకోవాలి.",
    "[00:01:07] ఇడ్లీ ప్లేట్లకు నెయ్యి రాసి ఈ పిండిని వేసుకోవాలి.",
    "[00:01:11] ఎనిమిది నిమిషాలు హై ఫ్లేమ్ మీద, నాలుగు నిమిషాలు లో ఫ్లేమ్ మీద స్టీమ్ చేసుకోవాలి.",
    "[00:01:21] పూర్తిగా చల్లారిన తర్వాతే ఇడ్లీలని డీమోల్డ్ చేయండి. వేడి వేడి అల్లం పచ్చడితో తింటే చాలా బాగుంటాయి."
  ],
  "transcription_english": [
    "[00:00:00] Hi foodies, welcome to Vismai Food. Today's special is Instant Rice Idli, ready in just 30 minutes.",
    "[00:00:06] They are very spongy and delicious, just like regular idlis. Once you try them, you'll make them repeatedly.",
    "[00:00:22] Add one cup of thin poha to a bowl and soak it in one cup of sour buttermilk for 15 minutes.",
    "[00:00:29] After 15 minutes, grind or mash it into a very smooth paste.",
    "[00:00:36] Add 1.5 cups of rice rava. Only use store-bought steamed rice rava for this recipe.",
    "[00:00:54] Add salt to taste and 1/4 tsp of cooking soda; mix with sour buttermilk to reach an idli batter consistency.",
    "[00:01:01] Let the batter rest for 30 minutes.",
    "[00:01:04] If the batter thickens after 30 minutes, adjust it by adding more buttermilk.",
    "[00:01:07] Grease idli plates with ghee and pour the batter into the moulds.",
    "[00:01:11] Steam cook for 8 minutes on high flame and 4 minutes on low flame.",
    "[00:01:21] De-mould the idlis only after they have cooled completely. They pair perfectly with hot ginger pickle."
  ]
}