{
  "metadata": {
    "title": "Ragi Sangati | ఈ ఒక్కటి చేర్చి రాగి సంగటి చేస్తే మళ్ళీ మళ్ళీ ఈ పద్ధతి లో చేస్తారు",
    "channel_name": "Vismai Food",
    "publish_date": "2019-01-03",
    "view_count": 5151022,
    "like_count": 61949,
    "duration": "02:26",
    "language": "Telugu",
    "video_id": "zYVZtAYA9E4",
    "url": "https://www.youtube.com/watch?v=zYVZtAYA9E4",
    "description": "The perfect method for making Ragi Sangati, a traditional and healthy recipe from the Rayalaseema region.",
    "ingredients_detected": [
      "400ml Water",
      "200g Ration Rice or Dosa Rice (soaked for 1 hour)",
      "Salt (to taste)",
      "100g Ragi Flour (Finger Millet Flour)"
    ]
  },
  "transcription_telugu": [
    "[00:00:00] హాయ్ ఫూడీస్, వెల్కమ్ టు విస్మయ్ ఫుడ్. ఇవాల్టి స్పెషల్ ది పర్ఫెక్ట్ రాగి సంగటి.",
    "[00:00:07] నేను మీకు ది బెస్ట్ వే చూపించబోతున్నాను. ఇది కనీసం 40-50 సంవత్సరాల అనుభవం ఉన్నవారి దగ్గర నుంచి నేర్చుకున్న రెసిపీ.",
    "[00:00:36] ముందుగా ఒక బౌల్ లో 400ml నీళ్లు పోసుకొని అందులో ఒక గంట పాటు నానబెట్టిన 200 గ్రాముల రేషన్ బియ్యం లేదా దోస బియ్యాన్ని వేసుకోండి.",
    "[00:00:50] రేషన్ బియ్యం వాడటం వల్ల సంగటికి కావలసినంత జిగురు మరియు సాఫ్ట్ నెస్ వస్తుంది.",
    "[00:01:08] ఇప్పుడు తగినంత ఉప్పు వేసి అన్నాన్ని మెత్తగా ఉడికించుకోవాలి.",
    "[00:01:21] అన్నం మెత్తగా ఉడికిన తర్వాత బియ్యంలో సగం అంటే 100 గ్రాముల రాగి పిండి వేసి లో ఫ్లేమ్ మీద 4-5 నిమిషాలు మగ్గించుకోవాలి.",
    "[00:01:34] రాగి పిండి బాగా మగ్గిన తర్వాత స్టవ్ ఆఫ్ చేసి బాగా మెదుపుకోవాలి.",
    "[00:01:47] ఇప్పుడు చేతులు తడి చేసుకొని అన్నాన్ని ప్లేట్ లోకి తీసుకొని ఉండలుగా చుట్టుకోవాలి.",
    "[00:01:59] ఎంతో సాఫ్ట్ గా ఉండే రాగి సంగటి రెడీ. ఇది పల్లీల చట్నీ లేదా నాటు కోడి పులుసుతో చాలా బాగుంటుంది."
  ],
  "transcription_english": [
    "[00:00:00] Hi foodies, welcome to Vismai Food. Today's special is the perfect Ragi Sangati.",
    "[00:00:07] I am going to show you the best way to make it. This recipe is learned from people with 40-50 years of experience.",
    "[00:00:36] First, pour 400ml of water into a bowl and add 200g of ration rice or dosa rice soaked for one hour.",
    "[00:00:50] Using ration rice provides the necessary stickiness and softness for the sangati.",
    "[00:01:08] Now add enough salt and cook the rice until it is super soft.",
    "[00:01:21] After the rice is soft, add 100g of ragi flour (half of the rice quantity) and let it steam on low flame for 4-5 minutes.",
    "[00:01:34] Once the ragi flour is well-steamed, turn off the flame and mash it thoroughly.",
    "[00:01:47] Wet your hands, take the mixture onto a plate, and roll it into balls while it's still warm.",
    "[00:01:59] Super soft Ragi Sangati is ready. It pairs perfectly with peanut chutney or country chicken curry."
  ]
}