{
  "metadata": {
    "title": "Coconut Halwa | కొబ్బరి హల్వా | ఆరోగ్యకరమైన ఈ హల్వాని మీ పిల్లలకి పెట్టండి చాల ఇష్టపడతారు",
    "channel_name": "Vismai Food",
    "publish_date": "2019-01-04",
    "view_count": 2646213,
    "like_count": 33586,
    "duration": "01:48",
    "language": "Telugu",
    "video_id": "fsWfep-HtQU",
    "url": "https://www.youtube.com/watch?v=fsWfep-HtQU",
    "description": "Healthy and tasty Coconut Halwa recipe that children will love. A quick and easy traditional sweet.",
    "ingredients_detected": [
      "2 Cups Grated Fresh Coconut (approx. one large coconut)",
      "1 Cup Grated Jaggery",
      "A little Water (for grinding)",
      "3 tbsps Ghee",
      "10-15 Cashews",
      "1/2 tsp Cardamom Powder"
    ]
  },
  "transcription_telugu": [
    "[00:00:00] హాయ్ ఫూడీస్, వెల్కమ్ టు విస్మయ్ ఫుడ్. ఇవాల్టి స్పెషల్ కొబ్బరి హల్వా. చాలా సింపుల్ అండ్ హెల్తీ స్వీట్.",
    "[00:00:15] ఇది నేను చెన్నైలోని ఒక అయ్యంగార్ ఫ్యామిలీ నుండి నేర్చుకున్నాను. వాళ్ళు ధనుర్మాసం సమయంలో విష్ణువుకు నివేదిస్తారట.",
    "[00:00:23] ముందుగా ఒక జార్ లో రెండు కప్పుల పచ్చి కొబ్బరి తురుము వేసుకోండి.",
    "[00:00:31] ఇందులో ఒక కప్పు బెల్లం తురుము మరియు కొద్దిగా నీళ్లు పోసి మెత్తగా పేస్ట్ లా గ్రైండ్ చేసుకోవాలి.",
    "[00:00:44] కడాయిలో రెండు టేబుల్ స్పూన్ల నెయ్యి వేడి చేసి 10-15 జీడిపప్పు పలుకులు వేసి ఎర్రగా వేపుకొని పక్కన పెట్టుకోవాలి.",
    "[00:00:54] అదే కడాయిలో గ్రైండ్ చేసిన కొబ్బరి-బెల్లం పేస్ట్ వేసి లో ఫ్లేమ్ మీద కలుపుతూ ఉండాలి.",
    "[00:01:03] అడుగు మందంగా ఉన్న గిన్నె వాడితే హల్వా బాగా వస్తుంది. ఇది కనీసం 20 నిమిషాల పాటు కుక్ చేయాలి.",
    "[00:01:18] మిశ్రమం దగ్గర పడ్డాక అర టీస్పూన్ యాలకుల పొడి మరియు వేయించిన జీడిపప్పు వేసి కలుపుకోవాలి.",
    "[00:01:25] దించే ముందు మరో టేబుల్ స్పూన్ నెయ్యి వేసి బాగా కలుపుకొని స్టవ్ ఆఫ్ చేయండి.",
    "[00:01:31] ఈ హల్వా మూడు నాలుగు రోజులు నిలవ ఉంటుంది. ఇది వేడి వేడిగా లేదా చల్లగా తిన్నా చాలా బాగుంటుంది."
  ],
  "transcription_english": [
    "[00:00:00] Hi foodies, welcome to Vismai Food. Today's special is Coconut Halwa. It's a very simple and healthy sweet.",
    "[00:00:15] I learned this from an Iyengar family in Chennai. They offer it to Lord Vishnu during the Dhanurmasam month.",
    "[00:00:23] First, add 2 cups of grated fresh coconut into a mixer jar.",
    "[00:00:31] Add 1 cup of grated jaggery and a little water; grind it into a fine, thick paste.",
    "[00:00:44] Heat 2 tbsps of ghee in a pan and fry 10-15 cashews until golden brown, then set them aside.",
    "[00:00:54] In the same pan, add the coconut-jaggery paste and keep stirring on a low flame.",
    "[00:01:03] Use a thick-bottomed pan for the best results. This needs to be cooked for at least 20 minutes.",
    "[00:01:18] Once the mixture thickens, add 1/2 tsp of cardamom powder and the fried cashews; mix well.",
    "[00:01:25] Just before turning off the heat, add another tbsp of ghee and mix thoroughly.",
    "[00:01:31] This halwa can be stored for 3-4 days. It tastes delicious whether served hot or cold."
  ]
}