{
  "metadata": {
    "title": "Tirumala Vada | తిరుమల వడ ప్రసాదం | Temple Style | Tirumala Vada Recipe",
    "channel_name": "Vismai Food",
    "publish_date": "2019-01-05",
    "view_count": 1642576,
    "like_count": 24175,
    "duration": "02:23",
    "language": "Telugu",
    "video_id": "xt9qSFUxY5A",
    "url": "https://www.youtube.com/watch?v=xt9qSFUxY5A",
    "description": "Authentic temple-style Tirumala Vada (Uddi Vada) recipe, taught by experts who serve the Lord at Tirumala."
  },
  "ingredients_detected": [
    "500g Whole Black Gram (Pottu Minumulu)",
    "2 tbsps Black Pepper (Miriyalu)",
    "1 tbsp Cumin Seeds (Jeelakarra)",
    "Salt (to taste)",
    "1/4 tsp Asafoetida (Hing) - optional",
    "Oil (for deep frying)"
  ],
  "transcription_telugu": [
    "[00:00:00] హాయ్ ఫూడీస్, వెల్కమ్ టు విస్మయ్ ఫుడ్. ఇవాల్టి స్పెషల్ తిరుమల ఉద్ది వడలు.",
    "[00:00:10] తిరుమల వెంకటేశ్వర స్వామికి ఎంతో ప్రీతిపాత్రమైన ఈ వడల్ని ఎలా చేయాలో చూద్దాం.",
    "[00:00:27] ముందుగా 500 గ్రాముల పొట్టు మినుముల్ని కనీసం 8 నుంచి 12 గంటల పాటు నానబెట్టుకోవాలి.",
    "[00:00:35] పొట్టు తీయకుండా ఈ మినుముల్నే వాడాలి, అప్పుడే పర్ఫెక్ట్ గా వస్తాయి.",
    "[00:00:40] నీళ్లు పూర్తిగా వడకట్టి, అస్సలు నీళ్లు లేకుండా జార్ లో వేసి బరకగా గ్రైండ్ చేసుకోవాలి.",
    "[00:00:51] రోటిలో దంచుకుంటే ఇంకా బాగుంటుంది. పిండి బాగా గట్టిగా ఉండాలి.",
    "[00:00:56] ఇప్పుడు రెండు టేబుల్ స్పూన్ల మిరియాలు, ఒక టేబుల్ స్పూన్ జీలకర్ర, ఉప్పు మరియు ఇంగువ వేసి బరకగా దంచుకోవాలి.",
    "[00:01:08] ఈ మిరియాల పొడిని పిండిలో వేసి బాగా కలుపుకోవాలి.",
    "[00:01:19] ఒక తడి వస్త్రం మీద పిండిని ఉంచి పల్చగా వత్తుకోవాలి. మరీ పల్చగా కాకుండా, మరీ మందంగా కాకుండా ఉండాలి.",
    "[00:01:35] మరిగే నూనెలో వేసి కేవలం లో ఫ్లేమ్ మీద మాత్రమే 12 నుంచి 15 నిమిషాల పాటు వేయించుకోవాలి.",
    "[00:01:52] వడలు గోల్డెన్ బ్రౌన్ కలర్ లోకి వచ్చి కరకరలాడే వరకు వేపుకోవాలి.",
    "[00:02:05] ఇవి కనీసం 4-5 రోజుల పాటు నిలవ ఉంటాయి. ఎంతో ఆరోగ్యకరం కూడా."
  ],
  "transcription_english": [
    "[00:00:00] Hi foodies, welcome to Vismai Food. Today's special is Tirumala Uddi Vada.",
    "[00:00:10] Let's see how to make these vadas, which are very dear to Lord Venkateswara.",
    "[00:00:27] First, soak 500g of whole black gram (with skin) for 8 to 12 hours.",
    "[00:00:35] Do not remove the skin; using whole black gram is key for the perfect result.",
    "[00:00:40] Drain the water completely and grind it into a coarse paste without adding any water.",
    "[00:00:51] It's even better if you use a stone grinder. The batter must be very thick.",
    "[00:00:56] Now, coarsely crush 2 tbsps of black pepper, 1 tbsp of cumin, salt, and asafoetida.",
    "[00:01:08] Add this pepper powder to the batter and mix it thoroughly.",
    "[00:01:19] Spread a damp cloth and press the batter into a thin disc, neither too thin nor too thick.",
    "[00:01:35] Drop them into hot oil and fry only on a low flame for 12 to 15 minutes.",
    "[00:01:52] Fry until they turn golden brown and become very crispy.",
    "[00:02:05] These vadas stay fresh for 4-5 days and are very healthy too."
  ]
}