{
  "metadata": {
    "title": "అందరికీ నచ్చే తీరులో తిరుగులేని పచ్చి పులుసు | Easy Pacchi pulusu recipe| Raw Rasam @VismaiFood",
    "channel_name": "Vismai Food",
    "publish_date": "2018-09-29",
    "view_count": 3077717,
    "like_count": 29617,
    "duration": "02:13",
    "language": "Telugu",
    "video_id": "wkNZL5RyWps",
    "url": "https://www.youtube.com/watch?v=wkNZL5RyWps",
    "description": "Easy and tasty Pacchi pulusu recipe by Vismai Food.",
    "ingredients_detected": [
      "5 Green Chillies (Roasted on low flame)",
      "2 Drops Oil",
      "3 Dry Red Chillies",
      "1 tbsp Cumin",
      "1/2 Bunch Coriander With Stems (chopped)",
      "Sea Salt (to taste)",
      "500ml Tamarind Juice (extracted from 100gms tamarind)",
      "1 large Onion (Chopped and squeezed)",
      "1 Sprig Curry Leaves (chopped)",
      "2 Green Chillies (chopped and squeezed)",
      "1 Small Tomato (optional, chopped and squeezed)",
      "1/2 tsp Turmeric"
    ]
  },
  "transcription_telugu": [
    "[00:00:00.000] హలో ఫుడీస్, వెల్కమ్ టు విస్మయ్ ఫుడ్. ఇవాల్టి స్పెషల్ మన తెలుగు వాళ్ల స్పెషల్ పచ్చి పులుసు.",
    "[00:00:07.000] చాలా సింపుల్ కానీ ఎంత రుచో! ఈ పచ్చి పులుసుని పేదింటి పులుసు అని కూడా అంటారు. ప్రాంతానికో రకమున్నా రాయలసీమ ప్రాంతపు పచ్చి పులుసు నాకు బాగా నచ్చింది.",
    "[00:00:20.000] ముందుగా ఒక స్ట్రైనర్ లో ఐదు పచ్చిమిర్చి వేసి లో ఫ్లేమ్ మీద బాగా కాల్చుకోండి. దీనివల్ల పచ్చి పులుసుకి మంచి స్మోకీ ఫ్లేవర్ వస్తుంది.",
    "[00:00:32.000] తర్వాత కొద్దిగా నూనె వేసి మూడు ఎండుమిర్చి తరుగు, ఒక టేబుల్ స్పూన్ జీలకర్ర వేసి మీడియం ఫ్లేమ్ లో మంచి సువాసన వచ్చేంత వరకు రోస్ట్ చేసి పక్కన ఉంచుకోండి.",
    "[00:00:46.000] ఇప్పుడు వేడి మీద రోట్లో వేసి కచ్చాపచ్చాగా దంచుకోండి. దంచితేనే రుచి ఎక్కువగా ఉంటుంది.",
    "[00:00:58.000] ఇప్పుడు చల్లారిన పచ్చిమిర్చి, అర కట్ట కొత్తిమీర తరుగు (కాడలతో సహా), రుచికి సరిపడా రాళ్ల ఉప్పు వేసి బాగా మెత్తగా నలుపుకోండి.",
    "[00:01:16.000] ఒక పెద్ద బౌల్ లో 100 గ్రాముల చింతపండుని అర లీటరు నీళ్లలో నానబెట్టి తీసిన రసం పోసుకోండి.",
    "[00:01:23.000] ఇందులో ఒక పెద్ద ఉల్లిపాయ తరుగుని బాగా మెత్తగా నలిపి వేసుకోండి. అలాగే కరివేపాకు తరుగు, రెండు పచ్చిమిర్చి తరుగు కూడా నలిపి వేసుకోండి.",
    "[00:01:35.000] ఒక చిన్న టొమాటో (ఆప్షనల్), అర టీస్పూన్ పసుపు, పచ్చిమిర్చి కొత్తిమీర మిశ్రమం, ఎండుమిర్చి మిశ్రమం వేయండి.",
    "[00:01:48.000] చేత్తోనే బాగా కలుపుకుంటూ పదార్థాలన్నింటినీ గట్టిగా నలపండి. దీనివల్ల రసం రుచి బాగా పెరుగుతుంది.",
    "[00:01:58.000] యమ్మీ పచ్చి పులుసు రెడీ. ఈ రెసిపీని ట్రై చేసి కామెంట్ చేయండి."
  ],
  "transcription_english": [
    "[00:00:00.000] Hello Foodies, welcome to Vismai Food. Today's special is our Telugu special Pacchi Pulusu.",
    "[00:00:07.000] Very simple but incredibly tasty! It's also called poor man's soup. While every region has its style, I love the Rayalaseema version.",
    "[00:00:20.000] First, roast five green chillies on low flame using a strainer. This gives a great smoky flavor to the pulusu.",
    "[00:00:32.000] Next, heat a little oil, add 3 dry red chillies, and 1 tbsp cumin. Roast on medium flame until aromatic and set aside.",
    "[00:00:46.000] Crush these while hot in a mortar and pestle for the best flavor.",
    "[00:00:58.000] Now, take the roasted green chillies, 1/2 bunch chopped coriander (with stems), and sea salt; crush them together well.",
    "[00:01:16.000] In a large bowl, pour 500ml tamarind juice extracted from 100gms of soaked tamarind.",
    "[00:01:23.000] Add one large chopped onion after squeezing it well. Also, add chopped curry leaves and 2 chopped green chillies (squeezed).",
    "[00:01:35.000] Add one small tomato (optional), 1/2 tsp turmeric, the coriander-chilli mixture, and the dry chilli mixture.",
    "[00:01:48.000] Mix well with your hand, squeezing all the ingredients to extract their full flavor into the liquid.",
    "[00:01:58.000] Yummy Pacchi Pulusu is ready. Try this recipe and let us know."
  ]
}