{
  "metadata": {
    "title": "Ariselu | అరిసెలు | Perfect Ariselu With Tips |Ariselu Recipe in Telugu|pindi vantalu By vismai food",
    "channel_name": "Vismai Food",
    "publish_date": "2019-01-05",
    "view_count": 3385952,
    "like_count": 34137,
    "duration": "03:32",
    "language": "Telugu",
    "video_id": "Z_CrhktyRsA",
    "url": "https://www.youtube.com/watch?v=Z_CrhktyRsA",
    "description": "Authentic and traditional Ariselu recipe with perfect tips for a soft and crispy result."
  },
  "ingredients_detected": [
    "400g Ration Rice (soaked for 12 hours)",
    "250g Jaggery (bellam)",
    "2 tbsps Sugar",
    "1 tbsp Ghee (for syrup)",
    "1/4 cup Sesame Seeds (nuvvulu)",
    "250g Rice Flour (sieved)",
    "Additional 150g Rice Flour (if needed)",
    "Oil (for deep frying)"
  ],
  "transcription_telugu": [
    "[00:00:00] హాయ్ ఫూడీస్, వెల్కమ్ టు విస్మయ్ ఫుడ్. ఇవాల్టి స్పెషల్ సంక్రాంతి స్పెషల్ అరిసెలు.",
    "[00:00:20] అరిసెలకి ఎప్పుడైనా సోనా మసూరి కంటే రేషన్ బియ్యం వాడితేనే రుచిగా ఉంటాయి.",
    "[00:00:26] 400 గ్రాముల రేషన్ బియ్యాన్ని రాత్రంతా నానబెట్టి, మర్నాడు నీరు లేకుండా వడకట్టి మెత్తని పిండిలా మర పట్టించాలి.",
    "[00:00:46] పిండిని తప్పకుండా జల్లించుకోవాలి, అప్పుడే అరిసెలు మృదువుగా వస్తాయి.",
    "[00:00:54] పాన్ లో పావు కిలో బెల్లం తరుగు, రెండు చెంచాల పంచదార మరియు కొద్దిగా నీళ్లు పోసి కరిగించాలి.",
    "[00:01:04] బెల్లం కరిగాక ఒక టేబుల్ స్పూన్ నెయ్యి వేసి తీగ పాకం వచ్చేదాకా ఉడికించాలి.",
    "[00:01:24] పాకాన్ని నీళ్లలో వేస్తే ఉండ కట్టాలి. పాకం సెమీ సాఫ్ట్ గా ఉండేలా చూసుకోండి.",
    "[00:01:32] ఇప్పుడు పావు కప్పు నువ్వులు మరియు జల్లించిన తడి పిండిని కొద్దికొద్దిగా వేస్తూ ఉండలు లేకుండా కలపాలి.",
    "[00:01:52] పిండి మరీ జారుగా ఉంటే మరికొంత పొడి పిండి వేసి అడ్జస్ట్ చేసుకోవచ్చు.",
    "[00:02:17] పాలిథిన్ షీట్ మీద నూనె రాసి, చిన్న నిమ్మకాయ సైజు పిండిని తీసుకుని పల్చగా వత్తుకోవాలి.",
    "[00:02:35] మరిగే నూనెలో వేసి మీడియం ఫ్లేమ్ మీద రెండు వైపులా ఎర్రగా వేయించుకోవాలి.",
    "[00:02:50] అరిసె నూనెలో వేయగానే పూరీలా పొంగితే అది పర్ఫెక్ట్ అరిసె అని అర్థం.",
    "[00:03:10] గరిటెతో నూనె అంతా ఒత్తేసి పూర్తిగా చల్లారాక సర్వ్ చేయండి."
  ],
  "transcription_english": [
    "[00:00:00] Hi foodies, welcome to Vismai Food. Today's special is Sankranti special Ariselu.",
    "[00:00:20] For Ariselu, using ration rice instead of Sona Masuri gives a better taste.",
    "[00:00:26] Soak 400g of ration rice overnight, drain the water, and grind it into a fine, slightly damp flour.",
    "[00:00:46] Sieve the flour to ensure the Ariselu are soft and smooth.",
    "[00:00:54] In a pan, add 250g jaggery, 2 tbsps sugar, and a little water; melt it completely.",
    "[00:01:04] Add 1 tbsp ghee and boil until it reaches a single-string consistency.",
    "[00:01:24] Test the syrup in water; it should form a semi-soft ball.",
    "[00:01:32] Add 1/4 cup of sesame seeds and the sieved flour gradually while stirring to avoid lumps.",
    "[00:01:52] If the batter is too thin, add more flour until it reaches the right consistency.",
    "[00:02:17] Grease a polythene sheet and press small lemon-sized balls into thin discs.",
    "[00:02:35] Deep fry in hot oil on a medium flame until golden brown on both sides.",
    "[00:02:50] If the Arise puffs up like a puri, it means the consistency is perfect.",
    "[00:03:10] Press out excess oil and let them cool completely before serving."
  ]
}