{
  "metadata": {
    "title": "Soya Pakoda | మీల్ మేకర్ పకోడీ | ఇది తిన్నాక మరో పకోడీ అడిగితే ఒట్టు | Soya Chunks Pakoda",
    "channel_name": "Vismai Food",
    "publish_date": "2019-01-06",
    "view_count": 1284743,
    "like_count": 17425,
    "duration": "02:06",
    "language": "Telugu",
    "video_id": "feTYIiIP-pA",
    "url": "https://www.youtube.com/watch?v=feTYIiIP-pA",
    "description": "Crispy and crunchy Soya Chunks Pakoda recipe by Vismai Food. Perfect for a quick evening snack."
  },
  "ingredients_detected": [
    "2 Cups Soya Chunks (meal maker)",
    "Water (for boiling)",
    "1/2 tsp Turmeric (pasupu)",
    "Salt (to taste)",
    "1 tbsp Chilli powder (karam)",
    "1 tsp Garam masala",
    "1 tsp Ginger-garlic paste",
    "1 Small Onion, made into a paste",
    "4 tbsps Besan (gram flour)",
    "2 tbsps Rice flour (biyyapu pindi)",
    "Oil (for deep frying)",
    "Optional: Lemon juice and Chaat masala"
  ],
  "transcription_telugu": [
    "[00:00:00] హాయ్ ఫూడీస్, వెల్కమ్ టు విస్మయ్ ఫుడ్. ఇవాల్టి స్పెషల్ సోయా పకోడీ లేదా మీల్ మేకర్ పకోడీ.",
    "[00:00:20] ముందుగా వాటర్ ని బాయిల్ చేసుకోండి. నీళ్లు మరిగాక మాత్రమే రెండు కప్పుల మీల్ మేకర్ వేసుకోండి.",
    "[00:00:27] మూడు నుంచి నాలుగు నిమిషాల పాటు కుక్ చేసుకోండి. మరీ సాఫ్ట్ గా ఉడకకూడదు.",
    "[00:00:34] వీటిని వడకట్టి అందులో చల్లటి నీళ్లు పోసి పక్కన ఉంచుకోవాలి. దీనివల్ల సోయా చంక్స్ మరీ మెత్తబడవు.",
    "[00:00:43] చల్లారాక నీళ్లను గట్టిగా పిండుకుంటూ సోయా చంక్స్ ని ఒక బౌల్ లో వేసుకోండి.",
    "[00:00:48] ఇందులో పసుపు, ఉప్పు, కారం, గరం మసాలా మరియు అల్లం వెల్లుల్లి పేస్ట్ వేసుకోవాలి.",
    "[00:00:58] ఒక చిన్న ఉల్లిపాయ పేస్ట్, నాలుగు టేబుల్ స్పూన్ల శనగపిండి మరియు రెండు టేబుల్ స్పూన్ల బియ్యప్పిండి వేసి బాగా కోట్ చేసుకోవాలి.",
    "[00:01:08] ఇందులో అస్సలు నీళ్లు వేయకూడదు. సోయాలో ఉన్న తేమ మరియు ఉల్లిపాయ పేస్ట్ సరిపోతాయి.",
    "[00:01:21] మరిగే నూనెలో వీటిని పకోడీల్లా వేసి మీడియం ఫ్లేమ్ మీద ఎర్రగా వేయించుకోవాలి.",
    "[00:01:30] లైట్ గోల్డెన్ బ్రౌన్ కలర్ రాగానే తీసేయాలి. మీడియం ఫ్లేమ్ మీద వేపితేనే పకోడీ కరకరలాడుతూ వస్తుంది.",
    "[00:01:40] వేడివేడిగా ఉన్నప్పుడే నిమ్మరసం, చాట్ మసాలా చల్లుకుంటే చాలా రుచిగా ఉంటాయి."
  ],
  "transcription_english": [
    "[00:00:00] Hi foodies, welcome to Vismai Food. Today's special is Soya Pakoda or Meal Maker Pakoda.",
    "[00:00:20] First, boil some water. Add two cups of meal maker only after the water starts boiling.",
    "[00:00:27] Cook for three to four minutes. Do not let them become too soft.",
    "[00:00:34] Strain them and pour cold water over them. This prevents the soya chunks from getting too mushy.",
    "[00:00:43] Once cooled, squeeze out the water and add the soya chunks to a bowl.",
    "[00:00:48] Add turmeric, salt, chilli powder, garam masala, and ginger-garlic paste.",
    "[00:00:58] Add one small onion paste, 4 tbsps of gram flour, and 2 tbsps of rice flour; coat them thoroughly.",
    "[00:01:08] Do not add any water. The moisture in the soya chunks and onion paste is sufficient.",
    "[00:01:21] Drop them into hot oil and fry on a medium flame until golden brown.",
    "[00:01:30] Remove them once they turn a light golden brown. Frying on medium flame makes the pakoda crispy.",
    "[00:01:40] Sprinkle some lemon juice and chaat masala while they are hot for extra flavor."
  ]
}