{
  "metadata": {
    "title": "Tiruvathirai Kali | Halwa | Biyyam Pindi Halwa | Rice Rava Halwa Recipe",
    "channel_name": "Vismai Food",
    "publish_date": "2019-01-07",
    "view_count": 1856139,
    "like_count": 16442,
    "duration": "02:32",
    "language": "Telugu",
    "video_id": "xNIyDDveJDY",
    "url": "https://www.youtube.com/watch?v=xNIyDDveJDY",
    "description": "Tiruvathirai Kali is a traditional South Indian sweet offered as prasad, especially during Dhanurmasam and at the Chidambaram Nataraja Temple."
  },
  "ingredients_detected": [
    "1 Cup Rice (soaked for 1 hour)",
    "1/4 Cup Moong Dal (pesara pappu)",
    "1.5 Cups Jaggery (bellam)",
    "1 Cup Water (for the syrup)",
    "1/2 tsp Cardamom powder (yelakula podi)",
    "2 tbsps Ghee",
    "10-15 Cashews (jeedipappu)",
    "Pinch of Edible Camphor (pacha karpuram) - optional"
  ],
  "transcription_telugu": [
    "[00:00:00] హాయ్ ఫూడీస్, వెల్కమ్ టు విస్మయ్ ఫుడ్. ఇవాల్టి స్పెషల్ బియ్యపు రవ్వ హల్వా లేదా తిరువాదిరై కళి.",
    "[00:00:10] ఇది ధనుర్మాసంలో విష్ణువుకి, చిదంబరంలో నటరాజ స్వామికి నివేదించే ప్రత్యేకమైన ప్రసాదం.",
    "[00:00:20] ముందుగా ఒక కప్పు బియ్యాన్ని గంటసేపు నానబెట్టుకోవాలి.",
    "[00:00:24] నానబెట్టిన బియ్యాన్ని వడకట్టి కాసేపు ఆరబెట్టాలి. బియ్యం పూర్తిగా ఆరిన తర్వాత మాత్రమే వాడాలి.",
    "[00:00:36] కడాయిలో ఆరబెట్టిన బియ్యం, పావు కప్పు పెసరపప్పు వేసి లో ఫ్లేమ్ మీద బ్రౌన్ కలర్ వచ్చేంత వరకు రోస్ట్ చేసుకోవాలి.",
    "[00:00:54] ఇది చల్లారాక మిక్సీలో రవ్వలా లేదా మెత్తని పౌడర్ లా గ్రైండ్ చేసుకోవాలి.",
    "[00:01:04] పాకం కోసం ఒకటిన్నర కప్పుల బెల్లం తరుగు వేసి కొంచెం నీళ్లు పోసి బెల్లం కరిగే వరకు మరిగించాలి.",
    "[00:01:16] కరిగిన బెల్లం పాకాన్ని వడకట్టి అందులో ఒక కప్పు నీళ్లు పోసి మరిగించాలి.",
    "[00:01:30] ఇందులో యాలకుల పొడి వేసి పాకం మరుగుతున్నప్పుడు గ్రైండ్ చేసిన బియ్యం పౌడర్ ని పోస్తూ బాగా కలపాలి.",
    "[00:01:46] మూత పెట్టి ఐదారు నిమిషాలు లో ఫ్లేమ్ మీద మగ్గనివ్వాలి.",
    "[00:01:56] ఇప్పుడు నెయ్యి వేడి చేసి జీడిపప్పు వేపుకొని హల్వాలో కలపాలి.",
    "[00:02:05] చివరగా పచ్చ కర్పూరం వేసి రెండు నిమిషాలు మగ్గనిస్తే కమ్మటి హల్వా రెడీ."
  ],
  "transcription_english": [
    "[00:00:00] Hi foodies, welcome to Vismai Food. Today's special is Rice Rava Halwa or Tiruvathirai Kali.",
    "[00:00:10] This is a special prasad offered to Lord Vishnu during Dhanurmasam and Lord Nataraja at Chidambaram.",
    "[00:00:20] First, soak one cup of rice for one hour.",
    "[00:00:24] Drain the soaked rice and let it dry for a while. Use it only after it is completely dry.",
    "[00:00:36] In a pan, add the dried rice and 1/4 cup moong dal; roast on low flame until they turn brown.",
    "[00:00:54] Once cooled, grind it into a coarse rava-like consistency or a fine powder.",
    "[00:01:04] For the syrup, add 1.5 cups of grated jaggery and a little water; boil until the jaggery dissolves.",
    "[00:01:16] Strain the jaggery syrup and add one cup of water; bring it to a boil.",
    "[00:01:30] Add cardamom powder and while the syrup boils, pour the rice powder while stirring continuously.",
    "[00:01:46] Cover and let it cook on low flame for five to six minutes.",
    "[00:01:56] Heat ghee, fry cashews, and mix them into the halwa.",
    "[00:02:05] Finally, add edible camphor and let it simmer for two minutes. The delicious halwa is ready."
  ]
}