{
  "metadata": {
    "title": "Vankaya Pachi Pulusu | Raw Rasam | వంకాయ పచ్చి పులుసు | Baingan Raw Rasam",
    "channel_name": "Vismai Food",
    "publish_date": "2019-01-09",
    "view_count": 1124181,
    "like_count": 13141,
    "duration": "02:06",
    "language": "Telugu",
    "video_id": "dRHUNyDd16w",
    "url": "https://www.youtube.com/watch?v=dRHUNyDd16w",
    "description": "Authentic and traditional Vankaya Pachi Pulusu (Brinjal Raw Rasam) recipe by Vismai Food. A perfect side dish for rice or ragi sangati."
  },
  "ingredients_detected": [
    "4 White Brinjals (Vankayalu)",
    "Oil (for applying on brinjals and for tempering)",
    "1 Onion, finely chopped",
    "2 Green chillies, finely chopped",
    "Handful of Coriander leaves, chopped",
    "1/2 inch Ginger, finely chopped",
    "Salt (to taste)",
    "1/4 tsp Turmeric (pasupu)",
    "1/2 tsp Mustard seeds (avalu)",
    "1/4 tsp Fenugreek seeds (menthulu)",
    "1 tbsp Chana dal (senagapappu)",
    "2 Dry red chillies, chopped",
    "6-7 Crushed garlic pods",
    "2 sprigs Curry leaves",
    "1 pinch Asafoetida (hing)",
    "400ml Tamarind juice (extracted from a lemon-sized tamarind)",
    "2 tbsps Jaggery powder (bellam podi)"
  ],
  "transcription_telugu": [
    "[00:00:00] హాయ్ ఫూడీస్, వెల్కమ్ టు విస్మయ్ ఫుడ్. ఇవాల్టి స్పెషల్ వంకాయ పచ్చి పులుసు.",
    "[00:00:05] ఈ పచ్చి పులుసు పుల్లపుల్లగా, కారకారంగా, తియ్యతియ్యగా భలే బాగుంటుంది.",
    "[00:00:20] ముందుగా నాలుగు తెల్ల వంకాయలకి నూనె రాసి స్టవ్ మీద పెట్టి తొక్క నల్లగా అయ్యే వరకు కాల్చుకోవాలి.",
    "[00:00:41] వంకాయలు చల్లారాక పైన తొక్క తీసేసి మెత్తగా మెదుపుకోవాలి.",
    "[00:00:54] ఇందులో ఉల్లిపాయ తరుగు, పచ్చిమిర్చి తరుగు, కొత్తిమీర, అల్లం తరుగు, ఉప్పు మరియు పసుపు వేయాలి.",
    "[00:01:04] అన్నిటినీ గట్టిగా పిండుతూ మెదుపుకోవాలి. ఇది చాలా ఇంపార్టెంట్ స్టెప్.",
    "[00:01:09] కడాయిలో నూనె వేడి చేసి ఆవాలు, మెంతులు, శనగపప్పు, ఎండుమిర్చి వేసి ఎర్రగా వేపుకోవాలి.",
    "[00:01:19] దంచిన వెల్లుల్లి మరియు కరివేపాకు వేసి వేయించిన తర్వాత చిటికెడు ఇంగువ వేసి దించేయాలి.",
    "[00:01:31] ఇప్పుడు ఈ తాలింపులో చింతపండు రసం, బెల్లం పొడి వేసి బాగా కలపాలి.",
    "[00:01:42] చివరగా మెదిపి పెట్టుకున్న వంకాయ మిశ్రమాన్ని ఇందులో వేసి బాగా కలిపి సర్వ్ చేయాలి."
  ],
  "transcription_english": [
    "[00:00:00] Hi foodies, welcome to Vismai Food. Today's special is Vankaya Pachi Pulusu.",
    "[00:00:05] This raw rasam is perfectly tangy, spicy, and sweet.",
    "[00:00:20] First, apply oil to four white brinjals and grill them on a stove until the outer skin turns black.",
    "[00:00:41] Once cooled, peel off the skin and mash the brinjals thoroughly.",
    "[00:00:54] Add chopped onion, green chillies, coriander, chopped ginger, salt, and turmeric.",
    "[00:01:04] Squeeze and mash all the ingredients together; this is a very important step.",
    "[00:01:09] Heat oil in a pan and fry mustard seeds, fenugreek, chana dal, and dry red chillies until golden brown.",
    "[00:01:19] Add crushed garlic and curry leaves; sauté well, then add a pinch of asafoetida and turn off the heat.",
    "[00:01:31] Add tamarind juice and jaggery powder to the tempering and mix well.",
    "[00:01:42] Finally, add the mashed brinjal mixture to the rasam, mix thoroughly, and serve."
  ]
}