{
  "metadata": {
    "title": "Chekkalu | చెక్కలు | పప్పు బిళ్ళలు | ఇవి కలిపి ఓ సారి చెక్కలు చేస్తే ఎన్ని తింటారో లెక్కే ఉండదు",
    "channel_name": "Vismai Food",
    "publish_date": "2019-01-09",
    "view_count": 7000200,
    "like_count": 60527,
    "duration": "02:14",
    "language": "Telugu",
    "video_id": "aeg_j9Gd03c",
    "url": "https://www.youtube.com/watch?v=aeg_j9Gd03c",
    "description": "Crispy and crunchy Chekkalu (Rice Crackers) recipe with tips for the perfect texture and taste."
  },
  "ingredients_detected": [
    "500g Rice Flour (ration rice preferred)",
    "1 handful Sabudana (soaked for 1 hour)",
    "1 handful Split Urad Dal (soaked for 1 hour)",
    "1 tbsp Cumin Seeds",
    "2 tbsps Sesame Seeds",
    "2 sprigs Curry Leaves, chopped",
    "1/2 bunch Coriander Leaves, chopped",
    "6-7 Green Chillies and 1 inch Ginger (paste)",
    "Salt (to taste)",
    "2 tbsps Hot Ghee or Dalda",
    "Luke warm water (for kneading)",
    "Oil (for deep frying)"
  ],
  "transcription_telugu": [
    "[00:00:00] హాయ్ ఫూడీస్, వెల్కమ్ టు విస్మయ్ ఫుడ్. ఇవాల్టి స్పెషల్ కరకరలాడే చెక్కలు.",
    "[00:00:07] ఈ పద్ధతిలో చేస్తే చెక్కలు చాలా పర్ఫెక్ట్ గా, టేస్టీగా వస్తాయి. మీరు ఒకటి తింటే నాలుగైదు తినాలనిపిస్తుంది.",
    "[00:00:19] ముందుగా ఒక బౌల్ లో 500 గ్రాముల బియ్యప్పిండిని తీసుకోండి. రేషన్ బియ్యం పిండి అయితే చెక్కలు బాగా వస్తాయి.",
    "[00:00:27] ఇందులో గంట సేపు నానబెట్టిన సగ్గుబియ్యం, మినప్పప్పు వేయాలి.",
    "[00:00:33] జీలకర్ర, నువ్వులు, కరివేపాకు తరుగు మరియు కొత్తిమీర తరుగు కూడా వేయాలి.",
    "[00:00:41] పచ్చిమిర్చి మరియు అల్లం కలిపి దంచిన పేస్ట్, తగినంత ఉప్పు వేయాలి.",
    "[00:00:47] ఇప్పుడు రెండు టేబుల్ స్పూన్ల వేడి నెయ్యి లేదా డాల్డా వేసి బాగా కలపాలి. దీనివల్ల చెక్కలు గుల్లగా వస్తాయి.",
    "[00:00:59] తగినంత గోరువెచ్చని నీళ్లు పోస్తూ పిండిని గట్టిగా కలుపుకోవాలి.",
    "[00:01:08] పిండిని చిన్న చిన్న ఉండలుగా చుట్టుకోవాలి.",
    "[00:01:16] పూరీ ప్రెస్ మీద ప్లాస్టిక్ కవర్ పెట్టి నూనె రాసి, ఉండను పెట్టి పల్చగా ఒత్తుకోవాలి.",
    "[00:01:33] మరిగే నూనెలో వేసి మీడియం ఫ్లేమ్ మీద లైట్ గోల్డెన్ బ్రౌన్ కలర్ వచ్చే వరకు వేయించాలి.",
    "[00:01:42] నూనెలోనే మరీ ఎర్రగా వేపకూడదు, బయటకి తీశాక మరింత రంగు మారుతాయి.",
    "[00:02:00] ఎంతో కరకరలాడే చెక్కలు రెడీ. ఈ సంక్రాంతికి మీరు కూడా ట్రై చేయండి"
  ],
  "transcription_english": [
    "[00:00:00] Hi foodies, welcome to Vismai Food. Today's special is crispy Chekkalu.",
    "[00:00:07] If you follow this method, the chekkalu will turn out perfectly and tasty. You won't stop at just one.",
    "[00:00:19] First, take 500g of rice flour in a bowl. Flour made from ration rice gives the best results.",
    "[00:00:27] Add sabudana and split urad dal that have been soaked for one hour.",
    "[00:00:33] Add cumin seeds, sesame seeds, chopped curry leaves, and chopped coriander leaves.",
    "[00:00:41] Add green chilli and ginger paste, and salt to taste.",
    "[00:00:47] Now add two tbsps of hot ghee or Dalda and mix well. This makes the chekkalu crispy and light.",
    "[00:00:59] Add sufficient lukewarm water and knead the dough firmly.",
    "[00:01:08] Divide the dough into small equal-sized balls.",
    "[00:01:16] Place a plastic sheet on a puri press, grease it with oil, and press the balls into thin discs.",
    "[00:01:33] Drop them in hot oil and fry on medium flame until they turn a light golden brown.",
    "[00:01:42] Do not over-fry them in the oil as they will darken further after being removed.",
    "[00:02:00] The super crispy Chekkalu are ready. Do try them this Sankranti"
  ]
}