{
  "metadata": {
    "title": "Kajjikayalu Recipe in Telugu | కజ్జికాయలు తయారీ విధానం | Bellam Kajjikayalu",
    "channel_name": "Vismai Food",
    "publish_date": "2019-01-10",
    "view_count": 6441945,
    "like_count": 46557,
    "duration": "02:42",
    "language": "Telugu",
    "video_id": "09scAX6uUh8",
    "url": "https://www.youtube.com/watch?v=09scAX6uUh8",
    "description": "Authentic and traditional Kajjikayalu recipe with tips for a perfect crispy and sweet result."
  },
  "ingredients_detected": [
    "250g Refined flour (maida) [00:00:21]",
    "3 tbsps Hot ghee [00:00:24]",
    "Water (for kneading) [00:00:29]",
    "1 Cup Peanuts [00:00:39]",
    "1/2 Cup Sesame seeds [00:00:47]",
    "1/2 Cup Dry coconut powder [00:01:01]",
    "1 Cup Roasted chana [00:01:03]",
    "300g Jaggery (bellam) [00:01:08]",
    "1 tsp Cardamom powder [00:01:13]",
    "Oil (for deep frying) [00:02:07]"
  ],
  "transcription_telugu": [
    "[00:00:00] హాయ్ ఫూడీస్, వెల్కమ్ టు విస్మయ్ ఫుడ్. ఇవాల్టి స్పెషల్ కజ్జికాయలు.",
    "[00:00:10] ఈ కజ్జికాయలు తింటుంటే మళ్ళీ మళ్ళీ తినాలనిపిస్తుంది. లెట్స్ స్టార్ట్.",
    "[00:00:21] ఒక బౌల్ లో పావు కిలో మైదా పిండి, మూడు టేబుల్ స్పూన్ల వేడి నెయ్యి వేసి బాగా కలుపుకోవాలి.",
    "[00:00:29] తగినంత నీరు పోసి పిండిని సాఫ్ట్ గా కలుపుకొని పక్కన పెట్టుకోవాలి.",
    "[00:00:39] కడాయిలో ఒక కప్పు పల్లీలు వేసి లో ఫ్లేమ్ మీద వేయించాలి.",
    "[00:00:47] అర కప్పు నువ్వులు వేసి చిటపటలాడే వరకు వేయించి పక్కన ఉంచుకోవాలి.",
    "[00:00:56] వేయించిన పల్లీల పొట్టు తీసి మిక్సీ జార్ లో వేసుకోవాలి.",
    "[00:01:01] అందులో ఎండు కొబ్బరి పొడి, పుట్నాల పప్పు, వేయించిన నువ్వులు మరియు బెల్లం తరుగు వేసి మెత్తని పౌడర్ లా గ్రైండ్ చేయాలి.",
    "[00:01:13] చివరగా యాలకుల పొడి వేసి బాగా కలుపుకుంటే లోపల పెట్టే స్టఫింగ్ రెడీ.",
    "[00:01:21] పిండిని చిన్న ఉండలుగా చేసి పల్చటి రోటీల్లా ఒత్తుకోవాలి.",
    "[00:01:32] కజ్జికాయల మౌల్డ్ కి పిండి చల్లి, పల్చటి రోటీని ఉంచి అందులో రెండు స్పూన్ల స్టఫింగ్ పెట్టాలి.",
    "[00:01:41] అంచులకి నీరు రాసి గట్టిగా ప్రెస్ చేసి ఎక్సెస్ పిండిని తీసేయాలి.",
    "[00:02:00] అంచులను పర్ఫెక్ట్ షేప్ లో కట్ చేసుకుంటే కజ్జికాయలు అందంగా ఉంటాయి.",
    "[00:02:07] మరిగే నూనెలో వేసి మీడియం ఫ్లేమ్ మీద గోల్డెన్ బ్రౌన్ కలర్ వచ్చే వరకు వేయించి సర్వ్ చేయాలి."
  ],
  "transcription_english": [
    "[00:00:00] Hi foodies, welcome to Vismai Food. Today's special is Kajjikayalu.",
    "[00:00:10] These kajjikayalu are so delicious you'll want to eat them again and again. Let's start.",
    "[00:00:21] In a bowl, take 250g refined flour and 3 tbsps of hot ghee; mix thoroughly.",
    "[00:00:29] Add enough water and knead it into a soft dough; set it aside.",
    "[00:00:39] In a pan, roast one cup of peanuts on a low flame.",
    "[00:00:47] Roast half a cup of sesame seeds until they splutter and set them aside.",
    "[00:00:56] Peel the roasted peanuts and add them to a mixer jar.",
    "[00:01:01] Add dry coconut powder, roasted chana, roasted sesame seeds, and jaggery; grind into a fine powder.",
    "[00:01:13] Finally, add cardamom powder and mix well; the stuffing is ready.",
    "[00:01:21] Divide the dough into small balls and roll them into thin discs.",
    "[00:01:32] Dust the kajjikayalu mould with flour, place the disc, and add two spoons of stuffing.",
    "[00:01:41] Apply water to the edges, press firmly, and remove the excess dough.",
    "[00:02:00] Cut the edges into a perfect shape to make them look more attractive.",
    "[00:02:07] Fry in hot oil on a medium flame until golden brown, then serve."
  ]
}