{
  "metadata": {
    "title": "Semiya Murukku | Semiya Janthikalu | సేమియా తో ఇలా మురుకులు చేస్తే కరకరలాడుతూ భలే వస్తాయి",
    "channel_name": "Vismai Food",
    "publish_date": "2019-01-11",
    "view_count": 121627,
    "like_count": 1722,
    "duration": "02:27",
    "language": "Telugu",
    "video_id": "0TfBRGOtR4w",
    "url": "https://www.youtube.com/watch?v=0TfBRGOtR4w",
    "description": "Unique and crispy Semiya Murukku (Vermicelli Crackers) recipe with perfect measurements and tips."
  },
  "ingredients_detected": [
    "1 Cup Semiya (vermicelli)",
    "2 Cups Water (for soaking)",
    "2 Cups Rice flour (biyyapu pindi)",
    "2 tbsps Sesame seeds (nuvvulu)",
    "1 tbsp Chilli powder (karam)",
    "Salt (to taste)",
    "2 tbsps Hot oil or ghee",
    "Little Water (for kneading)",
    "Oil (for deep frying)"
  ],
  "transcription_telugu": [
    "[00:00:00] హాయ్ ఫూడీస్, వెల్కమ్ టు విస్మయ్ ఫుడ్. ఇవాల్టి స్పెషల్ సేమియా మురుకులు.",
    "[00:00:05] కరకరలాడుతూ తిన్న కొద్దీ తినాలనిపించే ఈ మురుకులు చాలా గుల్లగా వస్తాయి.",
    "[00:00:23] ముందుగా ఒక బౌల్ లో ఒక కప్పు సేమియా వేసి, అవి మునిగేంత వరకు నీళ్లు పోసి రెండు గంటల పాటు నానబెట్టాలి.",
    "[00:00:31] సేమియా పట్టుకుంటే పిండిలా అయిపోవాలి, అప్పటివరకు నానబెట్టి నీళ్లన్నీ వడకట్టాలి.",
    "[00:00:36] ఒక మిక్సింగ్ బౌల్ లో రెండు కప్పుల బియ్యప్పిండి, సేమియా, నువ్వులు, కారం మరియు ఉప్పు వేయాలి.",
    "[00:00:49] రెండు టేబుల్ స్పూన్ల వేడి నూనె వేసి సేమియాని పిండితో పాటు బాగా మెదుపుతూ కలపాలి.",
    "[00:01:00] కొద్దికొద్దిగా నీళ్లు పోస్తూ పిండిని సాఫ్ట్ గా కలుపుకోవాలి. సేమియాలో ఉన్న తేమ వల్ల నీళ్లు తక్కువ పడతాయి.",
    "[00:01:15] మురుకుల మౌల్డ్ కి స్టార్ షేప్ ప్లేట్ పెట్టి నూనె రాసి, పిండి ముద్దను ఉంచాలి.",
    "[00:01:27] చిల్లుల గరిటె మీద చక్రాకారం లో చుట్టుకోవాలి.",
    "[00:01:40] నూనె వేడెక్కాక మీడియం ఫ్లేమ్ మీద ఒక్కొక్కటిగా వేసి వేయించాలి.",
    "[00:01:52] మురుకులు గోల్డెన్ కలర్ లోకి వచ్చి కరకరలాడే వరకు వేపుకోవాలి.",
    "[00:02:10] ఎంతో రుచికరమైన సేమియా మురుకులు రెడీ. పూర్తిగా చల్లారాక ఎయిర్ టైట్ జార్ లో భద్రపరుచుకోవాలి."
  ],
  "transcription_english": [
    "[00:00:00] Hi foodies, welcome to Vismai Food. Today's special is Semiya Murukku.",
    "[00:00:05] These murukku are super crispy and hollow, making you want more with every bite.",
    "[00:00:23] First, take one cup of semiya in a bowl, add enough water to cover it, and soak for two hours.",
    "[00:00:31] The semiya should be soft enough to mash into a paste; drain the water completely.",
    "[00:00:36] In a mixing bowl, add two cups of rice flour, soaked semiya, sesame seeds, chilli powder, and salt.",
    "[00:00:49] Add two tablespoons of hot oil and mash the semiya into the flour while mixing thoroughly.",
    "[00:01:00] Add water gradually and knead into a soft dough. You'll need less water due to the moisture in the semiya.",
    "[00:01:15] Use a star-shaped plate in the murukku mould, grease it, and fill it with the dough.",
    "[00:01:27] Swirl the dough onto a perforated spoon in a circular shape.",
    "[00:01:40] Once the oil is hot, drop them one by one and fry on a medium flame.",
    "[00:01:52] Fry until they turn golden brown and become perfectly crispy.",
    "[00:02:10] Delicious Semiya Murukku are ready. Store them in an airtight jar once they cool completely."
  ]
}