{
  "metadata": {
    "title": "Natukodi Pulao | ఇలా నాటు కోడి పులావ్ చేస్తే ఎంతో రుచిగా పర్ఫెక్ట్ గా వస్తుంది | Country Chicken",
    "channel_name": "Vismai Food",
    "publish_date": "2019-01-12",
    "view_count": 390879,
    "like_count": 5526,
    "duration": "03:54",
    "language": "Telugu",
    "video_id": "WaKcXrjCUp0",
    "url": "https://www.youtube.com/watch?v=WaKcXrjCUp0",
    "description": "Flavorful and spicy Country Chicken Pulao (Natukodi Pulao) with a perfect blend of spices, ideal for special occasions."
  },
  "ingredients_detected": [
    "2 Cups Chitti Mutyalu/Zeera Rice (soaked for 1 hour)",
    "3 tbsps Ghee",
    "2 tbsps Oil",
    "1 Phattar Phool (Stone flower)",
    "2 inches Cinnamon",
    "5-6 Cardamoms",
    "1 Black cardamom",
    "1 Star anise",
    "1 Javitri (Mace)",
    "7-8 Cloves",
    "2 Bay leaves",
    "1 tsp Saunf (Fennel seeds)",
    "1 tsp Shahi Jeera",
    "7-8 Green chillies, slit",
    "2 Large onions, sliced",
    "Salt (to taste)",
    "1 tbsp Ginger-garlic paste",
    "1/4 tsp Turmeric",
    "1 bunch Pudina (Mint leaves)",
    "1 bunch Coriander with stems, chopped",
    "2 Tomatoes, chopped",
    "1 tbsp Chilli powder",
    "1 tsp Coriander powder",
    "1/2 Cup Whisked curd",
    "1/2 kg Country Chicken (Natu kodi)",
    "250ml Water (for initial cooking)",
    "4 Cups Water (for the pulao)"
  ],
  "transcription_telugu": [
    "[00:00:00] హాయ్ ఫూడీస్, వెల్కమ్ టు విస్మయ్ ఫుడ్. ఇవాల్టి స్పెషల్ సంక్రాంతి స్పెషల్ నాటు కోడి పులావ్.",
    "[00:00:10] ఇది చాలా ఘాటుగా, కారం కారంగా భలే ఉంటుంది. లెట్స్ స్టార్ట్.",
    "[00:00:25] ముందుగా రెండు కప్పుల చిట్టి ముత్యాలు లేదా జీరా రైస్ ని ఒక గంట పాటు నానబెట్టుకోవాలి.",
    "[00:00:51] మందపాటి గిన్నెలో మూడు టేబుల్ స్పూన్ల నెయ్యి, రెండు టేబుల్ స్పూన్ల నూనె వేడి చేసుకోవాలి.",
    "[00:00:57] అందులో పత్తర్ ఫూల్, దాల్చిన చెక్క, యాలకులు, నల్ల యాలక, అనాస పువ్వు, జాపత్రి, లవంగాలు, బిర్యానీ ఆకులు, సోంపు మరియు షాజీరా వేసి వేయించాలి.",
    "[00:01:15] పచ్చిమిర్చి చీలికలు వేసి మూత పెట్టి మగ్గించుకోవాలి.",
    "[00:01:22] రెండు పెద్ద ఉల్లిపాయ చీలికలు వేసి గోల్డెన్ బ్రౌన్ కలర్ వచ్చే వరకు వేయించాలి.",
    "[00:01:31] ఉప్పు వేయడం వల్ల ఉల్లిపాయలు త్వరగా వేగుతాయి.",
    "[00:01:38] అల్లం వెల్లుల్లి పేస్ట్, పసుపు వేసి పచ్చివాసన పోయేదాకా వేయించాలి.",
    "[00:01:50] ఇప్పుడు పుదీనా, కొత్తిమీర తరుగు మరియు టొమాటో ముక్కలు వేసి మెత్తబడే వరకు మగ్గించాలి.",
    "[00:02:07] కారం, ధనియాల పొడి మరియు అర కప్పు పెరుగు వేసి బాగా కలపాలి.",
    "[00:02:20] అర కిలో నాటు కోడి ముక్కలు వేసి మసాలాలన్నీ పట్టించి మూడు నాలుగు నిమిషాలు మగ్గించాలి.",
    "[00:02:33] పావు లీటర్ నీళ్లు పోసి మూత పెట్టి నాలుగు ఐదు నిమిషాలు ఉడికించాలి.",
    "[00:02:45] ఇప్పుడు నాలుగు కప్పుల నీళ్లు పోసి, ఉప్పు అడ్జస్ట్ చేసి ఎసరు తెర్లకాగనివ్వాలి.",
    "[00:03:00] ఎసరు మరుగుతున్నప్పుడు నానబెట్టిన బియ్యం వేసి 8 నిమిషాలు హై ఫ్లేమ్ మీద, 7 నిమిషాలు లో ఫ్లేమ్ మీద ఉడికించాలి.",
    "[00:03:15] స్టవ్ ఆఫ్ చేసి 15 నిమిషాల పాటు కదపకుండా వదిలేస్తే పులావ్ రెడీ."
  ],
  "transcription_english": [
    "[00:00:00] Hi foodies, welcome to Vismai Food. Today's special is Sankranti special Country Chicken Pulao.",
    "[00:00:10] It's very spicy and flavorful. Let's start.",
    "[00:00:25] First, soak two cups of Chitti Mutyalu or Zeera rice for one hour.",
    "[00:00:51] Heat 3 tbsps of ghee and 2 tbsps of oil in a thick-bottomed pan.",
    "[00:00:57] Add stone flower, cinnamon, cardamoms, black cardamom, star anise, mace, cloves, bay leaves, fennel seeds, and shahi jeera; roast well.",
    "[00:01:15] Add slit green chillies, cover, and let them sauté.",
    "[00:01:22] Add two large sliced onions and fry until golden brown.",
    "[00:01:31] Adding salt helps the onions fry faster.",
    "[00:01:38] Add ginger-garlic paste and turmeric; sauté until the raw smell is gone.",
    "[00:01:50] Add mint, chopped coriander, and chopped tomatoes; cook until they become soft.",
    "[00:02:07] Mix in chilli powder, coriander powder, and half a cup of whisked curd.",
    "[00:02:20] Add half a kg of country chicken pieces, coat them with spices, and sauté for 3-4 minutes.",
    "[00:02:33] Pour 250ml of water, cover, and cook for four to five minutes.",
    "[00:02:45] Now add four cups of water, adjust salt, and bring it to a boil.",
    "[00:03:00] When the water is boiling, add the soaked rice and cook for 8 minutes on high flame and 7 minutes on low flame.",
    "[00:03:15] Turn off the heat and let it rest for 15 minutes without disturbing. The pulao is ready."
  ]
}