{
  "metadata": {
    "title": "Onion Pakodi | ఉల్లిపాయ పకోడీ | గట్టి పకోడీ | Crispy Sweet Shop Style Onion Pakoda | Best onion Pakoda",
    "channel_name": "Vismai Food",
    "publish_date": "2018-09-30",
    "view_count": 8040456,
    "like_count": 84605,
    "duration": "02:47",
    "language": "Telugu",
    "video_id": "j7QInvhwrAE",
    "url": "https://www.youtube.com/watch?v=j7QInvhwrAE",
    "description": "Perfect crispy sweet shop style onion pakoda recipe by Vismai Food.",
    "ingredients_detected": [
      "300gms Onion (sliced length-wise)",
      "4-5 Green Chillies (slit)",
      "Salt (to taste)",
      "1 tbsp Red Chilli powder",
      "1 tbsp Ginger garlic paste (freshly ground)",
      "1 tsp Roasted cumin powder",
      "1 tsp Coriander powder",
      "1 tsp Cumin seeds",
      "1 tsp Coriander seeds (crushed)",
      "150gms Chickpea flour (besan)",
      "2 tbsps Rice flour",
      "1 tbsp Water",
      "Oil (for deep frying)",
      "2 Sprigs Curry leaves"
    ]
  },
  "transcription_telugu": [
    "[00:00:00.000] హలో ఫుడీస్, వెల్కమ్ టు విస్మయ్ ఫుడ్. ఇవాల్టి స్పెషల్ స్వీట్ షాప్ స్టైల్ ఉల్లిపాయ పకోడీ.",
    "[00:00:07.000] గట్టి పకోడీ అని కూడా పిలిచే ఈ రెసిపీ చాలా క్రిస్పీగా ఉంటుంది. ఈజీగా ఎలా తయారు చేయాలో చూద్దాం.",
    "[00:00:19.000] ముందుగా 300 గ్రాముల ఉల్లిపాయలను నిలువుగా మరీ సన్నగా కాకుండా కోసుకోండి. ఇందులో 4-5 పచ్చిమిర్చి చీలికలు కలపండి.",
    "[00:00:41.000] ఒక బౌల్ లో ఉల్లిపాయలు, పచ్చిమిర్చి, ఉప్పు, ఒక టేబుల్ స్పూన్ కారం, ఒక టేబుల్ స్పూన్ అల్లం వెల్లుల్లి పేస్ట్ వేయండి.",
    "[00:00:51.000] అలాగే ఒక టీస్పూన్ వేయించిన జీలకర్ర పొడి, ఒక టీస్పూన్ ధనియాల పొడి, ఒక టీస్పూన్ జీలకర్ర, ఒక టీస్పూన్ దంచిన ధనియాలు వేయండి.",
    "[00:01:06.000] వీటన్నింటినీ ఉల్లిపాయ ముక్కలకు పట్టేలా గట్టిగా నలుపుతూ కలుపుకోవాలి. దీనివల్ల ఉల్లిపాయల్లోని తేమ బయటకు వస్తుంది.",
    "[00:01:13.000] ఇప్పుడు 150 గ్రాముల శనగపిండి, రెండు టేబుల్ స్పూన్ల బియ్యం పిండి వేసి బాగా కోట్ అయ్యేలా కలుపుకోండి.",
    "[00:01:29.000] కేవలం ఒక టేబుల్ స్పూన్ నీళ్లు వేసి పిండిని గట్టిగా కలుపుకోండి. పిండి ఎంత గట్టిగా ఉంటే పకోడీ అంత క్రిస్పీగా వస్తుంది.",
    "[00:01:46.000] వేడి నూనెలో పిండిని ముద్దలు ముద్దలుగా విడివిడిగా వేసుకోండి.",
    "[00:01:55.000] మీడియం ఫ్లేమ్ లో క్రిస్పీగా అయ్యేంత వరకు వేపుకోవాలి. 95% వేగాక బయటకు తీసేయండి, ఆ వేడికే మిగిలినది వేగిపోతుంది.",
    "[00:02:14.000] చివరగా రెండు రెబ్బల కరివేపాకు వేయించి పకోడీలపై చల్లుకోండి.",
    "[00:02:26.000] గాలి తగిలేలా ఉంచితే పకోడీలు గట్టిపడతాయి. స్వీట్ షాప్ స్టైల్ ఆనియన్ పకోడీ రెడీ."
  ],
  "transcription_english": [
    "[00:00:00.000] Hello Foodies, welcome to Vismai Food. Today's special is sweet shop style Onion Pakodi.",
    "[00:00:07.000] Also known as Gatti Pakodi, it's very crispy. Let's see how to make it easily.",
    "[00:00:19.000] Slice 300gms of onions length-wise (not too thin) and add 4-5 slit green chillies.",
    "[00:00:41.000] In a bowl, add onions, green chillies, salt, 1 tbsp red chilli powder, and 1 tbsp ginger-garlic paste.",
    "[00:00:51.000] Add 1 tsp roasted cumin powder, 1 tsp coriander powder, 1 tsp cumin seeds, and 1 tsp crushed coriander seeds.",
    "[00:01:06.000] Mix everything well by squeezing the onions to release moisture.",
    "[00:01:13.000] Add 150gms chickpea flour and 2 tbsps rice flour; coat the onions well.",
    "[00:01:29.000] Add just 1 tbsp of water and mix tightly. The tighter the batter, the crispier the pakoda.",
    "[00:01:46.000] Drop small portions of the batter into hot oil.",
    "[00:01:55.000] Fry on medium flame until crispy. Remove when 95% done, as the residual heat will cook them further.",
    "[00:02:14.000] Finally, fry two sprigs of curry leaves and sprinkle over the pakodas.",
    "[00:02:26.000] Let them cool completely in open air to become firm. Sweet shop style onion pakoda is ready."
  ]
}