{
  "metadata": {
    "title": "Purnam Burelu in Telugu | Purnalu | ఈ స్టైల్ లో పూర్ణాలు వేస్తే గంటల తరువాత కరకరలాడుతూ ఉంటాయి",
    "channel_name": "Vismai Food",
    "publish_date": "2019-01-13",
    "view_count": 3838521,
    "like_count": 34994,
    "duration": "03:45",
    "language": "Telugu",
    "video_id": "fuc-bjPHD0U",
    "url": "http://www.youtube.com/watch?v=fuc-bjPHD0U",
    "description": "ఈ టిప్స్ ఫాలో అయ్యి పూర్ణాలు చేస్తే గంటల తరబడి కరకరలాడుతూ ఉంటాయి. పైన కోటింగ్ చాలా పల్చగా వస్తుంది.",
    "ingredients_detected": [
      "Urad Dal (మినప్పప్పు) - 1/2 Cup (4 గంటలు నానబెట్టినది)",
      "Rice Flour (బియ్యం పిండి) - 1 Cup",
      "Chana Dal (శనగపప్పు) - 1 Cup (1 గంట నానబెట్టినది)",
      "Jaggery (బెల్లం తరుగు) - 250g",
      "Salt (ఉప్పు) - చిటికెడు",
      "Water (నీళ్లు) - అవసరమైనంత",
      "Ghee (నెయ్యి) - 1 tsp",
      "Cardamom Powder (యాలకల పొడి) - 1/2 tsp",
      "Oil (నూనె) - డీప్ ఫ్రైకి సరిపడా"
    ]
  },
  "transcription_telugu": [
    "[00:00:00.000] హలో ఫుడీస్, వెల్కమ్ టు విస్మయి ఫుడ్. ఇవాల్టి స్పెషల్ పూర్ణం బూరెలు.",
    "[00:00:25.000] ముందుగా నాలుగు గంటలు నానబెట్టిన అర కప్పు మినప్పప్పును ఇడ్లీ పిండిలా సాఫ్ట్‌గా గ్రైండ్ చేసుకోండి.",
    "[00:00:33.000] ఇప్పుడు కప్పు బియ్యం పిండిలో చిటికెడు ఉప్పు, నీళ్లు పోసి మెత్తగా ముద్దలా కలుపుకొని గంట సేపు నానబెట్టండి.",
    "[00:00:46.000] కుక్కర్‌లో గంట పైన నానిన కప్పు శనగపప్పు, 4 కప్పుల నీళ్లు పోసి మీడియం ఫ్లేమ్ మీద 4-5 విజిల్స్ వచ్చే వరకు ఉడికించాలి.",
    "[00:00:58.000] ఉడికిన పప్పును నీళ్లు వడకట్టి మెత్తగా మెదుపుకోవాలి.",
    "[00:01:18.000] కడాయిలో ఒక టేబుల్ స్పూన్ నీళ్లు, పావు కిలో బెల్లం తరుగు వేసి కరిగి నురగ వచ్చే వరకు బాయిల్ చేయండి.",
    "[00:01:37.000] ఇందులో మెదిపిన శనగపప్పు వేసి దగ్గర పడే వరకు మీడియం ఫ్లేమ్ మీద ఉడికించాలి.",
    "[00:01:52.000] చివరగా నెయ్యి, యాలకల పొడి వేసి కలిపి చల్లార్చుకోవాలి.",
    "[00:02:01.000] చల్లారాక చేతులకి నెయ్యి రాసుకుని చిన్న చిన్న బాల్స్‌లా చుట్టుకోవాలి.",
    "[00:02:19.000] నానిన బియ్యం పిండిలో గ్రైండ్ చేసిన మినప్పప్పు వేసి, కొంచెం నీళ్లు కలిపి ఇడ్లీ పిండి కన్సిస్టెన్సీకి తెచ్చుకోవాలి.",
    "[00:02:37.000] పూర్ణాన్ని పిండిలో ముంచి, అదనపు పిండిని వదిలేసి వేడి నూనెలో వేయాలి.",
    "[00:02:52.000] హై ఫ్లేమ్ మీద లైట్ గోల్డెన్ కలర్ వచ్చే వరకు వేయించి తీసేయడమే."
  ],
  "transcription_english": [
    "[00:00:00.000] Hello foodies, welcome to Vismai Food. Today's special is Purnam Burelu.",
    "[00:00:25.000] First, grind 1/2 cup of urad dal (soaked for 4 hours) into a fine paste like idli batter.",
    "[00:00:33.000] Mix 1 cup rice flour with a pinch of salt and water into a soft dough and let it rest for 1 hour.",
    "[00:00:46.000] In a cooker, add 1 cup soaked chana dal and 4 cups water; cook for 4-5 whistles on medium flame.",
    "[00:00:58.000] Drain the water from the cooked dal and mash it thoroughly.",
    "[00:01:18.000] In a pan, add 1 tbsp water and 250g jaggery; boil until it becomes foamy.",
    "[00:01:37.000] Add mashed dal to the syrup and cook on medium flame until it thickens.",
    "[00:01:52.000] Add ghee and cardamom powder, mix well, and let it cool completely.",
    "[00:02:01.000] Grease your palms with ghee and make small lemon-sized balls of the mixture.",
    "[00:02:19.000] Mix the rice dough and ground urad dal with a little water to get an idli batter consistency.",
    "[00:02:37.000] Dip the balls into the batter, remove excess coating, and drop into hot oil.",
    "[00:02:52.000] Fry on high flame until light golden brown and then remove."
  ]
}