{
  "metadata": {
    "title": "Dahi Vada | పెరుగు వడలు | ఇలా పెరుగు వడలు చేస్తే చాలా సాఫ్ట్ గా వస్తాయి | Dahi Vada Recipe",
    "channel_name": "Vismai Food",
    "publish_date": "2019-01-17",
    "view_count": 2542698,
    "like_count": 28026,
    "duration": "03:04",
    "language": "Telugu",
    "video_id": "OLRdBaWM58s",
    "url": "http://www.youtube.com/watch?v=OLRdBaWM58s",
    "description": "ఈ పద్ధతిలో పెరుగు వడలు చేస్తే పెరుగును బాగా పీల్చుకొని చాలా జ్యూసీగా, సాఫ్ట్‌గా ఉంటాయి. ఫ్రిజ్‌లో పెట్టినా గట్టిపడవు.",
    "ingredients_detected": [
      "Urad Dal (మినప్పప్పు) - 1 Cup (250g, 4 గంటలు నానబెట్టినది)",
      "Curd (పెరుగు) - 1 Litre",
      "Oil (నూనె) - 1 tbsp (తాలింపు కోసం) + డీప్ ఫ్రైకి సరిపడా",
      "Mustard Seeds (ఆవాలు) - 1 tsp",
      "Cumin Seeds (జీలకర్ర) - 1 tsp",
      "Chana Dal (శనగపప్పు) - 1 tbsp",
      "Urad Dal (మినప్పప్పు తాలింపుకు) - 1 tsp",
      "Dry Chillies (ఎండుమిర్చి) - 2",
      "Curry Leaves (కరివేపాకు) - 2 Sprigs",
      "Green Chilli (పచ్చిమిర్చి) - 1 (సన్నగా తరిగినది)",
      "Ginger (అల్లం) - 1/2 Inch (సన్నగా తరిగినది)",
      "Salt (ఉప్పు) - రుచికి సరిపడా",
      "Water (నీళ్లు) - 1 Litre"
    ]
  },
  "transcription_telugu": [
    "[00:00:00.000] హలో ఫుడీస్, వెల్కమ్ టు విస్మయి ఫుడ్. ఇవాల్టి స్పెషల్ పెరుగు వడలు.",
    "[00:00:45.000] ముందుగా 4 గంటలు నానబెట్టిన కప్పు మినప్పప్పును కొద్దిగా ఉప్పు వేసి సాఫ్ట్‌గా గ్రైండ్ చేసుకోండి.",
    "[00:00:55.000] తాలింపు కోసం బాణలిలో నూనె వేడి చేసి ఆవాలు, జీలకర్ర, శనగపప్పు, మినప్పప్పు వేసి 80% వరకు వేయించాలి.",
    "[00:01:09.000] ఇప్పుడు ఎండుమిర్చి, కరివేపాకు, పచ్చిమిర్చి, అల్లం తరుగు వేసి వేయించి స్టవ్ ఆపేయాలి.",
    "[00:01:19.000] ఈ తాలింపును లీటరు చిలికిన పెరుగులో వేసి, ఉప్పు కలిపి పక్కన ఉంచుకోండి. పెరుగు గరిట జారుగా ఉండాలి.",
    "[00:01:30.000] ఒక వెడల్పాటి పాత్రలో లీటరు నీళ్లు పోసి, అందులో కొంచెం ఉప్పు, రెండు స్పూన్ల పెరుగు మిశ్రమం కలిపి ఉంచండి.",
    "[00:01:42.000] గ్రైండ్ చేసిన పిండి ఇడ్లీ పిండిలా జారుగా ఉండాలి, అప్పుడే వడలు సాఫ్ట్‌గా వస్తాయి.",
    "[00:01:50.000] అరచేతిని తడి చేసుకుని, పిండిని వడలా ఒత్తి వేడి నూనెలో హై ఫ్లేమ్ మీద వేయించాలి.",
    "[00:02:05.000] వడలు లైట్ గోల్డెన్ బ్రౌన్ కలర్ రాగానే తీసి, వెంటనే సిద్ధం చేసుకున్న నీళ్లలో వేయాలి.",
    "[00:02:15.000] నీళ్లలో 4-5 నిమిషాలు ఉంచి, ఆపై నీళ్లు పిండకుండా జాగ్రత్తగా తీసి ఒక బౌల్‌లో సర్దాలి.",
    "[00:02:30.000] వడలపై పెరుగు మిశ్రమాన్ని పోసి 30 నిమిషాల పాటు నాననివ్వాలి.",
    "[00:02:36.000] అంతే, ఎంతో సాఫ్ట్‌గా ఉండే పెరుగు వడలు రెడీ. ఇవి ఫ్రిజ్‌లో పెట్టినా గట్టిపడవు."
  ],
  "transcription_english": [
    "[00:00:00.000] Hello foodies, welcome to Vismai Food. Today's special is Dahi Vada (Perugu Vada).",
    "[00:00:45.000] First, grind 1 cup of soaked urad dal with a little salt into a soft paste.",
    "[00:00:55.000] For tempering, heat oil and fry mustard seeds, cumin, chana dal, and urad dal until 80% done.",
    "[00:01:09.000] Add dry chillies, curry leaves, chopped green chillies, and ginger; fry well.",
    "[00:01:19.000] Mix this tempering into 1 litre of whisked curd, add salt, and keep it in a flowing consistency.",
    "[00:01:30.000] In a wide bowl, take 1 litre water, add salt and 2 tbsp of the curd mixture; set aside.",
    "[00:01:42.000] Ensure the batter is of idli batter consistency for soft vadas.",
    "[00:01:50.000] Wet your palm, shape the batter into vadas, and deep fry in hot oil on high flame.",
    "[00:02:05.000] Once they reach a light golden brown color, remove and drop them directly into the prepared water.",
    "[00:02:15.000] Let them soak for 4-5 minutes, then transfer them to a bowl without squeezing the water.",
    "[00:02:30.000] Pour the curd mixture over the vadas and let them rest for 30 minutes.",
    "[00:02:36.000] Your soft and juicy Dahi Vadas are ready. These won't get hard even if refrigerated."
  ]
}