{
  "metadata": {
    "title": "Onion Pickle | ఉల్లిపాయ నిల్వ పచ్చడి | ఉల్లిపాయతో ఇలా ఊరగాయ పెడితే నెల రోజులు నిలవుంటుంది",
    "channel_name": "Vismai Food",
    "publish_date": "2019-01-17",
    "view_count": 244874,
    "like_count": 3716,
    "duration": "02:58",
    "language": "Telugu",
    "video_id": "kdUaw-V24nE",
    "url": "http://www.youtube.com/watch?v=kdUaw-V24nE",
    "description": "ఈ పద్ధతిలో ఉల్లిపాయ నిల్వ పచ్చడి పెడితే రుచి అద్భుతంగా ఉండటమే కాకుండా నెల రోజుల పాటు నిల్వ ఉంటుంది. వేడి వేడి అన్నంలో నెయ్యి వేసుకొని తింటే చాలా బాగుంటుంది.",
    "ingredients_detected": [
      "Sambar Onions (సాంబార్ ఉల్లిపాయలు) - 500g",
      "Oil (నూనె) - 1/2 Cup (వేపుకోవడానికి) + 1/2 Cup (తాలింపు కోసం)",
      "Fenugreek Seeds (మెంతులు) - 1 tsp",
      "Cumin Seeds (జీలకర్ర) - 1 tsp + 1 tsp (తాలింపు కోసం)",
      "Mustard Seeds (ఆవాలు) - 1 tsp + 1 tsp (తాలింపు కోసం)",
      "Dry Chillies (ఎండుమిర్చి) - 4",
      "Asafoetida (ఇంగువ) - 1/4 tsp",
      "Turmeric (పసుపు) - 1 tbsp",
      "Chilli Powder (కారం) - 4 tbsp",
      "Salt (ఉప్పు) - 2 tbsp",
      "Tamarind Juice (చింతపండు రసం) - 150ml (పెద్ద నిమ్మకాయ సైజు చింతపండు నుండి తీసినది)"
    ]
  },
  "transcription_telugu": [
    "[00:00:00.000] హలో ఫుడీస్, వెల్కమ్ టు విస్మయి ఫుడ్. ఇవాల్టి స్పెషల్ ఉల్లిపాయ ఊరగాయ.",
    "[00:00:19.000] ముందుగా ఓ టీస్పూన్ మెంతులు, ఓ టీస్పూన్ జీలకర్ర, ఓ టీస్పూన్ ఆవాలు వేసి లో ఫ్లేమ్ మీద వేయించి ఫైన్ పౌడర్ చేసుకోండి.",
    "[00:00:35.000] కడాయిలో అర కప్పు ఆయిల్ హీట్ చేసి, అందులో అర కిలో పొట్టు తీసిన సాంబార్ ఉల్లిపాయలు వేసి మీడియం ఫ్లేమ్ మీద మగ్గించుకోండి.",
    "[00:00:52.000] ఉల్లిపాయలు లైట్ గోల్డెన్ కలర్ రాగానే, అందులోంచి 200 గ్రాముల ఉల్లిపాయలు తీసి కచ్చాపచ్చాగా గ్రైండ్ చేసుకోవాలి.",
    "[00:01:05.000] మళ్ళీ అదే పాన్‌లో అర కప్పు ఆయిల్ పోసి, ఎండుమిర్చి, ఆవాలు, జీలకర్ర, ఇంగువ వేసి తాలింపు వేయించుకోవాలి.",
    "[00:01:19.000] ఇందులో గ్రైండ్ చేసిన ఉల్లిపాయ పేస్ట్ వేసి పచ్చి వాసన పోయి నూనె వేరయ్యే వరకు ఫ్రై చేయండి.",
    "[00:01:35.000] మిగిలిన ఉల్లిపాయలు వేసి లో ఫ్లేమ్ మీద నెమ్మదిగా టాస్ చేయాలి.",
    "[00:01:46.000] ఇప్పుడు పసుపు, కారం, ఉప్పు వేసి ఉల్లిపాయలు చితికిపోకుండా జాగ్రత్తగా కలుపుకోవాలి.",
    "[00:02:01.000] పౌడర్ చేసుకున్న ఆవ-మెంతి పిండి వేసి బాగా కలిపి, 150ml చింతపండు రసం పోయండి.",
    "[00:02:15.000] లో ఫ్లేమ్ మీద నూనె పైకి తేలి ఉల్లిపాయలకు పులుపు పట్టే వరకు (7-10 నిమిషాలు) కుక్ చేయండి.",
    "[00:02:29.000] పచ్చడి పూర్తిగా చల్లారాక ఎయిర్ టైట్ జార్‌లో భద్రపరుచుకోండి. ఫ్రిజ్‌లో ఉంచితే నెల రోజుల పాటు నిల్వ ఉంటుంది.",
    "[00:02:38.000] ఈ పచ్చడి అప్పటికప్పుడైనా తినేయొచ్చు, వేడి అన్నంలో నెయ్యితో చాలా బాగుంటుంది. తప్పకుండా ట్రై చేయండి."
  ],
  "transcription_english": [
    "[00:00:00.000] Hello foodies, welcome to Vismai Food. Today's special is Onion Pickle.",
    "[00:00:19.000] First, roast 1 tsp fenugreek, 1 tsp cumin, and 1 tsp mustard seeds on low flame and grind into a fine powder.",
    "[00:00:35.000] Heat 1/2 cup oil in a pan and fry 500g of peeled sambar onions on medium flame.",
    "[00:00:52.000] Once they turn light golden, take out 200g of onions and grind them into a coarse paste.",
    "[00:01:05.000] In the same pan, add another 1/2 cup oil and temper with dry chillies, mustard, cumin, and asafoetida.",
    "[00:01:19.000] Add the ground onion paste and fry until the raw smell disappears and oil separates.",
    "[00:01:35.000] Add the remaining whole fried onions and toss gently on low flame.",
    "[00:01:46.000] Now add turmeric, chilli powder, and salt; mix carefully without mashing the onions.",
    "[00:02:01.000] Add the prepared spice powder and pour in 150ml of thick tamarind juice.",
    "[00:02:15.000] Cook on low flame for 7-10 minutes until the oil floats on top and the onions absorb the tanginess.",
    "[00:02:29.000] Once completely cooled, store in an airtight jar. It stays fresh for a month in the refrigerator.",
    "[00:02:38.000] This pickle can be consumed instantly and tastes great with hot rice and ghee. Do try it!"
  ]
}