{
  "metadata": {
    "title": "Aloo Khadi Recipe | ఆలూ మసాలా మజ్జిగ పులుసు | కారంగా ఘాటుగా భలే ఉంటుంది ఈ కర్రీ",
    "channel_name": "Vismai Food",
    "publish_date": "2019-01-18",
    "view_count": 451691,
    "like_count": 6440,
    "duration": "02:43",
    "language": "Telugu",
    "video_id": "-5ojC2mSnDQ",
    "url": "http://www.youtube.com/watch?v=-5ojC2mSnDQ",
    "description": "ఆలూ మసాలా మజ్జిగ పులుసు చాలా టేస్టీగా ఉంటుంది. అన్నం లేదా చపాతీతో కలిపి తింటే భలే రుచిగా ఉంటుంది.",
    "ingredients_detected": [
      "Potatoes (ఆలూ గడ్డలు)",
      "Oil (నూనె)",
      "Mustard Seeds (ఆవాలు)",
      "Cinnamon (దాల్చిన చెక్క)",
      "Cloves (లవంగాలు)",
      "Green Chillies (పచ్చి మిర్చి)",
      "Onion (ఉల్లిపాయ)",
      "Ginger Garlic Paste (అల్లం వెల్లుల్లి ముద్ద)",
      "Amchur Powder (ఆంచూర్ పౌడర్)",
      "Chilli Powder (కారం)",
      "Coriander Powder (ధనియాల పొడి)",
      "Turmeric (పసుపు)",
      "Mango Pickle (ఆవకాయ పచ్చడి) - Optional",
      "Whisked Curd (చిలికిన పెరుగు)",
      "Water (నీళ్లు)",
      "Garam Masala (గరం మసాలా)",
      "Coriander (కొత్తిమీర)",
      "Salt (ఉప్పు)"
    ]
  },
  "transcription_telugu": [
    "[00:00:00.000] హలో ఫుడీస్, వెల్కమ్ టు విస్మయి ఫుడ్. ఇవాల్టి స్పెషల్ ఆలూ మజ్జిగ పులుసు.",
    "[00:00:20.000] ముందుగా కడాయిలో ఆయిల్ హీట్ చేసుకొని ఉడికించిన ఆలూ క్యూబ్స్ వేసి మీడియం ఫ్లేమ్ మీద గోల్డెన్ కలర్ వచ్చే వరకు వేయించాలి.",
    "[00:00:43.000] ఆలూ ముక్కలు బాగా వేగాక తీసి పక్కన ఉంచుకోండి. అదే కడాయిలో మరికొంచెం ఆయిల్ వేసి ఆవాలు, దాల్చిన చెక్క, లవంగాలు, పచ్చిమిర్చి వేసి వేపాలి.",
    "[00:01:01.000] ఇప్పుడు ఉల్లిపాయ తరుగు వేసి గోల్డెన్ బ్రౌన్ కలర్ వచ్చే వరకు వేయించుకోవాలి.",
    "[00:01:06.000] ఇందులో అల్లం వెల్లుల్లి ముద్ద వేసి పచ్చి వాసన పోయేదాకా వేపి, ఆపై ఆంచూర్ పౌడర్, కారం, ధనియాల పొడి, పసుపు వేసి బాగా కలుపుకోవాలి.",
    "[00:01:25.000] రుచి ఇంకా పెరగాలంటే కొంచెం ఆవకాయ పచ్చడి గుజ్జు కూడా వేసుకోవచ్చు. మసాలాలు వేగాక స్టవ్ ఆఫ్ చేయండి.",
    "[00:01:38.000] స్టవ్ ఆఫ్ చేసిన తర్వాతే చిలికిన పెరుగు, నీళ్లు పోసి బాగా కలుపుకోవాలి. మళ్లీ స్టవ్ ఆన్ చేయాల్సిన అవసరం లేదు.",
    "[00:01:52.000] వేయించి పెట్టుకున్న ఆలూ ముక్కలు, గరం మసాలా, కొత్తిమీర తరుగు, రుచికి సరిపడా ఉప్పు వేసి బాగా కలపాలి.",
    "[00:02:14.000] అంతే! కారం కారంగా భలే రుచిగా ఉండే ఆలూ మజ్జిగ పులుసు సిద్ధం. రైస్ లేదా రోటీతో ఎంజాయ్ చేయండి."
  ],
  "transcription_english": [
    "[00:00:00.000] Hello foodies, welcome to Vismai Food. Today's special is Aloo Khadi (Aloo Majjiga Pulusu).",
    "[00:00:20.000] Heat oil in a pan and fry boiled potato cubes on medium flame until golden brown.",
    "[00:00:43.000] Remove the fried potatoes. In the same pan, add more oil and fry mustard seeds, cinnamon, cloves, and green chillies.",
    "[00:01:01.000] Add chopped onions and fry until they turn golden brown.",
    "[00:01:06.000] Add ginger-garlic paste and fry until the raw smell goes; then add amchur powder, chilli powder, coriander powder, and turmeric.",
    "[00:01:25.000] For extra taste, you can add a bit of mango pickle pulp. Turn off the flame once the spices are roasted.",
    "[00:01:38.000] After turning off the flame, add whisked curd and water; mix well. No need to turn the stove on again.",
    "[00:01:52.000] Add the fried potatoes, garam masala, chopped coriander, and salt to taste; mix thoroughly.",
    "[00:02:14.000] That's it! Spicy and tasty Aloo Khadi is ready. Enjoy it with rice or roti."
  ]
}