{
  "metadata": {
    "title": "Lemon Pepper Fish Fry | లెమన్ పెప్పర్ ఫిష్ ఫ్రై | Fish Fry in Telugu",
    "channel_name": "Vismai Food",
    "publish_date": "2019-01-19",
    "view_count": 523451,
    "like_count": 6507,
    "duration": "02:15",
    "language": "Telugu",
    "video_id": "yYquRECkOHI",
    "url": "http://www.youtube.com/watch?v=yYquRECkOHI",
    "description": "లెమన్ పెప్పర్ ఫిష్ ఫ్రై చాలా రుచిగా ఉంటుంది. తక్కువ మసాలాలతో ఎక్కువ రుచిని ఇచ్చే రెసిపీ ఇది.",
    "ingredients_detected": [
      "Fish Pieces (చేప ముక్కలు)",
      "Black Pepper (మిరియాలు)",
      "Saunf/Fennel Seeds (సోంపు)",
      "Garam Masala (గరం మసాలా)",
      "Salt (ఉప్పు)",
      "Ginger Garlic Paste (అల్లం వెల్లుల్లి ముద్ద)",
      "Rice Flour (బియ్యం పిండి)",
      "Lemon Juice (నిమ్మరసం)",
      "Coriander (కొత్తిమీర)",
      "Oil (నూనె)"
    ]
  },
  "transcription_telugu": [
    "[00:00:00.000] హలో ఫుడీస్, వెల్కమ్ టు విస్మయి ఫుడ్. ఇవాల్టి స్పెషల్ లెమన్ పెప్పర్ ఫిష్ ఫ్రై.",
    "[00:00:20.000] ముందుగా పాన్‌లో మిరియాలు, సోంపు వేసి లో ఫ్లేమ్ మీద రోస్ట్ చేసి ఫైన్ పౌడర్ చేసుకోండి.",
    "[00:00:35.000] మిక్సింగ్ బౌల్‌లో పెప్పర్ పౌడర్, గరం మసాలా, ఉప్పు, అల్లం వెల్లుల్లి ముద్ద వేయాలి.",
    "[00:00:43.000] అందులో బియ్యం పిండి, నిమ్మరసం, కొత్తిమీర తరుగు వేసి బాగా కలుపుకోవాలి.",
    "[00:01:00.000] ఇప్పుడు చేప ముక్కలు, నూనె వేసి మసాలా అంతా ముక్కలకి పట్టించాలి.",
    "[00:01:13.000] దీనిపై మూత పెట్టి కనీసం 2 గంటల పాటు ఫ్రిజ్‌లో ఉంచండి, అప్పుడు మసాలాలు బాగా పడతాయి.",
    "[00:01:17.000] పాన్‌పై నూనె వేడి చేసి చేప ముక్కలను అమర్చుకోవాలి.",
    "[00:01:32.000] మూత పెట్టి కేవలం లో ఫ్లేమ్ మీద మాత్రమే వేయించాలి; హై ఫ్లేమ్ పెడితే ముక్క లోపల ఉడకదు.",
    "[00:01:38.000] ప్రతి 3-4 నిమిషాలకోసారి ముక్కలను తిరగేస్తూ ఆయిల్ వేస్తూ ఫ్రై చేయాలి.",
    "[00:01:47.000] ఇవి వేగడానికి సుమారు 15 నుంచి 18 నిమిషాల టైమ్ పడుతుంది.",
    "[00:01:55.000] ముక్కలు కరకరలాడుతూ గోల్డెన్ కలర్ రాగానే తీసేయాలి. వేడి వేడిగా చాలా బాగుంటాయి.",
    "[00:02:05.000] ఈ లెమన్ పెప్పర్ ఫిష్ ఫ్రై ని మీరు కూడా ట్రై చేసి ఎలా వచ్చిందో చెప్పండి."
  ],
  "transcription_english": [
    "[00:00:00.000] Hello foodies, welcome to Vismai Food. Today's special is Lemon Pepper Fish Fry.",
    "[00:00:20.000] First, roast black pepper and fennel seeds on low flame and grind into a fine powder.",
    "[00:00:35.000] In a mixing bowl, take the pepper powder, garam masala, salt, and ginger-garlic paste.",
    "[00:00:43.000] Add rice flour, lemon juice, and chopped coriander; mix well.",
    "[00:01:00.000] Add fish pieces and oil; coat each piece thoroughly with the masala.",
    "[00:01:13.000] Cover and refrigerate for at least 2 hours to let the fish absorb the flavours.",
    "[00:01:17.000] Heat oil on a pan and arrange the fish pieces.",
    "[00:01:32.000] Cover and fry strictly on low flame; high flame will leave the fish raw inside.",
    "[00:01:38.000] Flip the pieces every 3-4 minutes, adding oil as needed until they are well-cooked.",
    "[00:01:47.000] It takes about 15 to 18 minutes for a perfect crispy fry.",
    "[00:01:55.000] Once they turn crispy and golden brown, take them off. They taste great when served hot.",
    "[00:02:05.000] Do try this Lemon Pepper Fish Fry and let us know how it turned out."
  ]
}