{
  "metadata": {
    "title": "crispy chicken pakoda In telugu by vismai food| చికెన్ పకోడీ | chicken fry recipe at home In telugu",
    "channel_name": "Vismai Food",
    "publish_date": "2019-01-20",
    "view_count": 10119382,
    "like_count": 138950,
    "duration": "02:10",
    "language": "Telugu",
    "video_id": "y9LDOvJR5f0",
    "url": "http://www.youtube.com/watch?v=y9LDOvJR5f0",
    "description": "చికెన్ పకోడీ ఇలా చేస్తే చాలా క్రిస్పీగా, రుచిగా వస్తుంది. ఇది పర్ఫెక్ట్ స్ట్రీట్ స్టైల్ చికెన్ పకోడీ రెసిపీ.",
    "ingredients_detected": [
      "Chicken (చికెన్)",
      "Ginger Garlic Paste (అల్లం వెల్లుల్లి ముద్ద)",
      "Lemon Juice (నిమ్మరసం)",
      "Salt (ఉప్పు)",
      "Chilli Powder (కారం)",
      "Garam Masala (గరం మసాలా)",
      "Roasted Cumin Powder (వేయించిన జీలకర్ర పొడి)",
      "Curry Leaves (కరివేపాకు)",
      "Coriander Leaves (కొత్తిమీర)",
      "Rice Flour (బియ్యం పిండి)",
      "Besan/Chickpea Flour (శనగపిండి)",
      "Oil (నూనె)",
      "Red Food Color (ఎరుపు రంగు) - Optional"
    ]
  },
  "transcription_telugu": [
    "[00:00:00.000] హలో ఫుడీస్, వెల్కమ్ టు విస్మయి ఫుడ్. ఇవాల్టి స్పెషల్ చికెన్ పకోడీ.",
    "[00:00:24.000] ముందుగా చికెన్‌ను అరగంట పాటు ఉప్పు నీటిలో నానబెట్టండి, దీనివల్ల ముక్కలు జ్యూసీగా ఉంటాయి.",
    "[00:00:31.000] చికెన్‌లో అల్లం వెల్లుల్లి ముద్ద, నిమ్మరసం, ఉప్పు, కారం వేయాలి.",
    "[00:00:40.000] అందులోనే గరం మసాలా, వేయించిన జీలకర్ర పొడి, కరివేపాకు, కొత్తిమీర తరుగు వేసి ముక్కలకు బాగా మసాజ్ చేయండి.",
    "[00:00:53.000] మీకు కావాలంటే కొద్దిగా ఎరుపు రంగు కూడా వేసుకోవచ్చు.",
    "[00:00:56.000] ఇప్పుడు బియ్యం పిండి, శనగపిండి వేసి ముక్కలకు బాగా పట్టించి కనీసం గంట పాటు ఫ్రిజ్‌లో ఉంచండి.",
    "[00:01:05.000] రాత్రంతా నానబెడితే ఇంకా బాగుంటుంది, మసాలాలన్నీ ముక్కకు బాగా పడతాయి.",
    "[00:01:14.000] బాణలిలో నూనె వేడి చేసి మంటను మీడియం ఫ్లేమ్‌లోకి అడ్జస్ట్ చేయండి.",
    "[00:01:19.000] చికెన్ ముక్కలను వేసి కేవలం మీడియం ఫ్లేమ్ మీదే వేయించాలి, అప్పుడే లోపల వరకు ఉడుకుతుంది.",
    "[00:01:28.000] ముక్కలు లైట్ గోల్డెన్ కలర్ రాగానే హై ఫ్లేమ్ మీద వేయించి తీసేయాలి.",
    "[00:01:40.000] వేడి మీద కొంచెం మెత్తగా అనిపించినా, చల్లారాక చాలా క్రిస్పీగా కరకరలాడుతూ ఉంటాయి.",
    "[00:01:54.000] మా కొలతలతో ఈ చికెన్ పకోడీని ట్రై చేసి, పిక్స్‌ని ఇన్స్టాగ్రామ్‌లో పోస్ట్ చేయండి."
  ],
  "transcription_english": [
    "[00:00:00.000] Hello foodies, welcome to Vismai Food. Today's special is Chicken Pakoda.",
    "[00:00:24.000] First, soak chicken in salt water for 30 minutes to make the pieces juicy.",
    "[00:00:31.000] Add ginger-garlic paste, lemon juice, salt, and chilli powder to the chicken.",
    "[00:00:40.000] Add garam masala, roasted cumin powder, curry leaves, and coriander leaves; massage the spices into the meat.",
    "[00:00:53.000] You can add a few drops of red food color for a street-style look (optional).",
    "[00:00:56.000] Add rice flour and besan; coat the pieces well and let them rest in the fridge for at least 1 hour.",
    "[00:01:05.000] Overnight soaking works wonders for better flavour absorption.",
    "[00:01:14.000] Heat oil and adjust the flame to medium.",
    "[00:01:19.000] Fry chicken pieces strictly on medium flame to ensure they are cooked through to the bone.",
    "[00:01:28.000] Once they turn light golden, increase to high flame for a moment and remove.",
    "[00:01:40.000] They might feel soft when hot, but they will turn perfectly crispy as they cool down.",
    "[00:01:54.000] Try this chicken pakoda with our exact measurements and share your photos on Instagram."
  ]
}