{
  "metadata": {
    "title": "Arbi Sabzi | రాయలసీమ స్పెషల్ చేమగడ్డ కారం పులుసు | Chamagadda Curry",
    "channel_name": "Vismai Food",
    "publish_date": "2019-01-21",
    "view_count": 1871320,
    "like_count": 16980,
    "duration": "02:52",
    "language": "Telugu",
    "video_id": "gJXj9t5SEQY",
    "url": "http://www.youtube.com/watch?v=gJXj9t5SEQY",
    "description": "ఈ వీడియోలో రాయలసీమ స్టైల్ చేమగడ్డ కారం పులుసు ఎలా చేయాలో స్టెప్ బై స్టెప్ వివరించాము. ఇది అన్నం లేదా జొన్న రొట్టెలోకి చాలా బాగుంటుంది.",
    "ingredients_detected": [
      "Colocasia (చేమగడ్డలు) - ఉడికించినవి",
      "Oil (నూనె)",
      "Mustard Seeds (ఆవాలు)",
      "Urad Dal (మినప్పప్పు)",
      "Chana Dal (శనగపప్పు)",
      "Fenugreek Seeds (మెంతులు)",
      "Cumin Seeds (జీలకర్ర)",
      "Dry Chillies (ఎండుమిర్చి)",
      "Crushed Garlic (నలగ్గొట్టిన వెల్లుల్లి)",
      "Slit Green Chillies (పచ్చిమిర్చి చీలికలు)",
      "Curry Leaves (కరివేపాకు)",
      "Chopped Onion (ఉల్లిపాయ తరుగు)",
      "Chopped Tomato (టమోటా తరుగు)",
      "Turmeric (పసుపు)",
      "Salt (ఉప్పు)",
      "Chilli Powder (కారం)",
      "Coriander Powder (ధనియాల పొడి)",
      "Black Pepper Powder (మిరియాల పొడి)",
      "Tamarind Juice (చింతపండు రసం)",
      "Water (నీళ్లు)",
      "Chopped Coriander (కొత్తిమీర తరుగు)"
    ]
  },
  "transcription_telugu": [
    "[00:00:00.000] హలో ఫుడీస్, వెల్కమ్ టు విస్మయి ఫుడ్. ఇవాల్టి స్పెషల్ ఘాటైన రాయలసీమ చేమగడ్డ కారం పులుసు.",
    "[00:00:27.000] కడాయిలో ఆయిల్ హీట్ చేసి ఆవాలు, మినప్పప్పు, శనగపప్పు, మెంతులు, జీలకర్ర, ఎండుమిర్చి వేసి వేయించాలి.",
    "[00:00:43.000] ఇందులో నలగ్గొట్టిన వెల్లుల్లి వేసి వేగనివ్వాలి.",
    "[00:00:49.000] పచ్చిమిర్చి చీలికలు, కరివేపాకు వేసి వేయించి, ఆపై ఉల్లిపాయ తరుగు వేసి పచ్చి వాసన పోయే వరకు వేపాలి.",
    "[00:01:03.000] టమోటా తరుగు, పసుపు, ఉప్పు వేసి టమోటాలు మెత్తగా అయ్యే వరకు మగ్గించుకోవాలి.",
    "[00:01:15.000] కారం, ధనియాల పొడి, మిరియాల పొడి వేసి మసాలాలన్నీ బాగా వేయించాలి.",
    "[00:01:28.000] చింతపండు రసం పోసి నూనె పైకి తేలే వరకు కేవలం లో ఫ్లేమ్ మీద మాత్రమే ఉడికించాలి.",
    "[00:01:42.000] నూనె పైకి తేలాక నీళ్లు పోసి హై ఫ్లేమ్ మీద ఎసరు మసలకాగనివ్వాలి.",
    "[00:01:50.000] ఎసరు మరుగుతున్నప్పుడు ఉడికించిన చేమగడ్డ ముక్కలు వేసి లో ఫ్లేమ్ మీద 30 నిమిషాల పాటు ఉడికించాలి.",
    "[00:02:10.000] చివరగా కొత్తిమీర తరుగు వేసి కలుపుకోవాలి. రాయలసీమలో పులుసులో బెల్లం వాడరు, కావాలంటే మీరు వేసుకోవచ్చు.",
    "[00:02:15.000] ఈ పులుసు ఎంత ఎక్కువ టైమ్ ఉడికితే అంత రుచిగా ఉంటుంది. మరుసటి రోజు తింటే ఇంకా బాగుంటుంది."
  ],
  "transcription_english": [
    "[00:00:00.000] Hello foodies, welcome to Vismai Food. Today's special is spicy Rayalaseema style Arbi Sabzi (Chamagadda Pulusu).",
    "[00:00:27.000] Heat oil in a pan and fry mustard seeds, urad dal, chana dal, fenugreek, cumin, and dry chillies.",
    "[00:00:43.000] Add crushed garlic and let it fry well.",
    "[00:00:49.000] Add slit green chillies and curry leaves; then add chopped onions and fry until the raw smell goes.",
    "[00:01:03.000] Add chopped tomatoes, turmeric, and salt; cook until the tomatoes turn mushy.",
    "[00:01:15.000] Add chilli powder, coriander powder, and black pepper powder; roast the spices thoroughly.",
    "[00:01:28.000] Pour in tamarind juice and cook strictly on low flame until the oil floats on top.",
    "[00:01:42.000] Once oil floats, pour in water and bring it to a boil on high flame.",
    "[00:01:50.000] When the gravy is boiling, add boiled colocasia pieces and cook on low flame for 30 minutes.",
    "[00:02:10.000] Finally, add chopped coriander and mix. In Rayalaseema, they don't add jaggery, but you can add it if you prefer.",
    "[00:02:15.000] The longer this curry cooks, the tastier it gets. It tastes even better the next day."
  ]
}