{
  "metadata": {
    "title": "Majjiga Pulusu | ది బెస్ట్ మజ్జిగ పులుసు | Mix Veg Kadhi in Telugu",
    "channel_name": "Vismai Food",
    "publish_date": "2019-01-20",
    "view_count": 2606076,
    "like_count": 21497,
    "duration": "02:02",
    "language": "Telugu",
    "video_id": "b-RH9KHd48Q",
    "url": "http://www.youtube.com/watch?v=b-RH9KHd48Q",
    "description": "మజ్జిగ పులుసు ఇలా మిక్స్డ్ వెజిటబుల్స్ తో చేస్తే చాలా రుచిగా ఉంటుంది. అన్నంలోకి ఇది ఒక అద్భుతమైన కాంబినేషన్.",
    "ingredients_detected": [
      "Sour Curd (పుల్లటి పెరుగు)",
      "Besan/Gram Flour (శనగపిండి)",
      "Water (నీళ్లు)",
      "Turmeric (పసుపు)",
      "Salt (ఉప్పు)",
      "Oil (నూనె)",
      "Mustard Seeds (ఆవాలు)",
      "Cumin Seeds (జీలకర్ర)",
      "Fenugreek Seeds (మెంతులు)",
      "Dry Chillies (ఎండుమిర్చి)",
      "Ginger (అల్లం తరుగు)",
      "Green Chillies (పచ్చిమిర్చి)",
      "Curry Leaves (కరివేపాకు)",
      "Asafoetida (ఇంగువ)",
      "Onion (ఉల్లిపాయ ముక్కలు)",
      "Drumsticks (మునక్కాయలు)",
      "Ladies Finger/Okra (బెండకాయలు)",
      "Bottle Gourd (ఆనపకాయ ముక్కలు)",
      "Coriander Leaves (కొత్తిమీర)"
    ]
  },
  "transcription_telugu": [
    "[00:00:00.000] హలో ఫుడీస్, వెల్కమ్ టు విస్మయి ఫుడ్. ఇవాల్టి స్పెషల్ మిక్స్డ్ వెజ్ మజ్జిగ పులుసు.",
    "[00:00:15.000] ముందుగా ఒక బౌల్‌లో పుల్లటి పెరుగు తీసుకుని అందులో శనగపిండి, ఉప్పు, పసుపు వేసి ఉండలు లేకుండా చిలుక్కోవాలి.",
    "[00:00:28.000] ఇందులో తగినన్ని నీళ్లు పోసి పక్కన ఉంచుకోండి. మజ్జిగ మరీ చిక్కగా ఉండకూడదు.",
    "[00:00:35.000] కడాయిలో ఆయిల్ హీట్ చేసి ఆవాలు, జీలకర్ర, మెంతులు, ఎండుమిర్చి వేసి వేయించాలి.",
    "[00:00:43.000] అల్లం తరుగు, పచ్చిమిర్చి, కరివేపాకు, ఇంగువ వేసి మంచి సువాసన వచ్చే వరకు వేపాలి.",
    "[00:00:52.000] ఇప్పుడు ఉల్లిపాయ ముక్కలు, మునక్కాయలు, ఆనపకాయ ముక్కలు వేసి కొద్దిగా ఉప్పు చల్లి మగ్గించుకోవాలి.",
    "[00:01:05.000] కూరగాయలు సగం ఉడికాక బెండకాయ ముక్కలు వేయాలి; ముందే వేస్తే జిగురు వస్తుంది.",
    "[00:01:12.000] ముక్కలన్నీ మెత్తగా ఉడికిన తర్వాత మజ్జిగ మిశ్రమాన్ని పోసి బాగా కలుపుకోవాలి.",
    "[00:01:25.000] లో ఫ్లేమ్ మీద కేవలం ఒక్క మరుగు వచ్చే వరకు మాత్రమే ఉడికించాలి, ఎక్కువ సేపు ఉడికిస్తే పెరుగు విరిగిపోతుంది.",
    "[00:01:38.000] చివరగా కొత్తిమీర తరుగు వేసి దించేయాలి. ఇది వేడి అన్నంలోకి చాలా రుచిగా ఉంటుంది."
  ],
  "transcription_english": [
    "[00:00:00.000] Hello foodies, welcome to Vismai Food. Today's special is Mixed Veg Majjiga Pulusu.",
    "[00:00:15.000] In a bowl, take sour curd and whisk it with gram flour, salt, and turmeric until lump-free.",
    "[00:00:28.000] Add sufficient water and set aside; ensure the consistency is not too thick.",
    "[00:00:35.000] Heat oil in a pan and fry mustard seeds, cumin, fenugreek, and dry chillies.",
    "[00:00:43.000] Add chopped ginger, green chillies, curry leaves, and asafoetida; fry until fragrant.",
    "[00:00:52.000] Add onions, drumsticks, and bottle gourd pieces; sprinkle some salt and let them cook.",
    "[00:01:05.000] Add okra once the other vegetables are half-cooked to prevent sliminess.",
    "[00:01:12.000] After the vegetables are fully tender, pour in the curd mixture and stir well.",
    "[00:01:25.000] Bring it to a single boil strictly on low flame; overcooking will cause the curd to curdle.",
    "[00:01:38.000] Finally, garnish with coriander leaves and turn off the heat. It tastes excellent with hot rice."
  ]
}