{
  "metadata": {
    "title": "Tomato Red Chilli Pickle | టమాటో పండుమిర్చి నిల్వ పచ్చడి | Tomato Pachadi",
    "channel_name": "Vismai Food",
    "publish_date": "2019-01-23",
    "view_count": 1250932,
    "like_count": 13213,
    "duration": "02:35",
    "language": "Telugu",
    "video_id": "4sIFxBLkrCY",
    "url": "https://www.youtube.com/watch?v=4sIFxBLkrCY",
    "description": "టమాటో పండుమిర్చి నిల్వ పచ్చడి తయారీ విధానం - Vismai Food.",
    "ingredients_detected": [
      "500gms Tomatoes (Sour Desi Tomatoes)",
      "500gms Desi Red Chillies",
      "1/4 Cup Oil",
      "2 tbsps Salt",
      "1 tbsp Turmeric",
      "Lemon-sized Tamarind",
      "10-15 Garlic cloves",
      "1 tsp Cumin"
    ]
  },
  "transcription_telugu": [
    "[00:00:00.000] హలో ఫుడీస్, వెల్కమ్ టు విస్మయ్ ఫుడ్. ఇవాల్టి స్పెషల్ టమాటో పండుమిర్చి పచ్చడి.",
    "[00:00:13.000] ఇప్పుడు నేను మీకు హార్డ్లీ 30 నిమిషాల్లో తయారు చేసుకునే పచ్చడి చూపించబోతున్నాను.",
    "[00:00:28.000] ముందుగా కడాయిలో పావు కప్పు ఆయిల్ హీట్ చేసుకుని, అందులో 500 గ్రాముల పుల్లటి నాటు టమాటోలు వేసుకోండి.",
    "[00:00:48.000] ఇందులో రెండు టీస్పూన్ల ఉప్పు, ఒక టేబుల్ స్పూన్ పసుపు వేసి బాగా కలుపుకొని మూత పెట్టి మగ్గించుకోండి.",
    "[00:01:17.000] టమాటోలు ఆల్మోస్ట్ మగ్గాక, నిమ్మకాయంత చింతపండు వేసి మగ్గించుకోండి.",
    "[00:01:24.000] టమాటోలు పూర్తిగా మగ్గాక మూత పెట్టకుండా చల్లార్చుకోండి.",
    "[00:01:31.000] ఇప్పుడు అరకిలో నాటు పండుమిర్చిని జార్ లో వేసుకోండి (తొడిమెలు తీయకుండా కడిగి ఆరబెట్టినవి).",
    "[00:01:46.000] ఇందులో 10 నుంచి 15 వెల్లుల్లి, ఒక టీస్పూన్ జీలకర్ర వేసి కచ్చాపచ్చాగా గ్రైండ్ చేసుకోండి.",
    "[00:01:53.000] పూర్తిగా చల్లారిన టమాటో గుజ్జు వేసి ఒకటి రెండు సార్లు గ్రైండ్ చేస్తే సరిపోతుంది.",
    "[00:01:58.000] ఈ పచ్చడిని ఎయిర్ టైట్ జార్ లో నిల్వ చేసుకుంటే ఏడాది పాటు ఉంటుంది.",
    "[00:02:04.000] మీకు కావలసినప్పుడు తాలింపు పెట్టుకోవచ్చు. గుంటూరు స్టైల్ లో తాలింపులో ఉల్లిపాయ ముక్కలు కూడా వేసుకోవచ్చు."
  ],
  "transcription_english": [
    "[00:00:00.000] Hello Foodies, welcome to Vismai Food. Today's special is Tomato Red Chilli Pickle.",
    "[00:00:13.000] I am going to show you a pickle that can be prepared in hardly 30 minutes.",
    "[00:00:28.000] Heat 1/4 cup oil in a pan and add 500gms of sour desi tomatoes.",
    "[00:00:48.000] Add 2 tsps salt and 1 tbsp turmeric. Mix well and cook covered until soft.",
    "[00:01:17.000] Once tomatoes are almost cooked, add a lemon-sized piece of tamarind.",
    "[00:01:24.000] After tomatoes are fully cooked, let them cool down completely without a lid.",
    "[00:01:31.000] Take 500gms of desi red chillies (washed and dried) in a blender jar.",
    "[00:01:46.000] Add 10-15 garlic cloves, 1 tsp cumin and grind into a coarse paste.",
    "[00:01:53.000] Add the cooled tomato pulp and pulse a few times.",
    "[00:01:58.000] You can preserve this pickle in an airtight jar for up to 1 year.",
    "[00:02:04.000] Add tempering (tadka) whenever needed. In Guntur style, you can also add chopped onions to the tempering."
  ]
}