{
  "metadata": {
    "title": "Garam Masala | గరం మసాలా | Aromatic Garam Masala | Perfect Method To make Strong Garam Masala | Vismai Food",
    "channel_name": "Vismai Food",
    "publish_date": "2018-10-05",
    "view_count": 2489172,
    "like_count": 36366,
    "duration": "02:00",
    "language": "Telugu",
    "video_id": "Qt7W4X3jdEI",
    "url": "https://www.youtube.com/watch?v=Qt7W4X3jdEI",
    "description": "Perfect aromatic Garam Masala recipe by Vismai Food.",
    "ingredients_detected": [
      "35gms Cinnamon",
      "15gms Black Cardamom",
      "3 Marathi Mogga",
      "5gms Cloves",
      "50gms Cardamom",
      "10gms Black Pepper",
      "5gms Javitri",
      "5-6 Star Anise",
      "5gms Pattar Phool (Stone flower)",
      "5gms Cumin",
      "5gms Shah Jeera",
      "2 tbsps Coriander seeds",
      "5-6 Bay Leaves",
      "5gms Dry Red Rose Petals",
      "5gms Nutmeg (Optional)",
      "10gms Kebab Cheeni (Optional)"
    ]
  },
  "transcription_telugu": [
    "[00:00:00.000] హలో ఫుడీస్, వెల్కమ్ టు విస్మయ్ ఫుడ్. ఇవాళ మీకు ఆథెంటిక్ గరం మసాలా రెసిపీని చూపిస్తాను.",
    "[00:00:08.000] నిజమైన గరం మసాలాకి 33 రకాల పదార్థాలు వాడతారు, కానీ మనకి అన్ని దొరకవు కాబట్టి దొరికే వాటితోనే తయారు చేస్తున్నాను.",
    "[00:00:22.000] ఒక మందపాటి కడాయిలో 35 గ్రాముల దాల్చిన చెక్క, 15 గ్రాముల నల్ల యాలకులు వేయండి.",
    "[00:00:28.000] మూడు మరాఠీ మొగ్గలు, 5 గ్రాముల లవంగాలు, 50 గ్రాముల యాలకులు, 10 గ్రాముల మిరియాలు కూడా వేయాలి.",
    "[00:00:37.000] 5 గ్రాముల జాపత్రి, ఐదు ఆరు అనాస పువ్వులు, 5 గ్రాముల పత్తర్ ఫూల్, 5 గ్రాముల జీలకర్ర వేయండి.",
    "[00:00:46.000] 5 గ్రాముల షాజీర, 2 టేబుల్ స్పూన్ల ధనియాలు, ఐదు ఆరు బిర్యానీ ఆకులు వేసి లో ఫ్లేమ్ మీద రోస్ట్ చేయండి.",
    "[00:01:00.000] 30-40% వేగాక 5 గ్రాముల దేశీవాళీ గులాబీ రేకులు వేసి మంచి సువాసన వచ్చేంత వరకు వేపుకోవాలి.",
    "[00:01:10.000] మీకు దొరికితే 5 గ్రాముల జాజికాయ, 10 గ్రాముల తోక మిరియాలు (కబాబ్ చీనీ) కూడా వేసుకోవచ్చు.",
    "[00:01:30.000] లో ఫ్లేమ్ లో బాగా వేయించిన ఈ మిశ్రమాన్ని ఒక ప్లేట్ లోకి తీసుకుని పూర్తిగా చల్లారనివ్వాలి.",
    "[00:01:37.000] చల్లారిన తర్వాత మిక్సీ జార్ లో వేసి ఫైన్ పౌడర్ లా గ్రైండ్ చేసుకోండి.",
    "[00:01:42.000] దీన్ని ఒక ఎయిర్ టైట్ జార్ లో భద్రపరుచుకుంటే మూడు నాలుగు నెలల వరకు చాలా స్ట్రాంగ్ గా ఉంటుంది.",
    "[00:01:48.000] ఈ రెసిపీని తప్పకుండా ట్రై చేసి మీ ఫీడ్ బ్యాక్ ఇవ్వండి."
  ],
  "transcription_english": [
    "[00:00:00.000] Hello Foodies, welcome to Vismai Food. Today I will show you the authentic Garam Masala recipe.",
    "[00:00:08.000] Authentic Garam Masala uses 33 ingredients, but since we can't find all, I am making it with available ones.",
    "[00:00:22.000] In a heavy-bottomed pan, add 35gms of cinnamon and 15gms of black cardamom.",
    "[00:00:28.000] Add 3 Marathi mogga, 5gms cloves, 50gms cardamom, and 10gms black pepper.",
    "[00:00:37.000] Add 5gms mace, 5-6 star anise, 5gms stone flower, and 5gms cumin.",
    "[00:00:46.000] Add 5gms shah jeera, 2 tbsps coriander seeds, and 5-6 bay leaves; roast on low flame.",
    "[00:01:00.000] After 30-40% roasting, add 5gms dry rose petals and roast until aromatic.",
    "[00:01:10.000] Optional: add 5gms nutmeg and 10gms kebab cheeni (cubeb) if available for more aroma.",
    "[00:01:30.000] Once roasted well on low flame, transfer to a plate and let it cool down completely.",
    "[00:01:37.000] After cooling, grind it into a fine powder in a mixer jar.",
    "[00:01:42.000] Store it in an airtight jar; it stays strong for 3 to 4 months.",
    "[00:01:48.000] Definitely try this recipe and share your feedback."
  ]
}