{
  "metadata": {
    "title": "Betel Leaf Rasam | తమలపాకు రసం | Tamalapaku Rasam | ఆరోగ్యం బాలేనప్పుడు మందులా పనిచేస్తుంది",
    "channel_name": "Vismai Food",
    "publish_date": "2019-01-25",
    "view_count": 180321,
    "like_count": 2992,
    "duration": "01:59",
    "language": "Telugu",
    "video_id": "weWDNnBtEoI",
    "url": "https://www.youtube.com/watch?v=weWDNnBtEoI",
    "description": "Health-benefiting Betel Leaf Rasam recipe by Vismai Food.",
    "ingredients_detected": [
      "7-8 Betel Leaves",
      "3 Ripe Sour Desi Tomatoes",
      "Fistful of Coriander (with stems)",
      "Salt (to taste)",
      "1 tbsp Rasam Powder",
      "600ml Water",
      "1/2 tsp Turmeric Powder",
      "1 tbsp Black Pepper Powder",
      "2 Sprigs Curry Leaves",
      "2 tbsps Oil",
      "1 tsp Mustard Seeds",
      "1/2 tsp Cumin Seeds",
      "2 Pinches Asafetida (Hing)",
      "4-5 Dry Red Chillies",
      "7-8 Garlic Cloves (crushed)",
      "1/2 Lemon (optional, for juice)"
    ]
  },
  "transcription_telugu": [
    "[00:00:00.000] హలో ఫుడీస్, వెల్కమ్ టు విస్మయ్ ఫుడ్. ఇవాల్టి స్పెషల్ తమలపాకు రసం.",
    "[00:00:05.000] ఇది చాలా ఘాటుగా, టేస్టీగా ఉంటుంది. అజీర్తి చేసినప్పుడు లేదా ఆరోగ్యం బాలేనప్పుడు ఇది చాలా బాగా పనిచేస్తుంది.",
    "[00:00:18.000] ముందుగా జార్ లో ఏడెనిమిది తమలపాకులను కట్ చేసి వేసుకోండి.",
    "[00:00:23.000] ఇందులో మూడు పండిన నాటు టమాటో ముక్కలు వేసి మెత్తగా పేస్ట్ చేసుకోండి.",
    "[00:00:30.000] ఒక గిన్నెలో ఈ పేస్ట్, ఒక పిడికెడు కొత్తిమీర తరుగు, ఉప్పు, ఒక టేబుల్ స్పూన్ రసం పౌడర్ వేయండి.",
    "[00:00:42.000] ఇందులో 600ml నీళ్లు, అర టీస్పూన్ పసుపు, ఒక టేబుల్ స్పూన్ మిరియాల పొడి, కరివేపాకు వేయండి.",
    "[00:00:55.000] మీడియం ఫ్లేమ్ మీద పది నుండి పన్నెండు నిమిషాల పాటు బాగా మరగనివ్వండి.",
    "[00:01:15.000] ఇప్పుడు తాలింపు కోసం రెండు టేబుల్ స్పూన్ల నూనెలో ఆవాలు, జీలకర్ర, ఇంగువ వేయండి.",
    "[00:01:23.000] అలాగే ఎండుమిర్చి, వెల్లుల్లి వేసి బాగా ఫ్రై చేసి రసంలో కలపండి.",
    "[00:01:32.000] అవసరమైతే చివర్లో అర చెక్క నిమ్మరసం పిండుకోవచ్చు. వేడివేడిగా సర్వ్ చేయండి."
  ],
  "transcription_english": [
    "[00:00:00.000] Hello Foodies, welcome to Vismai Food. Today's special is Betel Leaf Rasam.",
    "[00:00:05.000] It's spicy, tasty, and very healthy. It works wonders for indigestion or when you're feeling unwell.",
    "[00:00:18.000] Cut 7-8 betel leaves into pieces and add them to a blender jar.",
    "[00:00:23.000] Add 3 ripe sour desi tomatoes and grind into a fine paste.",
    "[00:00:30.000] In a pot, add this paste, a fistful of coriander, salt, and 1 tbsp rasam powder.",
    "[00:00:42.000] Add 600ml water, 1/2 tsp turmeric, 1 tbsp black pepper powder, and curry leaves.",
    "[00:00:55.000] Let it boil on medium flame for 10 to 12 minutes.",
    "[00:01:15.000] For tempering, heat 2 tbsps oil and add mustard seeds, cumin, and asafetida.",
    "[00:01:23.000] Add dry red chillies and crushed garlic. Fry well and add to the rasam.",
    "[00:01:32.000] You can squeeze half a lemon at the end if you want more tanginess. Serve hot."
  ]
}