{
  "metadata": {
    "title": "Onion Chutney | ఉల్లిపాయ పచ్చడి | ఇడ్లి దోశల్లోకి ఈ చట్నీ ఓ సారి ట్రై చేసి చుడండి | Ullipaya Pachadi",
    "channel_name": "Vismai Food",
    "publish_date": "2019-01-28",
    "view_count": 982120,
    "like_count": 12523,
    "duration": "01:53",
    "language": "Telugu",
    "video_id": "vTT4NrXPAmo",
    "url": "https://www.youtube.com/watch?v=vTT4NrXPAmo",
    "description": "Tasty and easy Onion Chutney recipe by Vismai Food.",
    "ingredients_detected": [
      "2 tbsps Oil",
      "1 tbsp Mustard Seeds",
      "1 tsp Cumin",
      "1/4 Cup Urad Dal",
      "7 Dry Chillies",
      "4 Green Chillies",
      "3 Large Onions (chopped)",
      "1 tbsp Oil (for sautéing onions)",
      "Lemon-sized Tamarind",
      "Salt (to taste)",
      "1/2 tsp Mustard Seeds (for tempering)",
      "1 pinch Asafetida (Hing)",
      "2 Sprigs Curry Leaves"
    ]
  },
  "transcription_telugu": [
    "[00:00:13] కడాయిలో రెండు టేబుల్ స్పూన్ల ఆయిల్ హీట్ చేసుకోండి.",
    "[00:00:16] ఒక టేబుల్ స్పూన్ ఆవాలు, ఒక టీస్పూన్ జీలకర్ర, పావు కప్పు మినప్పప్పు వేసి బాగా రోస్ట్ చేసుకోండి.",
    "[00:00:25] ఏడెనిమిది ఎండుమిర్చి, నాలుగు పచ్చిమిర్చి వేసి మూడు నాలుగు నిమిషాలు ఫ్రై చేసి చల్లార్చుకోండి.",
    "[00:00:37] అదే కడాయిలో మూడు పెద్ద ఉల్లిపాయల తరుగు, ఒక టేబుల్ స్పూన్ ఆయిల్ వేసి పచ్చివాసన పోయే వరకు ఫ్రై చేయండి.",
    "[00:00:48] నిమ్మకాయంత చింతపండు వేసి మరో రెండు నిమిషాలు రోస్ట్ చేసి చల్లార్చుకోండి.",
    "[00:00:56] జార్ లో మినప్పప్పు, మిర్చి మిశ్రమం వేసి ఫైన్ పౌడర్ లా చేసుకోండి.",
    "[00:01:06] ఇప్పుడు ఉల్లిపాయ ముక్కలు, ఉప్పు వేసి మెత్తగా పేస్ట్ చేయండి.",
    "[00:01:14] తాలింపు కోసం రెండు టేబుల్ స్పూన్ల ఆయిల్ లో ఆవాలు, ఇంగువ, కరివేపాకు వేసి వేయించి పచ్చడిలో కలపండి."
  ],
  "transcription_english": [
    "[00:00:13] Heat 2 tbsps oil in a pan.",
    "[00:00:16] Add 1 tbsp mustard seeds, 1 tsp cumin, and 1/4 cup urad dal. Roast them well.",
    "[00:00:25] Add 7-8 dry red chillies and 4 green chillies. Fry for 3-4 minutes and let them cool.",
    "[00:00:37] In the same pan, add 3 large chopped onions and 1 tbsp oil. Sauté until the raw smell disappears.",
    "[00:00:48] Add lemon-sized tamarind and roast for 2 more minutes. Let it cool.",
    "[00:00:56] Grind the urad dal and chilli mixture into a fine powder in a blender.",
    "[00:01:06] Add the sautéed onions and salt. Grind into a smooth paste.",
    "[00:01:14] For tempering, heat 2 tbsps oil and add 1/2 tsp mustard seeds, a pinch of hing, and 2 sprigs of curry leaves. Add this to the chutney."
  ]
}