{
  "metadata": {
    "title": "Crispy Chicken Fry | చికెన్ ఫ్రై | ఇలా మీరు  చికెన్ ఫ్రై చేస్తే కనీసం 15 రోజుల పైన నిలవుంటుంది",
    "channel_name": "Vismai Food",
    "publish_date": "2019-01-25",
    "view_count": 1778150,
    "like_count": 23216,
    "duration": "02:00",
    "language": "Telugu",
    "video_id": "wVc6p06BKnM",
    "url": "https://www.youtube.com/watch?v=wVc6p06BKnM",
    "description": "Crispy Chicken Fry recipe by Vismai Food which lasts for 15 days.",
    "ingredients_detected": [
      "500gms Boneless Chicken (cut into medium size pieces)",
      "Salt (to taste)",
      "1/4 tsp Turmeric Powder",
      "2 tsps Ginger Garlic Paste",
      "2 tbsps Red Chilli Powder",
      "1 tsp Coriander Powder",
      "1 tsp Roasted Cumin Powder",
      "1/2 tsp Garam Masala",
      "1/2 Lemon juice",
      "2 tbsps Oil (for marinade)",
      "1/4 cup Oil (for frying)",
      "2 sprigs Curry Leaves",
      "6 slit Green Chillies",
      "1 tsp Garam Masala (at end)",
      "1/2 tsp Roasted Cumin Powder (at end)",
      "2 tbsps Chopped Coriander"
    ]
  },
  "transcription_telugu": [
    "[00:00:00.000] హలో ఫుడీస్, వెల్కమ్ టు విస్మయ్ ఫుడ్. ఇవాల్టి స్పెషల్ సింపుల్ బోన్ లెస్ చికెన్ ఫ్రై.",
    "[00:00:06.000] ఇది చాలా టేస్టీగా ఉంటుంది. కనీసం పది నుండి పదిహేను రోజుల పాటు నిల్వ ఉంటుంది.",
    "[00:00:15.000] ముందుగా 500 గ్రాముల బోన్ లెస్ చికెన్ ముక్కలను ఒక బౌల్ లో తీసుకోండి.",
    "[00:00:20.000] ఇందులో ఉప్పు, పావు టీస్పూన్ పసుపు, రెండు టీస్పూన్ల అల్లం వెల్లుల్లి పేస్ట్ వేయండి.",
    "[00:00:27.000] అలాగే రెండు టేబుల్ స్పూన్ల కారం, ఒక టీస్పూన్ ధనియాల పొడి, ఒక టీస్పూన్ జీలకర్ర పొడి, అర టీస్పూన్ గరం మసాలా వేయండి.",
    "[00:00:36.000] అర చెక్క నిమ్మరసం, రెండు టేబుల్ స్పూన్ల నూనె వేసి ముక్కలకు బాగా పట్టించి రాత్రంతా ఫ్రిజ్ లో ఉంచండి.",
    "[00:00:56.000] కడాయిలో పావు కప్పు నూనె వేడి చేసి కరివేపాకు, పచ్చిమిర్చి వేసి వేపుకోండి.",
    "[00:01:05.000] ఇప్పుడు మ్యారినేట్ చేసిన చికెన్ వేసి మీడియం ఫ్లేమ్ మీద పదిహేను నుండి ఇరవై నిమిషాల పాటు ఫ్రై చేయండి.",
    "[00:01:23.000] చివరగా ఒక టీస్పూన్ గరం మసాలా, అర టీస్పూన్ వేయించిన జీలకర్ర పొడి, కొత్తిమీర చల్లుకోండి.",
    "[00:01:34.000] పూర్తిగా చల్లారాక ఎయిర్ టైట్ జార్ లో భద్రపరుచుకోండి. ఇది పప్పుచారులోకి చాలా బాగుంటుంది."
  ],
  "transcription_english": [
    "[00:00:00.000] Hello Foodies, welcome to Vismai Food. Today's special is simple boneless Chicken Fry.",
    "[00:00:06.000] It's very tasty and stays fresh for at least 10 to 15 days, even in summer.",
    "[00:00:15.000] Take 500gms of boneless chicken pieces in a bowl.",
    "[00:00:20.000] Add salt, 1/4 tsp turmeric, and 2 tsps ginger-garlic paste.",
    "[00:00:27.000] Also add 2 tbsps red chilli powder, 1 tsp coriander powder, 1 tsp cumin powder, and 1/2 tsp garam masala.",
    "[00:00:36.000] Add 1/2 lemon juice and 2 tbsps oil. Massage the pieces well and marinate in the fridge overnight.",
    "[00:00:56.000] Heat 1/4 cup oil in a pan, add curry leaves and green chillies. Sauté for a minute.",
    "[00:01:05.000] Add marinated chicken and fry on medium flame for 15 to 20 minutes.",
    "[00:01:23.000] Finally, sprinkle 1 tsp garam masala, 1/2 tsp roasted cumin powder, and chopped coriander.",
    "[00:01:34.000] Once completely cooled, store in an airtight jar. It pairs perfectly with dal or sambar."
  ]
}