{
  "metadata": {
    "title": "Onion Chicken | ఉల్లిపాయ చికెన్ మసాలా | ఉల్లిపాయలతో ఇలా కర్రీ ట్రై చేయండి. కారం కారం గా భలే ఉంటుంది",
    "channel_name": "Vismai Food",
    "publish_date": "2019-01-27",
    "view_count": 98385,
    "like_count": 1475,
    "duration": "02:00",
    "language": "Telugu",
    "video_id": "scVZo4_LMgY",
    "url": "https://www.youtube.com/watch?v=scVZo4_LMgY",
    "description": "Karnataka special Onion Chicken Masala recipe by Vismai Food.",
    "ingredients_detected": [
      "500gms Chicken (soaked in salt water for 1 hour)",
      "3 tbsps Oil",
      "2 Sprigs Curry Leaves",
      "4 Green Chillies",
      "1 Large Onion (sliced)",
      "10-12 Sambar Onions",
      "1 tbsp Ginger garlic paste",
      "1/4 tsp Turmeric",
      "1 Capsicum (cubes)",
      "2 tbsps Red Chilli powder",
      "1 tsp Coriander powder",
      "250ml Water",
      "1/2 tsp Garam masala",
      "1/2 tsp Roasted cumin powder",
      "2 tbsps Coriander (chopped)",
      "Salt (to taste)"
    ]
  },
  "transcription_telugu": [
    "[00:00:00.000] హలో ఫుడీస్, వెల్కమ్ టు విస్మయ్ ఫుడ్. ఇవాల్టి స్పెషల్ కర్ణాటక స్పెషల్ ఆనియన్ చికెన్.",
    "[00:00:16.000] కడాయిలో మూడు టేబుల్ స్పూన్ల ఆయిల్ హీట్ చేసుకొని, అందులో రెండు రెబ్బల కరివేపాకు, నాలుగు పచ్చిమిర్చి చీలికలు వేయండి.",
    "[00:00:24.000] ఒక పెద్ద ఉల్లిపాయ చీలికలు, 10 నుంచి 12 సాంబార్ ఉల్లిపాయలు వేసి మీడియం ఫ్లేమ్ మీద మూడు నాలుగు నిమిషాలు రోస్ట్ చేసుకోండి.",
    "[00:00:33.000] ఇప్పుడు ఇందులో సాల్ట్ వేసి ఫ్రై చేసుకోండి. ఆనియన్స్ ని ఎర్రగా అస్సలు వేపకూడదు.",
    "[00:00:39.000] ఇందులో ఒక టేబుల్ స్పూన్ అల్లం వెల్లుల్లి పేస్ట్ వేసి ఒక నిమిషం పాటు ఫ్రై చేసుకోండి.",
    "[00:00:46.000] ఇప్పుడు పావు చెంచా పసుపు, ఒక క్యాప్సికం క్యూబ్స్ వేసి రెండు నిమిషాలు ఫ్రై చేసుకోండి.",
    "[00:00:58.000] ఇప్పుడు ఇందులో రెండు టేబుల్ స్పూన్ల కారం, ఒక టీస్పూన్ ధనియాల పొడి వేసి మసాలాలన్నీ బాగా వేపుకోండి.",
    "[00:01:07.000] గంట సేపు ఉప్పు నీటిలో నానబెట్టిన అరకిలో చికెన్ వేసి మసాలాలన్నీ పట్టించి, పావు లీటర్ నీళ్లు పోయండి.",
    "[00:01:17.000] కేవలం సిమ్ లోనే కూర దగ్గరపడేంత వరకు, నూనె సెపరేట్ అయ్యేంత వరకు కుక్ చేసుకోండి.",
    "[00:01:21.000] దించే ముందు అర టీస్పూన్ గరం మసాలా, అర టీస్పూన్ వేయించిన జీలకర్ర పొడి వేసి కలుపుకోండి.",
    "[00:01:30.000] కొత్తిమీర చల్లుకొని బాగా కలుపుకోండి. నూనె సెపరేట్ అయ్యాక దించేసుకోవడమే.",
    "[00:01:42.000] తింటున్నప్పుడు తెలుస్తుంది దీని మజా, చాలా బాగుంటుంది."
  ],
  "transcription_english": [
    "[00:00:00.000] Hello foodies, welcome to Vismai Food. Today's special is Karnataka special Onion Chicken.",
    "[00:00:16.000] Heat 3 tbsps of oil in a pan, add two sprigs of curry leaves and four green chili slits.",
    "[00:00:24.000] Add one large sliced onion and 10-12 sambar onions; roast on medium flame for 3-4 minutes.",
    "[00:00:33.000] Add salt and fry. Do not fry the onions until they are golden brown.",
    "[00:00:39.000] Add one tablespoon of ginger-garlic paste and fry for a minute.",
    "[00:00:46.000] Add 1/4 teaspoon of turmeric and capsicum cubes; fry for two minutes.",
    "[00:00:58.000] Add two tablespoons of red chili powder and one teaspoon of coriander powder; fry the masalas well.",
    "[00:01:07.000] Add half a kg of chicken (soaked in salt water for an hour) and pour 250ml of water.",
    "[00:01:17.000] Cook on low flame only until the curry thickens and oil separates.",
    "[00:01:21.000] Before turning off, add 1/2 tsp garam masala and 1/2 tsp roasted cumin powder.",
    "[00:01:30.000] Sprinkle coriander leaves and mix well. Remove from heat once the oil separates.",
    "[00:01:42.000] You will know the taste when you eat it; it is very good."
  ]
}