{
  "metadata": {
    "title": "సేమియా నిమ్మకాయ పులిహోర | Semiya Nimmakaya Pulihora | Semiya Lemon Pulihora @vismai food",
    "channel_name": "Vismai Food",
    "publish_date": "2019-01-30",
    "view_count": 2120810,
    "like_count": 24077,
    "duration": "02:20",
    "language": "Telugu",
    "video_id": "SisTq9OeHDA",
    "url": "https://www.youtube.com/watch?v=SisTq9OeHDA",
    "description": "Tasty and easy Semiya Lemon Pulihora recipe by Vismai Food.",
    "ingredients_detected": [
      "1 కప్పు సేమియా",
      "1 టీస్పూన్ ఉప్పు",
      "1/2 టీస్పూన్ పసుపు",
      "1 లీటర్ నీళ్లు",
      "3 టీస్పూన్ల నూనె",
      "1 టీస్పూన్ శనగపప్పు",
      "1 టీస్పూన్ మినప్పప్పు",
      "1 టీస్పూన్ ఆవాలు",
      "1 టీస్పూన్ జీలకర్ర",
      "2 ఎండుమిర్చి",
      "10-15 జీడిపప్పులు",
      "2 పచ్చిమిర్చి",
      "2 రెమ్మల కరివేపాకు",
      "2 టేబుల్ స్పూన్ల కొత్తిమీర",
      "1 నిమ్మకాయ రసం"
    ]
  },
  "transcription_telugu": [
    "[00:00:00] హలో ఫుడీస్, వెల్కమ్ టు విస్మయ్ ఫుడ్. ఇవాల్టి స్పెషల్ సేమియా నిమ్మకాయ పులిహోర.",
    "[00:00:17] ముందుగా బౌల్ లో ఒక లీటర్ వాటర్ పోసుకొని, ఒక టీస్పూన్ ఉప్పు, అర టీస్పూన్ పసుపు వేసి మసలకాగనివ్వండి.",
    "[00:00:33] నీళ్లు మరుగుతున్నప్పుడు ఒక కప్పు సేమియా వేసి 3-4 నిమిషాలు హై ఫ్లేమ్ మీద ఉడికించుకోవాలి.",
    "[00:00:41] సేమియా కాస్త పలుకుగా ఉన్నప్పుడే స్టవ్ ఆఫ్ చేసి వడకట్టుకోవాలి.",
    "[00:00:53] వడకట్టిన సేమియాపై చల్లని నీళ్లు పోయాలి, దీనివల్ల సేమియా మెత్తబడదు. పూర్తిగా చల్లారనివ్వండి.",
    "[00:01:02] ఇప్పుడు కడాయిలో 3 స్పూన్ల ఆయిల్ హీట్ చేసి శనగపప్పు, మినప్పప్పు, ఆవాలు, జీలకర్ర వేసి వేపుకోవాలి.",
    "[00:01:14] ఇందులోనే ఎండుమిర్చి, జీడిపప్పు వేసి కాస్త వేగాక పచ్చిమిర్చి, కరివేపాకు వేసి తాలింపు పెట్టుకోవాలి.",
    "[00:01:31] ఇప్పుడు చల్లారిన సేమియా వేసి అట్లకాడతో నెమ్మదిగా కలుపుకోవాలి.",
    "[00:01:39] చివరగా కొత్తిమీర, కొద్దిగా సాల్ట్ వేసి నెమ్మదిగా కలుపుకోండి.",
    "[00:01:52] ఇప్పుడు స్టవ్ ఆఫ్ చేసి ఒక నిమ్మకాయ రసం పోసి బాగా కలిపితే సేమియా పులిహోర రెడీ."
  ],
  "transcription_english": [
    "[00:00:00] Hello Foodies, welcome to Vismai Food. Today's special is Semiya Lemon Pulihora.",
    "[00:00:17] In a bowl, boil one liter of water with one tsp salt and 1/2 tsp turmeric.",
    "[00:00:33] Add one cup of semiya to the boiling water and cook for 3-4 minutes on high flame.",
    "[00:00:41] When the semiya is slightly grainy, turn off the stove and strain it.",
    "[00:00:53] Pour cold water over the strained semiya to prevent it from overcooking. Let it cool completely.",
    "[00:01:02] Heat 3 tsps of oil in a pan and fry chana dal, urad dal, mustard seeds, and cumin seeds.",
    "[00:01:14] Add dry chillies and cashews. Once fried, add green chillies and curry leaves.",
    "[00:01:31] Add the cooled semiya and mix gently using a flat spatula.",
    "[00:01:39] Add chopped coriander and a little salt, then mix gently.",
    "[00:01:52] Turn off the stove, add one lemon juice, and mix well. Semiya Pulihora is ready."
  ]
}