{
  "metadata": {
    "title": "Ragi Palli Pakoda | ఇలా ఉల్లిపాయలు వేసి పకోడీ చేస్తే నూనే పీల్చవ్ | Ragi Pakoda | Palli Pakodi",
    "channel_name": "Vismai Food",
    "publish_date": "2019-01-31",
    "view_count": 167336,
    "like_count": 2652,
    "duration": "02:14",
    "language": "Telugu",
    "video_id": "VzswBX7cc0k",
    "url": "https://www.youtube.com/watch?v=VzswBX7cc0k",
    "description": "Healthy and crispy Ragi Palli Pakoda recipe by Vismai Food.",
    "ingredients_detected": [
      "1/2 Cup Peanuts (Palli)",
      "7-8 Dry Red Chillies",
      "2 large Onions (Thinly Sliced)",
      "Salt (to taste)",
      "1/2 Cup Ragi Flour",
      "1 tbsp Water (optional)",
      "1 tsp Cumin (Jeera)",
      "Oil (for deep frying)"
    ]
  },
  "transcription_telugu": [
    "[00:00:00.000] హలో ఫుడీస్, వెల్కమ్ టు విస్మయ్ ఫుడ్. ఇవాల్టి స్పెషల్ రాగి పల్లి పకోడి.",
    "[00:00:24.000] ముందుగా జార్‌లో అర కప్పు పల్లీలు వేసుకోండి. ఇవి పచ్చివే.",
    "[00:00:28.000] ఇందులో ఏడు నుంచి ఎనిమిది ఎండుమిర్చి వేసి కచ్చాపచ్చాగా గ్రైండ్ చేసుకోండి.",
    "[00:00:35.000] ఇప్పుడు మిక్సింగ్ బౌల్‌లో రెండు పెద్ద సన్నని ఉల్లిపాయ చీలికలు వేసుకోండి.",
    "[00:00:42.000] ఇందులో రుచికి సరిపడా ఉప్పు వేసి ఉల్లిపాయలను బాగా పిండుతూ కలిపితే నీరు దిగుతుంది.",
    "[00:00:48.000] అప్పుడు గ్రైండ్ చేసుకున్న పల్లి పౌడర్, అర కప్పు రాగి పిండి వేసి గట్టిగా పిండుతూ కలుపుకోండి.",
    "[00:01:03.000] అవసరమనిపిస్తే కొద్దిగా నీళ్లు వేసుకోండి. నాకు రెండు టీస్పూన్ల నీళ్లు పట్టాయి.",
    "[00:01:09.000] ఇందులో ఒక టీస్పూన్ జీలకర్ర వేసి బాగా గట్టి పకోడీ పిండిలా కలుపుకోండి.",
    "[00:01:17.000] నూనె బాగా వేడెక్కాక మంటను తగ్గించి పొడిపొడిగా వేసుకుంటున్నట్లుగా పకోడీ వేసుకోండి.",
    "[00:01:38.000] లైట్ గోల్డెన్ బ్రౌన్ కలర్ రాగానే తీసేయండి. ఇవి అస్సలు నూనె పీల్చవు, చాలా క్రిస్పీగా ఉంటాయి."
  ],
  "transcription_english": [
    "[00:00:00.000] Hello Foodies, welcome to Vismai Food. Today's special is Ragi Palli Pakoda.",
    "[00:00:24.000] First, add half a cup of raw peanuts into a jar.",
    "[00:00:28.000] Add 7 to 8 dry red chillies and grind them into a coarse powder.",
    "[00:00:35.000] In a mixing bowl, add two large thinly sliced onions.",
    "[00:00:42.000] Add salt to taste and squeeze the onions well until they release water.",
    "[00:00:48.000] Now add the ground peanut powder and half a cup of ragi flour; mix while applying pressure.",
    "[00:01:03.000] If needed, add a little water. I used about two teaspoons of water.",
    "[00:01:09.000] Add one teaspoon of cumin and mix it into a tight pakoda dough.",
    "[00:01:17.000] Once the oil is hot, lower the heat and sprinkle the mixture like pakoda into the oil.",
    "[00:01:38.000] Remove them once they turn light golden brown. They don't absorb oil and stay very crispy."
  ]
}