{
  "metadata": {
    "title": "Peanut Chutney | పల్లీల చట్నీ | Palli Chutney Telugu | హోటల్ స్టైల్ పల్లీ చట్నీ | రాయలసీమ స్టైల్",
    "channel_name": "Vismai Food",
    "publish_date": "2019-02-04",
    "view_count": 6007238,
    "like_count": 55107,
    "duration": "01:49",
    "language": "Telugu",
    "video_id": "RpAq9IqKnO0",
    "url": "https://www.youtube.com/watch?v=RpAq9IqKnO0",
    "description": "Authentic Rayalaseema style Peanut Chutney recipe for tiffins by Vismai Food.",
    "ingredients_detected": [
      "1 cup Peanuts (Roasted and skin removed)",
      "10-12 Dry Red Chillies",
      "1 large Onion (Chopped)",
      "2 medium Tomatoes (Chopped)",
      "1 tsp Tamarind",
      "Salt (to taste)",
      "2 tbsps Oil (for sautéing and tempering)",
      "1/2 tsp Mustard seeds",
      "1/2 tsp Cumin seeds",
      "1/2 tsp Urad dal",
      "1 sprig Curry leaves",
      "2 Dry red chillies (for tempering)"
    ]
  },
  "transcription_telugu": [
    "[00:00:00.000] హలో ఫుడీస్, వెల్కమ్ టు విస్మయ్ ఫుడ్. ఇవాల్టి స్పెషల్ రాయలసీమ స్టైల్ టిఫిన్ పల్లి చట్నీ.",
    "[00:00:27.000] ముందుగా పల్లీలను వేయించి పొట్టు తీసి పక్కన పెట్టుకోండి.",
    "[00:00:36.000] ఒక బాణలిలో నూనె వేడి చేసి ఎండుమిర్చి, ఉల్లిపాయ ముక్కలు వేసి రెండు నిమిషాల పాటు వేయించండి.",
    "[00:00:46.000] ఇందులో టొమాటో ముక్కలు వేసి మెత్తబడే వరకు మీడియం ఫ్లేమ్ మీద మగ్గనివ్వండి.",
    "[00:00:50.000] రాయలసీమలో ఈ చట్నీని పచ్చిమిర్చితో చేయరు, కేవలం ఎండుమిర్చితోనే చేస్తారు.",
    "[00:00:55.000] మిక్సీ జార్‌లో వేయించిన పల్లీలు, మగ్గించిన ఉల్లిపాయ టొమాటో మిశ్రమం వేసుకోండి.",
    "[00:01:05.000] ఇందులో ఒక టీస్పూన్ చింతపండు, రుచికి సరిపడా ఉప్పు వేసి మెత్తగా గ్రైండ్ చేయండి.",
    "[00:01:11.000] తాలింపు కోసం నూనె వేడి చేసి ఆవాలు, జీలకర్ర, మినప్పప్పు, కరివేపాకు, ఎండుమిర్చి వేయండి.",
    "[00:01:20.000] తాలింపు బాగా వేగాక దీనిని గ్రైండ్ చేసిన చట్నీలో వేసి కలుపుకోండి.",
    "[00:01:24.000] అంతే, ఎంతో రుచికరమైన రాయలసీమ స్టైల్ పల్లి చట్నీ సిద్ధం. ఇది ఇడ్లీ, దోశల్లోకి చాలా బాగుంటుంది."
  ],
  "transcription_english": [
    "[00:00:00.000] Hello Foodies, welcome to Vismai Food. Today's special is Rayalaseema style Peanut Chutney for tiffins.",
    "[00:00:27.000] First, roast the peanuts, remove the skin, and set them aside.",
    "[00:00:36.000] Heat oil in a pan, add dry red chillies and chopped onions, and sauté for two minutes.",
    "[00:00:46.000] Add chopped tomatoes and cook on medium flame until they become soft and tender.",
    "[00:00:50.000] In Rayalaseema, they don't use green chillies for this; they use only dry red chillies for spice.",
    "[00:00:55.000] In a mixer jar, add the roasted peanuts and the sautéed onion-tomato mixture.",
    "[00:01:05.000] Add one teaspoon of tamarind and salt to taste, then grind into a smooth paste.",
    "[00:01:11.000] For tempering, heat oil and add mustard seeds, cumin, urad dal, curry leaves, and dry chillies.",
    "[00:01:20.000] Once the tempering is well-fried, mix it into the ground chutney.",
    "[00:01:24.000] That's it! Tasty Rayalaseema style peanut chutney is ready. It pairs perfectly with idli and dosa."
  ]
}