{
  "metadata": {
    "title": "GreenChilli #ChickenFry| pacchimirchi chicken fry  | Don't Miss The Best Spiciest Chicken Fry",
    "channel_name": "Vismai Food",
    "publish_date": "2018-10-06",
    "view_count": 902010,
    "like_count": 13103,
    "duration": "02:08",
    "language": "Telugu",
    "video_id": "BekhSb8yc5c",
    "url": "https://www.youtube.com/watch?v=BekhSb8yc5c",
    "description": "The best spiciest green chilli chicken fry recipe by Vismai Food.",
    "ingredients_detected": [
      "2 tbsps Desi Ghee",
      "2 tbsps Oil",
      "4-5 Green Chillies (crushed)",
      "1 large Onion (sliced)",
      "1 tbsp Freshly ground ginger-garlic paste",
      "Salt (to taste)",
      "1/2 tsp Turmeric",
      "1 tbsp Coriander powder",
      "500gms Chicken (soaked in salt water for 30 mins)",
      "1/2 tsp Roasted cumin powder",
      "1/2 tsp Vismai Food special Garam masala",
      "Fried cashews (optional)",
      "1 Green chilli (chopped)",
      "1/2 Slice lemon juice"
    ]
  },
  "transcription_telugu": [
    "[00:00:00.000] హలో ఫుడీస్, వెల్కమ్ టు విస్మయ్ ఫుడ్. ఇవాల్టి స్పెషల్ చాలా సింపుల్ పచ్చిమిర్చి కోడి వేపుడు.",
    "[00:00:07.000] ఇది చాలా స్పైసీగా ఉంటుంది కానీ ఘాటుగా అస్సలు ఉండదు. సాంబార్, పప్పుచారుతో లేదా స్టార్టర్ గా కూడా చాలా బాగుంటుంది.",
    "[00:00:18.000] ముందుగా ఒక కడాయిలో 2 టేబుల్ స్పూన్ల నెయ్యి, 2 టేబుల్ స్పూన్ల నూనె వేసి వేడి చేయండి. నెయ్యి వల్ల మంచి అరోమా వస్తుంది.",
    "[00:00:29.000] ఇందులో 4-5 దంచిన పచ్చిమిర్చి వేసి పచ్చి వాసన పోయేదాకా వేపుకోవాలి.",
    "[00:00:38.000] ఇప్పుడు ఒక పెద్ద ఉల్లిపాయ చీలికలు వేసి గోల్డెన్ బ్రౌన్ కలర్ వచ్చేంత వరకు వేయించాలి.",
    "[00:00:49.000] ఉల్లిపాయలు వేగాక ఒక టేబుల్ స్పూన్ అల్లం వెల్లుల్లి పేస్ట్ వేసి పచ్చి వాసన పోయేదాకా వేపుకోండి.",
    "[00:00:56.000] కొద్దిగా ఉప్పు, అర చెంచా పసుపు, ఒక టేబుల్ స్పూన్ ధనియాల పొడి వేసి నూనె విడిపోయేదాకా వేయించండి.",
    "[00:01:08.000] ఇప్పుడు ఉప్పు నీళ్లలో 30 నిమిషాలు నానబెట్టిన అర కేజీ చికెన్ వేసుకోండి. దీనివల్ల చికెన్ జ్యూసీగా, టెండర్ గా ఉంటుంది.",
    "[00:01:21.000] మూత పెట్టి మీడియం ఫ్లేమ్ లో 10-12 నిమిషాల పాటు చికెన్ ను బాగా మగ్గనివ్వండి.",
    "[00:01:30.000] మూత తీసి అర చెంచా వేయించిన జీలకర్ర పొడి, అర చెంచా గరం మసాలా వేసి బాగా కలుపుకోవాలి.",
    "[00:01:39.000] మూత పెట్టకుండా మీడియం ఫ్లేమ్ లో నూనె విడిపోయేదాకా ఫ్రై చేయండి. కావాలంటే వేయించిన జీడిపప్పు కూడా వేసుకోవచ్చు.",
    "[00:01:50.000] సర్వింగ్ ప్లేట్ లోకి తీసుకున్నాక ఒక పచ్చిమిర్చి తరుగు, అర చెక్క నిమ్మరసం కలుపుకోండి. స్పైసీ పచ్చిమిర్చి చికెన్ ఫ్రై రెడీ."
  ],
  "transcription_english": [
    "[00:00:00.000] Hello Foodies, welcome to Vismai Food. Today's special is simple Green Chilli Chicken Fry.",
    "[00:00:07.000] It's very spicy but not overly sharp. It pairs perfectly with sambar or rasam, or even as a starter.",
    "[00:00:18.000] Heat 2 tbsps ghee and 2 tbsps oil in a pan. Ghee adds a wonderful aroma to the chicken.",
    "[00:00:29.000] Add 4-5 crushed green chillies and sauté until the raw smell disappears.",
    "[00:00:38.000] Add one large sliced onion and fry until it turns golden brown.",
    "[00:00:49.000] Once onions are fried, add 1 tbsp ginger-garlic paste and sauté until the raw smell goes away.",
    "[00:00:56.000] Add some salt, 1/2 tsp turmeric, and 1 tbsp coriander powder; fry until oil separates.",
    "[00:01:08.000] Now add 500gms chicken (soaked in salt water for 30 mins). This makes the chicken tender and juicy.",
    "[00:01:21.000] Cover and cook on medium flame for 10-12 minutes until the chicken is well-cooked.",
    "[00:01:30.000] Remove lid, add 1/2 tsp roasted cumin powder and 1/2 tsp garam masala; mix well.",
    "[00:01:39.000] Without lid, fry on medium flame until oil separates. You can add fried cashews if desired.",
    "[00:01:50.000] After plating, add chopped green chilli and juice of half a lemon. Spicy Green Chilli Chicken Fry is ready."
  ]
}