{
  "metadata": {
    "title": "Bisibelebath Recipe In telugu by vismai Food | బిసిబెళబాత్ | How to make sambar rice in telugu",
    "channel_name": "Vismai Food",
    "publish_date": "2019-02-09",
    "view_count": 4096242,
    "like_count": 39847,
    "duration": "04:46",
    "language": "Telugu",
    "video_id": "Hs5YibgKdUo",
    "url": "https://www.youtube.com/watch?v=Hs5YibgKdUo",
    "description": "Hotel style Bisibelebath/Sambar Rice recipe by Vismai Food.",
    "ingredients_detected": [
      "1 Cup Rice (Sona Masuri)",
      "1 Cup Toor Dal",
      "1/4 Cup Coriander Seeds",
      "7-8 Dry Red Chillies",
      "1 Inch Cinnamon",
      "1/2 tsp Black Pepper",
      "5-6 Cloves",
      "2 tbsps Urad Dal",
      "1 tbsp Chana Dal",
      "1/4 tsp Fenugreek Seeds",
      "1 tsp Cumin Seeds",
      "1/4 Cup Dry Coconut Powder",
      "1/2 Cup Ghee",
      "2 tbsps Oil",
      "2 Sprigs Curry Leaves",
      "1 Onion (sliced)",
      "10-12 Sambar Onions (Shallots)",
      "1 Tomato (chopped)",
      "1 tbsp Coriander Powder",
      "2 tsps Red Chilli Powder",
      "1/4 Cup Cashews",
      "1/4 Cup Peanuts",
      "1 Carrot (cubed)",
      "7-8 French Beans (chopped)",
      "1 Drumstick (chopped)",
      "5-6 Green Chillies",
      "1 Capsicum (cubed)",
      "1/4 Cup Fresh Peas",
      "1 Large Potato (cubed)",
      "1/4 Cup Tamarind Pulp",
      "1/2 tsp Asafetida (Hing)",
      "Boondi (for garnishing)",
      "Salt (to taste)"
    ]
  },
  "transcription_telugu": [
    "[00:00:00.000] హలో ఫుడీస్, వెల్కమ్ టు విస్మయ్ ఫుడ్. ఇవాల్టి స్పెషల్ హోటల్ స్టైల్ బిసిబెళబాత్.",
    "[00:00:20.000] ముందుగా ఒక కప్పు బియ్యం, ఒక కప్పు కందిపప్పును గంట సేపు నానబెట్టుకోవాలి.",
    "[00:00:37.000] మసాలా కోసం ధనియాలు, ఎండుమిర్చి, దాల్చిన చెక్క, మిరియాలు, లవంగాలు వేయించుకోండి.",
    "[00:01:05.000] ఆ తర్వాత మినపప్పు, శనగపిండి, బియ్యం, మెంతులు, జీలకర్ర, ఎండు కొబ్బరి పొడి వేసి గ్రైండ్ చేసి పెట్టుకోండి.",
    "[00:01:42.000] కుక్కర్‌లో నానబెట్టిన బియ్యం, పప్పు వేసి 5 కప్పుల నీళ్లు, పసుపు వేసి 3 విజిల్స్ వచ్చే వరకు ఉడికించాలి.",
    "[00:02:08.000] ఒక పాన్‌లో నెయ్యి వేసి కరివేపాకు, ఉల్లిపాయలు, సాంబార్ ఉల్లిపాయలు, టమాటో వేసి మగ్గించాలి.",
    "[00:02:37.000] వేరే గిన్నెలో నెయ్యి, నూనె వేసి జీడిపప్పు, పల్లీలు వేయించి పక్కన పెట్టుకోవాలి.",
    "[00:02:55.000] అదే గిన్నెలో క్యారెట్, బీన్స్, మునక్కాడ, పచ్చిమిర్చి, క్యాప్సికమ్, బఠానీ, ఆలుగడ్డ వేసి ఉడికించాలి.",
    "[00:03:27.000] ఉడికిన కూరగాయల్లో ఉల్లిపాయ మసాలా, నీళ్లు, గ్రైండ్ చేసిన మసాలా పౌడర్ వేయండి.",
    "[00:03:50.000] చివరగా ఉడికించిన అన్నం, పప్పు మిశ్రమం, చింతపండు పులుసు, ఇంగువ వేసి లో ఫ్లేమ్‌లో 8 నిమిషాలు ఉడికించి సర్వ్ చేయండి."
  ],
  "transcription_english": [
    "[00:00:00.000] Hello Foodies, welcome to Vismai Food. Today's special is Hotel style Bisibelebath.",
    "[00:00:20.000] First, soak one cup of rice and one cup of toor dal for an hour.",
    "[00:00:37.000] For masala, roast coriander seeds, dry red chillies, cinnamon, pepper, and cloves.",
    "[00:01:05.000] Then roast urad dal, chana dal, rice, fenugreek, cumin, and dry coconut powder; grind into a fine powder.",
    "[00:01:42.000] In a pressure cooker, add soaked rice and dal with 5 cups of water and turmeric; cook for 3 whistles.",
    "[00:02:08.000] In a pan, heat ghee and sauté curry leaves, sliced onions, sambar onions, and tomatoes.",
    "[00:02:37.000] In another pot, heat ghee and oil to fry cashews and peanuts; set them aside.",
    "[00:02:55.000] In the same pot, cook carrots, beans, drumstick, chillies, capsicum, peas, and potatoes.",
    "[00:03:27.000] Add the sautéed onion mixture, water, and the ground masala powder to the cooked vegetables.",
    "[00:03:50.000] Finally, add the cooked rice-dal mix, tamarind pulp, and asafetida; cook on low flame for 8 minutes and serve."
  ]
}