{
  "metadata": {
    "title": "Hyderabadi Khichdi | దమ్ కిచిడి | తిన్నారంటే బిర్యానీ ని మర్చిపోతారు | Hyderabadi Khichdi Khatta",
    "channel_name": "Vismai Food",
    "publish_date": "2019-02-12",
    "view_count": 2467943,
    "like_count": 23148,
    "duration": "02:31",
    "language": "Telugu",
    "video_id": "QD4ceoLSl9c",
    "url": "https://www.youtube.com/watch?v=QD4ceoLSl9c",
    "description": "Flavorful Hyderabadi Dum Khichdi recipe by Vismai Food.",
    "ingredients_detected": [
      "1/4 Cup Oil/Ghee",
      "1 Onion (sliced)",
      "6 Slit Green Chillies",
      "4 Cloves",
      "5-6 Green Cardamom",
      "1 Bay Leaf",
      "1 tsp Shah Jeera",
      "1 Inch Cinnamon",
      "2 Black Cardamom",
      "1 tbsp Ginger Garlic Paste",
      "1 Cup Masoor Dal (1 hour soaked)",
      "1/2 tsp Turmeric",
      "Salt (to taste)",
      "3.5 Cups Water",
      "1 Bunch Mint (chopped)",
      "1 Bunch Coriander (chopped)",
      "1.5 Cups Sona Masoori Rice (1 hour soaked)"
    ]
  },
  "transcription_telugu": [
    "[00:00:00.000] హలో ఫుడీస్, వెల్కమ్ టు విస్మయ్ ఫుడ్. ఇవాల్టి స్పెషల్ హైదరాబాదీ దమ్ కిచిడీ.",
    "[00:00:25.000] అడుగు మందంగా ఉన్న గిన్నెలో పావు కప్పు ఆయిల్ వేసి, ఒక ఉల్లిపాయ చీలికలు వేసి గోల్డెన్ బ్రౌన్ అయ్యే వరకు ఫ్రై చేయండి.",
    "[00:00:36.000] ఇందులో పచ్చిమిర్చి, లవంగాలు, యాలకలు, బిరియానీ ఆకు, షాజీరా, దాల్చిన చెక్క, నల్ల యాలకలు వేయండి.",
    "[00:00:54.000] ఒక టేబుల్ స్పూన్ అల్లం వెల్లుల్లి పేస్ట్ వేసి పచ్చి వాసన పోయేంత వరకు వేయించాలి.",
    "[00:01:03.000] గంట సేపు నానబెట్టిన మసూర్ దాల్ (ఎర్ర కందిపప్పు) వేసి రెండు మూడు నిమిషాలు ఫ్రై చేయండి.",
    "[00:01:14.000] పసుపు, ఉప్పు వేసి పప్పును బాగా వేయించుకోవాలి.",
    "[00:01:25.000] ఇందులో మూడున్నర కప్పుల నీళ్లు, పుదీనా, కొత్తిమీర తరుగు వేసి కలపండి.",
    "[00:01:34.000] నీళ్లు మరుగుతున్నప్పుడు గంట సేపు నానబెట్టిన సోనా మసూరి బియ్యం వేసి కలపాలి.",
    "[00:01:44.000] మూత పెట్టి 12 నిమిషాల పాటు మీడియం ఫ్లేమ్ మీద ఉడికించండి.",
    "[00:01:53.000] ఆ తర్వాత టిష్యూ పేపర్లు పైన పెట్టి, కొద్దిగా నీళ్లు చల్లి 12 నిమిషాలు లో ఫ్లేమ్ మీద దమ్ చేయండి. 10 నిమిషాల రెస్ట్ తర్వాత సర్వ్ చేయండి."
  ],
  "transcription_english": [
    "[00:00:00.000] Hello Foodies, welcome to Vismai Food. Today's special is Hyderabadi Dum Khichdi.",
    "[00:00:25.000] Heat 1/4 cup oil in a thick-bottomed pan and fry one sliced onion until golden brown.",
    "[00:00:36.000] Add green chillies, cloves, cardamom, bay leaf, shah jeera, cinnamon, and black cardamom.",
    "[00:00:54.000] Add 1 tbsp ginger-garlic paste and sauté until the raw smell goes away.",
    "[00:01:03.000] Add 1 cup of masoor dal (red lentils) soaked for an hour and fry for 2-3 minutes.",
    "[00:01:14.000] Add turmeric and salt, and fry the dal well.",
    "[00:01:25.000] Add 3.5 cups of water, chopped mint, and coriander leaves.",
    "[00:01:34.000] Once water starts boiling, add 1.5 cups of Sona Masoori rice soaked for an hour.",
    "[00:01:44.000] Cover and cook for 12 minutes on medium flame.",
    "[00:01:53.000] Place tissue papers on top, sprinkle a little water, and cook on low flame for 12 minutes. Rest for 10 minutes before serving."
  ]
}