{
  "metadata": {
    "title": "Vankaya Nuvvula Kura | వంకాయ నువ్వుల కూర | Baingan Sabzi Recipe | Vankaya Recipes @VismaiFood",
    "channel_name": "Vismai Food",
    "publish_date": "2019-02-13",
    "view_count": 616453,
    "like_count": 6790,
    "duration": "02:11",
    "language": "Telugu",
    "video_id": "TA5Fkt1a8ec",
    "url": "https://www.youtube.com/watch?v=TA5Fkt1a8ec",
    "description": "Flavorful Brinjal Sesame Curry (Vankaya Nuvvula Kura) recipe by Vismai Food.",
    "ingredients_detected": [
      "1/4 Cup Sesame Seeds",
      "4 Garlic cloves",
      "10 Dry Red Chillies",
      "1/4 Cup Oil",
      "1/2 tsp Mustard seeds",
      "1 tsp Cumin seeds",
      "2 Sprigs Curry leaves",
      "500gms Brinjal (sliced)",
      "1/2 tsp Turmeric powder",
      "Salt (to taste)",
      "1 tsp Coriander powder",
      "1/4 Cup Water",
      "1/4 Cup Tamarind juice (marble size tamarind)",
      "1 tsp Red Chilli powder",
      "2 tbsps Coriander (chopped)"
    ]
  },
  "transcription_telugu": [
    "[00:00:00.000] హలో ఫుడీస్, వెల్కమ్ టు విస్మయ్ ఫుడ్. ఇవాల్టి సింపుల్ మరియు టేస్టీ రెసిపీ వంకాయ నువ్వుల కూర.",
    "[00:00:19.000] కడాయిలో పావు కప్పు నువ్వులు, నాలుగు వెల్లుల్లి, 10 ఎండుమిర్చి వేసి లో ఫ్లేమ్ మీద రోస్ట్ చేయండి.",
    "[00:00:30.000] వీటిని మిక్సీ జార్‌లో వేసి కొద్దిగా నీళ్లు పోసి మెత్తని పేస్ట్‌లా గ్రైండ్ చేసి పక్కన పెట్టుకోండి.",
    "[00:00:36.000] ఇప్పుడు కడాయిలో పావు కప్పు నూనె వేసి ఆవాలు, జీలకర్ర, కరివేపాకు వేసి వేయించాలి.",
    "[00:00:47.000] ఇందులో అర కిలో పొడవు వంకాయ ముక్కలు వేసి మీడియం ఫ్లేమ్ మీద ఫ్రై చేయండి.",
    "[00:00:55.000] వంకాయ ముక్కల్లో పసుపు, ఉప్పు, ధనియాల పొడి వేసి బాగా కలిపి మూత పెట్టి ఉడికించాలి.",
    "[00:01:09.000] ముక్కలు సగం మగ్గాక నువ్వుల పేస్ట్, పావు కప్పు నీళ్లు వేసి కలిపి లో ఫ్లేమ్ మీద ఉడికించండి.",
    "[00:01:27.000] నూనె పైకి తేలాక పావు కప్పు చింతపండు పులుసు, ఒక టీస్పూన్ కారం వేసి కలపండి.",
    "[00:01:40.000] మూత పెట్టి నూనె పైకి తేలే వరకు ఉడికించాలి.",
    "[00:01:46.000] చివరగా కొత్తిమీర తరుగు వేసి దించేయండి. ఇది అన్నం, రోటీల్లోకి చాలా బాగుంటుంది."
  ],
  "transcription_english": [
    "[00:00:00.000] Hello Foodies, welcome to Vismai Food. Today's recipe is Brinjal Sesame Curry.",
    "[00:00:19.000] Roast 1/4 cup sesame seeds, 4 garlic cloves, and 10 dry red chillies on low flame.",
    "[00:00:30.000] Grind them into a fine paste by adding some water and set it aside.",
    "[00:00:36.000] In a pan, heat 1/4 cup oil and sauté mustard, cumin, and curry leaves.",
    "[00:00:47.000] Add 500g of sliced brinjals and fry on medium flame.",
    "[00:00:55.000] Add turmeric, salt, and coriander powder; mix well, cover, and cook until brinjals are soft.",
    "[00:01:09.000] When half-cooked, add the sesame paste and 1/4 cup water; cook on low flame.",
    "[00:01:27.000] Once oil floats, add 1/4 cup tamarind juice and 1 tsp red chilli powder.",
    "[00:01:40.000] Cover and cook until oil separates again.",
    "[00:01:46.000] Finally, garnish with chopped coriander and serve with rice or rotis."
  ]
}