{
  "metadata": {
    "title": "Mirchi Masala Curry | మిర్చి మసాలా కూర | Mirchi Ka Salan | Super Curry",
    "channel_name": "Vismai Food",
    "publish_date": "2019-02-17",
    "view_count": 594915,
    "like_count": 6812,
    "duration": "02:15",
    "language": "Telugu",
    "video_id": "mRDEyYeqKPQ",
    "url": "https://www.youtube.com/watch?v=mRDEyYeqKPQ",
    "description": "Tasty and spicy Mirchi Masala Curry recipe by Vismai Food.",
    "ingredients_detected": [
      "1/4 Cup Oil",
      "1/2 tsp Cumin seeds",
      "1/2 tsp Mustard seeds",
      "4 Dry chillies",
      "2 Onions (finely chopped)",
      "2 Sprigs Curry leaves",
      "1 tbsp Ginger garlic paste",
      "Salt (to taste)",
      "1 tsp Roasted cumin powder",
      "1/2 tsp Garam masala",
      "1/4 tsp Turmeric",
      "1 tsp Chilli powder",
      "1 tsp Coriander powder",
      "8 Bajji mirchi (slit)",
      "3 Desi Tomatoes puree",
      "100ml Water",
      "2 tbsps Coriander leaves (chopped)"
    ]
  },
  "transcription_telugu": [
    "[00:00:18] కడాయిలో పావు కప్పు నూనె వేడి చేసి, అందులో అర టీస్పూన్ జీలకర్ర, అర టీస్పూన్ ఆవాలు, నాలుగు ఎండుమిర్చి వేసి వేయించండి.",
    "[00:00:28] రెండు సన్నగా తరిగిన ఉల్లిపాయ ముక్కలు వేసి గోల్డెన్ బ్రౌన్ కలర్ వచ్చే వరకు ఫ్రై చేయండి.",
    "[00:00:35] రెండు రెబ్బల కరివేపాకు, ఒక టేబుల్ స్పూన్ అల్లం వెల్లుల్లి పేస్ట్, కొద్దిగా నీళ్లు వేసి ఉల్లిపాయలు బాగా వేగేలా చూసుకోండి.",
    "[00:00:45] రుచికి సరిపడా ఉప్పు, ఒక టీస్పూన్ వేయించిన జీలకర్ర పొడి, అర టీస్పూన్ గరం మసాలా, పావు చెంచా పసుపు, ఒక టీస్పూన్ కారం, ఒక టీస్పూన్ ధనియాల పొడి వేసి నూనె తేలే వరకు వేయించండి.",
    "[00:01:02] ఎనిమిది బజ్జీ మిర్చిలను మధ్యకు కట్ చేసి వేసుకోండి. కారం తగ్గాలంటే నిమ్మరసం లేదా ఉప్పు నీటిలో గంట సేపు నానబెట్టినవి వాడుకోవచ్చు.",
    "[00:01:21] మిర్చి బాగా మగ్గిన తర్వాత మూడు నాటు టమాటాల ప్యూరీ వేసి నూనె విడిపోయే వరకు ఉడికించండి.",
    "[00:01:41] ఇప్పుడు 100ml నీళ్లు పోసి తక్కువ మంట మీద నూనె పైకి తేలే వరకు ఉడికించండి.",
    "[00:01:48] చివరగా రెండు టేబుల్ స్పూన్ల కొత్తిమీర తరుగు చల్లుకుని స్టవ్ ఆఫ్ చేయండి."
  ],
  "transcription_english": [
    "[00:00:18] Heat 1/4 cup oil in a pan, add 1/2 tsp cumin seeds, 1/2 tsp mustard seeds, and 4 dry chillies and sauté.",
    "[00:00:28] Add two finely chopped onions and fry until they turn golden brown.",
    "[00:00:35] Add 2 sprigs of curry leaves, 1 tbsp ginger garlic paste, and a little water, and fry until the onions are well cooked.",
    "[00:00:45] Add salt to taste, 1 tsp roasted cumin powder, 1/2 tsp garam masala, 1/4 tsp turmeric, 1 tsp chilli powder, and 1 tsp coriander powder, and fry until the oil separates.",
    "[00:01:02] Add 8 slit bajji mirchis. To reduce spice, you can use chillies soaked in lemon juice or salt water for an hour.",
    "[00:01:21] After the chillies soften, add the puree of 3 desi tomatoes and cook until oil separates.",
    "[00:01:41] Now pour 100ml water and cook on a low flame until the oil floats on top.",
    "[00:01:48] Finally, sprinkle 2 tbsps of chopped coriander leaves and turn off the stove."
  ]
}