{
  "metadata": {
    "title": "Mutton Liver Fry | మటన్ లివర్ ఫ్రై | The best Ever Spicy Mutton Liver Fry @VismaiFood",
    "channel_name": "Vismai Food",
    "publish_date": "2018-10-07",
    "view_count": 2498156,
    "like_count": 22625,
    "duration": "02:08",
    "language": "Telugu",
    "video_id": "DeV5i8IfdZw",
    "url": "https://www.youtube.com/watch?v=DeV5i8IfdZw",
    "description": "Best spicy mutton liver fry recipe by Vismai Food.",
    "ingredients_detected": [
      "1/4 Cup Oil",
      "2 Sprigs Curry Leaves",
      "1 Large Onion & 3 Green Chillies (Ground to a paste)",
      "1 tsp Freshly Ground Ginger Garlic Paste",
      "1/2 tsp Turmeric",
      "1 tbsp Coriander Powder",
      "1 tbsp Red Chilli Powder",
      "250ml Water",
      "500gms Mutton Liver (Washed and soaked for 30 mins)",
      "Salt (to taste)",
      "2 tbsps Soya Leaves (Dill)",
      "2 tbsps Coriander (chopped)"
    ]
  },
  "transcription_telugu": [
    "[00:00:00.000] హలో ఫుడీస్, వెల్కమ్ టు విస్మయ్ ఫుడ్. ఇవాళ మీకు ద బెస్ట్ స్పైసీయస్ట్ మటన్ లివర్ ఫ్రై ఎలా తయారు చేయాలో చూపిస్తాను.",
    "[00:00:08.000] డెడ్ ఈజీ ఈ రెసిపీ. ఒక్కసారి ఈ స్టైల్ లో ట్రై చేయండి, మళ్ళీ దీని రుచి మర్చిపోలేరు.",
    "[00:00:21.000] ముందుగా ఒక కడాయిలో పావు కప్పు ఆయిల్ హీట్ చేసి, అందులో రెండు రెబ్బల కరివేపాకు వేసుకోండి.",
    "[00:00:28.000] ఒక పెద్ద ఉల్లిపాయ, మూడు పచ్చిమిర్చి కలిపి గ్రైండ్ చేసిన ఆనియన్ చిల్లీ పేస్ట్ వేసి పచ్చి వాసన పోయేదాకా ఫ్రై చేయండి.",
    "[00:00:40.000] ఇప్పుడు ఒక టీస్పూన్ అల్లం వెల్లుల్లి పేస్ట్, అర చెంచా పసుపు వేసి మంచి రంగు వచ్చే వరకు వేపండి.",
    "[00:00:50.000] ఒక టేబుల్ స్పూన్ ధనియాల పొడి, ఒక టేబుల్ స్పూన్ కారం వేసి కాసేపు ఫ్రై చేయండి.",
    "[00:01:00.000] ఇందులో 250ml నీళ్లు పోసి హై ఫ్లేమ్ మీద ఒక పొంగు రానివ్వండి.",
    "[00:01:06.000] పొంగు రాగానే శుభ్రం చేసి అరగంట పాటు నీళ్లలో నానబెట్టిన అర కేజీ మటన్ లివర్ వేసి మీడియం ఫ్లేమ్ లో ఉడికించండి.",
    "[00:01:17.000] రుచికి సరిపడా ఉప్పు వేసి మధ్య మధ్యలో కలుపుతూ ఉండండి.",
    "[00:01:23.000] గ్రేవీ కొద్దిగా దగ్గర పడ్డాక రెండు టేబుల్ స్పూన్ల సోయకూర, రెండు టేబుల్ స్పూన్ల కొత్తిమీర వేయండి. సోయకూర లివర్ ఫ్రైకి మంచి అరోమా ఇస్తుంది.",
    "[00:01:40.000] లో ఫ్లేమ్ లో నూనె పైకి తేలేంత వరకు బాగా వేయించుకోవాలి.",
    "[00:01:49.000] అంతే, ఎంతో రుచికరమైన మటన్ లివర్ ఫ్రై రెడీ. మిరియాల చారుతో తీసుకుంటే అద్భుతంగా ఉంటుంది."
  ],
  "transcription_english": [
    "[00:00:00.000] Hello Foodies, welcome to Vismai Food. Today, I'll show you how to make the best ever spicy mutton liver fry.",
    "[00:00:08.000] This recipe is incredibly easy. Try it this way once, and you won't forget the taste.",
    "[00:00:21.000] First, heat 1/4 cup oil in a pan and add two sprigs of curry leaves.",
    "[00:00:28.000] Add onion-chilli paste (made from one onion and three green chillies) and fry until the raw smell disappears.",
    "[00:00:40.000] Add 1 tsp freshly ground ginger-garlic paste and 1/2 tsp turmeric; sauté until aromatic.",
    "[00:00:50.000] Add 1 tbsp coriander powder and 1 tbsp chilli powder; fry for a few minutes.",
    "[00:01:00.000] Pour 250ml water and bring it to a boil on high flame.",
    "[00:01:06.000] Add 500gms cleaned mutton liver (soaked for 30 mins) and cook on medium flame.",
    "[00:01:17.000] Add salt to taste and stir occasionally while cooking.",
    "[00:01:23.000] When the gravy thickens, add 2 tbsps soya leaves (dill) and 2 tbsps coriander. Dill leaves add great aroma to liver fry.",
    "[00:01:40.000] Fry on low flame until the oil separates and the liver is well roasted.",
    "[00:01:49.000] That's it, delicious mutton liver fry is ready. It pairs perfectly with pepper rasam."
  ]
}