{
  "metadata": {
    "title": "Vada Curry | Tamil Nadu Special For Idli & Dosa | ఇడ్లి దోసల్లోకి ఈ వడ కర్రీ అడుర్స్",
    "channel_name": "Vismai Food",
    "publish_date": "2019-03-08",
    "view_count": 243901,
    "like_count": 3311,
    "duration": "03:51",
    "language": "Telugu",
    "video_id": "ZA8r-l1_dkE",
    "url": "https://www.youtube.com/watch?v=ZA8r-l1_dkE",
    "description": "Tamil Nadu Special Vada Curry, a perfect side dish for Idli and Dosa.",
    "ingredients_detected": [
      "1 Cup Chana Dal (soaked for 5 hours)",
      "6-7 Dry Chillies",
      "1 tsp Saunf (Sennel seeds)",
      "1/2 bunch Coriander (chopped)",
      "1 Sprig Curry leaves",
      "Salt (to taste)",
      "1/2 Coconut (grated)",
      "1 tsp Saunf (for coconut paste)",
      "Oil (for deep frying + 3 tbsps for curry)",
      "1 inch Cinnamon",
      "1/4 inch Nutmeg",
      "1 tsp Saunf (for tempering)",
      "2 Onions (chopped)",
      "4 Green Chillies",
      "1/4 tsp Turmeric",
      "1 tbsp Ginger garlic paste",
      "2 Tomatoes (chopped)",
      "2 tsps Chilli Powder",
      "1 tbsp Coriander Powder",
      "2 tbsps Ghee"
    ]
  },
  "transcription_telugu": [
    "[00:00:00.000] హలో ఫుడీస్, వెల్కమ్ టు విస్మయ్ ఫుడ్. ఇవాల్టి స్పెషల్ తమిళనాడు స్పెషల్ వడ కర్రీ. ఇది ఇడ్లీ, దోసల్లోకి చాలా బాగుంటుంది.",
    "[00:00:30.000] ముందుగా 5 గంటల పాటు నానబెట్టిన శనగపప్పులో ఎండుమిర్చి, సోంపు, కొత్తిమీర, కరివేపాకు, ఉప్పు వేసి నీళ్లు లేకుండా బరకగా రుబ్బుకోవాలి.",
    "[00:00:49.000] ఈ పిండిని చిన్న వడల్లా చేసి నూనెలో గోల్డెన్ బ్రౌన్ కలర్ వచ్చే వరకు వేయించి పక్కన పెట్టుకోవాలి.",
    "[00:01:04.000] మిక్సీ జార్‌లో పచ్చి కొబ్బరి తురుము, సోంపు వేసి మెత్తని పేస్ట్ లా గ్రైండ్ చేసుకోవాలి.",
    "[00:01:10.000] కడాయిలో ఆయిల్ వేసి దాల్చిన చెక్క, జాజికాయ, సోంపు వేసి వేయించాలి. తర్వాత ఉల్లిపాయలు, పచ్చిమిర్చి, కరివేపాకు, పసుపు వేసి మగ్గించాలి.",
    "[00:01:34.000] అల్లం వెల్లుల్లి పేస్ట్ వేసి వేపాక, టమాటో ముక్కలు, ఉప్పు, కారం, ధనియాల పొడి వేసి టమాటోలు మెత్తబడే వరకు ఉడికించాలి.",
    "[00:02:04.000] టమాటో మిశ్రమాన్ని మెత్తని పేస్ట్ లా గ్రైండ్ చేసి మళ్ళీ కడాయిలో వేసి, కొబ్బరి పేస్ట్, నీళ్లు పోసి నూనె పైకి తేలే వరకు ఉడికించాలి.",
    "[00:02:45.000] వేయించిన వడలను ముక్కలుగా చేసి గ్రేవీలో వేసి, మరికొన్ని నీళ్లు పోసి తక్కువ మంట మీద నూనె విడిపోయే వరకు ఉడికించాలి.",
    "[00:03:18.000] చివరగా కొత్తిమీర, నెయ్యి వేసి కలిపి దించేయాలి. ఎంతో రుచికరమైన వడ కర్రీ రెడీ."
  ],
  "transcription_english": [
    "[00:00:00.000] Hello Foodies, welcome to Vismai Food. Today's special is Tamil Nadu special Vada Curry, perfect for Idli and Dosa.",
    "[00:00:30.000] Grind soaked chana dal with dry chillies, saunf, coriander, curry leaves, and salt into a coarse paste without adding water.",
    "[00:00:49.000] Shape the paste into small vadas and deep fry until golden brown, then set aside.",
    "[00:01:04.000] Blend grated fresh coconut and saunf into a smooth paste.",
    "[00:01:10.000] Heat oil in a pan, sauté cinnamon, nutmeg, and saunf. Add onions, green chillies, curry leaves, and turmeric; sauté well.",
    "[00:01:34.000] Add ginger-garlic paste, then add tomatoes, salt, chilli powder, and coriander powder; cook until tomatoes turn soft.",
    "[00:02:04.000] Grind the tomato mixture into a paste, return to the pan, add coconut paste and water; cook until oil floats on top.",
    "[00:02:45.000] Break the fried vadas into pieces, add to the gravy with more water, and simmer on low flame until oil separates.",
    "[00:03:18.000] Finally, garnish with coriander leaves and ghee. Delicious Vada Curry is ready."
  ]
}