{
  "metadata": {
    "title": "Bendakaya Pulusu | అమ్మల కాలం నాటి బెండకాయ పులుసు | Vendakkai Puli Kulambu",
    "channel_name": "Vismai Food",
    "publish_date": "2019-03-11",
    "view_count": 1954042,
    "like_count": 16410,
    "duration": "02:01",
    "language": "Telugu",
    "video_id": "DdUlkN6w5X0",
    "url": "https://www.youtube.com/watch?v=DdUlkN6w5X0",
    "description": "Try this traditional and tangy Bendakaya Pulusu (Okra Tamarind Curry). A classic recipe from Vismai Food.",
    "ingredients_detected": [
      "250g Okra (Bendakaya)",
      "3 tbsps Oil",
      "1/2 tsp Mustard seeds",
      "1/2 tsp Cumin seeds",
      "1/4 tsp Fenugreek seeds (Methi)",
      "2 Dry red chillies",
      "1 sprig Curry leaves",
      "2 Medium Onions (chopped)",
      "3-4 Green chillies (slit)",
      "1 tsp Ginger-garlic paste",
      "2 Medium Tomatoes (chopped)",
      "Salt (to taste)",
      "1/2 tsp Turmeric powder",
      "1.5 tsps Red chilli powder",
      "1 tsp Coriander powder",
      "Lemon-sized Tamarind (soaked and extract taken)",
      "1 tsp Jaggery (optional)",
      "Coriander leaves (for garnish)"
    ]
  },
  "transcription_telugu": [
    "[00:00:00.000] హలో ఫుడీస్, వెల్కమ్ టు విస్మయ్ ఫుడ్. ఇవాల్టి స్పెషల్ అందరికీ ఇష్టమైన అమ్మల కాలం నాటి బెండకాయ పులుసు.",
    "[00:00:15.000] ముందుగా బెండకాయలను కడిగి ఆరబెట్టి, అంగుళం ముక్కలుగా కట్ చేసుకోవాలి. ఒక పాన్ లో నూనె వేసి బెండకాయ ముక్కలను జిగురు పోయే వరకు వేయించి పక్కన పెట్టుకోవాలి.",
    "[00:00:40.000] అదే పాన్ లో ఆవాలు, జీలకర్ర, మెంతులు, ఎండుమిర్చి, కరివేపాకు వేసి తాలింపు పెట్టుకోవాలి.",
    "[00:00:55.000] ఇందులో ఉల్లిపాయ ముక్కలు, పచ్చిమిర్చి వేసి వేగనివ్వాలి. తర్వాత అల్లం వెల్లుల్లి పేస్ట్ వేసి పచ్చి వాసన పోయే వరకు వేయించాలి.",
    "[00:01:10.000] ఇప్పుడు టమాటో ముక్కలు, ఉప్పు, పసుపు, కారం, ధనియాల పొడి వేసి టమాటోలు మెత్తబడే వరకు ఉడికించాలి.",
    "[00:01:30.000] చింతపండు పులుసు పోసి, రుచికి తగినంత బెల్లం ముక్క వేసి మరగనివ్వాలి.",
    "[00:01:45.000] పులుసు మరుగుతున్నప్పుడు వేయించిన బెండకాయ ముక్కలు వేసి, మూత పెట్టి నూనె పైకి తేలే వరకు ఉడికించాలి.",
    "[00:01:55.000] చివరగా కొత్తిమీర చల్లుకుంటే వేడి వేడి అన్నంలోకి అదిరిపోయే బెండకాయ పులుసు రెడీ."
  ],
  "transcription_english": [
    "[00:00:00.000] Hello Foodies, welcome to Vismai Food. Today's special is a traditional, mom-style Bendakaya Pulusu (Okra Curry).",
    "[00:00:15.000] First, wash and dry okra, then cut into 1-inch pieces. Sauté them in oil until the sliminess is gone and set aside.",
    "[00:00:40.000] In the same pan, add mustard seeds, cumin, fenugreek seeds, dry red chillies, and curry leaves for tempering.",
    "[00:00:55.000] Add onions and green chillies; sauté well. Then add ginger-garlic paste and fry until the raw smell disappears.",
    "[00:01:10.000] Add chopped tomatoes, salt, turmeric, red chilli powder, and coriander powder; cook until tomatoes turn soft.",
    "[00:01:30.000] Pour in the tamarind extract and add a small piece of jaggery; let the mixture come to a boil.",
    "[00:01:45.000] Add the fried okra pieces to the boiling gravy, cover, and cook until the oil floats on top.",
    "[00:01:55.000] Garnish with coriander leaves; the delicious Bendakaya Pulusu is ready to serve with hot rice."
  ]
}