{
  "metadata": {
    "title": "Sunnundalu | మినప సున్ని ఉండలు | Urad Dal Ladoo | Sunnundalu In telugu| Pindi Vantalu By vismai food",
    "channel_name": "Vismai Food",
    "publish_date": "2019-03-12",
    "view_count": 2292113,
    "like_count": 24942,
    "duration": "02:05",
    "language": "Telugu",
    "video_id": "1PYoWkv3IuA",
    "url": "https://www.youtube.com/watch?v=1PYoWkv3IuA",
    "description": "Traditional Andhra special Sunnundalu (Urad Dal Ladoo) recipe. A healthy and protein-rich sweet made with urad dal, jaggery/sugar, and ghee.",
    "ingredients_detected": [
      "2 Cups Urad Dal (Minapa Gullu)",
      "1.5 Cups Sugar or Grated Jaggery",
      "1/2 to 3/4 Cup Ghee (melted)",
      "2-3 Cardamoms (optional)"
    ]
  },
  "transcription_telugu": [
    "[00:00:00.000] హలో ఫుడీస్, వెల్కమ్ టు విస్మయ్ ఫుడ్. ఇవాల్టి స్పెషల్ ఆంధ్రుల సంప్రదాయ పిండి వంటకం మినప సున్ని ఉండలు.",
    "[00:00:10.000] ముందుగా మినప పప్పును మందపాటి కడాయిలో వేసి లో ఫ్లేమ్ మీద మంచి సువాసన వచ్చే వరకు ఎర్రగా వేయించుకోవాలి.",
    "[00:00:35.000] వేయించిన పప్పును పూర్తిగా చల్లారనివ్వాలి. చల్లారిన తర్వాత మిక్సీ జార్ లో వేసి కొంచెం బరకగా ఉండేలా పౌడర్ చేసుకోవాలి.",
    "[00:00:55.000] ఇప్పుడు ఇందులో చక్కెర లేదా బెల్లం తురుము వేసి మళ్ళీ ఒకసారి మెత్తగా గ్రైండ్ చేసుకోవాలి. చక్కెర వేసేవారు యాలకులు కూడా వేసుకోవచ్చు.",
    "[00:01:15.000] ఈ పిండిని ఒక వెడల్పాటి బౌల్ లోకి తీసుకుని, వేడి చేసిన నెయ్యిని కొంచెం కొంచెంగా పోస్తూ పిండిని బాగా కలుపుకోవాలి.",
    "[00:01:40.000] నెయ్యి పిండికి బాగా పట్టిన తర్వాత మీకు కావలసిన సైజులో ఉండలు చుట్టుకోవాలి.",
    "[00:02:00.000] ఎంతో రుచికరమైన మరియు ఆరోగ్యకరమైన మినప సున్ని ఉండలు రెడీ."
  ],
  "transcription_english": [
    "[00:00:00.000] Hello Foodies, welcome to Vismai Food. Today's special is the traditional Andhra sweet, Sunnundalu (Urad Dal Ladoo).",
    "[00:00:10.000] First, dry roast the urad dal in a heavy-bottomed pan on a low flame until it turns golden brown and aromatic.",
    "[00:00:35.000] Let the roasted dal cool completely. Once cooled, grind it in a mixer to a slightly coarse powder.",
    "[00:00:55.000] Add sugar or grated jaggery to the powder and grind again until smooth. You can add cardamoms if using sugar.",
    "[00:01:15.000] Transfer the mixture to a wide bowl. Gradually pour hot melted ghee and mix it well with the flour.",
    "[00:01:40.000] Once the ghee is well incorporated, take small portions and shape them into round ladoos of your desired size.",
    "[00:02:00.000] Delicious and healthy Sunnundalu are now ready to serve."
  ]
}