{
  "metadata": {
    "title": "Gutti Vankaya Masala Curry | గుంటూరు గుత్తి వంకాయ మసాలా | Masala Baingan recipe @VismaiFood",
    "channel_name": "Vismai Food",
    "publish_date": "2018-06-20",
    "view_count": 5935142,
    "like_count": 48021,
    "duration": "03:17",
    "language": "Telugu",
    "video_id": "xtj-yVelDE8",
    "url": "https://www.youtube.com/watch?v=xtj-yVelDE8",
    "description": "Authentic Guntur style Gutti Vankaya Masala Curry (Stuffed Brinjal Curry). A rich and flavorful traditional recipe from Vismai Food.",
    "ingredients_detected": [
      "250g Small Brinjals (Vankayalu)",
      "2 tbsps Peanuts",
      "1 tbsp Sesame seeds",
      "1 tbsp Coriander seeds",
      "1 tsp Cumin seeds",
      "2-3 Cloves",
      "1 inch Cinnamon",
      "2-3 Cardamoms",
      "1/4 cup Dry coconut pieces",
      "2 Medium Onions (chopped)",
      "1 tbsp Ginger-garlic paste",
      "2 tsps Red chilli powder",
      "1/2 tsp Turmeric powder",
      "Salt (to taste)",
      "Small lemon-sized Tamarind (soaked)",
      "4-5 tbsps Oil",
      "Coriander leaves (for garnish)"
    ]
  },
  "transcription_telugu": [
    "[00:00:00.000] హలో ఫుడీస్, వెల్కమ్ టు విస్మయ్ ఫుడ్. ఇవాల్టి స్పెషల్ గుంటూరు స్పెషల్ గుత్తి వంకాయ మసాలా కూర. ఇది అన్నం, పులావ్ లేదా బిర్యానీలోకి అద్భుతంగా ఉంటుంది.",
    "[00:00:15.000] ముందుగా మసాలా కోసం పల్లీలు, ధనియాలు, జీలకర్ర, నువ్వులు, లవంగాలు, దాల్చిన చెక్క, యాలకులు మరియు ఎండు కొబ్బరిని దోరగా వేయించి చల్లార్చుకోవాలి.",
    "[00:00:45.000] వేయించిన దినుసులతో పాటు ఉల్లిపాయ ముక్కలు, అల్లం వెల్లుల్లి పేస్ట్, కారం, పసుపు, ఉప్పు మరియు చింతపండు రసం వేసి మెత్తని పేస్ట్ లా గ్రైండ్ చేసుకోవాలి.",
    "[00:01:10.000] వంకాయలను నాలుగు పచ్చలుగా కట్ చేసి ఉప్పు నీళ్లలో వేయాలి. ఆ తర్వాత తయారు చేసుకున్న మసాలా పేస్ట్ ను ప్రతి వంకాయలో నిండుగా స్టఫ్ చేయాలి.",
    "[00:01:40.000] కడాయిలో నూనె వేడి చేసి, స్టఫ్ చేసిన వంకాయలను వేసి మూత పెట్టి తక్కువ మంట మీద మగ్గించాలి.",
    "[00:02:10.000] వంకాయలు సగం ఉడికాక, మిగిలిన మసాలా పేస్ట్ మరియు తగినన్ని నీళ్లు పోసి మళ్ళీ మూత పెట్టి ఉడికించాలి.",
    "[00:02:45.000] కూర దగ్గర పడి, నూనె పైకి తేలే వరకు సిమ్ లో ఉంచాలి.",
    "[00:03:05.000] చివరగా కొత్తిమీర చల్లుకుంటే ఎంతో రుచికరమైన గుత్తి వంకాయ మసాలా కూర సిద్ధం."
  ],
  "transcription_english": [
    "[00:00:00.000] Hello Foodies, welcome to Vismai Food. Today's special is the Guntur special Gutti Vankaya Masala Curry, a perfect match for rice or pulao.",
    "[00:00:15.000] For the masala, dry roast peanuts, coriander seeds, cumin, sesame seeds, cloves, cinnamon, cardamom, and dry coconut until aromatic.",
    "[00:00:45.000] Grind the roasted spices along with onions, ginger-garlic paste, chilli powder, turmeric, salt, and tamarind pulp into a smooth paste.",
    "[00:01:10.000] Slit the brinjals into four and soak in salt water. Stuff the prepared masala paste generously into each brinjal.",
    "[00:01:40.000] Heat oil in a pan, place the stuffed brinjals, cover, and cook on a low flame until they soften.",
    "[00:02:10.000] Once the brinjals are half-cooked, add the remaining masala paste and some water. Cover and continue to cook.",
    "[00:02:45.000] Simmer on a low flame until the gravy thickens and the oil starts floating on top.",
    "[00:03:05.000] Garnish with fresh coriander leaves; the delicious Gutti Vankaya Masala is ready to serve."
  ]
}