{
  "metadata": {
    "title": "Sambar Recipe In Telugu|హోటల్ స్టైల్ సాంబార్|Perfect Sambar In telugu|How To make Sambar Vismai food",
    "channel_name": "Vismai Food",
    "publish_date": "2019-03-26",
    "view_count": 3383548,
    "like_count": 37647,
    "duration": "04:06",
    "language": "Telugu",
    "video_id": "UpttkvlWUuw",
    "url": "https://www.youtube.com/watch?v=UpttkvlWUuw",
    "description": "Learn how to make perfect Hotel Style Sambar at home with this detailed recipe from Vismai Food.",
    "ingredients_detected": [
      "1 Cup Toor Dal (Kandipappu)",
      "1/2 tsp Turmeric powder",
      "1 tsp Oil (for boiling dal)",
      "Small lemon-sized Tamarind",
      "2-3 tbsps Oil",
      "1/2 tsp Mustard seeds",
      "1/2 tsp Cumin seeds",
      "1/4 tsp Fenugreek seeds (Methi)",
      "2 Dry red chillies",
      "1 sprig Curry leaves",
      "1/4 tsp Hing (Asafoetida)",
      "10-12 Shallots (Small onions) or 1 Large Onion",
      "2-3 Green chillies",
      "1 Drumstick (cut into pieces)",
      "1 Carrot (sliced)",
      "1 Potato (cubed)",
      "2 Medium Tomatoes (chopped)",
      "1.5 - 2 tbsps Sambar Powder",
      "1 tsp Red chilli powder",
      "Salt (to taste)",
      "Small piece of Jaggery",
      "Coriander leaves (for garnish)"
    ]
  },
  "transcription_telugu": [
    "[00:00:00.000] హలో ఫుడీస్, వెల్కమ్ టు విస్మయ్ ఫుడ్. ఇవాల్టి స్పెషల్ అందరికీ ఇష్టమైన హోటల్ స్టైల్ సాంబార్. కొన్ని చిన్న చిట్కాలు పాటిస్తే ఇంట్లోనే పర్ఫెక్ట్ సాంబార్ చేయవచ్చు.",
    "[00:00:15.000] ముందుగా ఒక కప్పు కందిపప్పును శుభ్రంగా కడిగి, అందులో పసుపు, ఒక చుక్క నూనె వేసి కుక్కర్ లో మెత్తగా ఉడికించుకోవాలి.",
    "[00:00:45.000] ఉడికించిన పప్పును పప్పుగుత్తితో మెత్తగా మెదుపుకోవాలి. చింతపండును నానబెట్టి పులుసు తీసి పక్కన పెట్టుకోవాలి.",
    "[00:01:05.000] ఒక పెద్ద గిన్నెలో నూనె వేసి ఆవాలు, జీలకర్ర, మెంతులు, ఎండుమిర్చి, కరివేపాకు, ఇంగువ వేసి తాలింపు వేయించుకోవాలి.",
    "[00:01:30.000] ఇందులో చిన్న ఉల్లిపాయలు, పచ్చిమిర్చి వేసి కొంచెం వేగాక మునక్కాయ, క్యారెట్, బంగాళదుంప ముక్కలు వేసి మగ్గించాలి.",
    "[00:01:55.000] ముక్కలు కొంచెం ఉడికాక టమాటోలు, ఉప్పు, సాంబార్ పొడి, కారం వేసి బాగా కలపాలి.",
    "[00:02:20.000] ఇప్పుడు చింతపండు పులుసు పోసి, ముక్కలు పూర్తిగా ఉడికే వరకు మరిగించాలి.",
    "[00:02:45.000] ముక్కలు ఉడికిన తర్వాత మెదిపి పెట్టుకున్న పప్పును వేసి, తగినన్ని నీళ్లు పోసి సాంబార్ చిక్కదనాన్ని అడ్జస్ట్ చేసుకోవాలి.",
    "[00:03:15.000] చివరగా చిన్న బెల్లం ముక్క, కొత్తిమీర వేసి 5 నిమిషాల పాటు మరిగించి దించేయాలి. ఎంతో రుచికరమైన హోటల్ స్టైల్ సాంబార్ రెడీ."
  ],
  "transcription_english": [
    "[00:00:00.000] Hello Foodies, welcome to Vismai Food. Today's special is the much-loved Hotel Style Sambar. You can make it perfectly at home by following a few tips.",
    "[00:00:15.000] First, wash one cup of toor dal and pressure cook it until soft with some turmeric and a drop of oil.",
    "[00:00:45.000] Mash the cooked dal thoroughly. Soak tamarind in water and extract the juice; keep it aside.",
    "[00:01:05.000] In a large pot, heat oil and add mustard seeds, cumin, fenugreek seeds, dry red chillies, curry leaves, and hing for tempering.",
    "[00:01:30.000] Add shallots and green chillies. Once slightly sautéed, add drumstick, carrot, and potato pieces; cook for a while.",
    "[00:01:55.000] When vegetables are partially cooked, add tomatoes, salt, sambar powder, and red chilli powder; mix well.",
    "[00:02:20.000] Pour in the tamarind extract and boil until the vegetables are completely cooked.",
    "[00:02:45.000] Once the vegetables are soft, add the mashed dal and adjust the consistency by adding required amount of water.",
    "[00:03:15.000] Finally, add a small piece of jaggery and coriander leaves; boil for 5 more minutes and then turn off the flame. Delicious Hotel Style Sambar is ready."
  ]
}