{
  "metadata": {
    "title": "Bhindi 65 | పెళ్ళిళ్ళ స్పెషల్ బెండకాయ 65 | మా టిప్స్ తో బెండకాయ ఫ్రై చేసి చుడండి మర్చిపోలేరు",
    "channel_name": "Vismai Food",
    "publish_date": "2019-03-26",
    "view_count": 1603860,
    "like_count": 17780,
    "duration": "02:29",
    "language": "Telugu",
    "video_id": "SB1C8dUTG8s",
    "url": "https://www.youtube.com/watch?v=SB1C8dUTG8s",
    "description": "Wedding style crispy Bhindi 65 (Okra Fry) recipe. Follow these tips for a perfect, crunchy starter from Vismai Food.",
    "ingredients_detected": [
      "250g Okra (Bendakaya)",
      "2 tbsps Corn flour",
      "2 tbsps Rice flour",
      "1 tbsp Gram flour (Besan)",
      "1 tsp Ginger-garlic paste",
      "1 tsp Red chilli powder",
      "1/2 tsp Garam masala",
      "1/4 tsp Turmeric powder",
      "Salt (to taste)",
      "1 tsp Lemon juice",
      "Oil (for deep frying)",
      "Curry leaves",
      "2-3 Green chillies (slit)",
      "2 tbsps Peanuts"
    ]
  },
  "transcription_telugu": [
    "[00:00:00.000] హలో ఫుడీస్, వెల్కమ్ టు విస్మయ్ ఫుడ్. ఇవాల్టి స్పెషల్ పెళ్ళిళ్ళలో వడ్డించే బెండకాయ 65. ఇది చాలా క్రిస్పీగా మరియు రుచిగా ఉంటుంది.",
    "[00:00:15.000] ముందుగా బెండకాయలను కడిగి, తడి లేకుండా తుడిచి, పొడవుగా ముక్కలు కట్ చేసుకోవాలి.",
    "[00:00:35.000] ఒక బౌల్ లో బెండకాయ ముక్కలు తీసుకుని అందులో అల్లం వెల్లుల్లి పేస్ట్, ఉప్పు, కారం, పసుపు, గరం మసాలా మరియు నిమ్మరసం వేసి బాగా కలుపుకోవాలి.",
    "[00:01:00.000] ఇప్పుడు ఇందులో కార్న్ ఫ్లోర్, బియ్యం పిండి, శనగపిండి వేసి ముక్కలకు పట్టేలా పొడి పొడిగా కలుపుకోవాలి. అవసరమైతే కొంచెం నీళ్లు చిలకరించుకోవాలి.",
    "[00:01:25.000] కడాయిలో నూనె వేడి చేసి, మసాలా పట్టించిన బెండకాయ ముక్కలను విడివిడిగా వేస్తూ హై ఫ్లేమ్ మీద క్రిస్పీగా అయ్యే వరకు వేయించుకోవాలి.",
    "[00:01:50.000] చివరగా అదే నూనెలో పల్లీలు, పచ్చిమిర్చి, కరివేపాకు వేయించి బెండకాయ ఫ్రై మీద వేసుకోవాలి.",
    "[00:02:15.000] అంతే! ఎంతో క్రిస్పీగా ఉండే బెండకాయ 65 సిద్ధం. ఇది స్నాక్ గా లేదా అన్నంలోకి సైడ్ డిష్ గా చాలా బాగుంటుంది."
  ],
  "transcription_english": [
    "[00:00:00.000] Hello Foodies, welcome to Vismai Food. Today's special is the wedding-style Bhindi 65. It is incredibly crispy and tasty.",
    "[00:00:15.000] First, wash the okra, wipe them completely dry, and cut them into thin, long pieces.",
    "[00:00:35.000] In a bowl, take the okra pieces and add ginger-garlic paste, salt, chilli powder, turmeric, garam masala, and lemon juice; mix well.",
    "[00:01:00.000] Now add corn flour, rice flour, and gram flour. Coat the pieces well; if it's too dry, sprinkle a very little amount of water.",
    "[00:01:25.000] Heat oil in a pan and deep fry the coated okra pieces on high flame until they become crunchy and golden.",
    "[00:01:50.000] Finally, fry some peanuts, green chillies, and curry leaves in the same oil and garnish over the fried okra.",
    "[00:02:15.000] That's it! Crispy Bhindi 65 is ready. It works perfectly as a snack or a side dish for rice."
  ]
}