{
  "metadata": {
    "title": "Vankaya Ulli Karam Curry | Baingan Pyaz Ki Sabzi | ఈ స్టైల్ లో చేస్తే సూపర్!",
    "channel_name": "Vismai Food",
    "publish_date": "2019-02-19",
    "view_count": 1794541,
    "like_count": 20839,
    "duration": "02:46",
    "language": "Telugu",
    "video_id": "zzxZbeQ1VOU",
    "url": "https://www.youtube.com/watch?v=zzxZbeQ1VOU",
    "description": "Delicious and spicy Vankaya Ulli Karam Curry (Brinjal Onion Masala). A perfect side dish for rice and rotis.",
    "ingredients_detected": [
      "250g Brinjals (Vankayalu)",
      "3 Large Onions (chopped)",
      "4-5 Dry Red Chillies",
      "1 tsp Cumin Seeds",
      "1 tsp Coriander Seeds",
      "1/2 tsp Turmeric Powder",
      "1 tbsp Red Chilli Powder",
      "Salt (to taste)",
      "4-5 tbsps Oil",
      "1 sprig Curry leaves",
      "Coriander leaves (for garnish)"
    ]
  },
  "transcription_telugu": [
    "[00:00:00.000] హలో ఫుడీస్, వెల్కమ్ టు విస్మయ్ ఫుడ్. ఇవాల్టి స్పెషల్ 'వంకాయ ఉల్లి కారం కూర'. ఈ కూర అన్నం మరియు చపాతీల్లోకి చాలా బాగుంటుంది.",
    "[00:00:20.000] ముందుగా మిక్సీ జార్ లో ఉల్లిపాయ ముక్కలు, ఎండుమిర్చి, జీలకర్ర, ధనియాలు, ఉప్పు వేసి బరకగా గ్రైండ్ చేసుకోవాలి.",
    "[00:00:45.000] వంకాయలను నిలువుగా నాలుగు పచ్చలుగా కోసి ఉప్పు నీళ్లలో వేయాలి. ఆ తర్వాత తయారు చేసుకున్న ఉల్లి కారం మసాలాను వంకాయల్లో స్టఫ్ చేయాలి.",
    "[00:01:10.000] కడాయిలో నూనె వేడి చేసి, స్టఫ్ చేసిన వంకాయలను వేసి తక్కువ మంట మీద మూత పెట్టి మగ్గించాలి.",
    "[00:01:40.000] వంకాయలు సగం ఉడికాక, మిగిలిన ఉల్లి కారం మసాలా, పసుపు, కారం వేసి మళ్ళీ ఒకసారి బాగా కలుపుకోవాలి.",
    "[00:02:10.000] కూర దగ్గర పడి వంకాయలు మెత్తగా ఉడికే వరకు సిమ్ లో ఉంచాలి.",
    "[00:02:30.000] చివరగా కొత్తిమీర చల్లుకుంటే ఎంతో రుచికరమైన వంకాయ ఉల్లి కారం కూర సిద్ధం."
  ],
  "transcription_english": [
    "[00:00:00.000] Hello Foodies, welcome to Vismai Food. Today's special is 'Vankaya Ulli Karam Curry'. It pairs excellently with rice and chapati.",
    "[00:00:20.000] First, grind chopped onions, dry red chillies, cumin seeds, coriander seeds, and salt into a coarse paste.",
    "[00:00:45.000] Slit the brinjals into four parts and keep them in salt water. Then, stuff the prepared onion masala into the brinjals.",
    "[00:01:10.000] Heat oil in a pan, add the stuffed brinjals, cover, and cook on a low flame.",
    "[00:01:40.000] Once the brinjals are half-cooked, add the remaining onion masala, turmeric powder, and red chilli powder; mix well.",
    "[00:02:10.000] Simmer on a low flame until the brinjals are soft and the curry thickens.",
    "[00:02:30.000] Finally, garnish with fresh coriander leaves; the delicious Vankaya Ulli Karam Curry is ready."
  ]
}