{
  "metadata": {
    "title": "How to Make Easy Tomato Rice- One Pot Rice Dish- Tastes Delicious- Indian Recipe",
    "channel_name": "Thasneen",
    "publish_date": "2016-12-18",
    "view_count": 99193,
    "like_count": 317,
    "duration": "01:42",
    "original_audio_language": "en",
    "video_id": "WG-S-YpiKGI",
    "url": "https://www.youtube.com/watch?v=WG-S-YpiKGI&list=PLthtds3jNgpZy7-yrHUuos6ej4NgttPUF&index=15",
    "description": "Easy to make and delicious Tomato rice. Tomato rice made in a pressure cooker. Serve with raita, pappad and pickle. Easy Vegetarian rice dish.\nRecipe: http://www.thasneen.com/cooking/easy-tomato-rice/\nConnect with me via:\nFb: https://www.facebook.com/CookingwithThas/\nTwitter: https://twitter.com/thasneen\nPinterest: https://www.pinterest.com/thasneen/\nInstagram: https://www.instagram.com/cookingwiththas/",
    "ingredients_detected": [
      "Ginger",
      "Garlic",
      "Green chilies",
      "Whole cardamom",
      "Whole cloves",
      "Whole cinnamon",
      "Ghee",
      "Onion",
      "Tomatoes",
      "Kashmiri chili powder",
      "Turmeric powder",
      "Coriander powder",
      "Garam Masala",
      "Salt",
      "Basmati Rice",
      "Water",
      "Cilantro"
    ]
  },
  "transcription": [
    "[00:00.000] Prep time 5 mins, Cook time 25 mins, Total time 30 mins",
    "[00:03.000] Author: Thasneen, Recipe type: Main, Cuisine: Indian, Serves: 4 People",
    "[00:08.000] Ingredients to grind: Ginger 1 inch slice, Garlic 3 cloves, Green chilies 3, Whole cardamom 2, Whole cloves 2, Whole cinnamon 2 inch slice",
    "[00:20.000] For cooking: Ghee 2 tbsp, Onion chopped 1, Tomatoes chopped 3, Kashmiri chili powder 1 tsp, Turmeric powder ⅛ tsp, Coriander powder 2 tsp, Garam Masala ¼ tsp, Salt 1¼ tsp, Basmati Rice 2 cups, Water 3¾ cups, Cilantro chopped ¼ cup",
    "[00:40.000] In a blender or food processor, coarsely grind the ingredients 'to grind'.",
    "[00:45.000] Place a pressure cooker over medium heat, add ghee.",
    "[00:50.000] Add the ground mixture, sauté till golden.",
    "[00:55.000] Add chopped onion, season with ½ tsp salt, sauté till onion turns golden.",
    "[01:00.000] Add tomatoes, cook till tomatoes are slightly mashed.",
    "[01:05.000] Add Kashmiri chili powder, turmeric powder, coriander powder, garam masala and ¾ tsp more salt. Combine well and cook for 2 minutes.",
    "[01:15.000] Add basmati rice, sauté for a minute.",
    "[01:20.000] Add water and chopped cilantro, combine well.",
    "[01:25.000] Cover the pressure cooker with its lid and place the whistle over it. Cook for 20 minutes till 1 or 2 whistles.",
    "[01:35.000] Remove the cooker from heat, let the pressure subside, open lid.",
    "[01:38.000] Let the tomato rice cool for 5 minutes. Serve along with raita, pappad, and pickle.",
    "[01:42.000] Notes: If you don't have a pressure cooker, you could make this in a saucepan."
  ]
}
