{
  "metadata": {
    "title": "Chickpeas Sundal- Made in the Instant Pot. Instant Pot Recipes",
    "channel_name": "Thasneen",
    "publish_date": "2017-09-07",
    "view_count": 2388,
    "like_count": 16,
    "duration": "05:19",
    "original_audio_language": "en",
    "video_id": "MfxuhF8n-Z0",
    "url": "https://www.youtube.com/watch?v=MfxuhF8n-Z0&list=PLthtds3jNgpZy7-yrHUuos6ej4NgttPUF&index=19",
    "description": "Chickpeas is cooked in the instant pot and Sundal is made out of it in the instant pot as well. Chickpeas Sundal is a South Indian snack, chick peas is stir fried with onion, grated coconut and some seasonings. Tastes delicious and a filling snack.\n\nFor more Instant Pot recipes, click here: http://bit.ly/2C6hvqr\nFOLLOW ME HERE:\n\nWebsite: http://www.thasneen.com/cooking/\nFacebook: https://www.facebook.com/CookingwithThas/\nInstagram: https://www.instagram.com/cookingwiththas/\nTwitter: https://twitter.com/thasneen\nPinterest: https://www.pinterest.com/thasneen/",
    "ingredients_detected": [
      "Chickpeas",
      "Instant Pot water",
      "Onion",
      "Grated coconut",
      "Curry leaves",
      "Green chilies",
      "Mustard seeds",
      "Cumin seeds",
      "Turmeric powder",
      "Salt",
      "Oil"
    ]
  },
  "transcription": [
    "[00:00.000] Take 1 cup chickpeas and wash them thoroughly under running water.",
    "[00:10.000] Add the chickpeas to the Instant Pot along with 3 cups of water and a pinch of salt.",
    "[00:20.000] Close the lid, select high pressure and cook until the chickpeas are soft and cooked through.",
    "[00:35.000] Once done, release pressure naturally and open the Instant Pot lid.",
    "[00:45.000] Heat 1 tablespoon of oil in the Instant Pot on sauté mode.",
    "[00:55.000] Add mustard seeds and cumin seeds, wait for them to splutter.",
    "[01:05.000] Add chopped onions, green chilies and curry leaves. Sauté until onions turn translucent.",
    "[01:20.000] Add turmeric powder and salt to taste, mix well with the sautéed mixture.",
    "[01:35.000] Add the cooked chickpeas along with any remaining cooking water.",
    "[01:50.000] Stir everything together and let it simmer on sauté mode for a few minutes.",
    "[02:05.000] Add grated coconut, combine well with the chickpeas and seasonings.",
    "[02:25.000] Continue to cook for 2–3 more minutes until the coconut is well mixed and warmed through.",
    "[02:40.000] Turn off the Instant Pot sauté mode once the Sundal has absorbed the flavors.",
    "[02:50.000] Transfer the Chickpeas Sundal to a serving bowl.",
    "[03:00.000] Garnish with a few extra curry leaves or grated coconut if desired.",
    "[03:10.000] Serve the Chickpeas Sundal hot as a snack or side dish.",
    "[03:20.000] It’s a nutritious, protein‑rich South Indian snack ready to enjoy!"
  ]
}
