{
  "metadata": {
    "title": "How to Make Idiyappam or String Hoppers- South Indian Dish",
    "channel_name": "Thasneen",
    "publish_date": "2015-01-08",
    "view_count": 622945,
    "like_count": 1873,
    "duration": "06:22",
    "orignal_audio_language": "English",
    "video_id": "2ACTL7YPHmQ",
    "url": "https://www.youtube.com/watch?v=2ACTL7YPHmQ",
    "description": "South Indian Speciality dish- Idiyappam or string hoppers.\n\nIngredients\n\nRice flour- 2 cups\nWater- 2 1/2 cups\nSalt- 1/4 tsp\nGrated coconut\n\nPreparation\n\nBoil water, add salt and add rice flour, combine well using the back of a wooden spoon. Let cool down a bit.\nKnead the dough well. It should be a soft dough.\nGrease idiyappam plates with non-stick cooking spray.\nSpread 1/2 tbsp grated coconut on the plates.\nPlace the disc in the holder, add 1 handful dough into the holder, close the lid and rotate the mould, let the strings fall onto the plate holes.\nStack up the plates and keep it in the steam cooker.\nSteam cook till 1 whistle.\nServe with your favorite curry.",
    "ingredients_detected": [
      "Rice flour",
      "Water",
      "Salt",
      "Grated coconut",
      "Non-stick cooking spray",
      "Coconut milk",
      "Sugar"
    ]
  },
  "transcription": {
    "original_audio_language": "English",
    "lines": [
      "[00:00:04.000] hi everybody Welcome to cooking with Tas",
      "[00:00:06.000] first of all I want to wish everyone a",
      "[00:00:08.000] Happy New Year I hope you all had a good",
      "[00:00:12.000] start and it's going to be a fantastic",
      "[00:00:13.000] year for",
      "[00:00:15.000] everyone I know it's been a while since",
      "[00:00:17.000] I have uploaded any videos I have to",
      "[00:00:20.000] admit that I'm very lazy when it comes",
      "[00:00:22.000] to making videos but I've been actively",
      "[00:00:25.000] vlogging so please go to my website ww.",
      "[00:00:28.000] th.com and you you will see all the food",
      "[00:00:30.000] that I make in my kitchen in this video",
      "[00:00:33.000] I'm going to show you how to make a",
      "[00:00:35.000] South Indian specialty dish that served",
      "[00:00:37.000] for breakfast or for dinner it's called",
      "[00:00:40.000] iapam in Malayalam or it can be also",
      "[00:00:43.000] called as string hoppers in English",
      "[00:00:46.000] making idam is a very interesting and",
      "[00:00:48.000] fun process so let's get into cooking so",
      "[00:00:51.000] here are the ingredients that's needed",
      "[00:00:53.000] for making",
      "[00:00:56.000] idia you will need 2 cups rice flour",
      "[00:01:01.000] grated",
      "[00:01:02.000] coconut and 2 and 1/2 cups of water",
      "[00:01:06.000] first I'm going to boil water and then",
      "[00:01:09.000] add the rice flour to the boiling water",
      "[00:01:11.000] and make into a dough so let's see how",
      "[00:01:14.000] season the water with4 teaspoon of salt",
      "[00:01:18.000] so the water has come to a rolling boil",
      "[00:01:20.000] now let's add the rice",
      "[00:01:22.000] flour as you add the rice flour combine",
      "[00:01:26.000] it well using the back of a wooden",
      "[00:01:28.000] spatula",
      "[00:01:31.000] and remove the pot from the",
      "[00:01:34.000] heat so what we need here is a very soft",
      "[00:01:37.000] rice dough do not add too much flour and",
      "[00:01:40.000] make into a hot dough so this looks good",
      "[00:01:43.000] so keep it aside and let it cool down",
      "[00:01:45.000] for some",
      "[00:01:47.000] time after the dough has slightly cooled",
      "[00:01:49.000] down you can knead the dough using your",
      "[00:01:52.000] hands it will be slightly",
      "[00:01:55.000] warm as you can see the dough is very",
      "[00:01:58.000] soft this is the kind of consistency we",
      "[00:02:00.000] are looking for for making idia pum I'm",
      "[00:02:04.000] using the mold where I can rotate so you",
      "[00:02:07.000] rotate",
      "[00:02:09.000] this once you rotate it completely you",
      "[00:02:12.000] can open",
      "[00:02:14.000] this so here is the place where you can",
      "[00:02:18.000] add the rice dough and you will also",
      "[00:02:20.000] need a disc uh this is the disc that's",
      "[00:02:24.000] perfect for making epam it has very tiny",
      "[00:02:26.000] holes so that you will get um very thin",
      "[00:02:30.000] strings or noodles so I'm going to put",
      "[00:02:33.000] this into this holder about one handful",
      "[00:02:38.000] of",
      "[00:02:39.000] dough just place that into the",
      "[00:02:44.000] holder after you place the dough into",
      "[00:02:47.000] the holder you close the mold and then",
      "[00:02:50.000] rotate keep rotating and the dough will",
      "[00:02:53.000] be squeezed inside as it reaches the",
      "[00:02:55.000] bottom you keep rotating and you can see",
      "[00:02:58.000] voila the dough will fall in the form of",
      "[00:03:01.000] strings or noodles wow how pretty is",
      "[00:03:07.000] that here are the idia pom plates there",
      "[00:03:09.000] are four plates so there is a stand and",
      "[00:03:13.000] these plates are stacked on it so you",
      "[00:03:15.000] can it's very easy to remove just take",
      "[00:03:19.000] it",
      "[00:03:20.000] out so now let's fill these holes with",
      "[00:03:23.000] the ID upam or the string Hoppers so",
      "[00:03:27.000] before that you need to grease the plate",
      "[00:03:30.000] using non-stick cooking",
      "[00:03:33.000] spray so first let's make the string",
      "[00:03:35.000] Hoppers or ID them on the bottom plate",
      "[00:03:38.000] before that you can spread some grated",
      "[00:03:44.000] coconut you can put on all the",
      "[00:03:48.000] plates rotate the mold and uh place it",
      "[00:03:52.000] right on top of the the hole and rotate",
      "[00:03:57.000] it and the dough will fall in the the",
      "[00:03:59.000] form of",
      "[00:04:01.000] noodles okay so this is",
      "[00:04:04.000] good keep",
      "[00:04:07.000] [Music]",
      "[00:04:12.000] going I have filled all the holes on the",
      "[00:04:16.000] plates and now we are going to steam",
      "[00:04:17.000] cook this I'm going to steam cook the",
      "[00:04:20.000] idia Pam in the idia Pam maker or steam",
      "[00:04:22.000] cooker I bought this from Kerala India",
      "[00:04:25.000] during my last visit um in North America",
      "[00:04:29.000] in can Canada and in US you could find",
      "[00:04:32.000] the idaa maker these plates and the mold",
      "[00:04:35.000] for making ippa in most of the Indian",
      "[00:04:38.000] stores so open the",
      "[00:04:41.000] lid and add about one cup of water into",
      "[00:04:45.000] the cooker and place the stacked up",
      "[00:04:48.000] plates into the cooker close",
      "[00:04:51.000] it then place the cooker over medium",
      "[00:04:56.000] heat and steam cook till you get one",
      "[00:04:59.000] vessel",
      "[00:05:00.000] [Music]",
      "[00:05:01.000] after 3 to 5 minutes of steam cooking",
      "[00:05:04.000] this is what you will hear the steam",
      "[00:05:06.000] cooker will make",
      "[00:05:07.000] noise so once you hear this noise turn",
      "[00:05:10.000] off the",
      "[00:05:13.000] stove and remove the pan from the Heat",
      "[00:05:17.000] and let it cool down do not open it",
      "[00:05:19.000] immediately let the pressure subside and",
      "[00:05:22.000] after a while you can open",
      "[00:05:24.000] [Music]",
      "[00:05:26.000] it using a spoon Slide the ID P onto a",
      "[00:05:30.000] [Music]",
      "[00:05:39.000] plate so here you go perfectly steamed",
      "[00:05:41.000] cooked idia pums are ready so idia pums",
      "[00:05:44.000] can be served with almost any kind of",
      "[00:05:46.000] curries like chicken curries vegetable",
      "[00:05:49.000] curries fish curries kurmas beef curries",
      "[00:05:52.000] um lamb CES mutton curries literally",
      "[00:05:55.000] anything goes well with idia pumps and",
      "[00:05:57.000] if you're serving it for kids you could",
      "[00:05:59.000] pour some coconut milk over the idia pum",
      "[00:06:01.000] sprinkle some sugar and give it to them",
      "[00:06:04.000] they will love it I hope you all enjoyed",
      "[00:06:07.000] watching me make idiappam do try making",
      "[00:06:10.000] idam in your kitchen and let me know",
      "[00:06:11.000] your feedback until then Happy cooking",
      "[00:06:14.000] and",
      "[00:06:14.000] [Music]",
      "[00:06:20.000] bye"
    ]
  }
}
