{
  "metadata": {
    "title": "How to Make Thin Pathiri or Rice Roti | Best Kerala Malabar Recipe",
    "channel_name": "Thasneen",
    "publish_date": "2018-06-10",
    "view_count": 21955,
    "like_count": 157,
    "duration": "03:05",
    "original_audio_language": "en",
    "video_id": "HafDcoAvWJ8",
    "url": "https://www.youtube.com/watch?v=HafDcoAvWJ8&list=PLthtds3jNgpZy7-yrHUuos6ej4NgttPUF&index=20",
    "description": "Pathiri is a traditional roti that is popular in Malabar cuisine. Nowadays, it is commonly served in almost all parts to South India. The texture of the pathiri is soft and thin that almost everyone finds it hard to ignore, especially when served with chicken or fish curry. I love to pour some coconut milk over the pathiri, followed by spicy meat curry. It tastes divine.\n\n👉Recipe on the blog:  https://bit.ly/2kWImy2\n\nFOLLOW ME HERE:\n\nWebsite: http://www.thasneen.com/cooking/\nFacebook: https://www.facebook.com/CookingwithThas\nInstagram: https://www.instagram.com/cookingwiththas/",
    "ingredients_detected": [
      "Rice flour",
      "Warm water",
      "Salt",
      "Oil",
      "Coconut milk"
    ]
  },
  "transcription": [
    "[00:00.000] Take rice flour in a large mixing bowl.",
    "[00:10.000] Add a pinch of salt and mix well with the rice flour.",
    "[00:20.000] Gradually pour warm water while kneading to make a soft dough.",
    "[00:30.000] Continue kneading until the dough becomes smooth and pliable.",
    "[00:40.000] Cover the dough and let it rest for 10 minutes.",
    "[00:55.000] Divide the dough into small balls of equal size.",
    "[01:05.000] Heat a non‑stick pan or tawa over medium flame.",
    "[01:15.000] Flatten each ball between your palms or with a cloth to make a thin round pathiri.",
    "[01:25.000] Place the flattened pathiri on the hot pan.",
    "[01:35.000] Cook for about a minute until small bubbles appear.",
    "[01:45.000] Flip the pathiri and cook the other side until lightly golden.",
    "[01:55.000] Remove from the pan and keep warm.",
    "[02:05.000] Repeat with the remaining dough balls.",
    "[02:15.000] Serve the thin pathiri hot with coconut milk or curry of your choice.",
    "[02:25.000] Enjoy the soft and delicate rice roti, a classic Kerala Malabar delight.",
    "[02:35.000] These are perfect with spicy meat or fish curries."
  ]
}
