{
  "metadata": {
    "title": "Coconut Oats Chutney- Oats Chutney- Healthy Chutney Recipe",
    "channel_name": "Thasneen",
    "publish_date": "2018-07-22",
    "view_count": 652,
    "like_count": 9,
    "duration": "01:43",
    "original_audio_language": "en",
    "video_id": "8_WBXiZpc08",
    "url": "https://www.youtube.com/watch?v=8_WBXiZpc08",
    "description": "South Indian Coconut chutney with a healthy twist by adding oats.\n👉Recipe on the blog: https://bit.ly/3edSXkd\n\nChutney is a sauce served along with Dosa, Appam, Rice etc. There are different kinds of chutney made with different ingredients and can be made sweet, tangy, spicy etc. One of the popular chutney in South India is Coconut chutney served along with dosa- by adding oats coconut chutney got a healthy makeover.\n\nFOLLOW ME HERE:\nWebsite: http://www.thasneen.com/cooking/\nFacebook: https://www.facebook.com/CookingwithThas/\nInstagram: https://www.instagram.com/cookingwiththas/",
    "ingredients_detected": [
      "Coconut",
      "Rolled oats",
      "Green chilies",
      "Ginger",
      "Tamarind",
      "Salt",
      "Water",
      "Oil",
      "Curry leaves"
    ]
  },
  "transcription": [
    "[00:00.000] Gather ingredients: coconut, rolled oats, green chilies, ginger, tamarind, salt, water, oil, and curry leaves.",
    "[00:10.000] Dry roast 2 tablespoons of rolled oats until lightly golden.",
    "[00:20.000] Chop 1 small piece of ginger and 2 green chilies.",
    "[00:30.000] In a blender, add roasted oats, chopped ginger, green chilies, and grated coconut.",
    "[00:40.000] Add a small piece of tamarind and 1/4 teaspoon salt.",
    "[00:50.000] Pour in about 1/2 cup water and grind to a smooth chutney consistency.",
    "[01:00.000] Heat 1 teaspoon oil in a small pan for tempering.",
    "[01:05.000] Add mustard seeds and let them splutter.",
    "[01:10.000] Add curry leaves and sauté for a few seconds.",
    "[01:15.000] Pour the tempering over the ground coconut-oats mixture and mix well.",
    "[01:25.000] Adjust consistency with water if needed.",
    "[01:30.000] Transfer the chutney to a serving bowl.",
    "[01:35.000] Serve fresh with dosa, idli, or rice.",
    "[01:40.000] Enjoy your healthy and tasty Coconut Oats Chutney!"
  ]
}
