{
  "metadata": {
    "title": "Instant Pot Easy Tomato Sambar",
    "channel_name": "Thasneen",
    "publish_date": "2018-08-26",
    "view_count": 962,
    "like_count": 12,
    "duration": "11:05",
    "original_audio_language": "en",
    "video_id": "UPk1XNtXwc8",
    "url": "https://www.youtube.com/watch?v=UPk1XNtXwc8&list=PLthtds3jNgpZy7-yrHUuos6ej4NgttPUF&index=22",
    "description": "Tomato Sambar made in the Instant Pot. Sambar is a popular South Indian vegetarian dish served with dosa, idli and rice. In this recipe, I've used tomatoes and toor dal. True sambar is made with mixed veggies and lentil.\n\nRecipe: http://www.thasneen.com/cooking/instant-pot-easy-tomato-sambar/\n\nFOLLOW ME HERE:\n\nWebsite: http://www.thasneen.com/cooking/\nFacebook: https://www.facebook.com/CookingwithThas/\nInstagram: https://www.instagram.com/cookingwiththas/",
    "ingredients_detected": [
      "Chana dal",
      "Coriander seeds",
      "Cumin seeds",
      "Whole black peppercorns",
      "Dried red chilies",
      "Toor dal",
      "Turmeric powder",
      "Tomatoes",
      "Tamarind",
      "Asafoetida",
      "Cilantro",
      "Oil",
      "Mustard seeds",
      "Curry leaves",
      "Water"
    ]
  },
  "transcription": [
    "[00:00.000] Prep time 10 mins, Cook time 25 mins, Total time 35 mins",
    "[00:10.000] Author: Thasneen, Recipe type: Main, Cuisine: Indian",
    "[00:20.000] Ingredients for homemade Sambar Masala: Chana dal 2 tbsp, Coriander seeds 1 tbsp, Cumin seeds 1 tsp, Whole black peppercorns 1 tsp, Dried red chilies 3",
    "[00:40.000] Place a pan over medium heat, add chana dal and sauté for 1 minute",
    "[00:50.000] Add coriander seeds, cumin seeds, peppercorns and dried chilies. Roast till aromatic and light brown. Keep aside",
    "[01:10.000] Grind roasted spices to a coarse powder. Store in airtight container if needed",
    "[01:30.000] Soak 2-inch tamarind slice in ¼ cup lukewarm water for 5 minutes. Extract juice and strain",
    "[01:50.000] Rinse 1 cup toor dal and add to Instant Pot with 1½ cups water",
    "[02:10.000] Close lid, select Pressure mode, high pressure, 3 minutes. Quick release after cooking",
    "[02:40.000] Cancel pressure mode, select sauté mode. Add ⅛ tsp turmeric and 3 chopped tomatoes. Mix well",
    "[03:00.000] Add ½ cup water and cook till tomatoes soften",
    "[03:20.000] Add 2 tbsp prepared sambar masala, cook for 1 minute",
    "[03:40.000] Add tamarind juice, cook for 1 minute",
    "[04:00.000] Add 2 pinches asafoetida and chopped cilantro. Cook for 1 minute",
    "[04:20.000] Remove inner pot and keep aside",
    "[04:30.000] Prepare tempering: heat 1 tbsp oil, add 1 tsp mustard seeds, let splutter",
    "[04:50.000] Add 2 dried red chilies and 1 sprig curry leaves, sauté briefly",
    "[05:10.000] Pour tempering over cooked sambar, cover and let sit for a while",
    "[05:30.000] Sambar can be served with dosa, idli, rice, chapati etc.",
    "[05:50.000] Notes: You can add mixed vegetables like carrots, potatoes, okra, eggplant, drumstick along with toor dal",
    "[06:10.000] Sambar masala can be prepared ahead and stored in airtight container for months",
    "[06:30.000] Enjoy your Instant Pot Easy Tomato Sambar!"
  ]
}
