{
  "metadata": {
    "title": "How To Make Instant Oats Semolina Uthappam | South Indian Oats Pancake | Healthy Breakfast Recipe",
    "channel_name": "Thasneen",
    "publish_date": "2019-03-10",
    "view_count": 971,
    "like_count": 13,
    "duration": "05:39",
    "original_audio_language": "en",
    "video_id": "MvxRIGD8LSY",
    "url": "https://www.youtube.com/watch?v=MvxRIGD8LSY&list=PLthtds3jNgpZy7-yrHUuos6ej4NgttPUF&index=26",
    "description": "Uthappam is a South Indian breakfast dish. Traditional uthappam batter is made with rice and urad dal. In this recipe, I've added instant oats and semolina for making the batter along with mixed veggies. Easy to make and delicious Uthappam, tastes good when served with chutney. \n👉Recipe on the blog: https://bit.ly/2K1OLaO\n👉Chutney Recipes on the blog: https://bit.ly/3v7XoX9\n\nLet's Connect:\nWebsite: http://www.thasneen.com/cooking/\nFacebook: https://www.facebook.com/CookingwithT...\nInstagram: https://www.instagram.com/cookingwith...\nTwitter: https://twitter.com/thasneen\nPinterest: https://www.pinterest.com/thasneen/",
    "ingredients_detected": [
      "Instant oats",
      "Semolina (rava)",
      "Vegetables (carrot, onion, capsicum)",
      "Yogurt",
      "Spices (salt, pepper)",
      "Water",
      "Oil",
      "Curry leaves",
      "Green chilies"
    ]
  },
  "transcription": [
    "[00:00.000] Gather ingredients: instant oats, semolina, mixed vegetables, yogurt, spices, water and oil.",
    "[00:15.000] In a bowl, combine 1 cup instant oats and ½ cup semolina.",
    "[00:30.000] Add chopped onions, carrots, capsicum and green chilies to the dry mix.",
    "[00:45.000] Add 1 cup yogurt and ½ cup water to make a thick batter.",
    "[01:00.000] Season with salt and pepper and mix everything well.",
    "[01:15.000] Let the batter rest for 5 minutes for oats and semolina to absorb moisture.",
    "[01:30.000] Heat a non‑stick pan or tawa over medium heat and grease lightly with oil.",
    "[01:45.000] Pour a ladleful of batter onto the pan to form a small uthappam.",
    "[02:00.000] Spread the batter slightly and let it cook until small bubbles appear.",
    "[02:15.000] Drizzle a little oil around the edges and cook for another 2 minutes.",
    "[02:30.000] Flip the uthappam and cook the other side until golden brown.",
    "[02:45.000] Remove the cooked uthappam and keep warm on a plate.",
    "[03:00.000] Repeat the process with the remaining batter.",
    "[03:15.000] Serve hot with your favorite chutney or sambar.",
    "[03:30.000] Enjoy the healthy and delicious instant oats semolina uthappam.",
    "[03:45.000] A nutritious South Indian pancake for breakfast or snack.",
    "[04:00.000] You can add more vegetables or spices as per taste.",
    "[04:15.000] Uthappams are soft inside with a slight crisp outside.",
    "[04:30.000] Perfect for a quick and healthy meal option.",
    "[04:45.000] Try with coconut chutney or tomato chutney for best pairing."
  ]
}
