{
  "metadata": {
    "title": "Medu Vada - Easy Tips to Make Crispy Medu Vada - Gluten Free Indian Snack - Thasneen.com",
    "channel_name": "Thasneen",
    "publish_date": "2019-10-12",
    "view_count": 3363,
    "like_count": 23,
    "duration": "09:35",
    "original_audio_language": "en",
    "video_id": "eDJbMUDxkBw",
    "url": "https://www.youtube.com/watch?v=eDJbMUDxkBw&list=PLthtds3jNgpZy7-yrHUuos6ej4NgttPUF&index=27",
    "description": "Medu Vada- Uzhunnu Vada or Urad Dal (Black Gram) Fritters is one of the most popular South Indian fried snacks. In this video, I share the tips for making the perfect light and crispy medu vada. Follow the recipe and you will make the perfect medu vadas. This is a gluten free snack.\nRecipe on the blog: https://bit.ly/339FLVA\nUrad dal or Skinned Black gram – 1 cup\nShallots or Small onions, chopped small- 1/4 cup\nGinger, minced- 1 tsp\nCurry Leaves, chopped- 1 sprig\nWhole peppercorns- 1/2 tsp\nGreen chilies, chopped - 2\nSalt- 1 tsp\nWater- 1/4 to 1/2 cup to make a smooth & thick batter\nOil- enough for frying\n\nOther Fritter Recipes on my blog: https://bit.ly/33r01SJ\nIndian Recipes on my blog: https://bit.ly/2obr9G3\nMy Cookbook Raving Recipes: https://amzn.to/2ms69Kz",
    "ingredients_detected": [
      "Urad dal (skinned black gram)",
      "Shallots (small onions)",
      "Ginger",
      "Curry leaves",
      "Whole peppercorns",
      "Green chilies",
      "Salt",
      "Water",
      "Oil"
    ]
  },
  "transcription": [
    "[00:00.000] Welcome to making crispy Medu Vada, a popular gluten free South Indian snack.",
    "[00:15.000] Take 1 cup urad dal and wash thoroughly under running water.",
    "[00:30.000] Soak the urad dal in water for at least 3–4 hours.",
    "[00:45.000] After soaking, drain all water from the dal.",
    "[01:00.000] Add soaked urad dal into a blender jar without adding extra water.",
    "[01:15.000] Grind to a smooth and fluffy batter.",
    "[01:30.000] Transfer batter to a bowl, add finely chopped shallots and minced ginger.",
    "[01:45.000] Chop curry leaves and add to the batter.",
    "[02:00.000] Add whole peppercorns and finely chopped green chilies.",
    "[02:15.000] Add salt to taste and combine all ingredients well.",
    "[02:30.000] Gradually sprinkle a little water to adjust batter consistency; it should be thick and airy.",
    "[02:45.000] Heat oil in a deep pan over medium flame for frying.",
    "[03:00.000] Wet your hands, take a small portion of batter and shape into a vada.",
    "[03:15.000] Create a hole in the center of the vada for even frying.",
    "[03:30.000] Carefully slide the shaped vada into hot oil.",
    "[03:45.000] Fry on medium heat until golden brown and crispy on both sides.",
    "[04:00.000] Remove the fried vada and drain on kitchen paper towel.",
    "[04:15.000] Fry the remaining batter in batches the same way.",
    "[04:30.000] Ensure oil remains hot but not smoking for perfect crispiness.",
    "[04:45.000] Once all vadas are fried, plate them together.",
    "[05:00.000] Serve hot medu vada with coconut chutney or sambar.",
    "[05:15.000] Enjoy light, fluffy, and crispy Medu Vadas!",
    "[05:30.000] Tips: Soak dal longer for airier batter.",
    "[05:45.000] Use medium oil heat; too hot will brown outside quickly.",
    "[06:00.000] You can use a piping bag to shape vada faster.",
    "[06:15.000] Leftover vadas can be stored and reheated.",
    "[06:30.000] Medu vada pairs well with filter coffee or chutney.",
    "[06:45.000] This recipe is gluten free and perfect for snacks.",
    "[07:00.000] Thanks for watching and happy cooking!",
    "[07:15.000] Don’t forget to subscribe for more South Indian recipes.",
    "[07:30.000] Visit the blog for full written recipe and tips.",
    "[07:45.000] Leave a comment if you try this recipe.",
    "[08:00.000] Share with family and friends.",
    "[08:15.000] See you in the next video!",
    "[08:30.000] Goodbye and take care.",
    "[08:45.000] End of Medu Vada recipe demonstration."
  ]
}
