{
  "metadata": {
    "title": "Instant Pot 15 minute Easy and Best Tomato Rice- Indian Recipe",
    "channel_name": "Thasneen",
    "publish_date": "2020-01-19",
    "view_count": 14622,
    "like_count": 131,
    "duration": "07:48",
    "original_audio_language": "en",
    "video_id": "6K4xhNuJD58",
    "url": "https://www.youtube.com/watch?v=6K4xhNuJD58",
    "description": "In just 15 minutes, the best tasting tomato rice will be ready in the Instant Pot. I've used Basmati rice for making this. Basmati rice is one of the best tasting and flavourful rice and will make tomato rice taste absolutely delicious.",
    "ingredients_detected": [
      "basmati rice",
      "tomatoes",
      "onion",
      "ginger",
      "garlic",
      "green chilies",
      "oil",
      "mustard seeds",
      "cumin seeds",
      "curry leaves",
      "turmeric powder",
      "red chili powder",
      "garam masala",
      "salt",
      "water",
      "coriander leaves"
    ]
  },
  "transcription": {
    "en": [
      "[00:00:00.000] Hi everyone, welcome back to Cooking with Thas.",
      "[00:00:03.200] Today I am going to show you how to make a very easy and delicious tomato rice in the Instant Pot.",
      "[00:00:08.500] This tomato rice will be ready in just 15 minutes and it tastes absolutely amazing.",
      "[00:00:14.000] I am using basmati rice for this recipe because it gives the best flavor.",
      "[00:00:19.500] I have washed and soaked the basmati rice for about 15 minutes.",
      "[00:00:25.000] Turn on the Instant Pot and press the sauté mode.",
      "[00:00:29.500] Add some oil to the pot.",
      "[00:00:33.000] Once the oil is hot, add mustard seeds and cumin seeds.",
      "[00:00:38.200] Let them splutter and then add curry leaves.",
      "[00:00:42.500] Add chopped onions and sauté until they turn light golden.",
      "[00:00:48.800] Now add ginger, garlic, and green chilies.",
      "[00:00:54.000] Sauté for a few seconds until the raw smell goes away.",
      "[00:00:58.500] Add chopped tomatoes and mix well.",
      "[00:01:03.800] Cook the tomatoes until they turn soft and mushy.",
      "[00:01:09.500] Now add turmeric powder, red chili powder, garam masala, and salt.",
      "[00:01:16.200] Mix everything really well and cook for another minute.",
      "[00:01:21.800] Add the soaked basmati rice to the pot.",
      "[00:01:26.500] Gently mix the rice with the tomato masala.",
      "[00:01:31.500] Add water and give it a gentle stir.",
      "[00:01:36.800] Cancel the sauté mode.",
      "[00:01:40.000] Close the Instant Pot lid and set the valve to sealing.",
      "[00:01:45.500] Pressure cook on high pressure for 5 minutes.",
      "[00:01:50.800] After cooking, let the pressure release naturally for 5 minutes.",
      "[00:01:56.500] Then do a quick pressure release.",
      "[00:02:00.800] Open the lid carefully.",
      "[00:02:03.500] Fluff the rice gently using a fork.",
      "[00:02:07.800] Garnish with chopped coriander leaves.",
      "[00:02:12.000] The tomato rice is ready to serve.",
      "[00:02:15.500] You can serve this with yogurt, raita, or any side dish of your choice.",
      "[00:02:20.800] I hope you enjoyed this easy Instant Pot tomato rice recipe.",
      "[00:02:25.500] If you like this video, please give it a thumbs up and subscribe to my channel.",
      "[00:02:31.000] Thank you so much for watching. See you in my next video. Bye."
    ]
  }
}
