{
  "metadata": {
    "title": "Instant Pot Fermented Dosa batter- How to Make Crispy Dosa",
    "channel_name": "Thasneen",
    "publish_date": "2020-04-15",
    "view_count": 4261,
    "like_count": 33,
    "duration": "11:00",
    "original_audio_language": "en",
    "video_id": "1mtE-XRUGYo",
    "url": "https://www.youtube.com/watch?v=1mtE-XRUGYo&list=PLthtds3jNgpZy7-yrHUuos6ej4NgttPUF&index=29",
    "description": "Crispy dosas and the dosa batter fermented in the Instant Pot.\nDosa is a crepe made using rice and urad dal or black lentil batter. This is a popular South Indian breakfast dish. If you own an Instant Pot, fermenting dosa batter is a breeze. Ground rice & urad dal batter can be kept in the Instant pot in yogurt setting for 8 to 10 hours. After 10 hours, you will have beautifully fermented dosa batter and you can make crispy dosas.",
    "ingredients_detected": [
      "long grain white rice",
      "urad dal",
      "fenugreek seeds",
      "water",
      "salt",
      "ghee",
      "oil"
    ]
  },
  "transcription": {
    "en": [
      "[00:00:00.000] [Music]",
      "[00:00:24.000] hey everyone this is TAS and welcome to",
      "[00:00:28.000] cooking with TAS in this video let's",
      "[00:00:30.000] make dosa",
      "[00:00:31.000] so dosa is a very popular South Indian",
      "[00:00:34.000] breakfast dish it can also be served for",
      "[00:00:37.000] lunch or for dinner",
      "[00:00:39.000] so for making dosa we need to first",
      "[00:00:42.000] grind rice and urad dhal which is a kind",
      "[00:00:45.000] of lentil and it has to be fermented",
      "[00:00:47.000] overnight and with the fermented batter",
      "[00:00:50.000] will be making the dosa so it's more",
      "[00:00:53.000] like a crepe that's made out of rice and",
      "[00:00:56.000] or a dad after I got the instant pot",
      "[00:00:59.000] I've been using instant pot for",
      "[00:01:01.000] fermenting the dosa batter so I use the",
      "[00:01:05.000] yogurt setting and I Firmin Didot say",
      "[00:01:08.000] batter for about eight to ten hours and",
      "[00:01:11.000] the batter will be well fermented after",
      "[00:01:14.000] ten hours and we'll be able to make",
      "[00:01:17.000] beautiful dosas so in this video I will",
      "[00:01:20.000] show you guys how to ferment those our",
      "[00:01:23.000] batter in the instant pot and we'll be",
      "[00:01:26.000] able to make really crispy doses",
      "[00:01:29.000] so in this recipe I have used three cups",
      "[00:01:33.000] of rice and 1 cup erecta since the",
      "[00:01:36.000] amount of rice is more than or a dull",
      "[00:01:39.000] the dosa will be much crispier but if",
      "[00:01:43.000] you use two cups of rice and two cups of",
      "[00:01:46.000] errata you will get softer those us so",
      "[00:01:50.000] let's get started let's first soak the",
      "[00:01:54.000] rice and urad dal so into a bowl I'm",
      "[00:01:56.000] adding three cups of rice so this is",
      "[00:02:00.000] long grain white rice you can also use",
      "[00:02:04.000] pani rice or Sona masuri rice",
      "[00:02:11.000] in another bowl let's add one cup reptile so I'll",
      "[00:02:16.000] be grinding this separately that's why",
      "[00:02:18.000] I'm adding this into separate bowls so",
      "[00:02:20.000] next let's add water so I have added",
      "[00:02:23.000] water to rice to soak the rice in water",
      "[00:02:28.000] and I have also added water to Arab doll",
      "[00:02:36.000] - the Arab doll I'm also adding one",
      "[00:02:39.000] teaspoon fenugreek seeds so like this",
      "[00:02:43.000] soap for five hours after five hours of",
      "[00:02:48.000] soaking I have rinse the rice and or a",
      "[00:02:52.000] doll",
      "[00:02:53.000] taken in a strainer so next I'm going to",
      "[00:02:56.000] grind these grind these separately",
      "[00:02:59.000] into a blender here I'm adding red dull",
      "[00:03:02.000] so this is one cup of red dal that's",
      "[00:03:05.000] been soaked add just enough water to",
      "[00:03:11.000] make a smooth batter so here I'm adding",
      "[00:03:14.000] around one cup water let's grind the dal",
      "[00:03:24.000] and water into a smooth batter so this",
      "[00:03:27.000] will take a few minutes alright so here",
      "[00:03:32.000] is the well ground or adult batter so",
      "[00:03:35.000] I'm going to pour this into the",
      "[00:03:36.000] stainless steel pot and keep it aside",
      "[00:03:43.000] next in the same blender jar you don't",
      "[00:03:46.000] have to wash it I'm going to grind the",
      "[00:03:49.000] soaked rice so this is three cups of",
      "[00:03:53.000] long grain white rice that's been soaked",
      "[00:03:56.000] for five hours",
      "[00:04:13.000] here is our rice batter so pour this on",
      "[00:04:35.000] top of the errata batter",
      "[00:05:10.000] here is our dosa batter so next let's place",
      "[00:05:28.000] instant pot so close the pot with the",
      "[00:05:31.000] lid so we don't need the sealing ring",
      "[00:06:44.000] here is the well fermented pattern you",
      "[00:06:53.000] can see the bubbles on top that's a good",
      "[00:07:04.000] dog's eye batter here so I'm using a",
      "[00:07:50.000] the batter that I've taken in the",
      "[00:07:53.000] separate Bowl for making dosa I'm going",
      "[00:07:55.000] to add 1/2 teaspoon salt give the batter",
      "[00:08:21.000] some ghee",
      "[00:08:45.000] holes have form so this is a sign that",
      "[00:09:20.000] look at the golden light golden brown",
      "[00:09:47.000] [Music]",
      "[00:10:06.000] here you have it guys are beautiful",
      "[00:10:41.000] videos until then happy cooking take",
      "[00:10:44.000] care and bye"
    ]
  }
}
