{
  "metadata": {
    "title": "How to Make Plantain Fritters- Pazham Pori Recipe",
    "channel_name": "Thasneen",
    "publish_date": "2015-02-08",
    "view_count": 6869,
    "like_count": 37,
    "duration": "04:20",
    "original_audio_language": "English",
    "video_id": "Xuwc_Xm1Gm0",
    "url": "https://www.youtube.com/watch?v=Xuwc_Xm1Gm0",
    "description": "Plantain fritter or Pazham Pori (in Malayalam) is one of the popular street snacks in South India. On a rainy day, plantain fritters with a cup of tea will make you feel cozy and happy.\n\nIngredients\n\nPlantains, ripe-1\nAll purpose flour- 1 cup\nEgg- 1 \nSugar- 3 tbsp\nBaking soda- ½ tsp\nTurmeric powder- 1/4 tsp (optional)\nWater- ½ cup\nOil- for frying\n\nInstructions\nPeel off the skin from the plantains, first cut it vertically, then cut it into halves.\nCut the halved plantain vertically to get two thin slices out of it and keep aside.\nTo make the batter: Combine the flour, egg, sugar, baking soda, turmeric powder and water using a whisk and make a batter without any lumps.\nPlace a frying pan over medium heat and add enough oil for frying.\nDip the plantain slices into the batter, coat it evenly with the batter.\nAfter the oil gets hot, add the plantain coated with batter into the oil.\nDeep fry till both the sides turn golden in color.\nUsing a slotted spoon, transfer the fried plantains to a plate lined with paper towel.\nLet the oil drain from the fried plantains and serve hot along with tea or coffee.",
    "ingredients_detected": [
      "Plantain",
      "All-purpose flour",
      "Egg",
      "Sugar",
      "Baking soda",
      "Turmeric powder",
      "Water",
      "Vegetable oil",
      "Canola oil"
    ]
  },
  "transcription": {
    "original_audio_language": "English",
    "lines": [
      "[00:00:07.000] hi everybody welcome to cooking with TAS",
      "[00:00:10.000] what's the most popular street snacks in",
      "[00:00:13.000] South India is plantain fritters",
      "[00:00:16.000] or it's also called parentally in Malaya",
      "[00:00:19.000] in fact 20 fritters are very common in",
      "[00:00:22.000] most of the tropical countries on a",
      "[00:00:24.000] rainy day on a cold freezing winter day",
      "[00:00:27.000] a cup of coffee or tea along with",
      "[00:00:29.000] plantain fritters will make you feel",
      "[00:00:31.000] great so I'm going to show you guys how",
      "[00:00:33.000] to make 19 fritters please take a look",
      "[00:00:36.000] at the ingredients list so first peel",
      "[00:00:44.000] off the skin and then cut them into thin",
      "[00:00:46.000] slices then we'll be making a batter and",
      "[00:00:49.000] coat the plantain slices in that batter",
      "[00:00:51.000] and then deep fry in oil till it gets",
      "[00:00:53.000] golden and crispy so let's get into",
      "[00:00:55.000] cooking",
      "[00:01:13.000] if you're using one planting you will be",
      "[00:01:16.000] able to cut it into eight thin slices",
      "[00:01:18.000] and so this is how you should cut it so",
      "[00:01:21.000] next let's make big batter for making",
      "[00:01:24.000] the batter to a bowl add one cup",
      "[00:01:26.000] all-purpose flour 1/2 teaspoon baking",
      "[00:01:30.000] soda 3 tablespoon of sugar if you want",
      "[00:01:36.000] you could add quarter teaspoon of",
      "[00:01:38.000] turmeric powder so this will give a nice",
      "[00:01:40.000] yellow color to the plantain fritters so",
      "[00:01:42.000] I'm gonna add this now combine these",
      "[00:01:45.000] well using a whisk to this add one egg",
      "[00:01:58.000] fine as well",
      "[00:02:02.000] and add around 1/2 cup of water mix it",
      "[00:02:09.000] well using the whisk combine it well",
      "[00:02:17.000] without any lumps so this is the kind of",
      "[00:02:19.000] consistency we want the batter shouldn't",
      "[00:02:22.000] be too thick nor too thin so this looks",
      "[00:02:25.000] perfect after you have made the batter",
      "[00:02:29.000] so next step will be heating a frying",
      "[00:02:31.000] pan over medium heat let it turn hot",
      "[00:02:33.000] then we are gonna add oil you can add",
      "[00:02:36.000] vegetable oil or canola oil in a 40 fry",
      "[00:02:45.000] so let the oil turn hot in order to",
      "[00:02:49.000] check if the oil has turned hot what I",
      "[00:02:52.000] do is I pour a small drop of batter into",
      "[00:02:55.000] the oil now you can see that there is a",
      "[00:02:59.000] sizzling sound and the batter is falling",
      "[00:03:01.000] in the oil now the oil is ready",
      "[00:03:04.000] so next what I'm going to do is put the",
      "[00:03:07.000] plantain slice in the batter coat it",
      "[00:03:10.000] well and then put this in the oil",
      "[00:03:17.000] do it with another one dip in batter and",
      "[00:03:22.000] put it in oil when both the sites have",
      "[00:03:31.000] turned golden in color and crispy check",
      "[00:03:34.000] it out off the oil and place it on a",
      "[00:03:37.000] kitchen paper towel so here we have the",
      "[00:03:50.000] perfectly crispy and fried plantain",
      "[00:03:52.000] pictures so these 19 fritters along with",
      "[00:03:55.000] a cup of tea",
      "[00:03:56.000] I prefer cardamom tea is an amazing",
      "[00:03:59.000] combination and will make you feel",
      "[00:04:00.000] wonderful especially on a rainy day I",
      "[00:04:03.000] hope you enjoyed watching this video you",
      "[00:04:06.000] try this finding fritters and let me",
      "[00:04:07.000] know your feedback until then happy",
      "[00:04:09.000] cooking and bye."
    ]
  }
}
