{
  "metadata": {
    "title": "How to make Ottappam Or Ottada- South Indian Rice Pancake",
    "channel_name": "Thasneen",
    "publish_date": "2015-08-19",
    "view_count": 25721,
    "like_count": 66,
    "duration": "00:56",
    "original_audio_language": "en",
    "video_id": "y0NffY0O6cQ",
    "url": "https://www.youtube.com/watch?v=y0NffY0O6cQ",
    "description": "How to make Ottappam or Ottada- South Indian Rice Pancake, breakfast speciality. Ottappam is made in a claypan.\nRecipe: http://www.thasneen.com/cooking/ottappam-or-ottada-recipe-ottappam-made-in-a-clay-pan-rice-pancakes/\n\nIngredients\nRice flour- 1½ cups\nEggs- 2\nWater- ¾ cup\nSalt- a couple of pinches\n\nInstructions\nYou have to use clay pan to make this, it won't come out good in a non-stick pan.\nIf you are using a new clay pan, season the pan well before you make this.\nIn a blender, grind the flour, eggs, water and salt together to a smooth paste.\nHeat the clay pan over medium high heat.\nGrease the pan with non-stick cooking spray.\nPour a large spoonful of batter and spread thin.\nOttappam can be served with curry or coconut milk and sugar.",
    "ingredients_detected": [
      "Rice flour",
      "Eggs",
      "Water",
      "Salt",
      "Non-stick cooking spray",
      "Chicken curry",
      "Mutton curry",
      "Coconut milk",
      "Sugar"
    ]
  },
  "transcription": {
    "en": [
      "[00:00.000] How to make Ottappam or Ottada, South Indian rice pancake.",
      "[00:04.500] This is a breakfast speciality and Ottappam is made in a clay pan.",
      "[00:08.800] Ingredients needed are rice flour, eggs, water and salt.",
      "[00:13.200] You have to use a clay pan to make this, it will not come out good in a non-stick pan.",
      "[00:18.000] If you are using a new clay pan, season the pan well before using it.",
      "[00:23.500] Rub the pan with egg shells a few times, rinse with water and use it.",
      "[00:28.800] In a blender, grind the flour, eggs, water and salt to a smooth paste.",
      "[00:34.500] The batter should not be too thick and not too thin.",
      "[00:38.900] Heat the clay pan over medium high heat and grease it lightly.",
      "[00:43.500] Pour a spoonful of batter and spread it into a thin small round shape.",
      "[00:48.000] Holes will start forming in the middle and it cooks very fast.",
      "[00:52.000] Remove the ottappam and serve with curry or coconut milk and sugar."
    ]
  }
}
