{
  "metadata": {
    "title": "Sambar- Lentil & Mixed Veggie Curry | Instant Pot Vegetarian Recipe | Kerala Onam Sadya | Recipe 1",
    "channel_name": "Thasneen",
    "publish_date": "2022-09-01",
    "view_count": 482,
    "like_count": 15,
    "duration": "01:31",
    "original_audio_language": "en",
    "video_id": "MSYFYhzrUh4",
    "url": "https://www.youtube.com/watch?v=MSYFYhzrUh4",
    "description": "Sambar is a popular South Indian vegetarian curry. In Kerala sadya, sambar is one of the main curries served along with rice. Sharing the recipe for making Sambar in the Instant Pot.",
    "ingredients_detected": [
      "toor dal",
      "water",
      "green chilies",
      "turmeric powder",
      "salt",
      "tamarind",
      "coriander seeds",
      "cumin seeds",
      "fenugreek seeds",
      "drumsticks (moringa)",
      "okra",
      "eggplant",
      "potatoes",
      "carrots",
      "curry leaves",
      "chili powder",
      "asafoetida",
      "tomatoes",
      "tamarind extract",
      "coconut oil",
      "mustard seeds",
      "shallots",
      "dried red chilies",
      "kashmiri chili powder"
    ]
  },
  "transcription": {
    "en": [
      "[00:00:00.000] sambar a south indian vegetarian delicacy",
      "[00:00:02.000] made with lentils and mixed veggies this",
      "[00:00:04.000] is one of the main curries in kerala sadya",
      "[00:00:06.000] let's make it i'm taking three quarter cup toor dal rinse it in water",
      "[00:00:10.000] let's pressure cook this add some water",
      "[00:00:12.000] green chilies turmeric powder salt",
      "[00:00:15.000] i'm going to pressure cook this in the instant pot for just ten minutes",
      "[00:00:18.000] in the meantime let's soak some tamarind in warm water",
      "[00:00:22.000] i'm gonna make homemade sambar masala coriander seeds cumin seeds",
      "[00:00:24.000] fenugreek seeds roasted and ground to a fine powder keep it aside",
      "[00:00:28.000] here's the perfectly pressure cooked toor dal i'll keep it aside",
      "[00:00:32.000] next let's pressure cook all the veggies",
      "[00:00:34.000] i'm taking drumsticks or moringa okra eggplant potatoes and carrots",
      "[00:00:39.000] add some curry leaves water salt chili powder give it a good mix",
      "[00:00:44.000] and let's pressure cook this for just three minutes in the instant pot",
      "[00:00:48.000] after three minutes here are the perfectly cooked veggies not mushy",
      "[00:00:51.000] add the toor dal give it a good mix",
      "[00:00:53.000] and let's cook this in saute setting",
      "[00:00:56.000] now it's time to add the homemade sambar masala so aromatic",
      "[00:01:00.000] add a few pinches of asafoetida tomatoes and tamarind extract",
      "[00:01:02.000] give it a good mix and cook it for a few minutes",
      "[00:01:04.000] season with some salt and let the sambar come to a slight boil",
      "[00:01:09.000] sambar is ready keep it covered",
      "[00:01:11.000] next let's make the tempering coconut oil mustard seeds",
      "[00:01:13.000] shallots fry it and let's add dried red chilies curry leaves",
      "[00:01:18.000] finally add some kashmiri chili powder",
      "[00:01:19.000] immediately pour it over the sambar keep it covered",
      "[00:01:22.000] here is the best tasting aromatic homemade sambar",
      "[00:01:24.000] give it a try and thanks for watching"
    ]
  }
}
